trying to use serial port: /dev/ttyUSB0
 >> 
 >> 

Expect: searching for 4 strs:  :[yes/no] :Press RETURN to get started. :# :Switch>
 << 
Switch>
Switch>
Switch>
Switch>
Expect: matched string 4: Switch>
 >> term len 0

Expect: searching for 2 strs:  :# :>
 << term len 0
Switch>
Expect: matched string 2: >
 >> show version

Expect: searching for 2 strs:  :# :>
 << show version
Cisco IOS Software, C2960X Software (C2960X-UNIVERSALK9-M), Version 15.0(2)EX4, RELEASE SOFTWARE (fc1)
Technical Support: http://www.cisco.com/techsupport
Copyright (c) 1986-2013 by Cisco Systems, Inc.
Compiled Thu 14-Nov-13 11:33 by prod
 << _rel_team

ROM: Bootstrap program is C2960X boot loader
BOOTLDR: C2960X Boot Loader (C2960X-HBOOT-M) Version 15.0(2r)EX, RELEASE SOFTWARE (fc1)

Switch uptime is 1 day, 18 minutes
System returned to ROM by power-on
System restarted at 13:50:26 UTC 
 << Wed Jul 1 2015
System image file is "flash:/c2960x-universalk9-mz.150-2.EX4/c2960x-universalk9-mz.150-2.EX4.bin"


This product contains cryptographic features and is subject to United
States and local country laws governing import, export, transfer 
 << and
use. Delivery of Cisco cryptographic products does not imply
third-party authority to import, export, distribute or use encryption.
Importers, exporters, distributors and users are responsible for
compliance with U.S. and local country laws. By us
 << ing this product you
agree to comply with applicable laws and regulations. If you are unable
to comply with U.S. and local laws, return this product immediately.

A summary of U.S. laws governing Cisco cryptographic products may be found at:
http://w
 << ww.cisco.com/wwl/export/crypto/tool/stqrg.html

If you require further assistance please contact us by sending email to
export@cisco.com.

cisco WS-C2960X-24PD-L (APM86XXX) processor (revision A0) with 524288K bytes of memory.
Processor board ID FOC
 << 1801S3VS
Last reset from power-on
1 Virtual Ethernet interface
1 FastEthernet interface
26 Gigabit Ethernet interfaces
2 Ten Gigabit Ethernet interfaces
The password-recovery mechanism is enabled.

512K bytes of flash-simulated non-volatile config
 << uration memory.
Base ethernet MAC Address       : 6C:99:89:86:B9:80
Motherboard assembly number     : 73-14189-04
Power supply part number        : 341-0528-01
Motherboard serial number       : FOC17496Y38
Power supply serial number      : DCB175171C
 << G
Model revision number           : A0
Motherboard revision number     : A0
Model number                    : WS-C2960X-24PD-L
Daughterboard assembly number   : 73-14200-03
Daughterboard serial number     : FOC18010TMC
System serial number          
 <<   : FOC1801S3VS
Top Assembly Part Number        : 800-38003-01
Top Assembly Revision Number    : C0
Version ID                      : V01
CLEI Code Number                : CMMLL00ARA
Daughterboard revision number   : A0
Hardware Board Revision Numbe
 << r  : 0x05


Switch Ports Model              SW Version            SW Image                 
------ ----- -----              ----------            ----------               
*    1 28    WS-C2960X-24PD-L   15.0(2)EX4            C2960X-UNIVERSALK9-M    
 <<  


Configuration register is 0xF

Switch>
Expect: matched string 2: >
 >> enable

Expect: searching for 2 strs:  :Password: :#
 << enable
Switch#
Expect: matched string 2: #
 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
Expect: matched string 1: (config)#
 >> version 15.0

 >> no service pad

 >> service timestamps debug datetime localtime

 >> service timestamps log datetime localtime

 >> service password-encryption

 >> boot-start-marker

 >> boot-end-marker

 >> enable secret Area=l*w

 >> enable password Area=l*w

 >> no aaa new-model

 >> clock timezone CST -6

 >> clock summer-time CDT recurring

 >> authentication mac-move permit

 >> ip subnet-zero

 >> ip domain-name mgmt.msstate.edu

 >> ip name-server 130.18.2.210

 >> vtp domain vtp01.mgmt.msstate.edu

 >> vtp mode client

 >> crypto pki trustpoint TP-self-signed-2494998912

 >>  enrollment selfsigned

 >>  subject-name cn=IOS-Self-Signed-Certificate-2494998912

 >>  revocation-check none

 >>  rsakeypair TP-self-signed-2494998912

 >> crypto pki certificate chain TP-self-signed-2494998912

 >>  certificate self-signed 01 nvram:IOS-Self-Sig#3232.cer

 >> spanning-tree portfast bpduguard default

 >> spanning-tree extend system-id

 >> vlan internal allocation policy ascending

 >> errdisable recovery cause all

 >> errdisable recovery interval 1800

 >> interface FastEthernet0

 >>  no ip address

 >>  shutdown

 >> interface Vlan1

 >>  no ip address

 >>  no ip route-cache

 >>  shutdown

 >> interface Vlan92

 >> ip http server

 >> ip http secure-server

 >> ip sla enable reaction-alerts

 >> logging facility local1

 >> logging 130.18.2.208

 >> access-list 1 permit 10.92.0.0 0.0.255.255

 >> snmp-server community sysnet RO 1

 >> snmp-server community c2-b2=a2 RW 1

 >> snmp-server enable traps snmp authentication linkdown linkup coldstart warmstart

 >> snmp-server enable traps transceiver all

 >> snmp-server enable traps tty

 >> snmp-server enable traps cluster

 >> snmp-server enable traps config-copy

 >> snmp-server enable traps config

 >> snmp-server enable traps config-ctid

 >> snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-auth-fail-vlan no-guest-vlan

 >> snmp-server enable traps entity

 >> snmp-server enable traps power-ethernet group 1

 >> snmp-server enable traps power-ethernet police

 >> snmp-server enable traps cpu threshold

 >> snmp-server enable traps rep

 >> snmp-server enable traps rtr

 >> snmp-server enable traps bridge newroot topologychange

 >> snmp-server enable traps stpx inconsistency root-inconsistency loop-inconsistency

 >> snmp-server enable traps syslog

 >> snmp-server enable traps vtp

 >> snmp-server enable traps vlancreate

 >> snmp-server enable traps vlandelete

 >> snmp-server enable traps flash insertion removal

 >> snmp-server enable traps port-security

 >> snmp-server enable traps envmon fan shutdown supply temperature status

 >> snmp-server enable traps errdisable

 >> snmp-server enable traps mac-notification change move threshold

 >> snmp-server enable traps vlan-membership

 >> snmp-server host 130.18.2.208 sysnet 

 >> line con 0

 >> line vty 0 4

 >>  password Area=l*w

 >>  login

 >> line vty 5 15

 >>  password Area=l*w

 >>  login

 >> ntp clock-period 22519226

 >> ntp server 130.18.92.22

 >> end

Expect: searching for 1 strs:  :Configured
 << version 15.0
Switch(config)#no service pad
Switch(config)#service timestamps debug datetime localtime
Switch(config)#service timestamps log datetime localtime
Switch(config)#service password-encryption
Switch(config)#boot-start-marker
Switch(config)
 << #boot-end-marker
Switch(config)#enable secret Area=l*w
Switch(config)#enable password Area=l*w
The enable password you have chosen is the same as your enable secret.
This is not recommended.  Re-enter the enable password.

Switch(config)#no aaa new-
 << model
Switch(config)#clock timezone CST -6
Switch(config)#clock summer-time CDT recurring
Switch(config)#authentication mac-move permit
Switch(config)#ip subnet-zero
Switch(config)#ip domain-name mgmt.msstate.edu
Switch(config)#
Jul  2 08:09:41: %S
 << YS-6-CLOCKUPDATE: System clock has been updated from 14:09:40 UTC Thu Jul 2 2015 to 08:09:41 CST Thu Jul 2 2015, configured from console by console.ip name-server 130.18.2.210
Switch(config)#vtp domain vtp01.mgmt.msstate.edu
Changing VTP domain name fro
 << m NULL to vtp01.mgmt.msstate.edu
Switch(config)#vtp mode client
Setting device to VTP Client mode for VLANS.
Switch(config)#crypto pki trustpoint TP-self-signed-2494998912
Switch(ca-trustpoint)# enrollment selfsigned
Switch(ca-trustpoint)# subject-na
 << me cn=IOS-Self-Signed-Certificate-2494998912
Switch(ca-trustpoint)# revocation-check none
Switch(ca-trustpoint)# rsakeypair TP-self-signed-2494998912
Switch(ca-trustpoint)#crypto pki certificate chain TP-self-signed-2494998912
Switch(config-cert-chain
 << )# certificate self-signed 01 nvram:IOS-Self-Sig#3232$e self-signed 01 nvram:IOS-Self-Sig#3232.         cer
Switch(config-cert
Jul  2 09:09:43: %SYS-6-CLOCKUPDATE: System clock has been updated
 <<  from 08:09:41 CST Thu Jul 2 2015 to 09:09:43 CDT Thu Jul 2 2015, configured from console by console.
Jul  2 09:09:43: %SW_VLAN-6-VTP_DOMAIN_NAME_CHG: VTP domain name changed to vtp01.mgmt.msstate.edu.-chain)#spanning-tree portfast bpduguard default
Swi
 << tch(config)#spanning-tree extend system-id
Switch(config)#vlan internal allocation policy ascending
Switch(config)#errdisable recovery cause all
Switch(config)#errdisable recovery interval 1800
Switch(config)#interface FastEthernet0
Switch(config-if)
 << # no ip address
Switch(config-if)# shutdown
Switch(config-if)#interface Vlan1
Switch(config-if)# no ip address
Switch(config-if)# no ip route-cache
Switch(config-if)# shutdown
Switch(config-if)#interface Vlan92
Switch(config-if)#ip http server
Swi
 << tch(config)#ip http secure-server
% Generating 1024 bit RSA keys, keys will be non-exportable...
Jul  2 09:09:46: %LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan92, changed state to down
[OK] (elapsed time was 2 seconds)

Switch(config)#ip sla e
 << nable reaction-alerts
                      ^
% Invalid input detected at '^' marker.

Switch(config)#logging facility local1
Switch(config)#
Jul  2 09:09:47: %LINK-5-CHANGED: Interface FastEthernet0, changed state to administratively down
Jul  2 0
 << 9:09:48: %LINK-5-CHANGED: Interface Vlan1, changed state to administratively down
Jul  2 09:09:48: %SSH-5-ENABLED: SSH 1.99 has been enabledlogging 130.18.2.208
Switch(config)#access-list 1 permit 10.92.0.0 0.0.255.255
Switch(config)#snmp-server commun
 << ity sysnet RO 1
Switch(config)#snmp-server community c2-b2=a2 RW 1
Switch(config)#snmp-server enable traps snmp authentication linkdown linkup c$ enable traps snmp authentication linkdown lin
 << kup co         ldstart waps snmp authentication linkdown linkup coldstart wa         rmstart
Switch(config)#snmp-server enable traps transceiver all
Switch(config)#snmp-serve
 << r enable traps tty
Switch(config)#snmp-server enable traps cluster
Switch(config)#snmp-server enable traps config-copy
Switch(config)#snmp-server enable traps config
Switch(config)#snmp-server enable traps conf
Jul  2 09:09:48: %PKI-4-NOAUTOSAVE: Con
 << figuration was modified.  Issue "write memory" to save new certificateig-ctid
Switch(config)#snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-au$ enable traps dot1x auth-fail-vlan g
 << uest-vlan no-aut         h-fail-vlaps dot1x auth-fail-vlan guest-vlan no-auth-fail-vla         n no-guesuth-fail-vla
 << n guest-vlan no-auth-fail-vlan no-guest         -vlan
Switch(config)#snmp-se
Jul  2 09:09:49: %SYS-6-LOGGINGHOST_STARTSTOP: Logging to host 130.18.2.208 port 514 started - CLI initiatedrver enable traps entity
Switch(config)#snmp-server enable
 <<  traps power-ethernet group 1
Switch(config)#snmp-server enable traps power-ethernet police
Switch(config)#snmp-server enable traps cpu threshold
Switch(config)#snmp-server enable traps rep
Switch(config)#snmp-server enable traps rtr
                
 <<                          ^
% Invalid input detected at '^' marker.

Switch(config)#snmp-server enable traps bridge newroot topologychange
Switch(config)#snmp-server enable traps stpx inconsistency root-inconsistency
 << $ enable traps stpx inconsistency root-inconsistency          loop-incoaps stpx inconsistency root-inconsistency loop-incon         sistency
Switch(c
 << onfig)#snmp-server enable traps syslog
Switch(config)#snmp-server enable traps vtp
Switch(config)#snmp-server enable traps vlancreate
Switch(config)#snmp-server enable traps vlandelete
Switch(config)#snmp-server enable traps flash insertion removal
S
 << witch(config)#snmp-server enable traps port-security
Switch(config)#snmp-server enable traps envmon fan shutdown supply temperatur$ enable traps envmon fan shutdown supply temperature         
 <<  status
Switch(config)#snmp-server enable traps errdisable
Switch(config)#snmp-server enable traps mac-notification change move threshol$ enable traps mac-notification change move th
 << reshold         
Switch(config)#snmp-server enable traps vlan-membership
Switch(config)#snmp-server host 130.18.2.208 sysnet 
Switch(config)#line con 0
Switch(config-line)#line vty 0 4
Switch(config-line)# password Area=l*w
Switch(config-li
 << ne)# login
Switch(config-line)#line vty 5 15
Switch(config-line)# password Area=l*w
Switch(config-line)# login
Switch(config-line)#ntp clock-period 22519226
%NTP: This configuration command is depreceated.
Switch(config)#ntp server 130.18.92.22
Swi
 << tch(config)#end
Switch#
Jul  2 09:09:55: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
Switch#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
Expect: matched string 1: (config)#
 >> spanning-tree mode mst

 >> spanning-tree etherchannel guard misconfig

 >> spanning-tree mst configuration

 >>  name msstate

 >>  revision 1

 >>  instance 1 vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 63, 70

 >>  instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 160

 >>  instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 230, 232, 242, 246

 >>  instance 1 vlan 256, 611-612, 654, 741, 996, 999

 >>  instance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037, 2039-2040

 >>  instance 2 vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096, 2104, 2110, 2126

 >>  instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 2189, 2194, 2202

 >>  instance 2 vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 2654, 2999

 >>  instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176, 196

 >>  instance 3 vlan 244, 248, 927

 >>  instance 4 vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072, 2108, 2113, 2128

 >>  instance 4 vlan 2144, 2176, 2196, 2244, 2248, 2927

 >>  instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 228

 >>  instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216, 2228

 >>  instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116, 124

 >>  instance 7 vlan 172, 186, 192, 204-208, 210, 240-241, 251-252, 630, 928

 >>  instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082, 2084

 >>  instance 8 vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208, 2210

 >>  instance 8 vlan 2240-2241, 2251-2252, 2630, 2928

 >>  instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102, 112

 >>  instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 500, 505, 510-511

 >>  instance 9 vlan 522, 551-570, 603, 629, 633, 742, 802, 926, 929

 >>  instance 10 vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 2057, 2062, 2068

 >>  instance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148, 2158

 >>  instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522, 2603, 2629, 2633

 >>  instance 10 vlan 2802, 2926, 2929

 >>  instance 11 vlan 8, 43, 52, 146, 156-157, 180, 200, 218

 >>  instance 12 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180, 2200, 2218

 >> 

 >> end

Expect: searching for 1 strs:  :Configured
 << spanning-tree mode mst
Switch(config)#spanning-tree etherchannel guard misconfig
Switch(config)#spanning-tree mst configuration
Switch(config-mst)# name msstate
Switch(config-mst)# revision 1
Switch(config-mst)# instance 1 vlan 2, 7, 11, 20, 22, 24, 
 << 31, 35, 37, 39-40, $ vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40, 5         0, 60, 63, 11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 
 << 63,          70
Switch(config-mst)# instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 1$ vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 14         0, 152, 1
 << 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 16         0
Switch(config-mst)# instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 23$ vlan 162-1
 << 63, 168, 189, 194, 202, 220, 222, 230         , 232, 24163, 168, 189, 194, 202, 220, 222, 230, 232, 242         , 246
Switch(config-mst)# instance 1 vlan 256, 611-612, 654, 741, 9
 << 96, 999
Switch(config-mst)# instance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031,$ vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031,          2035, 203
 << , 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037         , 2039-2011, 2020, 2022, 2024, 2031, 2035, 2037, 2039-204         0
Switch(config-mst)# instance 2 v
 << lan 2050, 2060, 2063, 2070, 2080, 2086, 2096,$ vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096,          2104, 211, 2060, 2063, 2070,
 <<  2080, 2086, 2096, 2104, 2110         , 2126
Switch(config-mst)# instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, $ vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 2         
 << 189, 2194, 2140, 2152, 2160, 2162-2163, 2168, 2189, 2194,          2202
Switch(config-mst)# instance 2 vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 
 << $ vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 2         654, 2999
Switch(config-mst)# instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128$ vlan 42, 51, 59, 64
 << , 66, 69, 72, 108, 113, 128,          144, 17651, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176,          196
Switch(config-mst)# instance 3 vlan 244, 248, 927
Switch(config-mst)# 
 << instance 4 vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072,$ vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072,          2108, 211, 2051,
 <<  2059, 2064, 2066, 2069, 2072, 2108, 2113         , 2128
Switch(config-mst)# instance 4 vlan 2144, 2176, 2196, 2244, 2248, 2927
Switch(config-mst)# instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 2
 << $ vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 22         8
Switch(config-mst)# instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-$ vlan 2016, 2048, 2058, 2088, 
 << 2121, 2131, 2133-2         134, 2216, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216,          2228
Switch(config-mst)# instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97,
 << $ vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97,          114, 116,3-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116,          1
 << 24
Switch(config-mst)# instance 7 vlan 172, 186, 192, 204-208, 210, 240-241, 251$ vlan 172, 186, 192, 204-208, 210, 240-241, 251-         252, 630,
 << 186, 192, 204-208, 210, 240-241, 251-252, 630,          928
Switch(config-mst)# instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, $ vlan 2009, 2033-2034, 2038, 2054
 << , 2056, 2071, 2         075, 2082, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082,          2084
Switch(config-mst)# instance 8 vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192,
 << $ vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192,          2204-2208, 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208,          221
 << 0
Switch(config-mst)# instance 8 vlan 2240-2241, 2251-2252, 2630, 2928
Switch(config-mst)# instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 9$ vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 
 << 98         -99, 102,12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102,          112
Switch(config-mst)# instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 50
 << $ vlan 130, 132, 147-148, 158, 212, 226, 236, 500         , 505, 51132, 147-148, 158, 212, 226, 236, 500, 505, 510         -511
Switch(config-mst
 << )# instance 9 vlan 522, 551-570, 603, 629, 633, 742, 802, 92$ vlan 522, 551-570, 603, 629, 633, 742, 802, 926         , 929
Switch(config-mst)# instance 10 vlan 2004-2005, 2012, 2018-2019
 << , 2032, 2044, $0 vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 2         057, 20624-2005, 2012, 2018-2019, 2032, 2044, 2057, 2062,  
 <<         2068
Switch(config-mst)# instance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132,$0 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132,          2147-2148
 << 6, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148,          2158
Switch(config-mst)# instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522,$0 vlan 221
 << 2, 2236, 2500, 2505, 2510-2511, 2522,          2603, 2622, 2236, 2500, 2505, 2510-2511, 2522, 2603, 2629         , 2633
Switch(config-mst)# instance 10 vlan 2802, 2926, 2929
Swit
 << ch(config-mst)# instance 11 vlan 8, 43, 52, 146, 156-157, 180, 200, 218
Switch(config-mst)# instance 12 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180,$2 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180
 << ,          2200, 2218, 2043, 2052, 2146, 2156-2157, 2180, 2200, 2218         
Switch(config-mst)#
Switch(config-mst)#end
Switch#
Jul  2 09:10:08: %SYS-5-CONFIG_I: Configured fr
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << om console by console
Switch#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
Expect: matched string 1: (config)#
 >> hostname c29s1p.r213u.b100.researchblvd 

Expect: searching for 2 strs:  :# :>
 << hostname c29s1p.r213u.b100.researchblvd 
c29s1p.r213u.b100.re(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s1p.r213u.b100.researchblvd#
 << 
Jul  2 09:10:13: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.r213u.b100.researchblvd#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.r213u.b100.re(config)#
Expect: matched string 1: (config)#
 >> snmp-server contact 6F-1935

Expect: searching for 1 strs:  :#
 << snmp-server contact 6F-1935
c29s1p.r213u.b100.re(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s1p.r213u.b100.researchblvd#
 << 
Jul  2 09:10:19: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.r213u.b100.researchblvd#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.r213u.b100.re(config)#
Expect: matched string 1: (config)#
 >> interface vlan 92

Expect: searching for 1 strs:  :(config-if)#
 << interface vlan 92
c29s1p.r213u.b100.re(config-if)#
Expect: matched string 1: (config-if)#
 >> ip address 10.92.1.130 255.255.0.0

 >> ip broadcast-address 10.92.255.255

 >> end

Expect: searching for 1 strs:  :Configured
 << ip address 10.92.1.130 255.255.0.0
c29s1p.r213u.b100.re(config-if)#ip broadcast-address 10.92.255.255
c29s1p.r213u.b100.re(config-if)#end
c29s1p.r213u.b100.researchblvd#
 << 
Jul  2 09:10:26: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.r213u.b100.researchblvd#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.r213u.b100.re(config)#
Expect: matched string 1: (config)#
 >> interface Vlan92

Expect: searching for 1 strs:  :(config-if)#
 << interface Vlan92
c29s1p.r213u.b100.re(config-if)#
Expect: matched string 1: (config-if)#
 >> ip default-gateway 10.92.0.1

 >> end

Expect: searching for 1 strs:  :Configured
 << ip default-gateway 10.92.0.1
c29s1p.r213u.b100.re(config)#end
c29s1p.r213u.b100.researchblvd#
Jul  2 09:10:31: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.r213u.b100.researchblvd#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.r213u.b100.re(config)#
Expect: matched string 1: (config)#
 >> ip dhcp snooping

Expect: searching for 1 strs:  :#
 << ip dhcp snooping
c29s1p.r213u.b100.re(config)#
Expect: matched string 1: #
 >> ip dhcp snooping vlan 190

Expect: searching for 1 strs:  :#
 << ip dhcp snooping vlan 190
c29s1p.r213u.b100.re(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s1p.r213u.b100.researchblvd#
Jul  2 09:10:38: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.r213u.b100.researchblvd#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.r213u.b100.re(config)#
Expect: matched string 1: (config)#
 >> default interface range gi1/0/1 - 24 

 >> interface range gi1/0/1 - 24 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi1/0/1 - 24 
c29s1p.r213u.b100.re(config)#interface range gi1/0/1 - 24 
c29s1p.r213u.b100.re(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport access vlan 190

 >> switchport mode access

 >> spanning-tree portfast

 >> switchport port-security maximum 2

 >> switchport port-security

 >> switchport port-security aging time 15

 >> switchport port-security violation protect

 >> switchport port-security aging type inactivity

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport access vlan 190
c29s1p.r213u.b100.re(config-if-range)#switchport mode access
c29s1p.r213u.b100.re(config-if-range)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, conce
 << ntrators, switches, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast will be configured in 24 interfaces due to the range command 
 but will only have effect when the inter
 << faces are in a non-trunking mode.
c29s1p.r213u.b100.re(config-if-range)#switchport port-security maximum 2
c29s1p.r213u.b100.re(config-if-range)#switchport port-security
c29s1p.r213u.b100.re(config-if-range)#switchport port-security aging time 15
c29s
 << 1p.r213u.b100.re(config-if-range)#switchport port-security violation prot$port-security violation prote         ct
c29s1p.r213u.b100.re(config-if-range)#switchport port-security aging type ina
 << $port-security aging type inac         tivity
c29s1p.r213u.b100.re(config-if-range)#end
c29s1p.r213u.b100.researchblvd#
 << 
Jul  2 09:10:46: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.r213u.b100.researchblvd#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.r213u.b100.re(config)#
Expect: matched string 1: (config)#
 >> default interface range gi1/0/1 - 2 

 >> interface range gi1/0/1 - 2 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi1/0/1 - 2 
c29s1p.r213u.b100.re(config)#interface range gi1/0/1 - 2 
c29s1p.r213u.b100.re(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport access vlan 568

 >> switchport mode access

 >> spanning-tree portfast

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport access vlan 568
c29s1p.r213u.b100.re(config-if-range)#switchport mode access
c29s1p.r213u.b100.re(config-if-range)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, conce
 << ntrators, switches, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast will be configured in 2 interfaces due to the range command 
 but will only have effect when the interf
 << aces are in a non-trunking mode.
c29s1p.r213u.b100.re(config-if-range)#end
c29s1p.r213u.b100.researchblvd#
 << 
Jul  2 09:10:52: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.r213u.b100.researchblvd#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.r213u.b100.re(config)#
Expect: matched string 1: (config)#
 >> default interface gi1/0/24 

 >> interface gi1/0/24 

Expect: searching for 1 strs:  :(config-if)#
 << default interface gi1/0/24 
Interface GigabitEthernet1/0/24 set to default configuration
c29s1p.r213u.b100.re(config)#interface gi1/0/24 
c29s1p.r213u.b100.re(config-if)#
Expect: matched string 1: (config-if)#
 >> switchport mode trunk

 >> switchport trunk native vlan 92

 >> ip dhcp snooping trust

 >> no keepalive

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport mode trunk
c29s1p.r213u.b100.re(config-if)#switchport trunk native vlan 92
c29s1p.r213u.b100.re(config-if)#ip dhcp snooping trust
c29s1p.r213u.b100.re(config-if)#no keepalive
c29s1p.r213u.b100.re(config-if)#end
c29s1p.r213u.b100.researchbl
 << vd#
 << 
Jul  2 09:10:58: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.r213u.b100.researchblvd#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.r213u.b100.re(config)#
Expect: matched string 1: (config)#
 >> default interface range te1/0/1 - 2 

 >> interface range te1/0/1 - 2 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range te1/0/1 - 2 
c29s1p.r213u.b100.re(config)#interface range te1/0/1 - 2 
c29s1p.r213u.b100.re(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport mode trunk

 >> switchport trunk native vlan 92

 >> ip dhcp snooping trust

 >> no keepalive

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport mode trunk
c29s1p.r213u.b100.re(config-if-range)#switchport trunk native vlan 92
c29s1p.r213u.b100.re(config-if-range)#ip dhcp snooping trust
c29s1p.r213u.b100.re(config-if-range)#no keepalive
c29s1p.r213u.b100.re(config-if-range)#end
c29s
 << 1p.r213u.b100.researchblvd#
 << 
Jul  2 09:11:04: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.r213u.b100.researchblvd#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.r213u.b100.re(config)#
Expect: matched string 1: (config)#
 >> default interface range gi1/0/25 - 26 

 >> interface range gi1/0/25 - 26 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi1/0/25 - 26 
c29s1p.r213u.b100.re(config)#interface range gi1/0/25 - 26 
c29s1p.r213u.b100.re(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport mode trunk

 >> switchport trunk native vlan 92

 >> ip dhcp snooping trust

 >> no keepalive

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport mode trunk
c29s1p.r213u.b100.re(config-if-range)#switchport trunk native vlan 92
c29s1p.r213u.b100.re(config-if-range)#ip dhcp snooping trust
c29s1p.r213u.b100.re(config-if-range)#no keepalive
c29s1p.r213u.b100.re(config-if-range)#end
c29s
 << 1p.r213u.b100.researchblvd#
 << 
Jul  2 09:11:10: %SYS-5-CONFIG_I: Configured from console by console
Jul  2 09:11:11: %LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet1/0/25, changed state to down
Jul  2 09:11:11: %LINEPROTO-5-UPDOWN: Line protocol on Interface Gigabit
Expect: matched string 1: Configured
 >> 

 >> write mem

Expect: searching for 2 strs:  :# :>
 << Ethernet1/0/26, changed state to down
c29s1p.r213u.b100.researchblvd#write mem
Building configuration...
[OK]
c29s1p.r213u.b100.researchblvd#
Expect: matched string 1: #
 >> 
Expect: searching for 2 strs:  :# :>
 << 
c29s1p.r213u.b100.researchblvd#
c29s1p.r213u.b100.researchblvd#
Expect: matched string 1: #
 >> sh run

Expect: searching for 2 strs:  :# :>
 << sh run
Building configuration...

Current configuration : 14218 bytes
!
! Last configuration change at 09:11:10 CDT Thu Jul 2 2015
! NVRAM config last updated at 09:11:12 CDT Thu Jul 2 2015
!
version 15.0
no service pad
service timestamps debug 
 << datetime localtime
service timestamps log datetime localtime
service password-encryption
!
hostname c29s1p.r213u.b100.researchblvd
!
boot-start-marker
boot-end-marker
!
enable secret 5 $1$yFHl$hTKyu8tXxcnUjfT121rph/
enable password 7 1436000E0D5
 << 9266133
!
no aaa new-model
clock timezone CST -6 0
clock summer-time CDT recurring
switch 1 provision ws-c2960x-24pd-l
authentication mac-move permit
!
!
ip dhcp snooping vlan 190
ip dhcp snooping
ip domain-name mgmt.msstate.edu
ip name-server
 <<  130.18.2.210
!
!
crypto pki trustpoint TP-self-signed-2307307904
 enrollment selfsigned
 subject-name cn=IOS-Self-Signed-Certificate-2307307904
 revocation-check none
 rsakeypair TP-self-signed-2307307904
!
!
crypto pki certificate chain TP-sel
 << f-signed-2307307904
 certificate self-signed 01
  3082022B 30820194 A0030201 02020101 300D0609 2A864886 F70D0101 05050030 
  31312F30 2D060355 04031326 494F532D 53656C66 2D536967 6E65642D 43657274 
  69666963 6174652D 32333037 33303739 3034301E 170D31
 << 35 30373032 31343039 
  34385A17 0D323030 31303130 30303030 305A3031 312F302D 06035504 03132649 
  4F532D53 656C662D 5369676E 65642D43 65727469 66696361 74652D32 33303733 
  30373930 3430819F 300D0609 2A864886 F70D0101 01050003 818D0030 81890281 
  81
 << 009CF8 97F8C4EF 3E888907 63AA3B8D FFFDD481 82D78F87 CC69D0AF AE217E51 
  CE51FCBF 17810A11 71E19937 CFBF258A 04D782AB 0EF0DF8C 61AF29D4 4A19422A 
  0B06B20F D73B83DE D51B5A8E 868A8516 0B38BB26 636AE85B EC9DEEBC A5BF91E5 
  C9D5D609 866C418E 1C963FD1 6A
 << D2F9D4 C3B7D7E6 5AC5A612 51272F01 CEE9AA64 
  1E2D0203 010001A3 53305130 0F060355 1D130101 FF040530 030101FF 301F0603 
  551D2304 18301680 1499CC77 C1CAC831 E439FF8A 698B9716 EBD1528D B6301D06 
  03551D0E 04160414 99CC77C1 CAC831E4 39FF8A69 8B9716EB D1
 << 528DB6 300D0609 
  2A864886 F70D0101 05050003 81810057 655CFF6A 53901A2D A382CC87 A22CAAAE 
  D26645F0 813C1C82 4B7FCA70 1CCF4D3F 40CDE0BA 7662A6DB 62A5B9D5 BAA30A67 
  9DE6364F 584652DC E6638EC0 C57B1FA4 7DE1BAE7 7C90F296 67AEA0DA 44ECA8A8 
  EFB6239
 << B 25A6FE9C 81414C3D 06C1C3B5 E29205F8 E9133216 C8EE553F 5BC2D300 
  39B2281B FE690BBD 81A41B14 FA0151
  	quit
!
spanning-tree mode mst
spanning-tree portfast bpduguard default
spanning-tree extend system-id
!
spanning-tree mst configuration
 name
 <<  msstate
 revision 1
 instance 1 vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 63, 70
 instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 160
 instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 230, 232, 242, 246
 instance 
 << 1 vlan 256, 611-612, 654, 741, 996, 999
 instance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037, 2039-2040
 instance 2 vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096, 2104, 2110, 2126
 instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 216
 << 8, 2189, 2194, 2202
 instance 2 vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 2654, 2999
 instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176, 196
 instance 3 vlan 244, 248, 927
 instance 4 vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072
 << , 2108, 2113, 2128
 instance 4 vlan 2144, 2176, 2196, 2244, 2248, 2927
 instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 228
 instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216, 2228
 instance 7 vlan 9, 33-34, 38, 54, 56, 71, 7
 << 5, 82, 84, 97, 114, 116, 124
 instance 7 vlan 172, 186, 192, 204-208, 210, 240-241, 251-252, 630, 928
 instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082, 2084
 instance 8 vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208, 2210
 << 
 instance 8 vlan 2240-2241, 2251-2252, 2630, 2928
 instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102, 112
 instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 500, 505, 510-511
 instance 9 vlan 522, 551-570, 603, 629, 633, 742, 802
 << , 926, 929
 instance 10 vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 2057, 2062, 2068
 instance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148, 2158
 instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522, 2603, 2629, 2633
 instance 10 v
 << lan 2802, 2926, 2929
 instance 11 vlan 8, 43, 52, 146, 156-157, 180, 200, 218
 instance 12 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180, 2200, 2218
!
!
!
!
!
!
errdisable recovery cause udld
errdisable recovery cause bpduguard
errdisable recove
 << ry cause security-violation
errdisable recovery cause channel-misconfig (STP)
errdisable recovery cause pagp-flap
errdisable recovery cause dtp-flap
errdisable recovery cause link-flap
errdisable recovery cause sfp-config-mismatch
errdisable recover
 << y cause gbic-invalid
errdisable recovery cause psecure-violation
errdisable recovery cause port-mode-failure
errdisable recovery cause dhcp-rate-limit
errdisable recovery cause pppoe-ia-rate-limit
errdisable recovery cause mac-limit
errdisable recov
 << ery cause vmps
errdisable recovery cause storm-control
errdisable recovery cause inline-power
errdisable recovery cause arp-inspection
errdisable recovery cause loopback
errdisable recovery cause small-frame
errdisable recovery cause psp
errdisable
 <<  recovery interval 1800
!
vlan internal allocation policy ascending
!
!
!
!
!
!
interface FastEthernet0
 no ip address
 shutdown
!
interface GigabitEthernet1/0/1
 switchport access vlan 568
 switchport mode access
 spanning-tree portfast

 << !
interface GigabitEthernet1/0/2
 switchport access vlan 568
 switchport mode access
 spanning-tree portfast
!
interface GigabitEthernet1/0/3
 switchport access vlan 190
 switchport mode access
 switchport port-security maximum 2
 switchport por
 << t-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/4
 switchport access vlan 190
 switchport mode ac
 << cess
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEther
 << net1/0/5
 switchport access vlan 190
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inac
 << tivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/6
 switchport access vlan 190
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security vi
 << olation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/7
 switchport access vlan 190
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport
 <<  port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/8
 switchport access vlan 190
 switchport mode access
 switchport port-
 << security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/9
 switchport a
 << ccess vlan 190
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree 
 << portfast
!
interface GigabitEthernet1/0/10
 switchport access vlan 190
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 swit
 << chport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/11
 switchport access vlan 190
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging 
 << time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/12
 switchport access vlan 190
 switchport mode access
 switchport port-security maximum 2

 <<  switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/13
 switchport access vlan 190
 sw
 << itchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interf
 << ace GigabitEthernet1/0/14
 switchport access vlan 190
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-securit
 << y aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/15
 switchport access vlan 190
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchpor
 << t port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/16
 switchport access vlan 190
 switchport mode access
 switchport port-security maximum 2
 switchport port-se
 << curity
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/17
 switchport access vlan 190
 switchport mode acces
 << s
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet
 << 1/0/18
 switchport access vlan 190
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inacti
 << vity
 spanning-tree portfast
!
interface GigabitEthernet1/0/19
 switchport access vlan 190
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security vio
 << lation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/20
 switchport access vlan 190
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport
 <<  port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/21
 switchport access vlan 190
 switchport mode access
 switchport port
 << -security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/22
 switchport
 <<  access vlan 190
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tre
 << e portfast
!
interface GigabitEthernet1/0/23
 switchport access vlan 190
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 sw
 << itchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/24
 switchport trunk native vlan 92
 switchport mode trunk
 no keepalive
 ip dhcp snooping trust
!
interface GigabitEthernet1/0/25
 switchport tr
 << unk native vlan 92
 switchport mode trunk
 ip dhcp snooping trust
!
interface GigabitEthernet1/0/26
 switchport trunk native vlan 92
 switchport mode trunk
 ip dhcp snooping trust
!
interface TenGigabitEthernet1/0/1
 switchport trunk native vlan
 <<  92
 switchport mode trunk
 ip dhcp snooping trust
!
interface TenGigabitEthernet1/0/2
 switchport trunk native vlan 92
 switchport mode trunk
 ip dhcp snooping trust
!
interface Vlan1
 no ip address
 no ip route-cache
 shutdown
!
interface 
 << Vlan92
 ip address 10.92.1.130 255.255.0.0
 ip broadcast-address 10.92.255.255
!
ip default-gateway 10.92.0.1
ip http server
ip http secure-server
!
logging facility local1
logging host 130.18.2.208
access-list 1 permit 10.92.0.0 0.0.255.255
!
 << 
snmp-server community sysnet RO 1
snmp-server community c2-b2=a2 RW 1
snmp-server contact 6F-1935
snmp-server enable traps snmp authentication linkdown linkup coldstart warmstart
snmp-server enable traps transceiver all
snmp-server enable traps tty
 << 
snmp-server enable traps cluster
snmp-server enable traps config-copy
snmp-server enable traps config
snmp-server enable traps config-ctid
snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-auth-fail-vlan no-guest-vlan
snmp-server enable tr
 << aps entity
snmp-server enable traps power-ethernet group 1
snmp-server enable traps power-ethernet police
snmp-server enable traps cpu threshold
snmp-server enable traps rep
snmp-server enable traps bridge newroot topologychange
snmp-server enable t
 << raps stpx inconsistency root-inconsistency loop-inconsistency
snmp-server enable traps syslog
snmp-server enable traps vtp
snmp-server enable traps vlancreate
snmp-server enable traps vlandelete
snmp-server enable traps flash insertion removal
snmp-
 << server enable traps port-security
snmp-server enable traps envmon fan shutdown supply temperature status
snmp-server enable traps errdisable
snmp-server enable traps mac-notification change move threshold
snmp-server enable traps vlan-membership
snmp
 << -server host 130.18.2.208 sysnet 
!
!
line con 0
line vty 0 4
 password 7 132405170A5108603C
 login
line vty 5 15
 password 7 153319090577276E3F
 login
!
ntp server 130.18.92.22
end

c29s1p.r213u.b100.researchblvd#
Expect: matched string 1: #
 >> show interface status

Expect: searching for 2 strs:  :# :>
 << show interface status

Port      Name               Status       Vlan       Duplex  Speed Type
Gi1/0/1                      notconnect   568          auto   auto 10/100/1000BaseTX
Gi1/0/2                      notconnect   568          auto   auto 10/1
 << 00/1000BaseTX
Gi1/0/3                      notconnect   190          auto   auto 10/100/1000BaseTX
Gi1/0/4                      notconnect   190          auto   auto 10/100/1000BaseTX
Gi1/0/5                      notconnect   190          auto   auto 1
 << 0/100/1000BaseTX
Gi1/0/6                      notconnect   190          auto   auto 10/100/1000BaseTX
Gi1/0/7                      notconnect   190          auto   auto 10/100/1000BaseTX
Gi1/0/8                      notconnect   190          auto   aut
 << o 10/100/1000BaseTX
Gi1/0/9                      notconnect   190          auto   auto 10/100/1000BaseTX
Gi1/0/10                     notconnect   190          auto   auto 10/100/1000BaseTX
Gi1/0/11                     notconnect   190          auto   
 << auto 10/100/1000BaseTX
Gi1/0/12                     notconnect   190          auto   auto 10/100/1000BaseTX
Gi1/0/13                     notconnect   190          auto   auto 10/100/1000BaseTX
Gi1/0/14                     notconnect   190          auto
 <<    auto 10/100/1000BaseTX
Gi1/0/15                     notconnect   190          auto   auto 10/100/1000BaseTX
Gi1/0/16                     notconnect   190          auto   auto 10/100/1000BaseTX
Gi1/0/17                     notconnect   190          a
 << uto   auto 10/100/1000BaseTX
Gi1/0/18                     notconnect   190          auto   auto 10/100/1000BaseTX
Gi1/0/19                     notconnect   190          auto   auto 10/100/1000BaseTX
Gi1/0/20                     notconnect   190        
 <<   auto   auto 10/100/1000BaseTX
Gi1/0/21                     notconnect   190          auto   auto 10/100/1000BaseTX
Gi1/0/22                     notconnect   190          auto   auto 10/100/1000BaseTX
Gi1/0/23                     notconnect   190     
 <<      auto   auto 10/100/1000BaseTX
Gi1/0/24                     notconnect   1            auto   auto 10/100/1000BaseTX
Te1/0/1                      notconnect   1            full    10G Not Present
Te1/0/2                      notconnect   1          
 <<   full    10G Not Present
Fa0                          disabled     routed       auto   auto 10/100BaseTX
c29s1p.r213u.b100.researchblvd#
Expect: matched string 1: #
