trying to use serial port: /dev/ttyUSB0
 >> 
 >> 

Expect: searching for 4 strs:  :[yes/no] :Press RETURN to get started. :# :Switch>
 << 


         --- System Configuration Dialog ---

Enable secret warning
----------------------------------
In order to access the device manager, an enable secret is required
If you enter the initial configuration dialog, you will be prompted for t
 << he enable secret
If you choose not to enter the intial configuration dialog, or if you exit setup without setting the enable secret,
please set an enable secret using the following CLI in configuration mode-
enable secret 0 <cleartext password>
------
 << ----------------------------
Would you like to enter the initial configuration dialog? [yes/no]: 
% Please answer 'yes' or 'no'.
Would you like to enter the initial configuration dialog? [yes/no]: 
% Please answer 'yes' or 'no'.
Would you like to ent
Expect: matched string 1: [yes/no]
 >> 

 >> no

 >> term len 0

Expect: searching for 2 strs:  :# :>
 << er the initial configuration dialog? [yes/no]: 
% Please answer 'yes' or 'no'.
Would you like to enter the initial configuration dialog? [yes/no]: 
% Please answer 'yes' or 'no'.
Would you like to enter the initial configuration dialog? [yes/no]: 
% 
 << Please answer 'yes' or 'no'.
Would you like to enter the initial configuration dialog? [yes/no]: no
Switch>term len 0
Switch>
Expect: matched string 2: >
 >> show version

Expect: searching for 2 strs:  :# :>
 << 
*Mar  1 00:04:31.748: %LINK-5-CHANGED: Interface Vlan1, changed state to administratively down
*Mar  1 00:04:31.754: %LINK-5-CHANGED: Interface FastEthernet0, changed state to administratively downshow version
Cisco IOS Software, C2960S Software (C296
 << 0S-UNIVERSALK9-M), Version 12.2(53)SE2, RELEASE SOFTWARE (fc3)
Technical Support: http://www.cisco.com/techsupport
Copyright (c) 1986-2010 by Cisco Systems, Inc.
Compiled Wed 21-Apr-10 06:08 by prod_rel_team
Image text-base: 0x00003000, data-base: 0x0
 << 1B00000

ROM: Bootstrap program is Alpha board boot loader
BOOTLDR: C2960S Boot Loader (C2960S-HBOOT-M) Version 12.2(53r)SE, RELEASE SOFTWARE (fc3)

Switch uptime is 4 minutes
System returned to ROM by power-on
System image file is "flash:/c2960s-u
 << niversalk9-mz.122-53.SE2/c2960s-universalk9-mz.122-53.SE2.bin"


This product contains cryptographic features and is subject to United
States and local country laws governing import, export, transfer and
use. Delivery of Cisco cryptographic products 
 << does not imply
third-party authority to import, export, distribute or use encryption.
Importers, exporters, distributors and users are responsible for
compliance with U.S. and local country laws. By using this product you
agree to comply with applicab
 << le laws and regulations. If you are unable
to comply with U.S. and local laws, return this product immediately.

A summary of U.S. laws governing Cisco cryptographic products may be found at:
http://www.cisco.com/wwl/export/crypto/tool/stqrg.html

I
 << f you require further assistance please contact us by sending email to
export@cisco.com.

cisco WS-C2960S-24TD-L (PowerPC) processor (revision B0) with 131072K bytes of memory.
Processor board ID FOC1436Z0RQ
Last reset from power-on
1 Virtual Ethern
 << et interface
1 FastEthernet interface
26 Gigabit Ethernet interfaces
2 Ten Gigabit Ethernet interfaces
The password-recovery mechanism is enabled.

512K bytes of flash-simulated non-volatile configuration memory.
Base ethernet MAC Address       : B
 << 4:A4:E3:03:FA:80
Motherboard assembly number     : 73-11906-08
Power supply part number        : 341-0328-02
Motherboard serial number       : FOC14345HXP
Power supply serial number      : DCA1423M1SQ
Model revision number           : B0
Motherboard
 <<  revision number     : A0
Model number                    : WS-C2960S-24TD-L
Daughterboard assembly number   : 73-11933-04
Daughterboard serial number     : FOC143546XV
System serial number            : FOC1436Z0RQ
Top Assembly Part Number        : 8
 << 00-30933-02
Top Assembly Revision Number    : A0
Version ID                      : V02
CLEI Code Number                : COMGA00ARB
Daughterboard revision number   : A0
Hardware Board Revision Number  : 0x01


Switch Ports Model              SW Ve
 << rsion            SW Image                 
------ ----- -----              ----------            ----------               
*    1 28    WS-C2960S-24TD-L   12.2(53)SE2           C2960S-UNIVERSALK9-M     


Configuration register is 0xF

Switch>
Expect: matched string 2: >
 >> enable

Expect: searching for 2 strs:  :Password: :#
 << enable
Switch#
Expect: matched string 2: #
 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
Expect: matched string 1: (config)#
 >> version 12.2

 >> no service pad

 >> service timestamps debug datetime localtime

 >> service timestamps log datetime localtime

 >> service password-encryption

 >> boot-start-marker

 >> boot-end-marker

 >> enable secret Area=l*w

 >> enable password Area=l*w

 >> no aaa new-model

 >> clock timezone CST -6

 >> clock summer-time CDT recurring

 >> switch 1 provision ws-c2960s-48ts-l

 >> authentication mac-move permit

 >> ip subnet-zero

 >> ip domain-name mgmt.msstate.edu

 >> ip name-server 130.18.2.210

 >> vtp domain vtp01.mgmt.msstate.edu

 >> vtp mode client

 >> crypto pki trustpoint TP-self-signed-2494998912

 >>  enrollment selfsigned

 >>  subject-name cn=IOS-Self-Signed-Certificate-2494998912

 >>  revocation-check none

 >>  rsakeypair TP-self-signed-2494998912

 >> crypto pki certificate chain TP-self-signed-2494998912

 >>  certificate self-signed 01 nvram:IOS-Self-Sig#3232.cer

 >> spanning-tree portfast bpduguard default

 >> spanning-tree extend system-id

 >> vlan internal allocation policy ascending

 >> errdisable recovery cause all

 >> errdisable recovery interval 1800

 >> interface FastEthernet0

 >>  no ip address

 >>  shutdown

 >> interface Vlan1

 >>  no ip address

 >>  no ip route-cache

 >>  shutdown

 >> interface Vlan92

 >> ip http server

 >> ip http secure-server

 >> ip sla enable reaction-alerts

 >> logging facility local1

 >> logging 130.18.2.208

 >> access-list 1 permit 10.92.0.0 0.0.255.255

 >> snmp-server community sysnet RO 1

 >> snmp-server community c2-b2=a2 RW 1

 >> snmp-server enable traps snmp authentication linkdown linkup coldstart warmstart

 >> snmp-server enable traps transceiver all

 >> snmp-server enable traps tty

 >> snmp-server enable traps cluster

 >> snmp-server enable traps config-copy

 >> snmp-server enable traps config

 >> snmp-server enable traps config-ctid

 >> snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-auth-fail-vlan no-guest-vlan

 >> snmp-server enable traps entity

 >> snmp-server enable traps power-ethernet group 1

 >> snmp-server enable traps power-ethernet police

 >> snmp-server enable traps cpu threshold

 >> snmp-server enable traps rep

 >> snmp-server enable traps rtr

 >> snmp-server enable traps bridge newroot topologychange

 >> snmp-server enable traps stpx inconsistency root-inconsistency loop-inconsistency

 >> snmp-server enable traps syslog

 >> snmp-server enable traps vtp

 >> snmp-server enable traps vlancreate

 >> snmp-server enable traps vlandelete

 >> snmp-server enable traps flash insertion removal

 >> snmp-server enable traps port-security

 >> snmp-server enable traps envmon fan shutdown supply temperature status

 >> snmp-server enable traps errdisable

 >> snmp-server enable traps mac-notification change move threshold

 >> snmp-server enable traps vlan-membership

 >> snmp-server host 130.18.2.208 sysnet 

 >> line con 0

 >> line vty 0 4

 >>  password Area=l*w

 >>  login

 >> line vty 5 15

 >>  password Area=l*w

 >>  login

 >> ntp clock-period 22519226

 >> ntp server 130.18.92.22

 >> end

Expect: searching for 1 strs:  :Configured
 << version 12.2
Switch(config)#no service pad
Switch(config)#service timestamps debug datetime localtime
Switch(config)#service timestamps log datetime localtime
Switch(config)#service password-encryption
Switch(config)#boot-start-marker
Switch(config)
 << #boot-end-marker
Switch(config)#enable secret Area=l*w
Switch(config)#enable password Area=l*w
The enable password you have chosen is the same as your enable secret.
This is not recommended.  Re-enter the enable password.

Switch(config)#no aaa new-
 << model
Switch(config)#clock timezone CST -6
Switch(config)#clock summer-time CDT recurring
Switch(config)#switch 1 provision ws-c2960s-48ts-l
%Command rejected: switch 1 (ws-c2960s-24td-l) already present in the stack

Switch(config)#authentication m
 << ac-move permit
Switch(config)#ip subnet-zero
Switch(config)#
*Feb 28 18:05:00: %SYS-6-CLOCKUPDATE: System clock has been updated from 00:05:00 UTC Mon Mar 1 1993 to 18:05:00 CST Sun Feb 28 1993, configured from console by console.
*Feb 28 18:05:00: %S
 << YS-6-CLOCKUPDATE: System clock has been updated from 18:05:00 CST Sun Feb 28 1993 to 18:05:00 CST Sun Feb 28 1993, configured from console by console.ip domain-name mgmt.msstate.edu
Switch(config)#ip name-server 130.18.2.210
Switch(config)#vtp domain vt
 << p01.mgmt.msstate.edu
Domain name already set to vtp01.mgmt.msstate.edu.
Switch(config)#vtp mode client
Device mode already VTP Client for VLANS.
Switch(config)#crypto pki trustpoint TP-self-signed-2494998912
Switch(ca-trustpoint)# enrollment selfsign
 << ed
Switch(ca-trustpoint)# subject-name cn=IOS-Self-Signed-Certificate-2494998912
Switch(ca-trustpoint)# revocation-check none
Switch(ca-trustpoint)# rsakeypair TP-self-signed-2494998912
Switch(ca-trustpoint)#crypto pki certificate chain TP-self-signed
 << -2494998912
Switch(config-cert-chain)# certificate self-signed 01 nvram:IOS-Self-Sig#3232$e self-signed 01 nvram:IOS-Self-Sig#3232.         cer
Switch(config-cert-chain)#spanning-tree portfast 
 << bpduguard default
Switch(config)#spanning-tree extend system-id
Switch(config)#vlan internal allocation policy ascending
Switch(config)#errdisable recovery cause all
Switch(config)#errdisable recovery interval 1800
Switch(config)#interface FastEthern
 << et0
Switch(config-if)# no ip address
Switch(config-if)# shutdown
Switch(config-if)#interface Vlan1
Switch(config-if)# no ip address
Switch(config-if)# no ip route-cache
Switch(config-if)# shutdown
Switch(config-if)#interface Vlan92
Switch(config-i
 << f)#ip http server
Switch(config)#ip http secure-server
% Generating 1024 bit RSA keys, keys will be non-exportable...[OK]

*Feb 28 18:05:07: %LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan92, changed state to down
Switch(config)#ip sla enable re
 << action-alerts
Switch(config)#logging facility local1
Switch(config)#logging 130.18.2.208
Switch(config)#access-list 1 permit 10.92.0.0 0.0.255.255
Switch(config)#snmp-server community sysnet RO 1
Switch(config)#snmp-server community c2-b2=a2 RW 1
Sw
 << itch(config)#snmp-server enable traps snmp authentication linkdown linkup c$ enable traps snmp authentication linkdown linkup co         ldstart w
 << aps snmp authentication linkdown linkup coldstart wa         rmstart
Switch(config)#snmp-server enable traps transceiver all
Switch(config)#snmp-server enable traps tty
Switch(config)#snmp
*Feb 28 18:05:09: %SSH-5-ENABL
 << ED: SSH 1.99 has been enabled-server enable traps cluster
Switch(config)#snmp-server enable traps config-copy
Switch(config)#snmp-server enable traps config
Switch(config)#snmp-server enable traps config-ctid
Switch(config)#snmp-server enable traps do
 << t1x auth-fail-vlan guest-vlan no-au$ enable traps dot1x auth-fail-vlan guest-vlan no-aut         h-fail-vlaps dot1x auth-fa
 << il-vlan guest-vlan no-auth-fail-vla         n no-guesuth-fail-vlan guest-vlan no-auth-fail-vlan no-guest         -vlan
Switch(config)#snmp-server enable traps entity
Switch(co
 << nfig)#snmp-server enable traps power-ethernet group 1
Switch(config)#snmp-server enable traps power-ethernet police
Switch(config)#snmp-server enable traps cpu threshold
Switch(config)#snmp-server enable traps rep
Switch(config)#snmp-server enable tra
 << ps rtr
Switch(config)#snmp-server enable traps bridge newroot topologychange
Switch(config)#snmp-server enable traps stpx inconsistency 
*Feb 28 18:05:10: %PKI-4-NOAUTOSAVE: Configuration was modified.  Issue "write memory" to save new certificateroot-
 << inconsistency$ enable traps stpx inconsistency root-inconsistency          loop-incoaps stpx inconsistency root-inconsisten
 << cy loop-incon         sistency
Switch(config)#snmp-server enable traps syslog
Switch(config)#snmp-server enable traps vtp
Switch(config)#snmp-server enable traps vlancreate
Switch(config)#snmp-server enable traps vlandelete
Switch(config)#

 << *Feb 28 18:05:11: %SYS-6-LOGGINGHOST_STARTSTOP: Logging to host 130.18.2.208 Port 514 started - CLI initiatedsnmp-server enable traps flash insertion removal
Switch(config)#snmp-server enable traps port-security
Switch(config)#snmp-server enable traps e
 << nvmon fan shutdown supply temperatur$ enable traps envmon fan shutdown supply temperature          status
Switch(config)#snmp-server enable traps errdisable
Switch(config)#snmp-serve
 << r enable traps mac-notification change move threshol$ enable traps mac-notification change move threshold         
Switch(config)#snmp-server enable traps vlan-membership
Switch(conf
 << ig)#snmp-server host 130.18.2.208 sysnet 
Switch(config)#line con 0
Switch(config-line)#line vty 0 4
Switch(config-line)# password Area=l*w
Switch(config-line)# login
Switch(config-line)#line vty 5 15
Switch(config-line)# password Area=l*w
Switch(c
 << onfig-line)# login
Switch(config-line)#ntp clock-period 22519226
Switch(config)#ntp server 130.18.92.22
Switch(config)#end
Switch#
 << 
*Feb 28 18:05:16: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
Switch#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
Expect: matched string 1: (config)#
 >> spanning-tree mode mst

 >> spanning-tree etherchannel guard misconfig

 >> spanning-tree mst configuration

 >>  name msstate

 >>  revision 1

 >>  instance 1 vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 63, 70

 >>  instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 160

 >>  instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 230, 232, 242, 246

 >>  instance 1 vlan 256, 611-612, 654, 741, 996, 999

 >>  instance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037, 2039-2040

 >>  instance 2 vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096, 2104, 2110, 2126

 >>  instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 2189, 2194, 2202

 >>  instance 2 vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 2654, 2999

 >>  instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176, 196

 >>  instance 3 vlan 244, 248, 927

 >>  instance 4 vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072, 2108, 2113, 2128

 >>  instance 4 vlan 2144, 2176, 2196, 2244, 2248, 2927

 >>  instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 228

 >>  instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216, 2228

 >>  instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116, 124

 >>  instance 7 vlan 172, 186, 192, 204-208, 210, 240-241, 251-252, 630, 928

 >>  instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082, 2084

 >>  instance 8 vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208, 2210

 >>  instance 8 vlan 2240-2241, 2251-2252, 2630, 2928

 >>  instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102, 112

 >>  instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 500, 505, 510-511

 >>  instance 9 vlan 522, 551-570, 603, 629, 633, 742, 802, 926, 929

 >>  instance 10 vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 2057, 2062, 2068

 >>  instance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148, 2158

 >>  instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522, 2603, 2629, 2633

 >>  instance 10 vlan 2802, 2926, 2929

 >>  instance 11 vlan 8, 43, 52, 146, 156-157, 180, 200, 218

 >>  instance 12 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180, 2200, 2218

 >> 

 >> end

Expect: searching for 1 strs:  :Configured
 << spanning-tree mode mst
Switch(config)#spanning-tree etherchannel guard misconfig
Switch(config)#spanning-tree mst configuration
Switch(config-mst)# name msstate
Switch(config-mst)# revision 1
Switch(config-mst)# instance 1 vlan 2, 7, 11, 20, 22, 24, 
 << 31, 35, 37, 39-40, $ vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40, 5         0, 60, 63, 11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 
 << 63,          70
Switch(config-mst)# instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 1$ vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 14         0, 152, 1
 << 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 16         0
Switch(config-mst)# instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 23$ vlan 162-1
 << 63, 168, 189, 194, 202, 220, 222, 230         , 232, 24163, 168, 189, 194, 202, 220, 222, 230, 232, 242         , 246
Switch(config-mst)# instance 1 vlan 256, 611-612, 654, 741, 9
 << 96, 999
Switch(config-mst)# instance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031,$ vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031,          2035, 203
 << , 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037         , 2039-2011, 2020, 2022, 2024, 2031, 2035, 2037, 2039-204         0
Switch(config-mst)# instance 2 v
 << lan 2050, 2060, 2063, 2070, 2080, 2086, 2096,$ vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096,          2104, 211, 2060, 2063, 2070,
 <<  2080, 2086, 2096, 2104, 2110         , 2126
Switch(config-mst)# instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, $ vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 2         
 << 189, 2194, 2140, 2152, 2160, 2162-2163, 2168, 2189, 2194,          2202
Switch(config-mst)# instance 2 vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 
 << $ vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 2         654, 2999
Switch(config-mst)# instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128$ vlan 42, 51, 59, 64
 << , 66, 69, 72, 108, 113, 128,          144, 17651, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176,          196
Switch(config-mst)# instance 3 vlan 244, 248, 927
Switch(config-mst)# 
 << instance 4 vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072,$ vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072,          2108, 211, 2051,
 <<  2059, 2064, 2066, 2069, 2072, 2108, 2113         , 2128
Switch(config-mst)# instance 4 vlan 2144, 2176, 2196, 2244, 2248, 2927
Switch(config-mst)# instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 2
 << $ vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 22         8
Switch(config-mst)# instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-$ vlan 2016, 2048, 2058, 2088, 
 << 2121, 2131, 2133-2         134, 2216, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216,          2228
Switch(config-mst)# instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97,
 << $ vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97,          114, 116,3-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116,          1
 << 24
Switch(config-mst)# instance 7 vlan 172, 186, 192, 204-208, 210, 240-241, 251$ vlan 172, 186, 192, 204-208, 210, 240-241, 251-         252, 630,
 << 186, 192, 204-208, 210, 240-241, 251-252, 630,          928
Switch(config-mst)# instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, $ vlan 2009, 2033-2034, 2038, 2054
 << , 2056, 2071, 2         075, 2082, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082,          2084
Switch(config-mst)# instance 8 vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192,
 << $ vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192,          2204-2208, 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208,          221
 << 0
Switch(config-mst)# instance 8 vlan 2240-2241, 2251-2252, 2630, 2928
Switch(config-mst)# instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 9$ vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 
 << 98         -99, 102,12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102,          112
Switch(config-mst)# instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 50
 << $ vlan 130, 132, 147-148, 158, 212, 226, 236, 500         , 505, 51132, 147-148, 158, 212, 226, 236, 500, 505, 510         -511
Switch(config-mst
 << )# instance 9 vlan 522, 551-570, 603, 629, 633, 742, 802, 92$ vlan 522, 551-570, 603, 629, 633, 742, 802, 926         , 929
Switch(config-mst)# instance 10 vlan 2004-2005, 2012, 2018-2019
 << , 2032, 2044, $0 vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 2         057, 2062
 << 
 << 
 << 
*Feb 28 18:05:32: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
Expect: matched string 1: (config)#
 >> hostname test 

Expect: searching for 2 strs:  :# :>
 << hostname test 
test(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
test#
 << 
*Feb 28 18:05:39: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
test#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
test(config)#
Expect: matched string 1: (config)#
 >> snmp-server contact test

Expect: searching for 1 strs:  :#
 << snmp-server contact test
test(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
test#
 << 
*Feb 28 18:05:45: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
test#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
test(config)#
Expect: matched string 1: (config)#
 >> interface vlan 92

Expect: searching for 1 strs:  :(config-if)#
 << interface vlan 92
test(config-if)#
Expect: matched string 1: (config-if)#
 >> ip address 10.92.1.193 255.255.0.0

 >> ip broadcast-address 10.92.255.255

 >> end

Expect: searching for 1 strs:  :Configured
 << ip address 10.92.1.193 255.255.0.0
test(config-if)#ip broadcast-address 10.92.255.255
test(config-if)#end
test#
 << 
*Feb 28 18:05:51: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
test#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
test(config)#
Expect: matched string 1: (config)#
 >> interface Vlan92

Expect: searching for 1 strs:  :(config-if)#
 << interface Vlan92
test(config-if)#
Expect: matched string 1: (config-if)#
 >> ip default-gateway 10.92.0.1

 >> end

Expect: searching for 1 strs:  :Configured
 << ip default-gateway 10.92.0.1
test(config)#end
test#
 << 
*Feb 28 18:05:57: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
test#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
test(config)#
Expect: matched string 1: (config)#
 >> default interface range gi1/0/1 - 24 

 >> interface range gi1/0/1 - 24 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi1/0/1 - 24 
test(config)#interface range gi1/0/1 - 24 
test(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport access vlan 123

 >> switchport mode access

 >> spanning-tree portfast

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport access vlan 123
test(config-if-range)#switchport mode access
test(config-if-range)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, concentrators, switches, bridges, etc
 << ... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast will be configured in 24 interfaces due to the range command 
 but will only have effect when the interfaces are in a non-trunking mode
 << .
test(config-if-range)#end
test#
 << 
*Feb 28 18:06:10: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
test#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
test(config)#
Expect: matched string 1: (config)#
 >> default interface range te1/0/1 - 2 

 >> interface range te1/0/1 - 2 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range te1/0/1 - 2 
test(config)#interface range te1/0/1 - 2 
test(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport mode trunk

 >> switchport trunk native vlan 92

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport mode trunk
test(config-if-range)#switchport trunk native vlan 92
test(config-if-range)#end
test#
 << 
*Feb 28 18:06:21: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
test#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
test(config)#
Expect: matched string 1: (config)#
 >> default interface range gi1/0/25 - 26 

 >> interface range gi1/0/25 - 26 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi1/0/25 - 26 
test(config)#interface range gi1/0/25 - 26 
test(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport mode trunk

 >> switchport trunk native vlan 92

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport mode trunk
test(config-if-range)#switchport trunk native vlan 92
test(config-if-range)#end
test#
 << 
*Feb 28 18:06:27: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> write mem

Expect: searching for 2 strs:  :# :>
 << 
test#write mem
Building configuration...
[OK]
test#
Expect: matched string 1: #
 >> 
Expect: searching for 2 strs:  :# :>
 << 
test#
test#
Expect: matched string 1: #
 >> sh run

Expect: searching for 2 strs:  :# :>
 << sh run
Building configuration...

Current configuration : 10017 bytes
!
version 12.2
no service pad
service timestamps debug datetime localtime
service timestamps log datetime localtime
service password-encryption
!
hostname test
!
boot-start
 << -marker
boot-end-marker
!
enable secret 5 $1$XqFR$Hln3WOTaFAHKU1ZiGr43v0
enable password 7 153319090577276E3F
!
!
!
no aaa new-model
clock timezone CST -6
clock summer-time CDT recurring
switch 1 provision ws-c2960s-24td-l
authentication mac-m
 << ove permit
ip subnet-zero
!
!
ip domain-name mgmt.msstate.edu
ip name-server 130.18.2.210
!
!
crypto pki trustpoint TP-self-signed-3808688768
 enrollment selfsigned
 subject-name cn=IOS-Self-Signed-Certificate-3808688768
 revocation-check none
 << 
 rsakeypair TP-self-signed-3808688768
!
!
crypto pki certificate chain TP-self-signed-3808688768
 certificate self-signed 01
  3082024F 308201B8 A0030201 02020101 300D0609 2A864886 F70D0101 04050030 
  31312F30 2D060355 04031326 494F532D 53656C66 2
 << D536967 6E65642D 43657274 
  69666963 6174652D 33383038 36383837 3638301E 170D3933 30333031 30303035 
  31305A17 0D323030 31303130 30303030 305A3031 312F302D 06035504 03132649 
  4F532D53 656C662D 5369676E 65642D43 65727469 66696361 74652D33 38303836 
 << 
  38383736 3830819F 300D0609 2A864886 F70D0101 01050003 818D0030 81890281 
  8100B9A4 35F5DA30 FF338EEF C978E6BC 6A71F20A C165C045 B5C22BB3 F60CFC41 
  4C1F996E 025700C3 06172D0F 86C730C4 8E4C5B07 9690F093 69C53929 6E2E4295 
  32444296 C0A4F509 434C74
 << 37 79A977A4 20935421 110A67A1 2D306A37 8B3C968A 
  E8163E73 1C906FCC 56AC3462 E58480DB 09B58CAF 6174F10D 6B3E1A94 B680ABDA 
  5E750203 010001A3 77307530 0F060355 1D130101 FF040530 030101FF 30220603 
  551D1104 1B301982 17537769 7463682E 6D676D74 2E6D73
 << 73 74617465 2E656475 
  301F0603 551D2304 18301680 14453943 93D6F837 1F8CFCA2 52F8B231 4C8301C9 
  C7301D06 03551D0E 04160414 45394393 D6F8371F 8CFCA252 F8B2314C 8301C9C7 
  300D0609 2A864886 F70D0101 04050003 81810049 140F4959 7CD63DC2 4E6904C1 
  0F
 << F5DE28 2950EFBF FD3DE72C 367C808E 74A467A7 EC9FA3A1 D5F945D4 F509C945 
  3E63F5D7 37FFC97D A7BD06E4 A10A4330 FABB49F0 A125177E 309D8B37 0A1803F8 
  70ECD5E9 C7D8283F 9AD5FEB8 BB7D6745 CA1C9C85 68E1EB35 41316767 13003678 
  026E7973 12A61B48 9ECB2A37 93
 << 4EAD69 B05FA2
  quit
!
spanning-tree mode mst
spanning-tree portfast bpduguard default
spanning-tree etherchannel guard misconfig
spanning-tree extend system-id
!
spanning-tree mst configuration
 name msstate
 revision 1
 instance 1 vlan 2, 7, 
 << 11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 63, 70
 instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 160
 instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 230, 232, 242, 246
 instance 1 vlan 256, 611-612, 654, 741, 996, 999
 inst
 << ance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037, 2039-2040
 instance 2 vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096, 2104, 2110, 2126
 instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 2189, 2194, 2202
 instance 2 vlan 2220, 22
 << 22, 2232, 2242, 2246, 2611-2612, 2654, 2999
 instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176, 196
 instance 3 vlan 244, 248, 927
 instance 4 vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072, 2108, 2113, 2128
 instance 4 vlan 2144, 217
 << 6, 2196, 2244, 2248, 2927
 instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 228
 instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216, 2228
 instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116, 124
 instance 7 vlan
 <<  172, 186, 192, 204-208, 210, 240-241, 251-252, 630, 928
 instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082, 2084
 instance 8 vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208, 2210
 instance 8 vlan 2240-2241, 2251-2252, 2630, 
 << 2928
 instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102, 112
 instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 500, 505, 510-511
 instance 9 vlan 522, 551-570, 603, 629, 633, 742, 802, 926, 929
 instance 10 vlan 2004-2005, 2012,
 <<  2018-2019, 2032, 2044, 2057, 2062, 2068
 instance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148, 2158
 instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522, 2603, 2629, 2633
 instance 10 vlan 2802, 2926, 2929
 instance 11 vlan 8, 43,
 <<  52, 146, 156-157, 180, 200, 218
 instance 12 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180, 2200, 2218
!
!
!
!
errdisable recovery cause udld
errdisable recovery cause bpduguard
errdisable recovery cause security-violation
errdisable recovery cau
 << se channel-misconfig (STP)
errdisable recovery cause pagp-flap
errdisable recovery cause dtp-flap
errdisable recovery cause link-flap
errdisable recovery cause sfp-config-mismatch
errdisable recovery cause gbic-invalid
errdisable recovery cause psec
 << ure-violation
errdisable recovery cause port-mode-failure
errdisable recovery cause dhcp-rate-limit
errdisable recovery cause pppoe-ia-rate-limit
errdisable recovery cause mac-limit
errdisable recovery cause vmps
errdisable recovery cause storm-cont
 << rol
errdisable recovery cause inline-power
errdisable recovery cause arp-inspection
errdisable recovery cause loopback
errdisable recovery cause small-frame
errdisable recovery interval 1800
!
vlan internal allocation policy ascending
!
!
!
int
 << erface FastEthernet0
 no ip address
 shutdown
!
interface GigabitEthernet1/0/1
 switchport access vlan 123
 switchport mode access
 spanning-tree portfast
!
interface GigabitEthernet1/0/2
 switchport access vlan 123
 switchport mode access
 sp
 << anning-tree portfast
!
interface GigabitEthernet1/0/3
 switchport access vlan 123
 switchport mode access
 spanning-tree portfast
!
interface GigabitEthernet1/0/4
 switchport access vlan 123
 switchport mode access
 spanning-tree portfast
!
in
 << terface GigabitEthernet1/0/5
 switchport access vlan 123
 switchport mode access
 spanning-tree portfast
!
interface GigabitEthernet1/0/6
 switchport access vlan 123
 switchport mode access
 spanning-tree portfast
!
interface GigabitEthernet1/0/
 << 7
 switchport access vlan 123
 switchport mode access
 spanning-tree portfast
!
interface GigabitEthernet1/0/8
 switchport access vlan 123
 switchport mode access
 spanning-tree portfast
!
interface GigabitEthernet1/0/9
 switchport access vlan 
 << 123
 switchport mode access
 spanning-tree portfast
!
interface GigabitEthernet1/0/10
 switchport access vlan 123
 switchport mode access
 spanning-tree portfast
!
interface GigabitEthernet1/0/11
 switchport access vlan 123
 switchport mode acc
 << ess
 spanning-tree portfast
!
interface GigabitEthernet1/0/12
 switchport access vlan 123
 switchport mode access
 spanning-tree portfast
!
interface GigabitEthernet1/0/13
 switchport access vlan 123
 switchport mode access
 spanning-tree portf
 << ast
!
interface GigabitEthernet1/0/14
 switchport access vlan 123
 switchport mode access
 spanning-tree portfast
!
interface GigabitEthernet1/0/15
 switchport access vlan 123
 switchport mode access
 spanning-tree portfast
!
interface Gigabit
 << Ethernet1/0/16
 switchport access vlan 123
 switchport mode access
 spanning-tree portfast
!
interface GigabitEthernet1/0/17
 switchport access vlan 123
 switchport mode access
 spanning-tree portfast
!
interface GigabitEthernet1/0/18
 switchpo
 << rt access vlan 123
 switchport mode access
 spanning-tree portfast
!
interface GigabitEthernet1/0/19
 switchport access vlan 123
 switchport mode access
 spanning-tree portfast
!
interface GigabitEthernet1/0/20
 switchport access vlan 123
 swit
 << chport mode access
 spanning-tree portfast
!
interface GigabitEthernet1/0/21
 switchport access vlan 123
 switchport mode access
 spanning-tree portfast
!
interface GigabitEthernet1/0/22
 switchport access vlan 123
 switchport mode access
 span
 << ning-tree portfast
!
interface GigabitEthernet1/0/23
 switchport access vlan 123
 switchport mode access
 spanning-tree portfast
!
interface GigabitEthernet1/0/24
 switchport access vlan 123
 switchport mode access
 spanning-tree portfast
!
in
 << terface GigabitEthernet1/0/25
 switchport trunk native vlan 92
 switchport mode trunk
!
interface GigabitEthernet1/0/26
 switchport trunk native vlan 92
 switchport mode trunk
!
interface TenGigabitEthernet1/0/1
 switchport trunk native vlan 92

 <<  switchport mode trunk
!
interface TenGigabitEthernet1/0/2
 switchport trunk native vlan 92
 switchport mode trunk
!
interface Vlan1
 no ip address
 no ip route-cache
 shutdown
!
interface Vlan92
 ip address 10.92.1.193 255.255.0.0
 ip broadc
 << ast-address 10.92.255.255
!
ip default-gateway 10.92.0.1
ip http server
ip http secure-server
ip sla enable reaction-alerts
logging facility local1
logging 130.18.2.208
access-list 1 permit 10.92.0.0 0.0.255.255
snmp-server community sysnet RO 1
 << 
snmp-server community c2-b2=a2 RW 1
snmp-server contact test
snmp-server enable traps snmp authentication linkdown linkup coldstart warmstart
snmp-server enable traps transceiver all
snmp-server enable traps tty
snmp-server enable traps cluster
snm
 << p-server enable traps config-copy
snmp-server enable traps config
snmp-server enable traps config-ctid
snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-auth-fail-vlan no-guest-vlan
snmp-server enable traps entity
snmp-server enable traps p
 << ower-ethernet group 1
snmp-server enable traps power-ethernet police
snmp-server enable traps cpu threshold
snmp-server enable traps rep
snmp-server enable traps rtr
snmp-server enable traps bridge newroot topologychange
snmp-server enable traps stp
 << x inconsistency root-inconsistency loop-inconsistency
snmp-server enable traps syslog
snmp-server enable traps vtp
snmp-server enable traps vlancreate
snmp-server enable traps vlandelete
snmp-server enable traps flash insertion removal
snmp-server e
 << nable traps port-security
snmp-server enable traps envmon fan shutdown supply temperature status
snmp-server enable traps errdisable
snmp-server enable traps mac-notification change move threshold
snmp-server enable traps vlan-membership
snmp-server 
 << host 130.18.2.208 sysnet 
!
!
line con 0
line vty 0 4
 password 7 0227165E0A5B036B5B
 login
line vty 5 15
 password 7 072E33494F54154F00
 login
!
ntp clock-period 22519226
ntp server 130.18.92.22
end

test#
Expect: matched string 1: #
 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
test(config)#
Expect: matched string 1: (config)#
 >> version 12.2

 >> no service pad

 >> service timestamps debug datetime localtime

 >> service timestamps log datetime localtime

 >> service password-encryption

 >> boot-start-marker

 >> boot-end-marker

 >> enable secret Area=l*w

 >> enable password Area=l*w

 >> no aaa new-model

 >> clock timezone CST -6

 >> clock summer-time CDT recurring

 >> switch 1 provision ws-c2960s-48ts-l

 >> authentication mac-move permit

 >> ip subnet-zero

 >> ip domain-name mgmt.msstate.edu

 >> ip name-server 130.18.2.210

 >> vtp domain vtp01.mgmt.msstate.edu

 >> vtp mode client

 >> crypto pki trustpoint TP-self-signed-2494998912

 >>  enrollment selfsigned

 >>  subject-name cn=IOS-Self-Signed-Certificate-2494998912

 >>  revocation-check none

 >>  rsakeypair TP-self-signed-2494998912

 >> crypto pki certificate chain TP-self-signed-2494998912

 >>  certificate self-signed 01 nvram:IOS-Self-Sig#3232.cer

 >> spanning-tree portfast bpduguard default

 >> spanning-tree extend system-id

 >> vlan internal allocation policy ascending

 >> errdisable recovery cause all

 >> errdisable recovery interval 1800

 >> interface FastEthernet0

 >>  no ip address

 >>  shutdown

 >> interface Vlan1

 >>  no ip address

 >>  no ip route-cache

 >>  shutdown

 >> interface Vlan92

 >> ip http server

 >> ip http secure-server

 >> ip sla enable reaction-alerts

 >> logging facility local1

 >> logging 130.18.2.208

 >> access-list 1 permit 10.92.0.0 0.0.255.255

 >> snmp-server community sysnet RO 1

 >> snmp-server community c2-b2=a2 RW 1

 >> snmp-server enable traps snmp authentication linkdown linkup coldstart warmstart

 >> snmp-server enable traps transceiver all

 >> snmp-server enable traps tty

 >> snmp-server enable traps cluster

 >> snmp-server enable traps config-copy

 >> snmp-server enable traps config

 >> snmp-server enable traps config-ctid

 >> snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-auth-fail-vlan no-guest-vlan

 >> snmp-server enable traps entity

 >> snmp-server enable traps power-ethernet group 1

 >> snmp-server enable traps power-ethernet police

 >> snmp-server enable traps cpu threshold

 >> snmp-server enable traps rep

 >> snmp-server enable traps rtr

 >> snmp-server enable traps bridge newroot topologychange

 >> snmp-server enable traps stpx inconsistency root-inconsistency loop-inconsistency

 >> snmp-server enable traps syslog

 >> snmp-server enable traps vtp

 >> snmp-server enable traps vlancreate

 >> snmp-server enable traps vlandelete

 >> snmp-server enable traps flash insertion removal

 >> snmp-server enable traps port-security

 >> snmp-server enable traps envmon fan shutdown supply temperature status

 >> snmp-server enable traps errdisable

 >> snmp-server enable traps mac-notification change move threshold

 >> snmp-server enable traps vlan-membership

 >> snmp-server host 130.18.2.208 sysnet 

 >> line con 0

 >> line vty 0 4

 >>  password Area=l*w

 >>  login

 >> line vty 5 15

 >>  password Area=l*w

 >>  login

 >> ntp clock-period 22519226

 >> ntp server 130.18.92.22

 >> end

Expect: searching for 1 strs:  :Configured
 << version 12.2
test(config)#no service pad
test(config)#service timestamps debug datetime localtime
test(config)#service timestamps log datetime localtime
test(config)#service password-encryption
test(config)#boot-start-marker
test(config)#boot-end-ma
 << rker
test(config)#enable secret Area=l*w
The enable secret you have chosen is the same as your enable password.
This is not recommended.  Re-enter the enable secret.

test(config)#enable password Area=l*w
The enable password you have chosen is the s
 << ame as your enable secret.
This is not recommended.  Re-enter the enable password.

test(config)#no aaa new-model
test(config)#clock timezone CST -6
test(config)#clock summer-time CDT recurring
test(config)#switch 1 provision ws-c2960s-48ts-l
%Comm
 << and rejected: switch 1 (ws-c2960s-24td-l) already present in the stack

test(config)#authentication mac-move permit
test(config)#ip subnet-zero
test(config)#ip domain-name mgmt.msstate.edu
test(config)#ip name-server 130.18.2.210
test(config)#
*Feb
 <<  28 18:08:24: %SYS-6-CLOCKUPDATE: System clock has been updated from 18:08:24 CST Sun Feb 28 1993 to 18:08:24 CST Sun Feb 28 1993, configured from console by console.
*Feb 28 18:08:24: %SYS-6-CLOCKUPDATE: System clock has been updated from 18:08:24 CST S
 << un Feb 28 1993 to 18:08:24 CST Sun Feb 28 1993, configured from console by console.vtp domain vtp01.mgmt.msstate.edu
Domain name already set to vtp01.mgmt.msstate.edu.
test(config)#vtp mode client
Device mode already VTP Client for VLANS.
test(config)
 << #crypto pki trustpoint TP-self-signed-2494998912
test(ca-trustpoint)# enrollment selfsigned
test(ca-trustpoint)# subject-name cn=IOS-Self-Signed-Certificate-2494998912
test(ca-trustpoint)# revocation-check none
test(ca-trustpoint)# rsakeypair TP-self-
 << signed-2494998912
test(ca-trustpoint)#crypto pki certificate chain TP-self-signed-2494998912
test(config-cert-chain)# certificate self-signed 01 nvram:IOS-Self-Sig#3232.c$e self-signed 01 nvram:IOS-Se
 << lf-Sig#3232.ce         r
test(config-cert-chain)#spanning-tree portfast bpduguard default
test(config)#spanning-tree extend system-id
test(config)#vlan internal allocation policy ascending
test(config)#errdisable recovery cause all
test(conf
 << ig)#errdisable recovery interval 1800
test(config)#
*Feb 28 18:08:27: % Multiple self signed certificates in config
    certificate for trust point TP-self-signed-2494998912 ignored
interface FastEthernet0
test(config-if)# no ip address
test(config-
 << if)# shutdown
test(config-if)#interface Vlan1
test(config-if)# no ip address
test(config-if)# no ip route-cache
test(config-if)# shutdown
test(config-if)#interface Vlan92
test(config-if)#ip http server
test(config)#ip http secure-server
test(confi
 << g)#ip sla enable reaction-alerts
test(config)#logging facility local1
test(config)#logging 130.18.2.208
test(config)#access-list 1 permit 10.92.0.0 0.0.255.255
test(config)#snmp-server community sysnet RO 1
test(config)#snmp-server community c2-b2=a2
 <<  RW 1
test(config)#snmp-server enable traps snmp authentication linkdown linkup col$ enable traps snmp authentication linkdown linkup cold         start war
 << aps snmp authentication linkdown linkup coldstart warm         start
test(config)#snmp-server enable traps transceiver all
test(config)#snmp-server enable traps tty
test(config)#snmp-server enable traps cl
 << uster
test(config)#snmp-server enable traps config-copy
test(config)#snmp-server enable traps config
test(config)#snmp-server enable traps config-ctid
test(config)#snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-auth
 << $ enable traps dot1x auth-fail-vlan guest-vlan no-auth-         fail-vlanaps dot1x auth-fail-vlan guest-vlan no-auth-fail-vlan          
 << no-guest-uth-fail-vlan guest-vlan no-auth-fail-vlan no-guest-v         lan
test(config)#snmp-server enable traps entity
test(config)#snmp-server enable traps power-ethernet group 
 << 1
test(config)#snmp-server enable traps power-ethernet police
test(config)#snmp-server enable traps cpu threshold
test(config)#snmp-server enable traps rep
test(config)#snmp-server enable traps rtr
test(config)#snmp-server enable traps bridge newroot
 <<  topologychange
test(config)#snmp-server enable traps stpx inconsistency root-inconsistency l$ enable traps stpx inconsistency root-inconsistency lo         op-incons
 << aps stpx inconsistency root-inconsistency loop-inconsi         stency
test(config)#snmp-server enable traps syslog
test(config)#snmp-server enable traps vtp
test(config)#snmp-server enable traps 
 << vlancreate
test(config)#snmp-server enable traps vlandelete
test(config)#snmp-server enable traps flash insertion removal
test(config)#snmp-server enable traps port-security
test(config)#snmp-server enable traps envmon fan shutdown supply temperature 
 << $ enable traps envmon fan shutdown supply temperature s         tatus
test(config)#snmp-server enable traps errdisable
test(config)#snmp-server enable traps mac-notification change
 <<  move threshold
test(config)#snmp-server enable traps vlan-membership
test(config)#snmp-server host 130.18.2.208 sysnet 
test(config)#line con 0
test(config-line)#line vty 0 4
test(config-line)# password Area=l*w
test(config-line)# login
test(confi
 << g-line)#line vty 5 15
test(config-line)# password Area=l*w
test(config-line)# login
test(config-line)#ntp clock-period 22519226
test(config)#ntp server 130.18.92.22
test(config)#end
test#
 << 
*Feb 28 18:08:40: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
test#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
test(config)#
Expect: matched string 1: (config)#
 >> spanning-tree mode mst

 >> spanning-tree etherchannel guard misconfig

 >> spanning-tree mst configuration

 >>  name msstate

 >>  revision 1

 >>  instance 1 vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 63, 70

 >>  instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 160

 >>  instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 230, 232, 242, 246

 >>  instance 1 vlan 256, 611-612, 654, 741, 996, 999

 >>  instance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037, 2039-2040

 >>  instance 2 vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096, 2104, 2110, 2126

 >>  instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 2189, 2194, 2202

 >>  instance 2 vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 2654, 2999

 >>  instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176, 196

 >>  instance 3 vlan 244, 248, 927

 >>  instance 4 vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072, 2108, 2113, 2128

 >>  instance 4 vlan 2144, 2176, 2196, 2244, 2248, 2927

 >>  instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 228

 >>  instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216, 2228

 >>  instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116, 124

 >>  instance 7 vlan 172, 186, 192, 204-208, 210, 240-241, 251-252, 630, 928

 >>  instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082, 2084

 >>  instance 8 vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208, 2210

 >>  instance 8 vlan 2240-2241, 2251-2252, 2630, 2928

 >>  instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102, 112

 >>  instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 500, 505, 510-511

 >>  instance 9 vlan 522, 551-570, 603, 629, 633, 742, 802, 926, 929

 >>  instance 10 vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 2057, 2062, 2068

 >>  instance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148, 2158

 >>  instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522, 2603, 2629, 2633

 >>  instance 10 vlan 2802, 2926, 2929

 >>  instance 11 vlan 8, 43, 52, 146, 156-157, 180, 200, 218

 >>  instance 12 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180, 2200, 2218

 >> 

 >> end

Expect: searching for 1 strs:  :Configured
 << spanning-tree mode mst
test(config)#spanning-tree etherchannel guard misconfig
test(config)#spanning-tree mst configuration
test(config-mst)# name msstate
test(config-mst)# revision 1
test(config-mst)# instance 1 vlan 2, 7, 11, 20, 22, 24, 31, 35, 37
 << , 39-40, 50$ vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40, 50,          60, 63, , 11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 63
 << , 7         0
test(config-mst)# instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 140$ vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 140,          152, 160
test(config-ms
 << t)# instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 230,$ vlan 162-163, 168, 189, 194, 202, 220, 222, 230,          232, 242,
 << 163, 168, 189, 194, 202, 220, 222, 230, 232, 242,          246
test(config-mst)# instance 1 vlan 256, 611-612, 654, 741, 996, 999
test(config-mst)# instance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031, 2
 << $ vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031, 20         35, 2037,, 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037,          2039-2040
test(config
 << -mst)# instance 2 vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096, 2$ vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096, 21         04, 2110,
 << , 2060, 2063, 2070, 2080, 2086, 2096, 2104, 2110,          2126
test(config-mst)# instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 21$ vlan 2136, 2140, 2152, 2160, 2162-
 << 2163, 2168, 218         9, 2194, , 2140, 2152, 2160, 2162-2163, 2168, 2189, 2194, 2         202
test(config-mst)# instance 2 vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 26
 << $ vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 265         4, 2999
test(config-mst)# instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128, 
 << $ vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128, 1         44, 176, 51, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176, 1         96
test(config-mst)# instance 3 v
 << lan 244, 248, 927
test(config-mst)# instance 4 vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072, 2$ vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072, 21         08, 2113,
 << , 2051, 2059, 2064, 2066, 2069, 2072, 2108, 2113,          2128
test(config-mst)# instance 4 vlan 2144, 2176, 2196, 2244, 2248, 2927
test(config-mst)# instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216,
 <<  228
test(config-mst)# instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-21$ vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-213         4, 2216, 
 << , 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216, 2         228
test(config-mst)# instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97, 1$ vlan 9, 33-34, 38,
 <<  54, 56, 71, 75, 82, 84, 97, 11         4, 116, 13-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116, 12         4
test(config-mst)# instance 7 vlan 172, 186, 192, 204-208, 210, 240-
 << 241, 251-2$ vlan 172, 186, 192, 204-208, 210, 240-241, 251-25         2, 630, 9186, 192, 204-208, 210, 240-241, 251-252, 630, 92
 <<          8
test(config-mst)# instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, 20$ vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, 207         5, 2082, 
 << , 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082, 2         084
test(config-mst)# instance 8 vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192, 2$ vla
 << n 2097, 2114, 2116, 2124, 2172, 2186, 2192, 22         04-2208, , 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208, 2         210
test(config-mst)# instance 8 vlan 2240-2241, 2251-
 << 2252, 2630, 2928
test(config-mst)# instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 98-$ vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 98-9         9, 102, 1
 << 12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102, 11         2
test(config-mst)# instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 500,$ vlan 130, 
 << 132, 147-148, 158, 212, 226, 236, 500,          505, 510-132, 147-148, 158, 212, 226, 236, 500, 505, 510-5         11
test(config-mst)# instance 9 vlan 522, 551-570, 603, 629, 63
 << 3, 742, 802, 926,$ vlan 522, 551-570, 603, 629, 633, 742, 802, 926,          929
test(config-mst)# instance 10 vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 20
 << $0 vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 205         7, 2062, 4-2005, 2012, 2018-2019, 2032, 2044, 2057, 2062, 2         068
test(config-
 << mst)# instance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132, 2$0 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132, 21         47-2148, 
 << 6, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148, 2         158
test(config-mst)# instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522, 2$0 vlan 2212, 2236, 2500, 2505, 2510-2
 << 511, 2522, 26         03, 2629,2, 2236, 2500, 2505, 2510-2511, 2522, 2603, 2629,          2633
test(config-mst)# instance 10 vlan 2802, 2926, 2929
test(config-mst)# instance 11
 <<  vlan 8, 43, 52, 146, 156-157, 180, 200, 218
test(config-mst)# instance 12 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180, 2$2 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180, 22         00,
 <<  2218
test(config-mst)#
test(config-mst)#end
test#
 << 
*Feb 28 18:08:55: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
test#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
test(config)#
Expect: matched string 1: (config)#
 >> hostname test 

Expect: searching for 2 strs:  :# :>
 << hostname test 
test(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
test#
 << 
*Feb 28 18:09:02: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
test#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
test(config)#
Expect: matched string 1: (config)#
 >> snmp-server contact test

Expect: searching for 1 strs:  :#
 << snmp-server contact test
test(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
test#
 << 
*Feb 28 18:09:08: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
test#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
test(config)#
Expect: matched string 1: (config)#
 >> interface vlan 92

Expect: searching for 1 strs:  :(config-if)#
 << interface vlan 92
test(config-if)#
Expect: matched string 1: (config-if)#
 >> ip address 10.92.1.193 255.255.0.0

 >> ip broadcast-address 10.92.255.255

 >> end

Expect: searching for 1 strs:  :Configured
 << ip address 10.92.1.193 255.255.0.0
test(config-if)#ip broadcast-address 10.92.255.255
test(config-if)#end
test#
 << 
*Feb 28 18:09:14: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
test#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
test(config)#
Expect: matched string 1: (config)#
 >> interface Vlan92

Expect: searching for 1 strs:  :(config-if)#
 << interface Vlan92
test(config-if)#
Expect: matched string 1: (config-if)#
 >> ip default-gateway 10.92.0.1

 >> end

Expect: searching for 1 strs:  :Configured
 << ip default-gateway 10.92.0.1
test(config)#end
test#
 << 
*Feb 28 18:09:20: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
test#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
test(config)#
Expect: matched string 1: (config)#
 >> default interface range gi1/0/1 - 24 

 >> interface range gi1/0/1 - 24 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi1/0/1 - 24 

 << test(config)#interface range gi1/0/1 - 24 
test(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport access vlan 123

 >> switchport mode access

 >> spanning-tree portfast

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport access vlan 123
test(config-if-range)#switchport mode access
test(config-if-range)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, concentrators, switches, bridges, etc
 << ... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast will be configured in 24 interfaces due to the range command 
 but will only have effect when the interfaces are in a non-trunking mode
 << .
test(config-if-range)#end
test#
 << 
*Feb 28 18:09:34: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
test#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
test(config)#
Expect: matched string 1: (config)#
 >> end

Expect: searching for 1 strs:  :Configured
 << end
test#
 << 
*Feb 28 18:09:43: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
test#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
test(config)#
Expect: matched string 1: (config)#
 >> end

Expect: searching for 1 strs:  :Configured
 << end
test#
 << 
*Feb 28 18:09:47: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> write mem

Expect: searching for 2 strs:  :# :>
 << 
test#write mem
Building configuration...
[OK]
test#
Expect: matched string 1: #
 >> 
Expect: searching for 2 strs:  :# :>
 << 
test#
test#
Expect: matched string 1: #
 >> sh run

Expect: searching for 2 strs:  :# :>
 << sh run
Building configuration...

Current configuration : 8532 bytes
!
version 12.2
no service pad
service timestamps debug datetime localtime
service timestamps log datetime localtime
service password-encryption
!
hostname test
!
boot-start-
 << marker
boot-end-marker
!
enable secret 5 $1$SK64$Smdv7emG5fFL0MczEoN8F.
enable password 7 11280B00164F074613
!
!
!
no aaa new-model
clock timezone CST -6
clock summer-time CDT recurring
switch 1 provision ws-c2960s-24td-l
authentication mac-mo
 << ve permit
ip subnet-zero
!
!
ip domain-name mgmt.msstate.edu
ip name-server 130.18.2.210
!
!
crypto pki trustpoint TP-self-signed-2494998912
 enrollment selfsigned
 subject-name cn=IOS-Self-Signed-Certificate-2494998912
 revocation-check none

 <<  rsakeypair TP-self-signed-2494998912
!
!
!
spanning-tree mode mst
spanning-tree portfast bpduguard default
spanning-tree etherchannel guard misconfig
spanning-tree extend system-id
!
spanning-tree mst configuration
 name msstate
 revision 1
 
 << instance 1 vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 63, 70
 instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 160
 instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 230, 232, 242, 246
 instance 1 vlan 256, 611-612, 654
 << , 741, 996, 999
 instance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037, 2039-2040
 instance 2 vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096, 2104, 2110, 2126
 instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 2189, 2194, 2202
 in
 << stance 2 vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 2654, 2999
 instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176, 196
 instance 3 vlan 244, 248, 927
 instance 4 vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072, 2108, 2113, 2128
 ins
 << tance 4 vlan 2144, 2176, 2196, 2244, 2248, 2927
 instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 228
 instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216, 2228
 instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116,
 <<  124
 instance 7 vlan 172, 186, 192, 204-208, 210, 240-241, 251-252, 630, 928
 instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082, 2084
 instance 8 vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208, 2210
 instance 8 vlan 2240-2
 << 241, 2251-2252, 2630, 2928
 instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102, 112
 instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 500, 505, 510-511
 instance 9 vlan 522, 551-570, 603, 629, 633, 742, 802, 926, 929
 instance 10
 <<  vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 2057, 2062, 2068
 instance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148, 2158
 instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522, 2603, 2629, 2633
 instance 10 vlan 2802, 2926, 2929
 i
 << nstance 11 vlan 8, 43, 52, 146, 156-157, 180, 200, 218
 instance 12 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180, 2200, 2218
!
!
!
!
errdisable recovery cause udld
errdisable recovery cause bpduguard
errdisable recovery cause security-violation
e
 << rrdisable recovery cause channel-misconfig (STP)
errdisable recovery cause pagp-flap
errdisable recovery cause dtp-flap
errdisable recovery cause link-flap
errdisable recovery cause sfp-config-mismatch
errdisable recovery cause gbic-invalid
errdisab
 << le recovery cause psecure-violation
errdisable recovery cause port-mode-failure
errdisable recovery cause dhcp-rate-limit
errdisable recovery cause pppoe-ia-rate-limit
errdisable recovery cause mac-limit
errdisable recovery cause vmps
errdisable rec
 << overy cause storm-control
errdisable recovery cause inline-power
errdisable recovery cause arp-inspection
errdisable recovery cause loopback
errdisable recovery cause small-frame
errdisable recovery interval 1800
!
vlan internal allocation policy a
 << scending
!
!
!
interface FastEthernet0
 no ip address
 shutdown
!
interface GigabitEthernet1/0/1
 switchport access vlan 123
 switchport mode access
 spanning-tree portfast
!
interface GigabitEthernet1/0/2
 switchport access vlan 123
 switc
 << hport mode access
 spanning-tree portfast
!
interface GigabitEthernet1/0/3
 switchport access vlan 123
 switchport mode access
 spanning-tree portfast
!
interface GigabitEthernet1/0/4
 switchport access vlan 123
 switchport mode access
 spannin
 << g-tree portfast
!
interface GigabitEthernet1/0/5
 switchport access vlan 123
 switchport mode access
 spanning-tree portfast
!
interface GigabitEthernet1/0/6
 switchport access vlan 123
 switchport mode access
 spanning-tree portfast
!
interfa
 << ce GigabitEthernet1/0/7
 switchport access vlan 123
 switchport mode access
 spanning-tree portfast
!
interface GigabitEthernet1/0/8
 switchport access vlan 123
 switchport mode access
 spanning-tree portfast
!
interface GigabitEthernet1/0/9
 s
 << witchport access vlan 123
 switchport mode access
 spanning-tree portfast
!
interface GigabitEthernet1/0/10
 switchport access vlan 123
 switchport mode access
 spanning-tree portfast
!
interface GigabitEthernet1/0/11
 switchport access vlan 123
 << 
 switchport mode access
 spanning-tree portfast
!
interface GigabitEthernet1/0/12
 switchport access vlan 123
 switchport mode access
 spanning-tree portfast
!
interface GigabitEthernet1/0/13
 switchport access vlan 123
 switchport mode access
 << 
 spanning-tree portfast
!
interface GigabitEthernet1/0/14
 switchport access vlan 123
 switchport mode access
 spanning-tree portfast
!
interface GigabitEthernet1/0/15
 switchport access vlan 123
 switchport mode access
 spanning-tree portfast
 << 
!
interface GigabitEthernet1/0/16
 switchport access vlan 123
 switchport mode access
 spanning-tree portfast
!
interface GigabitEthernet1/0/17
 switchport access vlan 123
 switchport mode access
 spanning-tree portfast
!
interface GigabitEth
 << ernet1/0/18
 switchport access vlan 123
 switchport mode access
 spanning-tree portfast
!
interface GigabitEthernet1/0/19
 switchport access vlan 123
 switchport mode access
 spanning-tree portfast
!
interface GigabitEthernet1/0/20
 switchport 
 << access vlan 123
 switchport mode access
 spanning-tree portfast
!
interface GigabitEthernet1/0/21
 switchport access vlan 123
 switchport mode access
 spanning-tree portfast
!
interface GigabitEthernet1/0/22
 switchport access vlan 123
 switchp
 << ort mode access
 spanning-tree portfast
!
interface GigabitEthernet1/0/23
 switchport access vlan 123
 switchport mode access
 spanning-tree portfast
!
interface GigabitEthernet1/0/24
 switchport access vlan 123
 switchport mode access
 spannin
 << g-tree portfast
!
interface GigabitEthernet1/0/25
 switchport trunk native vlan 92
 switchport mode trunk
!
interface GigabitEthernet1/0/26
 switchport trunk native vlan 92
 switchport mode trunk
!
interface TenGigabitEthernet1/0/1
 switchport 
 << trunk native vlan 92
 switchport mode trunk
!
interface TenGigabitEthernet1/0/2
 switchport trunk native vlan 92
 switchport mode trunk
!
interface Vlan1
 no ip address
 no ip route-cache
 shutdown
!
interface Vlan92
 ip address 10.92.1.193 2
 << 55.255.0.0
 ip broadcast-address 10.92.255.255
!
ip default-gateway 10.92.0.1
ip http server
ip http secure-server
ip sla enable reaction-alerts
logging facility local1
logging 130.18.2.208
access-list 1 permit 10.92.0.0 0.0.255.255
snmp-server 
 << community sysnet RO 1
snmp-server community c2-b2=a2 RW 1
snmp-server contact test
snmp-server enable traps snmp authentication linkdown linkup coldstart warmstart
snmp-server enable traps transceiver all
snmp-server enable traps tty
snmp-server ena
 << ble traps cluster
snmp-server enable traps config-copy
snmp-server enable traps config
snmp-server enable traps config-ctid
snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-auth-fail-vlan no-guest-vlan
snmp-server enable traps entity
snmp
 << -server enable traps power-ethernet group 1
snmp-server enable traps power-ethernet police
snmp-server enable traps cpu threshold
snmp-server enable traps rep
snmp-server enable traps rtr
snmp-server enable traps bridge newroot topologychange
snmp-s
 << erver enable traps stpx inconsistency root-inconsistency loop-inconsistency
snmp-server enable traps syslog
snmp-server enable traps vtp
snmp-server enable traps vlancreate
snmp-server enable traps vlandelete
snmp-server enable traps flash insertion 
 << removal
snmp-server enable traps port-security
snmp-server enable traps envmon fan shutdown supply temperature status
snmp-server enable traps errdisable
snmp-server enable traps mac-notification change move threshold
snmp-server enable traps vlan-me
 << mbership
snmp-server host 130.18.2.208 sysnet 
!
!
line con 0
line vty 0 4
 password 7 052A140A201142430E
 login
line vty 5 15
 password 7 11280B00164F074613
 login
!
ntp clock-period 22519226
ntp server 130.18.92.22
end

test#
Expect: matched string 1: #
 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
test(config)#
Expect: matched string 1: (config)#
 >> version 12.2

 >> no service pad

 >> service timestamps debug datetime localtime

 >> service timestamps log datetime localtime

 >> service password-encryption

 >> boot-start-marker

 >> boot-end-marker

 >> enable secret Area=l*w

 >> enable password Area=l*w

 >> no aaa new-model

 >> clock timezone CST -6

 >> clock summer-time CDT recurring

 >> switch 1 provision ws-c2960s-48ts-l

 >> authentication mac-move permit

 >> ip subnet-zero

 >> ip domain-name mgmt.msstate.edu

 >> ip name-server 130.18.2.210

 >> vtp domain vtp01.mgmt.msstate.edu

 >> vtp mode client

 >> crypto pki trustpoint TP-self-signed-2494998912

 >>  enrollment selfsigned

 >>  subject-name cn=IOS-Self-Signed-Certificate-2494998912

 >>  revocation-check none

 >>  rsakeypair TP-self-signed-2494998912

 >> crypto pki certificate chain TP-self-signed-2494998912

 >>  certificate self-signed 01 nvram:IOS-Self-Sig#3232.cer

 >> spanning-tree portfast bpduguard default

 >> spanning-tree extend system-id

 >> vlan internal allocation policy ascending

 >> errdisable recovery cause all

 >> errdisable recovery interval 1800

 >> interface FastEthernet0

 >>  no ip address

 >>  shutdown

 >> interface Vlan1

 >>  no ip address

 >>  no ip route-cache

 >>  shutdown

 >> interface Vlan92

 >> ip http server

 >> ip http secure-server

 >> ip sla enable reaction-alerts

 >> logging facility local1

 >> logging 130.18.2.208

 >> access-list 1 permit 10.92.0.0 0.0.255.255

 >> snmp-server community sysnet RO 1

 >> snmp-server community c2-b2=a2 RW 1

 >> snmp-server enable traps snmp authentication linkdown linkup coldstart warmstart

 >> snmp-server enable traps transceiver all

 >> snmp-server enable traps tty

 >> snmp-server enable traps cluster

 >> snmp-server enable traps config-copy

 >> snmp-server enable traps config

 >> snmp-server enable traps config-ctid

 >> snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-auth-fail-vlan no-guest-vlan

 >> snmp-server enable traps entity

 >> snmp-server enable traps power-ethernet group 1

 >> snmp-server enable traps power-ethernet police

 >> snmp-server enable traps cpu threshold

 >> snmp-server enable traps rep

 >> snmp-server enable traps rtr

 >> snmp-server enable traps bridge newroot topologychange

 >> snmp-server enable traps stpx inconsistency root-inconsistency loop-inconsistency

 >> snmp-server enable traps syslog

 >> snmp-server enable traps vtp

 >> snmp-server enable traps vlancreate

 >> snmp-server enable traps vlandelete

 >> snmp-server enable traps flash insertion removal

 >> snmp-server enable traps port-security

 >> snmp-server enable traps envmon fan shutdown supply temperature status

 >> snmp-server enable traps errdisable

 >> snmp-server enable traps mac-notification change move threshold

 >> snmp-server enable traps vlan-membership

 >> snmp-server host 130.18.2.208 sysnet 

 >> line con 0

 >> line vty 0 4

 >>  password Area=l*w

 >>  login

 >> line vty 5 15

 >>  password Area=l*w

 >>  login

 >> ntp clock-period 22519226

 >> ntp server 130.18.92.22

 >> end

Expect: searching for 1 strs:  :Configured
 << version 12.2
test(config)#no service pad
test(config)#service timestamps debug datetime localtime
test(config)#service timestamps log datetime localtime
test(config)#service password-encryption
test(config)#boot-start-marker
test(config)#boot-end-ma
 << rker
test(config)#enable secret Area=l*w
The enable secret you have chosen is the same as your enable password.
This is not recommended.  Re-enter the enable secret.

test(config)#enable password Area=l*w
The enable password you have chosen is the s
 << ame as your enable secret.
This is not recommended.  Re-enter the enable password.

test(config)#no aaa new-model
test(config)#clock timezone CST -6
test(config)#clock summer-time CDT recurring
test(config)#switch 1 provision ws-c2960s-48ts-l
%Comm
 << and rejected: switch 1 (ws-c2960s-24td-l) already present in the stack

test(config)#authentication mac-move permit
test(config)#ip subnet-zero
test(config)#ip domain-name mgmt.msstate.edu
test(config)#
*Feb 28 18:11:26: %SYS-6-CLOCKUPDATE: System c
 << lock has been updated from 18:11:26 CST Sun Feb 28 1993 to 18:11:26 CST Sun Feb 28 1993, configured from console by console.
*Feb 28 18:11:26: %SYS-6-CLOCKUPDATE: System clock has been updated from 18:11:26 CST Sun Feb 28 1993 to 18:11:26 CST Sun Feb 28 
 << 1993, configured from console by console.ip name-server 130.18.2.210
test(config)#vtp domain vtp01.mgmt.msstate.edu
Domain name already set to vtp01.mgmt.msstate.edu.
test(config)#vtp mode client
Device mode already VTP Client for VLANS.
test(config)
 << #crypto pki trustpoint TP-self-signed-2494998912
test(ca-trustpoint)# enrollment selfsigned
test(ca-trustpoint)# subject-name cn=IOS-Self-Signed-Certificate-2494998912
test(ca-trustpoint)# revocation-check none
test(ca-trustpoint)# rsakeypair TP-self-
 << signed-2494998912
test(ca-trustpoint)#crypto pki certificate chain TP-self-signed-2494998912
test(config-cert-chain)# certificate self-signed 01 nvram:IOS-Self-Sig#3232.c$e self-signed 01 nvram:IOS-Se
 << lf-Sig#3232.ce         r
test(config-cert-chain)#spanning-tree portfast bpduguard default
test(config)#spanning-tree extend system-id
test(config)#vlan internal allocation policy ascending
test(config)#errdisable recovery cause all
test(conf
 << ig)#errdisable recovery interval 1800
test(config)#interface FastEthernet0
test(config-if)# no ip address
test(config-if)# shutdown
test(config-if)#interface Vlan1
test(config-if)# no ip address
test(config-if)# no ip route-cache
test(config-if)# s
 << hutdown
test(config-if)#interface Vlan92
test(config-if)#ip http server
test(config)#ip http secure-server
test(config)#ip sla enable reaction-alerts
test(config)#logging facility local1
test(config)#logging 130.18.2.208
test(config)#access-list 1 
 << permit 10.92.0.0 0.0.255.255
test(config)#snmp-server community sysnet RO 1
test(config)#snmp-server community c2-b2=a2 RW 1
test(config)#snmp-server enable traps snmp authentication linkdown linkup col
 << $ enable traps snmp authentication linkdown linkup cold         start waraps snmp authentication linkdown linkup coldstart warm         start
test(config)#
*F
 << eb 28 18:11:32: %PKI-4-NOAUTOSAVE: Configuration was modified.  Issue "write memory" to save new certificatesnmp-server enable traps transceiver all
test(config)#snmp-server enable traps tty
test(config)#snmp-server enable traps cluster
test(config)#sn
 << mp-server enable traps config-copy
test(config)#snmp-server enable traps config
test(config)#snmp-server enable traps config-ctid
test(config)#snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-auth
 << $ enable traps dot1x auth-fail-vlan guest-vlan no-auth-         fail-vlanaps dot1x auth-fail-vlan guest-vlan no-auth-fail-vlan          no-guest-
 << uth-fail-vlan guest-vlan no-auth-fail-vlan no-guest-v         lan
test(config)#snmp-server enable traps entity
test(config)#snmp-server enable traps power-ethernet group 1
test(config)#snmp-s
 << erver enable traps power-ethernet police
test(config)#snmp-server enable traps cpu threshold
test(config)#snmp-server enable traps rep
test(config)#snmp-server enable traps rtr
test(config)#snmp-server enable traps bridge newroot topologychange
test(
 << config)#snmp-server enable traps stpx inconsistency root-inconsistency l$ enable traps stpx inconsistency root-inconsistency lo         op-incons
 << aps stpx inconsistency root-inconsistency loop-inconsi         stency
test(config)#snmp-server enable traps syslog
test(config)#snmp-server enable traps vtp
test(config)#snmp-server enable traps vlancreate
test(confi
 << g)#snmp-server enable traps vlandelete
test(config)#snmp-server enable traps flash insertion removal
test(config)#snmp-server enable traps port-security
test(config)#snmp-server enable traps envmon fan shutdown supply temperature 
 << $ enable traps envmon fan shutdown supply temperature s         tatus
test(config)#snmp-server enable traps errdisable
test(config)#snmp-server enable traps mac-notification change move threshold
test(
 << config)#snmp-server enable traps vlan-membership
test(config)#snmp-server host 130.18.2.208 sysnet 
test(config)#line con 0
test(config-line)#line vty 0 4
test(config-line)# password Area=l*w
test(config-line)# login
test(config-line)#line vty 5 15
 << 
test(config-line)# password Area=l*w
test(config-line)# login
test(config-line)#ntp clock-period 22519226
test(config)#ntp server 130.18.92.22
test(config)#end
test#
 << 
*Feb 28 18:11:41: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
test#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
test(config)#
Expect: matched string 1: (config)#
 >> spanning-tree mode mst

 >> spanning-tree etherchannel guard misconfig

 >> spanning-tree mst configuration

 >>  name msstate

 >>  revision 1

 >>  instance 1 vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 63, 70

 >>  instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 160

 >>  instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 230, 232, 242, 246

 >>  instance 1 vlan 256, 611-612, 654, 741, 996, 999

 >>  instance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037, 2039-2040

 >>  instance 2 vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096, 2104, 2110, 2126

 >>  instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 2189, 2194, 2202

 >>  instance 2 vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 2654, 2999

 >>  instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176, 196

 >>  instance 3 vlan 244, 248, 927

 >>  instance 4 vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072, 2108, 2113, 2128

 >>  instance 4 vlan 2144, 2176, 2196, 2244, 2248, 2927

 >>  instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 228

 >>  instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216, 2228

 >>  instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116, 124

 >>  instance 7 vlan 172, 186, 192, 204-208, 210, 240-241, 251-252, 630, 928

 >>  instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082, 2084

 >>  instance 8 vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208, 2210

 >>  instance 8 vlan 2240-2241, 2251-2252, 2630, 2928

 >>  instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102, 112

 >>  instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 500, 505, 510-511

 >>  instance 9 vlan 522, 551-570, 603, 629, 633, 742, 802, 926, 929

 >>  instance 10 vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 2057, 2062, 2068

 >>  instance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148, 2158

 >>  instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522, 2603, 2629, 2633

 >>  instance 10 vlan 2802, 2926, 2929

 >>  instance 11 vlan 8, 43, 52, 146, 156-157, 180, 200, 218

 >>  instance 12 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180, 2200, 2218

 >> 

 >> end

Expect: searching for 1 strs:  :Configured
 << spanning-tree mode mst
test(config)#spanning-tree etherchannel guard misconfig
test(config)#spanning-tree mst configuration
test(config-mst)# name msstate
test(config-mst)# revision 1
test(config-mst)# instance 1 vlan 2, 7, 11, 20, 22, 24, 31, 35, 37
 << , 39-40, 50$ vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40, 50,          60, 63, , 11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 63
 << , 7         0
test(config-mst)# instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 140$ vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 140,          152, 160
test(config-ms
 << t)# instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 230,$ vlan 162-163, 168, 189, 194, 202, 220, 222, 230,          232, 242,
 << 163, 168, 189, 194, 202, 220, 222, 230, 232, 242,          246
test(config-mst)# instance 1 vlan 256, 611-612, 654, 741, 996, 999
test(config-mst)# instance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031, 2
 << $ vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031, 20         35, 2037,, 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037,          2039-2040
test(config
 << -mst)# instance 2 vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096, 2$ vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096, 21         04, 2110,
 << , 2060, 2063, 2070, 2080, 2086, 2096, 2104, 2110,          2126
test(config-mst)# instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 21$ vlan 2136, 2140, 2152, 2160, 2162-
 << 2163, 2168, 218         9, 2194, , 2140, 2152, 2160, 2162-2163, 2168, 2189, 2194, 2         202
test(config-mst)# instance 2 vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 26
 << $ vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 265         4, 2999
test(config-mst)# instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128, 
 << $ vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128, 1         44, 176, 51, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176, 1         96
test(config-mst)# instance 3 v
 << lan 244, 248, 927
test(config-mst)# instance 4 vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072, 2$ vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072, 21         08, 2113,
 << , 2051, 2059, 2064, 2066, 2069, 2072, 2108, 2113,          2128
test(config-mst)# instance 4 vlan 2144, 2176, 2196, 2244, 2248, 2927
test(config-mst)# instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216,
 <<  228
test(config-mst)# instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-21$ vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-213         4, 2216, 
 << , 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216, 2         228
test(config-mst)# instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97, 1$ vlan 9, 33-34, 38,
 <<  54, 56, 71, 75, 82, 84, 97, 11         4, 116, 13-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116, 12         4
test(config-mst)# instance 7 vlan 172, 186, 192, 204-208, 210, 240-
 << 241, 251-2$ vlan 172, 186, 192, 204-208, 210, 240-241, 251-25         2, 630, 9186, 192, 204-208, 210, 240-241, 251-252, 630, 92
 <<          8
test(config-mst)# instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, 20$ vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, 207         5, 2082, 
 << , 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082, 2         084
test(config-mst)# instance 8 vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192, 2$ vla
 << n 2097, 2114, 2116, 2124, 2172, 2186, 2192, 22         04-2208, , 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208, 2         210
test(config-mst)# instance 8 vlan 2240-2241, 2251-
 << 2252, 2630, 2928
test(config-mst)# instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 98-$ vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 98-9         9, 102, 1
 << 12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102, 11         2
test(config-mst)# instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 500,$ vlan 130, 
 << 132, 147-148, 158, 212, 226, 236, 500,          505, 510-132, 147-148, 158, 212, 226, 236, 500, 505, 510-5         11
test(config-mst)# instance 9 vlan 522, 551-570, 603, 629, 63
 << 3, 742, 802, 926,$ vlan 522, 551-570, 603, 629, 633, 742, 802, 926,          929
test(config-mst)# instance 10 vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 20
 << $0 vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 205         7, 2062, 4-2005, 2012, 2018-2019, 2032, 2044, 2057, 2062, 2         068
test(config-
 << mst)# instance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132, 2$0 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132, 21         47-2148, 
 << 6, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148, 2         158
test(config-mst)# instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522, 2$0 vlan 2212, 2236, 2500, 2505, 2510-2
 << 511, 2522, 26         03, 2629,2, 2236, 2500, 2505, 2510-2511, 2522, 2603, 2629,          2633
test(config-mst)# instance 10 vlan 2802, 2926, 2929
test(config-mst)# instance 11
 <<  vlan 8, 43, 52, 146, 156-157, 180, 200, 218
test(config-mst)# instance 12 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180, 2$2 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180, 22         00,
 <<  2218
test(config-mst)#
test(config-mst)#end
test#
 << 
*Feb 28 18:11:57: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
test#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
test(config)#
Expect: matched string 1: (config)#
 >> hostname test 

Expect: searching for 2 strs:  :# :>
 << hostname test 
test(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
test#
 << 
*Feb 28 18:12:03: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
test#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
test(config)#
Expect: matched string 1: (config)#
 >> snmp-server contact test

Expect: searching for 1 strs:  :#
 << snmp-server contact test
test(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
test#
 << 
*Feb 28 18:12:09: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
test#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
test(config)#
Expect: matched string 1: (config)#
 >> interface vlan 92

Expect: searching for 1 strs:  :(config-if)#
 << interface vlan 92
test(config-if)#
Expect: matched string 1: (config-if)#
 >> ip address 10.92.1.193 255.255.0.0

 >> ip broadcast-address 10.92.255.255

 >> end

Expect: searching for 1 strs:  :Configured
 << ip address 10.92.1.193 255.255.0.0
test(config-if)#ip broadcast-address 10.92.255.255
test(config-if)#end
test#
 << 
*Feb 28 18:12:16: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
test#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
test(config)#
Expect: matched string 1: (config)#
 >> interface Vlan92

Expect: searching for 1 strs:  :(config-if)#
 << interface Vlan92
test(config-if)#
Expect: matched string 1: (config-if)#
 >> ip default-gateway 10.92.0.1

 >> end

Expect: searching for 1 strs:  :Configured
 << ip default-gateway 10.92.0.1
test(config)#end
test#
 << 
*Feb 28 18:12:22: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
test#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
test(config)#
Expect: matched string 1: (config)#
 >> default interface range gi1/0/1 - 24 

 >> interface range gi1/0/1 - 24 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi1/0/1 - 24 

 << test(config)#interface range gi1/0/1 - 24 
test(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport access vlan 123

 >> switchport mode access

 >> spanning-tree portfast

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport access vlan 123
test(config-if-range)#switchport mode access
test(config-if-range)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, concentrators, switches, bridges, etc
 << ... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast will be configured in 24 interfaces due to the range command 
 but will only have effect when the interfaces are in a non-trunking mode
 << .
test(config-if-range)#end
test#
 << 
*Feb 28 18:12:35: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
test#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
test(config)#
Expect: matched string 1: (config)#
 >> end

Expect: searching for 1 strs:  :Configured
 << end
test#
 << 
*Feb 28 18:12:45: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
test#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
test(config)#
Expect: matched string 1: (config)#
 >> end

Expect: searching for 1 strs:  :Configured
 << end
test#
 << 
*Feb 28 18:12:49: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> write mem

Expect: searching for 2 strs:  :# :>
 << 
test#write mem
Building configuration...
[OK]
test#
Expect: matched string 1: #
 >> 
Expect: searching for 2 strs:  :# :>
 << 
test#
test#
Expect: matched string 1: #
 >> sh run

Expect: searching for 2 strs:  :# :>
 << sh run
Building configuration...

Current configuration : 10013 bytes
!
version 12.2
no service pad
service timestamps debug datetime localtime
service timestamps log datetime localtime
service password-encryption
!
hostname test
!
boot-start
 << -marker
boot-end-marker
!
enable secret 5 $1$7ULi$90mfeiXUc.MdsirNltO1n0
enable password 7 002501030506074C18
!
!
!
no aaa new-model
clock timezone CST -6
clock summer-time CDT recurring
switch 1 provision ws-c2960s-24td-l
authentication mac-m
 << ove permit
ip subnet-zero
!
!
ip domain-name mgmt.msstate.edu
ip name-server 130.18.2.210
!
!
crypto pki trustpoint TP-self-signed-3808688768
 enrollment selfsigned
 subject-name cn=IOS-Self-Signed-Certificate-3808688768
 revocation-check none
 << 
 rsakeypair TP-self-signed-3808688768
!
!
crypto pki certificate chain TP-self-signed-3808688768
 certificate self-signed 01
  3082024D 308201B6 A0030201 02020101 300D0609 2A864886 F70D0101 04050030 
  31312F30 2D060355 04031326 494F532D 53656C66 2
 << D536967 6E65642D 43657274 
  69666963 6174652D 33383038 36383837 3638301E 170D3933 30333031 30303131 
  33325A17 0D323030 31303130 30303030 305A3031 312F302D 06035504 03132649 
  4F532D53 656C662D 5369676E 65642D43 65727469 66696361 74652D33 38303836 
 << 
  38383736 3830819F 300D0609 2A864886 F70D0101 01050003 818D0030 81890281 
  8100B9A4 35F5DA30 FF338EEF C978E6BC 6A71F20A C165C045 B5C22BB3 F60CFC41 
  4C1F996E 025700C3 06172D0F 86C730C4 8E4C5B07 9690F093 69C53929 6E2E4295 
  32444296 C0A4F509 434C74
 << 37 79A977A4 20935421 110A67A1 2D306A37 8B3C968A 
  E8163E73 1C906FCC 56AC3462 E58480DB 09B58CAF 6174F10D 6B3E1A94 B680ABDA 
  5E750203 010001A3 75307330 0F060355 1D130101 FF040530 030101FF 30200603 
  551D1104 19301782 15746573 742E6D67 6D742E6D 737374
 << 61 74652E65 6475301F 
  0603551D 23041830 16801445 394393D6 F8371F8C FCA252F8 B2314C83 01C9C730 
  1D060355 1D0E0416 04144539 4393D6F8 371F8CFC A252F8B2 314C8301 C9C7300D 
  06092A86 4886F70D 01010405 00038181 0080BF77 1BFB2A84 1B6D823E 2F7390DA 
  60
 << 755DAA F2CE4563 102D05D6 C8DBE02D AF723454 E8886DFA 522FD9D1 45AD06D7 
  9C860E52 94EC69F3 ECC849EB 9C2DEA5B 514DF45A 2CF8D453 246C5382 3CE4B796 
  24DE0480 D7F9FAA5 5FCB8DA2 C531BDD4 F0150945 2AA6C182 53AA5697 D8FC4A76 
  3D4B4766 036DD86F 9DFD0E99 C7
 << 739DEE B9
  quit
!
spanning-tree mode mst
spanning-tree portfast bpduguard default
spanning-tree etherchannel guard misconfig
spanning-tree extend system-id
!
spanning-tree mst configuration
 name msstate
 revision 1
 instance 1 vlan 2, 7, 11, 
 << 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 63, 70
 instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 160
 instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 230, 232, 242, 246
 instance 1 vlan 256, 611-612, 654, 741, 996, 999
 instance
 <<  2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037, 2039-2040
 instance 2 vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096, 2104, 2110, 2126
 instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 2189, 2194, 2202
 instance 2 vlan 2220, 2222, 
 << 2232, 2242, 2246, 2611-2612, 2654, 2999
 instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176, 196
 instance 3 vlan 244, 248, 927
 instance 4 vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072, 2108, 2113, 2128
 instance 4 vlan 2144, 2176, 2
 << 196, 2244, 2248, 2927
 instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 228
 instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216, 2228
 instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116, 124
 instance 7 vlan 172
 << , 186, 192, 204-208, 210, 240-241, 251-252, 630, 928
 instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082, 2084
 instance 8 vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208, 2210
 instance 8 vlan 2240-2241, 2251-2252, 2630, 2928
 << 
 instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102, 112
 instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 500, 505, 510-511
 instance 9 vlan 522, 551-570, 603, 629, 633, 742, 802, 926, 929
 instance 10 vlan 2004-2005, 2012, 201
 << 8-2019, 2032, 2044, 2057, 2062, 2068
 instance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148, 2158
 instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522, 2603, 2629, 2633
 instance 10 vlan 2802, 2926, 2929
 instance 11 vlan 8, 43, 52,
 <<  146, 156-157, 180, 200, 218
 instance 12 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180, 2200, 2218
!
!
!
!
errdisable recovery cause udld
errdisable recovery cause bpduguard
errdisable recovery cause security-violation
errdisable recovery cause c
 << hannel-misconfig (STP)
errdisable recovery cause pagp-flap
errdisable recovery cause dtp-flap
errdisable recovery cause link-flap
errdisable recovery cause sfp-config-mismatch
errdisable recovery cause gbic-invalid
errdisable recovery cause psecure-
 << violation
errdisable recovery cause port-mode-failure
errdisable recovery cause dhcp-rate-limit
errdisable recovery cause pppoe-ia-rate-limit
errdisable recovery cause mac-limit
errdisable recovery cause vmps
errdisable recovery cause storm-control
 << 
errdisable recovery cause inline-power
errdisable recovery cause arp-inspection
errdisable recovery cause loopback
errdisable recovery cause small-frame
errdisable recovery interval 1800
!
vlan internal allocation policy ascending
!
!
!
interfa
 << ce FastEthernet0
 no ip address
 shutdown
!
interface GigabitEthernet1/0/1
 switchport access vlan 123
 switchport mode access
 spanning-tree portfast
!
interface GigabitEthernet1/0/2
 switchport access vlan 123
 switchport mode access
 spanni
 << ng-tree portfast
!
interface GigabitEthernet1/0/3
 switchport access vlan 123
 switchport mode access
 spanning-tree portfast
!
interface GigabitEthernet1/0/4
 switchport access vlan 123
 switchport mode access
 spanning-tree portfast
!
interf
 << ace GigabitEthernet1/0/5
 switchport access vlan 123
 switchport mode access
 spanning-tree portfast
!
interface GigabitEthernet1/0/6
 switchport access vlan 123
 switchport mode access
 spanning-tree portfast
!
interface GigabitEthernet1/0/7
 
 << switchport access vlan 123
 switchport mode access
 spanning-tree portfast
!
interface GigabitEthernet1/0/8
 switchport access vlan 123
 switchport mode access
 spanning-tree portfast
!
interface GigabitEthernet1/0/9
 switchport access vlan 123
 << 
 switchport mode access
 spanning-tree portfast
!
interface GigabitEthernet1/0/10
 switchport access vlan 123
 switchport mode access
 spanning-tree portfast
!
interface GigabitEthernet1/0/11
 switchport access vlan 123
 switchport mode access
 << 
 spanning-tree portfast
!
interface GigabitEthernet1/0/12
 switchport access vlan 123
 switchport mode access
 spanning-tree portfast
!
interface GigabitEthernet1/0/13
 switchport access vlan 123
 switchport mode access
 spanning-tree portfast
 << 
!
interface GigabitEthernet1/0/14
 switchport access vlan 123
 switchport mode access
 spanning-tree portfast
!
interface GigabitEthernet1/0/15
 switchport access vlan 123
 switchport mode access
 spanning-tree portfast
!
interface GigabitEthe
 << rnet1/0/16
 switchport access vlan 123
 switchport mode access
 spanning-tree portfast
!
interface GigabitEthernet1/0/17
 switchport access vlan 123
 switchport mode access
 spanning-tree portfast
!
interface GigabitEthernet1/0/18
 switchport a
 << ccess vlan 123
 switchport mode access
 spanning-tree portfast
!
interface GigabitEthernet1/0/19
 switchport access vlan 123
 switchport mode access
 spanning-tree portfast
!
interface GigabitEthernet1/0/20
 switchport access vlan 123
 switchpo
 << rt mode access
 spanning-tree portfast
!
in