trying to use serial port: /dev/ttyUSB0
 >> 
 >> 

Expect: searching for 4 strs:  :[yes/no] :Press RETURN to get started. :# :Switch>
 << 
Switch>
Switch>
Switch>
Switch>
Expect: matched string 4: Switch>
 >> term len 0

Expect: searching for 2 strs:  :# :>
 << term len 0
Switch>
Expect: matched string 2: >
 >> show version

Expect: searching for 2 strs:  :# :>
 << show version
Cisco IOS Software, C2960S Software (C2960S-UNIVERSALK9-M), Version 12.2(53)SE2, RELEASE SOFTWARE (fc3)
Technical Support: http://www.cisco.com/techsupport
Copyright (c) 1986-2010 by Cisco Systems, Inc.
Compiled Wed 21-Apr-10 06:08 by pro
 << d_rel_team
Image text-base: 0x00003000, data-base: 0x01B00000

ROM: Bootstrap program is Alpha board boot loader
BOOTLDR: C2960S Boot Loader (C2960S-HBOOT-M) Version 12.2(53r)SE, RELEASE SOFTWARE (fc3)

Switch uptime is 2 minutes
System returned to
 <<  ROM by power-on
System image file is "flash:/c2960s-universalk9-mz.122-53.SE2/c2960s-universalk9-mz.122-53.SE2.bin"


This product contains cryptographic features and is subject to United
States and local country laws governing import, export, trans
 << fer and
use. Delivery of Cisco cryptographic products does not imply
third-party authority to import, export, distribute or use encryption.
Importers, exporters, distributors and users are responsible for
compliance with U.S. and local country laws. B
 << y using this product you
agree to comply with applicable laws and regulations. If you are unable
to comply with U.S. and local laws, return this product immediately.

A summary of U.S. laws governing Cisco cryptographic products may be found at:
http
 << ://www.cisco.com/wwl/export/crypto/tool/stqrg.html

If you require further assistance please contact us by sending email to
export@cisco.com.

cisco WS-C2960S-24TD-L (PowerPC) processor (revision B0) with 131072K bytes of memory.
Processor board ID 
 << FOC1436Z0RQ
Last reset from power-on
1 Virtual Ethernet interface
1 FastEthernet interface
26 Gigabit Ethernet interfaces
2 Ten Gigabit Ethernet interfaces
The password-recovery mechanism is enabled.

512K bytes of flash-simulated non-volatile con
 << figuration memory.
Base ethernet MAC Address       : B4:A4:E3:03:FA:80
Motherboard assembly number     : 73-11906-08
Power supply part number        : 341-0328-02
Motherboard serial number       : FOC14345HXP
Power supply serial number      : DCA1423
 << M1SQ
Model revision number           : B0
Motherboard revision number     : A0
Model number                    : WS-C2960S-24TD-L
Daughterboard assembly number   : 73-11933-04
Daughterboard serial number     : FOC143546XV
System serial number       
 <<      : FOC1436Z0RQ
Top Assembly Part Number        : 800-30933-02
Top Assembly Revision Number    : A0
Version ID                      : V02
CLEI Code Number                : COMGA00ARB
Daughterboard revision number   : A0
Hardware Board Revision Nu
 << mber  : 0x01


Switch Ports Model              SW Version            SW Image                 
------ ----- -----              ----------            ----------               
*    1 28    WS-C2960S-24TD-L   12.2(53)SE2           C2960S-UNIVERSALK9-M 
 <<     


Configuration register is 0xF

Switch>
Expect: matched string 2: >
 >> enable

Expect: searching for 2 strs:  :Password: :#
 << enable
Switch#
Expect: matched string 2: #
 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
Expect: matched string 1: (config)#
 >> version 12.2

 >> no service pad

 >> service timestamps debug datetime localtime

 >> service timestamps log datetime localtime

 >> service password-encryption

 >> boot-start-marker

 >> boot-end-marker

 >> enable secret Area=l*w

 >> enable password Area=l*w

 >> no aaa new-model

 >> clock timezone CST -6

 >> clock summer-time CDT recurring

 >> switch 1 provision ws-c2960s-48ts-l

 >> authentication mac-move permit

 >> ip subnet-zero

 >> ip domain-name mgmt.msstate.edu

 >> ip name-server 130.18.2.210

 >> vtp domain vtp01.mgmt.msstate.edu

 >> vtp mode client

 >> crypto pki trustpoint TP-self-signed-2494998912

 >>  enrollment selfsigned

 >>  subject-name cn=IOS-Self-Signed-Certificate-2494998912

 >>  revocation-check none

 >>  rsakeypair TP-self-signed-2494998912

 >> crypto pki certificate chain TP-self-signed-2494998912

 >>  certificate self-signed 01 nvram:IOS-Self-Sig#3232.cer

 >> spanning-tree portfast bpduguard default

 >> spanning-tree extend system-id

 >> vlan internal allocation policy ascending

 >> errdisable recovery cause all

 >> errdisable recovery interval 1800

 >> interface FastEthernet0

 >>  no ip address

 >>  shutdown

 >> interface Vlan1

 >>  no ip address

 >>  no ip route-cache

 >>  shutdown

 >> interface Vlan92

 >> ip http server

 >> ip http secure-server

 >> ip sla enable reaction-alerts

 >> logging facility local1

 >> logging 130.18.2.208

 >> access-list 1 permit 10.92.0.0 0.0.255.255

 >> snmp-server community sysnet RO 1

 >> snmp-server community c2-b2=a2 RW 1

 >> snmp-server enable traps snmp authentication linkdown linkup coldstart warmstart

 >> snmp-server enable traps transceiver all

 >> snmp-server enable traps tty

 >> snmp-server enable traps cluster

 >> snmp-server enable traps config-copy

 >> snmp-server enable traps config

 >> snmp-server enable traps config-ctid

 >> snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-auth-fail-vlan no-guest-vlan

 >> snmp-server enable traps entity

 >> snmp-server enable traps power-ethernet group 1

 >> snmp-server enable traps power-ethernet police

 >> snmp-server enable traps cpu threshold

 >> snmp-server enable traps rep

 >> snmp-server enable traps rtr

 >> snmp-server enable traps bridge newroot topologychange

 >> snmp-server enable traps stpx inconsistency root-inconsistency loop-inconsistency

 >> snmp-server enable traps syslog

 >> snmp-server enable traps vtp

 >> snmp-server enable traps vlancreate

 >> snmp-server enable traps vlandelete

 >> snmp-server enable traps flash insertion removal

 >> snmp-server enable traps port-security

 >> snmp-server enable traps envmon fan shutdown supply temperature status

 >> snmp-server enable traps errdisable

 >> snmp-server enable traps mac-notification change move threshold

 >> snmp-server enable traps vlan-membership

 >> snmp-server host 130.18.2.208 sysnet 

 >> line con 0

 >> line vty 0 4

 >>  password Area=l*w

 >>  login

 >> line vty 5 15

 >>  password Area=l*w

 >>  login

 >> ntp clock-period 22519226

 >> ntp server 130.18.92.22

 >> end

Expect: searching for 1 strs:  :Configured
 << version 12.2
Switch(config)#no service pad
Switch(config)#service timestamps debug datetime localtime
Switch(config)#service timestamps log datetime localtime
Switch(config)#service password-encryption
Switch(config)#boot-start-marker
Switch(config)
 << #boot-end-marker
Switch(config)#enable secret Area=l*w
Switch(config)#enable password Area=l*w
The enable password you have chosen is the same as your enable secret.
This is not recommended.  Re-enter the enable password.

Switch(config)#no aaa new-
 << model
Switch(config)#clock timezone CST -6
Switch(config)#clock summer-time CDT recurring
Switch(config)#switch 1 provision ws-c2960s-48ts-l
%Command rejected: switch 1 (ws-c2960s-24td-l) already present in the stack

Switch(config)#authentication m
 << ac-move permit
Switch(config)#ip subnet-zero
Switch(config)#ip domain-name mgmt.msstate.edu
Switch(config)#
*Feb 28 18:04:50: %SYS-6-CLOCKUPDATE: System clock has been updated from 00:04:50 UTC Mon Mar 1 1993 to 18:04:50 CST Sun Feb 28 1993, configure
 << d from console by console.
*Feb 28 18:04:51: %SYS-6-CLOCKUPDATE: System clock has been updated from 18:04:51 CST Sun Feb 28 1993 to 18:04:51 CST Sun Feb 28 1993, configured from console by console.ip name-server 130.18.2.210
Switch(config)#vtp domain vt
 << p01.mgmt.msstate.edu
Domain name already set to vtp01.mgmt.msstate.edu.
Switch(config)#vtp mode client
Device mode already VTP Client for VLANS.
Switch(config)#crypto pki trustpoint TP-self-signed-2494998912
Switch(ca-trustpoint)# enrollment selfsign
 << ed
Switch(ca-trustpoint)# subject-name cn=IOS-Self-Signed-Certificate-2494998912
Switch(ca-trustpoint)# revocation-check none
Switch(ca-trustpoint)# rsakeypair TP-self-signed-2494998912
Switch(ca-trustpoint)#crypto pki certificate chain TP-self-signed
 << -2494998912
Switch(config-cert-chain)# certificate self-signed 01 nvram:IOS-Self-Sig#3232$e self-signed 01 nvram:IOS-Self-Sig#3232.         cer
Switch(config-cert-chain)#spanning-tree portfast 
 << bpduguard default
Switch(config)#spanning-tree extend system-id
Switch(config)#vlan internal allocation policy ascending
Switch(config)#errdisable recovery cause all
Switch(config)#errdisable recovery interval 1800
Switch(config)#interface FastEthern
 << et0
Switch(config-if)# no ip address
Switch(config-if)# shutdown
Switch(config-if)#interface Vlan1
Switch(config-if)# no ip address
Switch(config-if)# no ip route-cache
Switch(config-if)# shutdown
Switch(config-if)#interface Vlan92
Switch(config-i
 << f)#ip http server
Switch(config)#ip http secure-server
% Generating 1024 bit RSA keys, keys will be non-exportable...
*Feb 28 18:04:57: %LINK-5-CHANGED: Interface FastEthernet0, changed state to administratively down
*Feb 28 18:04:57: %LINEPROTO-5-UPD
 << OWN: Line protocol on Interface Vlan92, changed state to down
*Feb 28 18:04:58: %LINK-5-CHANGED: Interface Vlan1, changed state to administratively down[OK]

Switch(config)#ip sla enable reaction-alerts
Switch(config)#logging facility local1
Switch(c
 << onfig)#logging 130.18.2.208
Switch(config)#access-list 1 permit 10.92.0.0 0.0.255.255
Switch(config)#snmp-server community sysnet RO 1
Switch(config)#snmp-server community c2-b2=a2 RW 1
Switch(config)#snmp-server enable traps snmp authentication linkd
 << own linkup c$ enable traps snmp authentication linkdown linkup co         ldstart waps snmp authentication linkdown linkup 
 << coldstart wa         rmstart
Switch(config)#snmp-server enable traps transceiver all
Switch(config)#snmp-server enable traps tty
Switch(config
*Feb 28 18:05:02: %SSH-5-ENABLED: SSH 1.99 has been enabled)#snmp-server enable traps cluster
Swit
 << ch(config)#snmp-server enable traps config-copy
Switch(config)#snmp-server enable traps config
Switch(config)#snmp-server enable traps config-ctid
Switch(config)#snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-au
 << $ enable traps dot1x auth-fail-vlan guest-vlan no-aut         h-fail-vlaps dot1x auth-fail-vlan guest-vlan no-auth-fail-vla         n no-gues
 << uth-fail-vlan guest-vlan no-auth-fail-vlan no-guest         -vlan
Switch(config)#snmp-server enable traps entity
Switch(config)#snmp-server enable traps power-ethernet group 1
Switch(c
 << onfig)#snmp-server enable traps power-ethernet police
Switch(config)#snmp-server enable traps cpu threshold
Switch(config)#snmp-server enable traps rep
Switch(config)#snmp-server enable traps rtr
Switch(config)#snmp-server enable traps bridge newroot 
 << topologychange
Switch(config)#snmp-server enable traps stpx inc
*Feb 28 18:05:03: %PKI-4-NOAUTOSAVE: Configuration was modified.  Issue "write memory" to save new certificateonsistency root-inconsistency
 << $ enable traps stpx inconsistency root-inconsistency          loop-incoaps stpx inconsistency root-inconsistency loop-incon         sistency
Switch(config)#snmp-se
 << rver enable traps syslog
Switch(config)#snmp-server enable traps vtp
Switch(config)#snmp-server enable traps vlancreate
Switch(config)#snmp-server enable traps vlandelete
Switch(config)#snmp-server enable tr
*Feb 28 18:05:04: %SYS-6-LOGGINGHOST_START
 << STOP: Logging to host 130.18.2.208 Port 514 started - CLI initiatedaps flash insertion removal
Switch(config)#snmp-server enable traps port-security
Switch(config)#snmp-server enable traps envmon fan shutdown supply temperatur
 << $ enable traps envmon fan shutdown supply temperature          status
Switch(config)#snmp-server enable traps errdisable
Switch(config)#snmp-server enable traps mac-notification change move threshol
 << $ enable traps mac-notification change move threshold         
Switch(config)#snmp-server enable traps vlan-membership
Switch(config)#snmp-server host 130.18.2.208 sysnet 
Switch(config)#line 
 << con 0
Switch(config-line)#line vty 0 4
Switch(config-line)# password Area=l*w
Switch(config-line)# login
Switch(config-line)#line vty 5 15
Switch(config-line)# password Area=l*w
Switch(config-line)# login
Switch(config-line)#ntp clock-period 225192
 << 26
Switch(config)#ntp server 130.18.92.22
Switch(config)#end
Switch#
 << 
*Feb 28 18:05:07: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
Switch#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
Expect: matched string 1: (config)#
 >> spanning-tree mode mst

 >> spanning-tree etherchannel guard misconfig

 >> spanning-tree mst configuration

 >>  name msstate

 >>  revision 1

 >>  instance 1 vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 63, 70

 >>  instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 160

 >>  instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 230, 232, 242, 246

 >>  instance 1 vlan 256, 611-612, 654, 741, 996, 999

 >>  instance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037, 2039-2040

 >>  instance 2 vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096, 2104, 2110, 2126

 >>  instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 2189, 2194, 2202

 >>  instance 2 vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 2654, 2999

 >>  instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176, 196

 >>  instance 3 vlan 244, 248, 927

 >>  instance 4 vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072, 2108, 2113, 2128

 >>  instance 4 vlan 2144, 2176, 2196, 2244, 2248, 2927

 >>  instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 228

 >>  instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216, 2228

 >>  instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116, 124

 >>  instance 7 vlan 172, 186, 192, 204-208, 210, 240-241, 251-252, 630, 928

 >>  instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082, 2084

 >>  instance 8 vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208, 2210

 >>  instance 8 vlan 2240-2241, 2251-2252, 2630, 2928

 >>  instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102, 112

 >>  instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 500, 505, 510-511

 >>  instance 9 vlan 522, 551-570, 603, 629, 633, 742, 802, 926, 929

 >>  instance 10 vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 2057, 2062, 2068

 >>  instance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148, 2158

 >>  instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522, 2603, 2629, 2633

 >>  instance 10 vlan 2802, 2926, 2929

 >>  instance 11 vlan 8, 43, 52, 146, 156-157, 180, 200, 218

 >>  instance 12 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180, 2200, 2218

 >> 

 >> end

Expect: searching for 1 strs:  :Configured
 << spanning-tree mode mst
Switch(config)#spanning-tree etherchannel guard misconfig
Switch(config)#spanning-tree mst configuration
Switch(config-mst)# name msstate
Switch(config-mst)# revision 1
Switch(config-mst)# instance 1 vlan 2, 7, 11, 20, 22, 24, 
 << 31, 35, 37, 39-40, $ vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40, 5         0, 60, 63, 11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 
 << 63,          70
Switch(config-mst)# instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 1$ vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 14         0, 152, 1
 << 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 16         0
Switch(config-mst)# instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 23$ vlan 162-1
 << 63, 168, 189, 194, 202, 220, 222, 230         , 232, 24163, 168, 189, 194, 202, 220, 222, 230, 232, 242         , 246
Switch(config-mst)# instance 1 vlan 256, 611-612, 654, 741, 9
 << 96, 999
Switch(config-mst)# instance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031,$ vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031,          2035, 203
 << , 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037         , 2039-2011, 2020, 2022, 2024, 2031, 2035, 2037, 2039-204         0
Switch(config-mst)# instance 2 v
 << lan 2050, 2060, 2063, 2070, 2080, 2086, 2096,$ vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096,          2104, 211, 2060, 2063, 2070,
 <<  2080, 2086, 2096, 2104, 2110         , 2126
Switch(config-mst)# instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, $ vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 2         
 << 189, 2194, 2140, 2152, 2160, 2162-2163, 2168, 2189, 2194,          2202
Switch(config-mst)# instance 2 vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 
 << $ vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 2         654, 2999
Switch(config-mst)# instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128$ vlan 42, 51, 59, 64
 << , 66, 69, 72, 108, 113, 128,          144, 17651, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176,          196
Switch(config-mst)# instance 3 vlan 244, 248, 927
Switch(config-mst)# 
 << instance 4 vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072,$ vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072,          2108, 211, 2051,
 <<  2059, 2064, 2066, 2069, 2072, 2108, 2113         , 2128
Switch(config-mst)# instance 4 vlan 2144, 2176, 2196, 2244, 2248, 2927
Switch(config-mst)# instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 2
 << $ vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 22         8
Switch(config-mst)# instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-$ vlan 2016, 2048, 2058, 2088, 
 << 2121, 2131, 2133-2         134, 2216, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216,          2228
Switch(config-mst)# instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97,
 << $ vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97,          114, 116,3-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116,          1
 << 24
Switch(config-mst)# instance 7 vlan 172, 186, 192, 204-208, 210, 240-241, 251$ vlan 172, 186, 192, 204-208, 210, 240-241, 251-         252, 630,
 << 186, 192, 204-208, 210, 240-241, 251-252, 630,          928
Switch(config-mst)# instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, $ vlan 2009, 2033-2034, 2038, 2054
 << , 2056, 2071, 2         075, 2082, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082,          2084
Switch(config-mst)# instance 8 vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192,
 << $ vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192,          2204-2208, 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208,          221
 << 0
Switch(config-mst)# instance 8 vlan 2240-2241, 2251-2252, 2630, 2928
Switch(config-mst)# instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 9$ vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 
 << 98         -99, 102,12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102,          112
Switch(config-mst)# instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 50
 << $ vlan 130, 132, 147-148, 158, 212, 226, 236, 500         , 505, 51132, 147-148, 158, 212, 226, 236, 500, 505, 510         -511
Switch(config-mst
 << )# instance 9 vlan 522, 551-570, 603, 629, 633, 742, 802, 92$ vlan 522, 551-570, 603, 629, 633, 742, 802, 926         , 929
Switch(config-mst)# instance 10 vlan 2004-2005, 2012, 2018-2019
 << , 2032, 2044, $0 vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 2         057, 20624-2005, 2012, 2018-2019, 2032, 2044, 2057, 2062,  
 <<         2068
Switch(config-mst)# instance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132,$0 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132,          2147-2148
 << 6, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148,          2158
Switch(config-mst)# instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522,$0 vlan 221
 << 2, 2236, 2500, 2505, 2510-2511, 2522,          2603, 2622, 2236, 2500, 2505, 2510-2511, 2522, 2603, 2629         , 2633
Switch(config-mst)# instance 10 vlan 2802, 2926, 2929
Swit
 << ch(config-mst)# instance 11 vlan 8, 43, 52, 146, 156-157, 180, 200, 218
Switch(config-mst)# instance 12 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180,$2 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180
 << ,          2200, 2218, 2043, 2052, 2146, 2156-2157, 2180, 2200, 2218         
Switch(config-mst)#
Switch(config-mst)#end
Switch#
 << 
*Feb 28 18:05:23: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
Switch#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
Expect: matched string 1: (config)#
 >> hostname test 

Expect: searching for 2 strs:  :# :>
 << hostname test 
test(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
test#
 << 
*Feb 28 18:05:29: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
test#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
test(config)#
Expect: matched string 1: (config)#
 >> snmp-server contact test

Expect: searching for 1 strs:  :#
 << snmp-server contact test
test(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
test#
 << 
*Feb 28 18:05:36: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
test#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
test(config)#
Expect: matched string 1: (config)#
 >> interface vlan 92

Expect: searching for 1 strs:  :(config-if)#
 << interface vlan 92
test(config-if)#
Expect: matched string 1: (config-if)#
 >> ip address 10.13.3.46 255.255.0.0

 >> ip broadcast-address 10.92.255.255

 >> end

Expect: searching for 1 strs:  :Configured
 << ip address 10.13.3.46 255.255.0.0
test(config-if)#ip broadcast-address 10.92.255.255
test(config-if)#end
test#
 << 
*Feb 28 18:05:42: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
test#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
test(config)#
Expect: matched string 1: (config)#
 >> interface Vlan92

Expect: searching for 1 strs:  :(config-if)#
 << interface Vlan92
test(config-if)#
Expect: matched string 1: (config-if)#
 >> ip default-gateway 10.92.0.1

 >> end

Expect: searching for 1 strs:  :Configured
 << ip default-gateway 10.92.0.1
test(config)#end
test#
 << 
*Feb 28 18:05:48: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
test#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
test(config)#
Expect: matched string 1: (config)#
 >> default interface range gi1/0/1 - 24 

 >> interface range gi1/0/1 - 24 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi1/0/1 - 24 
test(config)#interface range gi1/0/1 - 24 
test(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport access vlan 1234

 >> switchport mode access

 >> spanning-tree portfast

 >> switchport port-security maximum 2

 >> switchport port-security

 >> switchport port-security aging time 15

 >> switchport port-security violation protect

 >> switchport port-security aging type inactivity

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport access vlan 1234
%VTP VLAN configuration not allowed When device is in CLIENT mode.
% Range command terminated because it failed on GigabitEthernet1/0/1
test(config-if-range)#switchport mode access
test(config-if-range)#spanning-tree portfa
 << st
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, concentrators, switches, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfa
 << st will be configured in 24 interfaces due to the range command 
 but will only have effect when the interfaces are in a non-trunking mode.
test(config-if-range)#switchport port-security maximum 2
test(config-if-range)#switchport port-security
test(co
 << nfig-if-range)#switchport port-security aging time 15
test(config-if-range)#switchport port-security violation protect
test(config-if-range)#switchport port-security aging type inactivity
test(config-if-range)#end
test#
 << 
*Feb 28 18:06:02: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
test#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
test(config)#
Expect: matched string 1: (config)#
 >> default interface range te1/0/1 - 2 

 >> interface range te1/0/1 - 2 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range te1/0/1 - 2 
test(config)#interface range te1/0/1 - 2 
test(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport mode trunk

 >> switchport trunk native vlan 92

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport mode trunk
test(config-if-range)#switchport trunk native vlan 92
test(config-if-range)#end
test#
 << 
*Feb 28 18:06:13: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
test#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
test(config)#
Expect: matched string 1: (config)#
 >> default interface range gi1/0/25 - 26 

 >> interface range gi1/0/25 - 26 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi1/0/25 - 26 
test(config)#interface range gi1/0/25 - 26 
test(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport mode trunk

 >> switchport trunk native vlan 92

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport mode trunk
test(config-if-range)#switchport trunk native vlan 92
test(config-if-range)#end
test#
 << 
*Feb 28 18:06:19: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> write mem

Expect: searching for 2 strs:  :# :>
 << 
test#write mem
Building configuration...

Expect: matched string 1: #
 >> 
Expect: searching for 2 strs:  :# :>
 << [OK]
test#
test#
test#
Expect: matched string 1: #
 >> sh run

Expect: searching for 2 strs:  :# :>
 << sh run
Building configuration...

Current configuration : 14000 bytes
!
version 12.2
no service pad
service timestamps debug datetime localtime
service timestamps log datetime localtime
service password-encryption
!
hostname test
!
boot-start
 << -marker
boot-end-marker
!
enable secret 5 $1$3C7z$g7VbHSnS4mgD6bBD..qfp0
enable password 7 047A19030E7C40041E
!
!
!
no aaa new-model
clock timezone CST -6
clock summer-time CDT recurring
switch 1 provision ws-c2960s-24td-l
authentication mac-m
 << ove permit
ip subnet-zero
!
!
ip domain-name mgmt.msstate.edu
ip name-server 130.18.2.210
!
!
crypto pki trustpoint TP-self-signed-3808688768
 enrollment selfsigned
 subject-name cn=IOS-Self-Signed-Certificate-3808688768
 revocation-check none
 << 
 rsakeypair TP-self-signed-3808688768
!
!
crypto pki certificate chain TP-self-signed-3808688768
 certificate self-signed 01
  3082024F 308201B8 A0030201 02020101 300D0609 2A864886 F70D0101 04050030 
  31312F30 2D060355 04031326 494F532D 53656C66 2
 << D536967 6E65642D 43657274 
  69666963 6174652D 33383038 36383837 3638301E 170D3933 30333031 30303035 
  30335A17 0D323030 31303130 30303030 305A3031 312F302D 06035504 03132649 
  4F532D53 656C662D 5369676E 65642D43 65727469 66696361 74652D33 38303836 
 << 
  38383736 3830819F 300D0609 2A864886 F70D0101 01050003 818D0030 81890281 
  8100D2C7 B7D916D5 96B9CA4D D370CA42 A00B08C8 6905AC76 5AFBF71C 06561EEE 
  694D28F8 0F164C0C D12BD2DD 1F3BB30D B56567F1 558340DA 7EB9079D 0EECAF7E 
  1709A69A 39F72A19 7A1EDC
 << BD 3CC4071E 2E540799 AA95BC8B C33AAED8 78A16126 
  6D5F57E1 B2B684E5 C7BDDF46 F76111FC F7AA040D 667C4BDE A8B5A383 CF2A0966 
  19810203 010001A3 77307530 0F060355 1D130101 FF040530 030101FF 30220603 
  551D1104 1B301982 17537769 7463682E 6D676D74 2E6D73
 << 73 74617465 2E656475 
  301F0603 551D2304 18301680 1427A46E 41154C53 9A6D10C4 B71C640E AEDB6808 
  47301D06 03551D0E 04160414 27A46E41 154C539A 6D10C4B7 1C640EAE DB680847 
  300D0609 2A864886 F70D0101 04050003 8181005A 3F8CA4E7 F139370B 74BC20B6 
  10
 << 9BAD72 87E882B9 E1EFAC88 92ACD7B5 86775AA3 6D594BD1 C1AC1CC8 3796DFF5 
  3B026B10 7A9250BA 528E5BC8 83BD34AB FE0404CF 2726F3A8 5F2CE718 6C928D77 
  C72B2AAD 90642745 176A0E54 F71607F0 92F3947E E4E40189 F6EFBDCA 39E6E59F 
  73A92C00 A04F7004 92D7CC7B CE
 << 1BB9C1 0CEB29
  quit
!
spanning-tree mode mst
spanning-tree portfast bpduguard default
spanning-tree etherchannel guard misconfig
spanning-tree extend system-id
!
spanning-tree mst configuration
 name msstate
 revision 1
 instance 1 vlan 2, 7, 
 << 11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 63, 70
 instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 160
 instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 230, 232, 242, 246
 instance 1 vlan 256, 611-612, 654, 741, 996, 999
 inst
 << ance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037, 2039-2040
 instance 2 vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096, 2104, 2110, 2126
 instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 2189, 2194, 2202
 instance 2 vlan 2220, 22
 << 22, 2232, 2242, 2246, 2611-2612, 2654, 2999
 instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176, 196
 instance 3 vlan 244, 248, 927
 instance 4 vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072, 2108, 2113, 2128
 instance 4 vlan 2144, 217
 << 6, 2196, 2244, 2248, 2927
 instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 228
 instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216, 2228
 instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116, 124
 instance 7 vlan
 <<  172, 186, 192, 204-208, 210, 240-241, 251-252, 630, 928
 instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082, 2084
 instance 8 vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208, 2210
 instance 8 vlan 2240-2241, 2251-2252, 2630, 
 << 2928
 instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102, 112
 instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 500, 505, 510-511
 instance 9 vlan 522, 551-570, 603, 629, 633, 742, 802, 926, 929
 instance 10 vlan 2004-2005, 2012,
 <<  2018-2019, 2032, 2044, 2057, 2062, 2068
 instance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148, 2158
 instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522, 2603, 2629, 2633
 instance 10 vlan 2802, 2926, 2929
 instance 11 vlan 8, 43,
 <<  52, 146, 156-157, 180, 200, 218
 instance 12 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180, 2200, 2218
!
!
!
!
errdisable recovery cause udld
errdisable recovery cause bpduguard
errdisable recovery cause security-violation
errdisable recovery cau
 << se channel-misconfig (STP)
errdisable recovery cause pagp-flap
errdisable recovery cause dtp-flap
errdisable recovery cause link-flap
errdisable recovery cause sfp-config-mismatch
errdisable recovery cause gbic-invalid
errdisable recovery cause psec
 << ure-violation
errdisable recovery cause port-mode-failure
errdisable recovery cause dhcp-rate-limit
errdisable recovery cause pppoe-ia-rate-limit
errdisable recovery cause mac-limit
errdisable recovery cause vmps
errdisable recovery cause storm-cont
 << rol
errdisable recovery cause inline-power
errdisable recovery cause arp-inspection
errdisable recovery cause loopback
errdisable recovery cause small-frame
errdisable recovery interval 1800
!
vlan internal allocation policy ascending
!
!
!
int
 << erface FastEthernet0
 no ip address
 shutdown
!
interface GigabitEthernet1/0/1
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation prote
 << ct
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/2
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport 
 << port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/3
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-securit
 << y aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/4
 switchport mode access
 switchport port-security maximum 2
 switchport port-secur
 << ity
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/5
 switchport mode access
 switchport port-security maxi
 << mum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/6
 switchport mode access
 
 << switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/
 << 7
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!

 << interface GigabitEthernet1/0/8
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 << 
 spanning-tree portfast
!
interface GigabitEthernet1/0/9
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-se
 << curity aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/10
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violatio
 << n protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/11
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 swi
 << tchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/12
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport por
 << t-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/13
 switchport mode access
 switchport port-security maximum 2
 switchport 
 << port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/14
 switchport mode access
 switchport port-se
 << curity maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/15
 switchport mo
 << de access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface Gigabit
 << Ethernet1/0/16
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree 
 << portfast
!
interface GigabitEthernet1/0/17
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging ty
 << pe inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/18
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 swi
 << tchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/19
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-se
 << curity violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/20
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security agin
 << g time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/21
 switchport mode access
 switchport port-security maximum 2
 switchport port-security

 <<  switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/22
 switchport mode access
 switchport port-security maximum 
 << 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/23
 switchport mode access
 swi
 << tchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/24
 << 
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
in
 << terface GigabitEthernet1/0/25
 switchport trunk native vlan 92
 switchport mode trunk
!
interface GigabitEthernet1/0/26
 switchport trunk native vlan 92
 switchport mode trunk
!
interface TenGigabitEthernet1/0/1
 switchport trunk native vlan 92

 <<  switchport mode trunk
!
interface TenGigabitEthernet1/0/2
 switchport trunk native vlan 92
 switchport mode trunk
!
interface Vlan1
 no ip address
 no ip route-cache
 shutdown
!
interface Vlan92
 ip address 10.13.3.46 255.255.0.0
 ip broadca
 << st-address 10.92.255.255
!
ip default-gateway 10.92.0.1
ip http server
ip http secure-server
ip sla enable reaction-alerts
logging facility local1
logging 130.18.2.208
access-list 1 permit 10.92.0.0 0.0.255.255
snmp-server community sysnet RO 1

 << snmp-server community c2-b2=a2 RW 1
snmp-server contact test
snmp-server enable traps snmp authentication linkdown linkup coldstart warmstart
snmp-server enable traps transceiver all
snmp-server enable traps tty
snmp-server enable traps cluster
snmp
 << -server enable traps config-copy
snmp-server enable traps config
snmp-server enable traps config-ctid
snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-auth-fail-vlan no-guest-vlan
snmp-server enable traps entity
snmp-server enable traps po
 << wer-ethernet group 1
snmp-server enable traps power-ethernet police
snmp-server enable traps cpu threshold
snmp-server enable traps rep
snmp-server enable traps rtr
snmp-server enable traps bridge newroot topologychange
snmp-server enable traps stpx
 <<  inconsistency root-inconsistency loop-inconsistency
snmp-server enable traps syslog
snmp-server enable traps vtp
snmp-server enable traps vlancreate
snmp-server enable traps vlandelete
snmp-server enable traps flash insertion removal
snmp-server en
 << able traps port-security
snmp-server enable traps envmon fan shutdown supply temperature status
snmp-server enable traps errdisable
snmp-server enable traps mac-notification change move threshold
snmp-server enable traps vlan-membership
snmp-server h
 << ost 130.18.2.208 sysnet 
!
!
line con 0
line vty 0 4
 password 7 153319090577276E3F
 login
line vty 5 15
 password 7 132405170A5108603C
 login
!
ntp clock-period 22519226
ntp server 130.18.92.22
end

test#
Expect: matched string 1: #
