trying to use serial port: /dev/ttyUSB0
 >> 
 >> 

Expect: searching for 4 strs:  :[yes/no] :Press RETURN to get started. :# :Switch>
 << 
test#
test#
test#
test#
Expect: matched string 3: #
 >> term len 0

Expect: searching for 2 strs:  :# :>
 << term len 0
test#
Expect: matched string 1: #
 >> show version

Expect: searching for 2 strs:  :# :>
 << show version
Cisco IOS Software, C2960S Software (C2960S-UNIVERSALK9-M), Version 12.2(53)SE2, RELEASE SOFTWARE (fc3)
Technical Support: http://www.cisco.com/techsupport
Copyright (c) 1986-2010 by Cisco Systems, Inc.
Compiled Wed 21-Apr-10 06:08 by pro
 << d_rel_team
Image text-base: 0x00003000, data-base: 0x01B00000

ROM: Bootstrap program is Alpha board boot loader
BOOTLDR: C2960S Boot Loader (C2960S-HBOOT-M) Version 12.2(53r)SE, RELEASE SOFTWARE (fc3)

test uptime is 10 minutes
System returned to 
 << ROM by power-on
System image file is "flash:/c2960s-universalk9-mz.122-53.SE2/c2960s-universalk9-mz.122-53.SE2.bin"


This product contains cryptographic features and is subject to United
States and local country laws governing import, export, transf
 << er and
use. Delivery of Cisco cryptographic products does not imply
third-party authority to import, export, distribute or use encryption.
Importers, exporters, distributors and users are responsible for
compliance with U.S. and local country laws. By
 <<  using this product you
agree to comply with applicable laws and regulations. If you are unable
to comply with U.S. and local laws, return this product immediately.

A summary of U.S. laws governing Cisco cryptographic products may be found at:
http:
 << //www.cisco.com/wwl/export/crypto/tool/stqrg.html

If you require further assistance please contact us by sending email to
export@cisco.com.

cisco WS-C2960S-24TD-L (PowerPC) processor (revision B0) with 131072K bytes of memory.
Processor board ID F
 << OC1436Z0RQ
Last reset from power-on
2 Virtual Ethernet interfaces
1 FastEthernet interface
26 Gigabit Ethernet interfaces
2 Ten Gigabit Ethernet interfaces
The password-recovery mechanism is enabled.

512K bytes of flash-simulated non-volatile con
 << figuration memory.
Base ethernet MAC Address       : B4:A4:E3:03:FA:80
Motherboard assembly number     : 73-11906-08
Power supply part number        : 341-0328-02
Motherboard serial number       : FOC14345HXP
Power supply serial number      : DCA1423
 << M1SQ
Model revision number           : B0
Motherboard revision number     : A0
Model number                    : WS-C2960S-24TD-L
Daughterboard assembly number   : 73-11933-04
Daughterboard serial number     : FOC143546XV
System serial number       
 <<      : FOC1436Z0RQ
Top Assembly Part Number        : 800-30933-02
Top Assembly Revision Number    : A0
Version ID                      : V02
CLEI Code Number                : COMGA00ARB
Daughterboard revision number   : A0
Hardware Board Revision Nu
 << mber  : 0x01


Switch Ports Model              SW Version            SW Image                 
------ ----- -----              ----------            ----------               
*    1 28    WS-C2960S-24TD-L   12.2(53)SE2           C2960S-UNIVERSALK9-M 
 <<     


Configuration register is 0xF

test#
Expect: matched string 1: #
 >> write mem

Expect: searching for 2 strs:  :# :>
 << write mem
Building configuration...
[OK]
test#
Expect: matched string 1: #
 >> enable

Expect: searching for 2 strs:  :Password: :#
 << enable
test#
Expect: matched string 2: #
 >> wr erase
 >> 

 >> reload

Expect: searching for 2 strs:  :# :>
 << wr erase
Erasing the nvram filesystem will remove all configuration files! Continue? [confirm]
[OK]
Erase of nvram: complete
test#reload
Proceed with reload? [confirm]
Expect: matched string 1: #
Expect: searching for 1 strs:  :Save?
 << 
*Feb 28 18:10:21: %SYS-7-NV_BLOCK_INIT: Initialized the geometry of nvram
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

*Feb 28 18:10:21: %SYS-7-NV_BLOCK_INIT: Initialized the geometry of nvram
...

 >> 

