trying to use serial port: /dev/ttyUSB0
 >> 
 >> 

Expect: searching for 4 strs:  :[yes/no] :Press RETURN to get started. :# :Switch>
 << 
 << 
 << 
 << 
POST: PortASIC Port Loopback Tests : End, Status Passed

Waiting for Port download...Complete
 << 


This product contains cryptographic features and is subject to United
States and local country laws governing import, export, transfer and
use. Delivery of Cisco cryptographic products does not imply
third-party authority to import, export, distr
 << ibute or use encryption.
Importers, exporters, distributors and users are responsible for
compliance with U.S. and local country laws. By using this product you
agree to comply with applicable laws and regulations. If you are unable
to comply with U.S
 << . and local laws, return this product immediately.

A summary of U.S. laws governing Cisco cryptographic products may be found at:
http://www.cisco.com/wwl/export/crypto/tool/stqrg.html

If you require further assistance please contact us by sending 
 << email to
export@cisco.com.


 << 
 << 
 << cisco WS-C2960C-8TC-L (PowerPC405) processor (revision F0) with 131072K bytes of memory.
Processor board ID FOC1850W1DG
Last reset from power-on
1 Virtual Ethernet interface
8 FastEthernet interfaces
2 Gigabit Ethernet interfaces
The password-recove
Expect: did not match any strings!
...

POST: PortASIC Port Loopback Tests : End, Status Passed

Waiting for Port download...Complete


This product contains cryptographic features and is subject to United
States and local country laws governing import, export, transfer and
use. Delivery of Cisco cryptographic products does not imply
third-party authority to import, export, distribute or use encryption.
Importers, exporters, distributors and users are responsible for
compliance with U.S. and local country laws. By using this product you
agree to comply with applicable laws and regulations. If you are unable
to comply with U.S. and local laws, return this product immediately.

A summary of U.S. laws governing Cisco cryptographic products may be found at:
http://www.cisco.com/wwl/export/crypto/tool/stqrg.html

If you require further assistance please contact us by sending email to
export@cisco.com.

cisco WS-C2960C-8TC-L (PowerPC405) processor (revision F0) with 131072K bytes of memory.
Processor board ID FOC1850W1DG
Last reset from power-on
1 Virtual Ethernet interface
8 FastEthernet interfaces
2 Gigabit Ethernet interfaces
The password-recove
...

 >> 

Expect: searching for 2 strs:  :# :>
 << ry mechanism is enabled.

64K bytes of flash-simulated non-volatile configuration memory.
Base ethernet MAC Address       : 3C:5E:C3:D2:C7:80
Motherboard assembly number     : 73-13530-04
Power supply part number        : 341-0208-02
Motherboard ser
 << ial number       : FOC184977LY
Power supply serial number      : LIT18450AJ2
Model revision number           : F0
Motherboard revision number     : A0
Model number                    : WS-C2960C-8TC-L
System serial number            : FOC1850W1DG
To
 << p Assembly Part Number        : 800-35230-01
Top Assembly Revision Number    : L0
Version ID                      : V01
CLEI Code Number                : CMMGB00ARA
Hardware Board Revision Number  : 0x01


Switch Ports Model              SW Version
 <<             SW Image                 
------ ----- -----              ----------            ----------               
*    1 10    WS-C2960C-8TC-L    15.0(2)SE5            C2960c405-UNIVERSALK9-M  


 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...
ry mechanism is enabled.

64K bytes of flash-simulated non-volatile configuration memory.
Base ethernet MAC Address       : 3C:5E:C3:D2:C7:80
Motherboard assembly number     : 73-13530-04
Power supply part number        : 341-0208-02
Motherboard serial number       : FOC184977LY
Power supply serial number      : LIT18450AJ2
Model revision number           : F0
Motherboard revision number     : A0
Model number                    : WS-C2960C-8TC-L
System serial number            : FOC1850W1DG
Top Assembly Part Number        : 800-35230-01
Top Assembly Revision Number    : L0
Version ID                      : V01
CLEI Code Number                : CMMGB00ARA
Hardware Board Revision Number  : 0x01


Switch Ports Model              SW Version            SW Image                 
------ ----- -----              ----------            ----------               
*    1 10    WS-C2960C-8TC-L    15.0(2)SE5            C2960c405-UNIVERSALK9-M  


...

 >> 

Expect: searching for 4 strs:  :[yes/no] :Press RETURN to get started. :# :Switch>
 << 
% Please answer 'yes' or 'no'.
Would you like to enter the initial configuration dialog? [yes/no]: 
% Please answer 'yes' or 'no'.
Would you like to enter the initial configuration dialog? [yes/no]: 
Expect: matched string 1: [yes/no]
 >> 

 >> no

 >> term len 0

Expect: searching for 2 strs:  :# :>
 << 
% Please answer 'yes' or 'no'.
Would you like to enter the initial configuration dialog? [yes/no]: 
% Please answer 'yes' or 'no'.
Would you like to enter the initial configuration dialog? [yes/no]: no
Switch>term len 0
Switch>
Expect: matched string 2: >
 >> show version

Expect: searching for 2 strs:  :# :>
 << show version
Cisco IOS Software, C2960C Software (C2960c405-UNIVERSALK9-M), Version 15.0(2)SE5, RELEASE SOFTWARE (fc1)
Technical Support: http://www.cisco.com/techsupport
Copyright (c) 1986-2013 by Cisco Systems, Inc.
Compiled Fri 25-Oct-13 14:35 by p
 << rod_rel_team

ROM: Bootstrap program is C2960C boot loader
BOOTLDR: C2960C Boot Loader (C2960c405-HBOOT-M) Version 12.2(55r)EX9, RELEASE SOFTWARE (fc1)

Switch uptime is 2 minutes
System returned to ROM by power-on
System restarted at 01:27:24 UTC 
 << Wed Mar 30 2011
System image file is "flash:/c2960c405-universalk9-mz.150-2.SE5/c2960c405-universalk9-mz.150-2.SE5.bin"


This product contains cryptographic features and is subject to United
States and local country laws governing import, export, tr
 << ansfer and
use. Delivery of Cisco cryptographic products does not imply
third-party authority to import, export, distribute or use encryption.
Importers, exporters, distributors and users are responsible for
compliance with U.S. and local country laws
 << . By using this product you
agree to comply with applicable laws and regulations. If you are unable
to comply with U.S. and local laws, return this product immediately.

A summary of U.S. laws governing Cisco cryptographic products may be found at:
h
 << ttp://www.cisco.com/wwl/export/crypto/tool/stqrg.html

If you require further assistance please contact us by sending email to
export@cisco.com.

License Level: lanbase
License Type: Permanent
Next reload license Level: lanbase

cisco WS-C2960C-8
 << TC-L (PowerPC405) processor (revision F0) with 131072K bytes of memory.
Processor board ID FOC1850W1DG
Last reset from power-on
1 Virtual Ethernet interface
8 FastEthernet interfaces
2 Gigabit Ethernet interfaces
The password-recovery mechanism is e
 << nabled.

64K bytes of flash-simulated non-volatile configuration memory.
Base ethernet MAC Address       : 3C:5E:C3:D2:C7:80
Motherboard assembly number     : 73-13530-04
Power supply part number        : 341-0208-02
Motherboard serial number       
 << : FOC184977LY
Power supply serial number      : LIT18450AJ2
Model revision number           : F0
Motherboard revision number     : A0
Model number                    : WS-C2960C-8TC-L
System serial number            : FOC1850W1DG
Top Assembly Part N
 << umber        : 800-35230-01
Top Assembly Revision Number    : L0
Version ID                      : V01
CLEI Code Number                : CMMGB00ARA
Hardware Board Revision Number  : 0x01


Switch Ports Model              SW Version            SW Im
 << age                 
------ ----- -----              ----------            ----------               
*    1 10    WS-C2960C-8TC-L    15.0(2)SE5            C2960c405-UNIVERSALK9-M  


Configuration register is 0xF

Switch>
Expect: matched string 2: >
 >> enable

Expect: searching for 2 strs:  :Password: :#
 << enable
Switch#
Expect: matched string 2: #
 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
Expect: matched string 1: (config)#
 >> no service pad

 >> service timestamps debug datetime localtime

 >> service timestamps log datetime localtime

 >> service password-encryption

 >> boot-start-marker

 >> boot-end-marker

 >> enable secret Area=l*w

 >> enable password Area=l*w

 >> no aaa new-model

 >> clock timezone CST -6.0

 >> clock summer-time CDT recurring

 >> authentication mac-move permit

 >> ip domain-name mgmt.msstate.edu

 >> ip name-server 130.18.2.210

 >> vtp domain vtp01.mgmt.msstate.edu

 >> vtp mode client

 >> crypto pki trustpoint TP-self-signed-2494998912

 >>  enrollment selfsigned

 >>  subject-name cn=IOS-Self-Signed-Certificate-2494998912

 >>  revocation-check none

 >>  rsakeypair TP-self-signed-2494998912

 >> crypto pki certificate chain TP-self-signed-2494998912

 >>  certificate self-signed 01 nvram:IOS-Self-Sig#3232.cer

 >> spanning-tree portfast bpduguard default

 >> spanning-tree extend system-id

 >> vlan internal allocation policy ascending

 >> errdisable recovery cause all

 >> errdisable recovery interval 1800

 >> interface Vlan1

 >>  no ip address

 >>  no ip route-cache

 >>  shutdown

 >> interface Vlan92

 >> ip http server

 >> ip http secure-server

 >> logging facility local1

 >> logging loghost.msstate.edu

 >> access-list 1 permit 10.92.0.0 0.0.255.255

 >> snmp-server community sysnet RO 1

 >> snmp-server community c2-b2=a2 RW 1

 >> snmp-server enable traps snmp authentication linkdown linkup coldstart warmstart

 >> snmp-server enable traps transceiver all

 >> snmp-server enable traps tty

 >> snmp-server enable traps cluster

 >> snmp-server enable traps config-copy

 >> snmp-server enable traps config

 >> snmp-server enable traps config-ctid

 >> snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-auth-fail-vlan no-guest-vlan

 >> snmp-server enable traps entity

 >> snmp-server enable traps power-ethernet police

 >> snmp-server enable traps cpu threshold

 >> snmp-server enable traps rep

 >> snmp-server enable traps bridge newroot topologychange

 >> snmp-server enable traps stpx inconsistency root-inconsistency loop-inconsistency

 >> snmp-server enable traps syslog

 >> snmp-server enable traps vtp

 >> snmp-server enable traps vlancreate

 >> snmp-server enable traps vlandelete

 >> snmp-server enable traps flash insertion removal

 >> snmp-server enable traps port-security

 >> snmp-server enable traps envmon fan shutdown supply temperature status

 >> snmp-server enable traps errdisable

 >> snmp-server enable traps mac-notification change move threshold

 >> snmp-server enable traps vlan-membership

 >> snmp-server host 130.18.2.208 sysnet 

 >> line con 0

 >> line vty 0 4

 >>  password Area=l*w

 >>  login

 >> line vty 5 15

 >>  password Area=l*w

 >>  login

 >> ntp server 10.92.0.3

 >> end

Expect: searching for 1 strs:  :Configured
 << no service pad
Switch(config)#service timestamps debug datetime localtime
Switch(config)#service timestamps log datetime localtime
Switch(config)#service password-encryption
Switch(config)#boot-start-marker
Switch(config)#boot-end-marker
Switch(conf
 << ig)#enable secret Area=l*w
Switch(config)#enable password Area=l*w
The enable password you have chosen is the same as your enable secret.
This is not recommended.  Re-enter the enable password.

Switch(config)#no aaa new-model
Switch(config)#clock t
 << imezone CST -6.0
                                  ^
% Invalid input detected at '^' marker.

Switch(config)#clock summer-time CDT recurring
Switch(config)#authentication mac-move permit
Switch(config)#ip domain-name mgmt.msstate.edu
Switch(config)
 << #ip name-server 130.18.2.210
Switch(config)#vtp domain vtp01.mgmt.msstate.edu
Domain name already set to vtp01.mgmt.msstate.edu.
Switch(config)#vtp mode client
Device mode already VTP Client for VLANS.
Switch(config)#crypto pki trustpoint TP-self-sig
 << ned-2494998912
Switch(ca-trustpoint)# enrollment selfsigned
Switch(ca-trustpoint)#
Mar 30 02:30:23: %SYS-6-CLOCKUPDATE: System clock has been updated from 01:30:23 UTC Wed Mar 30 2011 to 02:30:23 CDT Wed Mar 30 2011, configured from console by console.
 <<  subject-name cn=IOS-Self-Signed-Certificate-2494998912
Switch(ca-trustpoint)# revocation-check none
Switch(ca-trustpoint)# rsakeypair TP-self-signed-2494998912
Switch(ca-trustpoint)#crypto pki certificate chain TP-self-signed-2494998912
Switch(config
 << -cert-chain)# certificate self-signed 01 nvram:IOS-Self-Sig#3232$e self-signed 01 nvram:IOS-Self-Sig#3232.         cer
Switch(config-cert-chain)#spanning-tree portfast bpduguard default
Switch(
 << config)#spanning-tree extend system-id
Switch(config)#vlan internal allocation policy ascending
Switch(config)#errdisable recovery cause all
Switch(config)#errdisable recovery interval 1800
Switch(config)#interface Vlan1
Switch(config-if)# no ip addr
 << ess
Switch(config-if)# no ip route-cache
Switch(config-if)# shutdown
Switch(config-if)#interface Vlan92
Switch(config-if)#ip http server
Switch(config)#ip http secure-server
% Generating 1024 bit RSA keys, keys will be non-exportable...
Mar 30 02:3
 << 0:28: %LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan92, changed state to down
Mar 30 02:30:30: %LINK-5-CHANGED: Interface Vlan1, changed state to administratively down
[OK] (elapsed time was 6 seconds)

Switch(config)#logging facility local1
Sw
 << itch(config)#logging loghost.msstate.edu
Translating "loghost.msstate.edu"...domain server (130.18.2.210)
                       ^
% Invalid input detected at '^' marker.

Switch(config)#access-list 1 permit 10.92.0.0 0.0.255.255
Switch(config)#snmp
 << -server community sysnet RO 1
Switch(config)#snmp-server community c2-b2=a2 RW 1
Switch(config)#snmp-server enable traps snmp authentication linkdown linkup c$ enable traps snmp authenticatio
 << n linkdown linkup co         ldstart waps snmp authentication linkdown linkup coldstart wa         rmstart
Switch(config)#snmp-server enable tr
Mar 30 02:30:34: %SSH-5-ENABLE
 << D: SSH 1.99 has been enabledaps transceiver all
Switch(config)#snmp-server enable traps tty
Switch(config)#snmp-server enable traps cluster
Switch(config)#snmp-server enable traps config-copy
Switch(config)#snmp-server enable traps config
Switch(conf
 << ig)#snmp-server enable traps config-ctid
Switch(config)#snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-au$ enable traps dot1x auth-fail-vlan guest-vlan no-aut         h-f
 << ail-vlaps dot1x auth-fail-vlan guest-vlan no-auth-fail-vla         n no-guesuth-fail-vlan guest-vlan no-auth-fail-vlan no-gue
 << st         -vlan
Switch(config)#snmp-server enable traps entity
Switch(config)#snmp-server enable traps power-ethernet police
Switch(config)#snmp-server enable traps cpu threshold
Switch(config)#
Mar 30 02:30:34: snmp-server enable traps rep
 << 
Switch(config)#snmp-server enable traps bridge newroot topologychange
Switch(config)#snmp-server enable traps stpx inconsistency root-inconsistency$ enable traps stpx inconsistency root-inco
 << nsistency          loop-incoaps stpx inconsistency root-inconsistency loop-incon         sistency
Switch(config)#snmp-server enable traps syslog
Switch(config)#snmp-server en
 << able traps vtp
Switch(config)#snmp-server enable traps vlancreate
Switch(config)#snmp-server enable traps vlandelete
Switch(config)#snmp-server enabl%PKI-4-NOAUTOSAVE: Configuration was modified.  Issue "write memory" to save new certificatee traps fla
 << sh insertion removal
Switch(config)#snmp-server enable traps port-security
Switch(config)#snmp-server enable traps envmon fan shutdown supply temperatur$ enable traps envmon fan shutdown supp
 << ly temperature          status
Switch(config)#snmp-server enable traps errdisable
Switch(config)#snmp-server enable traps mac-notification change move threshol$ enable traps mac-noti
 << fication change move threshold         
Switch(config)#snmp-server enable traps vlan-membership
Switch(config)#snmp-server host 130.18.2.208 sysnet 
Switch(config)#line con 0
Switch(config-line)#line vty 0 4
Switch(config-line)# password Are
 << a=l*w
Switch(config-line)# login
Switch(config-line)#line vty 5 15
Switch(config-line)# password Area=l*w
Switch(config-line)# login
Switch(config-line)#ntp server 10.92.0.3
Switch(config)#end
Switch#
 << 
Mar 30 02:30:38: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
Switch#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
Expect: matched string 1: (config)#
 >> spanning-tree mode mst

 >> spanning-tree etherchannel guard misconfig

 >> spanning-tree mst configuration

 >>  name msstate

 >>  revision 1

 >>  instance 1 vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 63, 70

 >>  instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 160

 >>  instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 230, 232, 242, 246

 >>  instance 1 vlan 256, 611-612, 654, 741, 996, 999

 >>  instance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037, 2039-2040

 >>  instance 2 vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096, 2104, 2110, 2126

 >>  instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 2189, 2194, 2202

 >>  instance 2 vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 2654, 2999

 >>  instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176, 196

 >>  instance 3 vlan 244, 248, 927

 >>  instance 4 vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072, 2108, 2113, 2128

 >>  instance 4 vlan 2144, 2176, 2196, 2244, 2248, 2927

 >>  instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 228

 >>  instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216, 2228

 >>  instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116, 124

 >>  instance 7 vlan 172, 186, 192, 204-208, 210, 240-241, 251-252, 630, 928

 >>  instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082, 2084

 >>  instance 8 vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208, 2210

 >>  instance 8 vlan 2240-2241, 2251-2252, 2630, 2928

 >>  instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102, 112

 >>  instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 500, 505, 510-511

 >>  instance 9 vlan 522, 551-570, 603, 629, 633, 742, 802, 926, 929

 >>  instance 10 vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 2057, 2062, 2068

 >>  instance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148, 2158

 >>  instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522, 2603, 2629, 2633

 >>  instance 10 vlan 2802, 2926, 2929

 >>  instance 11 vlan 8, 43, 52, 146, 156-157, 180, 200, 218

 >>  instance 12 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180, 2200, 2218

 >> 

 >> end

Expect: searching for 1 strs:  :Configured
 << spanning-tree mode mst
Switch(config)#spanning-tree etherchannel guard misconfig
Switch(config)#spanning-tree mst configuration
Switch(config-mst)# name msstate
Switch(config-mst)# revision 1
Switch(config-mst)# instance 1 vlan 2, 7, 11, 20, 22, 24, 
 << 31, 35, 37, 39-40, $ vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40, 5         0, 60, 63, 11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 
 << 63,          70
Switch(config-mst)# instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 1$ vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 14         0, 152, 1
 << 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 16         0
Switch(config-mst)# instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 23$ vlan 162-1
 << 63, 168, 189, 194, 202, 220, 222, 230         , 232, 24163, 168, 189, 194, 202, 220, 222, 230, 232, 242         , 246
Switch(config-mst)# instance 1 vlan 256, 611-612, 654, 741, 9
 << 96, 999
Switch(config-mst)# instance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031,$ vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031,          2035, 203
 << , 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037         , 2039-2011, 2020, 2022, 2024, 2031, 2035, 2037, 2039-204         0
Switch(config-mst)# instance 2 v
 << lan 2050, 2060, 2063, 2070, 2080, 2086, 2096,$ vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096,          2104, 211, 2060, 2063, 2070,
 <<  2080, 2086, 2096, 2104, 2110         , 2126
Switch(config-mst)# instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, $ vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 2         
 << 189, 2194, 2140, 2152, 2160, 2162-2163, 2168, 2189, 2194,          2202
Switch(config-mst)# instance 2 vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 
 << $ vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 2         654, 2999
Switch(config-mst)# instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128$ vlan 42, 51, 59, 64
 << , 66, 69, 72, 108, 113, 128,          144, 17651, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176,          196
Switch(config-mst)# instance 3 vlan 244, 248, 927
Switch(config-mst)# 
 << instance 4 vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072,$ vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072,          2108, 211, 2051,
 <<  2059, 2064, 2066, 2069, 2072, 2108, 2113         , 2128
Switch(config-mst)# instance 4 vlan 2144, 2176, 2196, 2244, 2248, 2927
Switch(config-mst)# instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 2
 << $ vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 22         8
Switch(config-mst)# instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-$ vlan 2016, 2048, 2058, 2088, 
 << 2121, 2131, 2133-2         134, 2216, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216,          2228
Switch(config-mst)# instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97,
 << $ vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97,          114, 116,3-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116,          1
 << 24
Switch(config-mst)# instance 7 vlan 172, 186, 192, 204-208, 210, 240-241, 251$ vlan 172, 186, 192, 204-208, 210, 240-241, 251-         252, 630,
 << 186, 192, 204-208, 210, 240-241, 251-252, 630,          928
Switch(config-mst)# instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, $ vlan 2009, 2033-2034, 2038, 2054
 << , 2056, 2071, 2         075, 2082, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082,          2084
Switch(config-mst)# instance 8 vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192,
 << $ vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192,          2204-2208, 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208,          221
 << 0
Switch(config-mst)# instance 8 vlan 2240-2241, 2251-2252, 2630, 2928
Switch(config-mst)# instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 9$ vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 
 << 98         -99, 102,12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102,          112
Switch(config-mst)# instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 50
 << $ vlan 130, 132, 147-148, 158, 212, 226, 236, 500         , 505, 51132, 147-148, 158, 212, 226, 236, 500, 505, 510         -511
Switch(config-mst
 << )# instance 9 vlan 522, 551-570, 603, 629, 633, 742, 802, 92$ vlan 522, 551-570, 603, 629, 633, 742, 802, 926         , 929
Switch(config-mst)# instance 10 vlan 2004-2005, 2012, 2018-2019
 << , 2032, 2044, $0 vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 2         057, 20624-2005, 2012, 2018-2019, 2032, 2044, 2057, 2062,  
 <<         2068
Switch(config-mst)# instance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132,$0 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132,          2147-2148
 << 6, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148,          2158
Switch(config-mst)# instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522,$0 vlan 221
 << 2, 2236, 2500, 2505, 2510-2511, 2522,          2603, 2622, 2236, 2500, 2505, 2510-2511, 2522, 2603, 2629         , 2633
Switch(config-mst)# instance 10 vlan 2802, 2926, 2929
Swit
 << ch(config-mst)# instance 11 vlan 8, 43, 52, 146, 156-157, 180, 200, 218
Switch(config-mst)# instance 12 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180,$2 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180
 << ,          2200, 2218, 2043, 2052, 2146, 2156-2157, 2180, 2200, 2218         
Switch(config-mst)#
Switch(config-mst)#end
Switch#
 << 
Mar 30 02:30:54: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
Switch#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
Expect: matched string 1: (config)#
 >> hostname c29s1c.r256.allen 

Expect: searching for 2 strs:  :# :>
 << hostname c29s1c.r256.allen 
c29s1c.r256.allen(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s1c.r256.allen#
 << 
Mar 30 02:31:01: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1c.r256.allen#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1c.r256.allen(config)#
Expect: matched string 1: (config)#
 >> snmp-server contact  

Expect: searching for 1 strs:  :#
 << snmp-server contact  
% Incomplete command.

c29s1c.r256.allen(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s1c.r256.allen#
 << 
Mar 30 02:31:07: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1c.r256.allen#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1c.r256.allen(config)#
Expect: matched string 1: (config)#
 >> interface vlan 92

Expect: searching for 1 strs:  :(config-if)#
 << interface vlan 92
c29s1c.r256.allen(config-if)#
Expect: matched string 1: (config-if)#
 >> ip address 10.92.1.201 255.255.0.0

 >> ip broadcast-address 10.92.255.255

 >> end

Expect: searching for 1 strs:  :Configured
 << ip address 10.92.1.201 255.255.0.0
c29s1c.r256.allen(config-if)#ip broadcast-address 10.92.255.255
c29s1c.r256.allen(config-if)#end
c29s1c.r256.allen#
 << 
Mar 30 02:31:13: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1c.r256.allen#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1c.r256.allen(config)#
Expect: matched string 1: (config)#
 >> interface Vlan92

Expect: searching for 1 strs:  :(config-if)#
 << interface Vlan92
c29s1c.r256.allen(config-if)#
Expect: matched string 1: (config-if)#
 >> ip default-gateway 10.92.0.1

 >> end

Expect: searching for 1 strs:  :Configured
 << ip default-gateway 10.92.0.1
c29s1c.r256.allen(config)#end
c29s1c.r256.allen#
Mar 30 02:31:19: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1c.r256.allen#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1c.r256.allen(config)#
Expect: matched string 1: (config)#
 >> ip dhcp snooping

Expect: searching for 1 strs:  :#
 << ip dhcp snooping
c29s1c.r256.allen(config)#
Expect: matched string 1: #
 >> ip dhcp snooping vlan 24

Expect: searching for 1 strs:  :#
 << ip dhcp snooping vlan 24
c29s1c.r256.allen(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s1c.r256.allen#
Mar 30 02:31:26: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1c.r256.allen#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1c.r256.allen(config)#
Expect: matched string 1: (config)#
 >> default interface range fa0/1 - 8 

 >> interface range fa0/1 - 8 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range fa0/1 - 8 
c29s1c.r256.allen(config)#interface range fa0/1 - 8 
c29s1c.r256.allen(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport access vlan 24

 >> switchport mode access

 >> spanning-tree portfast

 >> switchport port-security maximum 2

 >> switchport port-security

 >> switchport port-security aging time 15

 >> switchport port-security violation protect

 >> switchport port-security aging type inactivity

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport access vlan 24
c29s1c.r256.allen(config-if-range)#switchport mode access
c29s1c.r256.allen(config-if-range)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, concentrator
 << s, switches, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast will be configured in 8 interfaces due to the range command 
 but will only have effect when the interfaces ar
 << e in a non-trunking mode.
c29s1c.r256.allen(config-if-range)#switchport port-security maximum 2
c29s1c.r256.allen(config-if-range)#switchport port-security
c29s1c.r256.allen(config-if-range)#switchport port-security aging time 15
c29s1c.r256.allen(con
 << fig-if-range)#switchport port-security violation protect
c29s1c.r256.allen(config-if-range)#switchport port-security aging type inacti$port-security aging type inactiv         ity
c29s1c.r256.allen(conf
 << ig-if-range)#end
c29s1c.r256.allen#
 << 
Mar 30 02:31:40: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1c.r256.allen#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1c.r256.allen(config)#
Expect: matched string 1: (config)#
 >> default interface range gi0/1 - 2 

 >> interface range gi0/1 - 2 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi0/1 - 2 
c29s1c.r256.allen(config)#interface range gi0/1 - 2 
c29s1c.r256.allen(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport mode trunk

 >> switchport trunk native vlan 92

 >> ip dhcp snooping trust

 >> no keepalive

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport mode trunk
c29s1c.r256.allen(config-if-range)#switchport trunk native vlan 92
c29s1c.r256.allen(config-if-range)#ip dhcp snooping trust
c29s1c.r256.allen(config-if-range)#no keepalive
c29s1c.r256.allen(config-if-range)#end
c29s1c.r256.alle
 << n#
 << 
Mar 30 02:31:51: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> write mem

Expect: searching for 2 strs:  :# :>
 << 
c29s1c.r256.allen#write mem
Building configuration...
[OK]
c29s1c.r256.allen#
Expect: matched string 1: #
 >> 
Expect: searching for 2 strs:  :# :>
 << 
c29s1c.r256.allen#
c29s1c.r256.allen#
Expect: matched string 1: #
 >> sh run

Expect: searching for 2 strs:  :# :>
 << sh run
Building configuration...

Current configuration : 9444 bytes
!
! Last configuration change at 02:31:51 CDT Wed Mar 30 2011
! NVRAM config last updated at 02:31:59 CDT Wed Mar 30 2011
!
version 15.0
no service pad
service timestamps debug
 <<  datetime localtime
service timestamps log datetime localtime
service password-encryption
!
hostname c29s1c.r256.allen
!
boot-start-marker
boot-end-marker
!
enable secret 5 $1$qED6$qmxCrzCDPaDmzrFjcf1jU1
enable password 7 08005E4B0844095D05
!

 << no aaa new-model
clock summer-time CDT recurring
system mtu routing 1500
authentication mac-move permit
!
!
ip dhcp snooping vlan 24
ip dhcp snooping
ip domain-name mgmt.msstate.edu
ip name-server 130.18.2.210
!
!
crypto pki trustpoint TP-self
 << -signed-3285370752
 enrollment selfsigned
 subject-name cn=IOS-Self-Signed-Certificate-3285370752
 revocation-check none
 rsakeypair TP-self-signed-3285370752
!
!
crypto pki certificate chain TP-self-signed-3285370752
 certificate self-signed 01

 <<   3082022B 30820194 A0030201 02020101 300D0609 2A864886 F70D0101 05050030 
  31312F30 2D060355 04031326 494F532D 53656C66 2D536967 6E65642D 43657274 
  69666963 6174652D 33323835 33373037 3532301E 170D3131 30333330 30313330 
  33345A17 0D323030 3130313
 << 0 30303030 305A3031 312F302D 06035504 03132649 
  4F532D53 656C662D 5369676E 65642D43 65727469 66696361 74652D33 32383533 
  37303735 3230819F 300D0609 2A864886 F70D0101 01050003 818D0030 81890281 
  8100AADC 97474CE6 F4165464 E73C9EB8 79D8999C F5339C9
 << 8 6258E86B 4AC94D91 
  656B3B7D D0D21AC2 5A1FF76A AB8444E8 14EC940F 613AC1E0 AD249EF5 C16599AC 
  697781E4 A9117FB4 F22C7690 A922A121 7F9328A9 5B1D34FC CCD9EE59 7C6FC6F2 
  F71F546B 620BEB4F B5A42EB3 F9B9B576 642BEB11 82AE6CDB CCFCD31B 4A9B6CD0 
  AB1
 << B0203 010001A3 53305130 0F060355 1D130101 FF040530 030101FF 301F0603 
  551D2304 18301680 14445316 4D77EA00 3B776856 7AACA497 A562D93C 3A301D06 
  03551D0E 04160414 4453164D 77EA003B 7768567A ACA497A5 62D93C3A 300D0609 
  2A864886 F70D0101 05050003 818
 << 10098 DD089AEF 8E7808BC 055DFE2E 578F1DE0 
  F312BCDC 6C274D5D 18322BB6 9CFE65D0 A33B4C0D D8EEBA38 D19C2452 E68524D0 
  78333897 21B70E00 1DC65927 AB56B14D C981D1F2 D12A33FE CB47222F 5EA866B5 
  E1047AC7 3A20B71F 74315612 8FD0596A E1A6D4C1 30278983 D36
 << B68DA 2C94920E 
  7FA5CEB5 3D77FCC4 224CF804 700421
  	quit
!
spanning-tree mode mst
spanning-tree portfast bpduguard default
spanning-tree extend system-id
!
spanning-tree mst configuration
 name msstate
 revision 1
 instance 1 vlan 2, 7, 11, 
 << 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 63, 70
 instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 160
 instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 230, 232, 242, 246
 instance 1 vlan 256, 611-612, 654, 741, 996, 999
 instance
 <<  2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037, 2039-2040
 instance 2 vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096, 2104, 2110, 2126
 instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 2189, 2194, 2202
 instance 2 vlan 2220, 2222, 
 << 2232, 2242, 2246, 2611-2612, 2654, 2999
 instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176, 196
 instance 3 vlan 244, 248, 927
 instance 4 vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072, 2108, 2113, 2128
 instance 4 vlan 2144, 2176, 2
 << 196, 2244, 2248, 2927
 instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 228
 instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216, 2228
 instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116, 124
 instance 7 vlan 172
 << , 186, 192, 204-208, 210, 240-241, 251-252, 630, 928
 instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082, 2084
 instance 8 vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208, 2210
 instance 8 vlan 2240-2241, 2251-2252, 2630, 2928
 << 
 instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102, 112
 instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 500, 505, 510-511
 instance 9 vlan 522, 551-570, 603, 629, 633, 742, 802, 926, 929
 instance 10 vlan 2004-2005, 2012, 201
 << 8-2019, 2032, 2044, 2057, 2062, 2068
 instance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148, 2158
 instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522, 2603, 2629, 2633
 instance 10 vlan 2802, 2926, 2929
 instance 11 vlan 8, 43, 52,
 <<  146, 156-157, 180, 200, 218
 instance 12 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180, 2200, 2218
!
!
!
!
!
!
errdisable recovery cause udld
errdisable recovery cause bpduguard
errdisable recovery cause security-violation
errdisable recovery c
 << ause channel-misconfig (STP)
errdisable recovery cause pagp-flap
errdisable recovery cause dtp-flap
errdisable recovery cause link-flap
errdisable recovery cause sfp-config-mismatch
errdisable recovery cause gbic-invalid
errdisable recovery cause ps
 << ecure-violation
errdisable recovery cause port-mode-failure
errdisable recovery cause dhcp-rate-limit
errdisable recovery cause pppoe-ia-rate-limit
errdisable recovery cause mac-limit
errdisable recovery cause vmps
errdisable recovery cause storm-co
 << ntrol
errdisable recovery cause inline-power
errdisable recovery cause arp-inspection
errdisable recovery cause loopback
errdisable recovery cause small-frame
errdisable recovery cause psp
errdisable recovery interval 1800
!
!
!
!
vlan internal
 <<  allocation policy ascending
!
!
! 
!
!
!
!
!
!
!
!
interface FastEthernet0/1
 switchport access vlan 24
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switc
 << hport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface FastEthernet0/2
 switchport access vlan 24
 switchport mode access
 switchport port-security maximum 2
 switchport port-secur
 << ity
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface FastEthernet0/3
 switchport access vlan 24
 switchport mode access
 switch
 << port port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface FastEthernet0/4
 switchp
 << ort access vlan 24
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-t
 << ree portfast
!
interface FastEthernet0/5
 switchport access vlan 24
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchp
 << ort port-security aging type inactivity
 spanning-tree portfast
!
interface FastEthernet0/6
 switchport access vlan 24
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 
 << switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface FastEthernet0/7
 switchport access vlan 24
 switchport mode access
 switchport port-security maximum 2
 switchport port-
 << security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface FastEthernet0/8
 switchport access vlan 24
 switchport mode access
 s
 << witchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet0/1

 <<  switchport trunk native vlan 92
 switchport mode trunk
 ip dhcp snooping trust
!
interface GigabitEthernet0/2
 switchport trunk native vlan 92
 switchport mode trunk
 ip dhcp snooping trust
!
interface Vlan1
 no ip address
 no ip route-cache

 <<  shutdown
!
interface Vlan92
 ip address 10.92.1.201 255.255.0.0
 ip broadcast-address 10.92.255.255
!
ip default-gateway 10.92.0.1
ip http server
ip http secure-server
!
logging facility local1
access-list 1 permit 10.92.0.0 0.0.255.255
snmp-
 << server community sysnet RO 1
snmp-server community c2-b2=a2 RW 1
snmp-server enable traps snmp authentication linkdown linkup coldstart warmstart
snmp-server enable traps transceiver all
snmp-server enable traps tty
snmp-server enable traps cluster

 << snmp-server enable traps config-copy
snmp-server enable traps config
snmp-server enable traps config-ctid
snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-auth-fail-vlan no-guest-vlan
snmp-server enable traps entity
snmp-server enable trap
 << s power-ethernet police
snmp-server enable traps cpu threshold
snmp-server enable traps rep
snmp-server enable traps bridge newroot topologychange
snmp-server enable traps stpx inconsistency root-inconsistency loop-inconsistency
snmp-server enable tr
 << aps syslog
snmp-server enable traps vtp
snmp-server enable traps vlancreate
snmp-server enable traps vlandelete
snmp-server enable traps flash insertion removal
snmp-server enable traps port-security
snmp-server enable traps envmon fan shutdown supp
 << ly temperature status
snmp-server enable traps errdisable
snmp-server enable traps mac-notification change move threshold
snmp-server enable traps vlan-membership
snmp-server host 130.18.2.208 sysnet 
!
!
line con 0
line vty 0 4
 password 7 01321
 << 4015A560A4536
 login
line vty 5 15
 password 7 06271D244D13055312
 login
!
ntp server 10.92.0.3
end

c29s1c.r256.allen#
Expect: matched string 1: #
 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1c.r256.allen(config)#
Expect: matched string 1: (config)#
 >> no service pad

 >> service timestamps debug datetime localtime

 >> service timestamps log datetime localtime

 >> service password-encryption

 >> boot-start-marker

 >> boot-end-marker

 >> enable secret Area=l*w

 >> enable password Area=l*w

 >> no aaa new-model

 >> clock summer-time CDT recurring

 >> authentication mac-move permit

 >> ip domain-name mgmt.msstate.edu

 >> ip name-server 130.18.2.210

 >> vtp domain vtp01.mgmt.msstate.edu

 >> vtp mode client

 >> crypto pki trustpoint TP-self-signed-2494998912

 >>  enrollment selfsigned

 >>  subject-name cn=IOS-Self-Signed-Certificate-2494998912

 >>  revocation-check none

 >>  rsakeypair TP-self-signed-2494998912

 >> crypto pki certificate chain TP-self-signed-2494998912

 >>  certificate self-signed 01 nvram:IOS-Self-Sig#3232.cer

 >> spanning-tree portfast bpduguard default

 >> spanning-tree extend system-id

 >> vlan internal allocation policy ascending

 >> errdisable recovery cause all

 >> errdisable recovery interval 1800

 >> interface Vlan1

 >>  no ip address

 >>  no ip route-cache

 >>  shutdown

 >> interface Vlan92

 >> ip http server

 >> ip http secure-server

 >> logging facility local1

 >> access-list 1 permit 10.92.0.0 0.0.255.255

 >> snmp-server community sysnet RO 1

 >> snmp-server community c2-b2=a2 RW 1

 >> snmp-server enable traps snmp authentication linkdown linkup coldstart warmstart

 >> snmp-server enable traps transceiver all

 >> snmp-server enable traps tty

 >> snmp-server enable traps cluster

 >> snmp-server enable traps config-copy

 >> snmp-server enable traps config

 >> snmp-server enable traps config-ctid

 >> snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-auth-fail-vlan no-guest-vlan

 >> snmp-server enable traps entity

 >> snmp-server enable traps power-ethernet police

 >> snmp-server enable traps cpu threshold

 >> snmp-server enable traps rep

 >> snmp-server enable traps bridge newroot topologychange

 >> snmp-server enable traps stpx inconsistency root-inconsistency loop-inconsistency

 >> snmp-server enable traps syslog

 >> snmp-server enable traps vtp

 >> snmp-server enable traps vlancreate

 >> snmp-server enable traps vlandelete

 >> snmp-server enable traps flash insertion removal

 >> snmp-server enable traps port-security

 >> snmp-server enable traps envmon fan shutdown supply temperature status

 >> snmp-server enable traps errdisable

 >> snmp-server enable traps mac-notification change move threshold

 >> snmp-server enable traps vlan-membership

 >> snmp-server host 130.18.2.208 sysnet 

 >> line con 0

 >> line vty 0 4

 >>  password Area=l*w

 >>  login

 >> line vty 5 15

 >>  password Area=l*w

 >>  login

 >> ntp server 10.92.0.3

 >> end

Expect: searching for 1 strs:  :Configured
 << no service pad
c29s1c.r256.allen(config)#service timestamps debug datetime localtime
c29s1c.r256.allen(config)#service timestamps log datetime localtime
c29s1c.r256.allen(config)#service password-encryption
c29s1c.r256.allen(config)#boot-start-marker
 << 
c29s1c.r256.allen(config)#boot-end-marker
c29s1c.r256.allen(config)#enable secret Area=l*w
The enable secret you have chosen is the same as your enable password.
This is not recommended.  Re-enter the enable secret.

c29s1c.r256.allen(config)#enable
 <<  password Area=l*w
The enable password you have chosen is the same as your enable secret.
This is not recommended.  Re-enter the enable password.

c29s1c.r256.allen(config)#no aaa new-model
c29s1c.r256.allen(config)#clock summer-time CDT recurring
c
 << 29s1c.r256.allen(config)#authentication mac-move permit
c29s1c.r256.allen(config)#ip domain-name mgmt.msstate.edu
c29s1c.r256.allen(config)#ip name-server 130.18.2.210
c29s1c.r256.allen(config)#vtp domain vtp01.mgmt.msstate.edu
Domain name already set
 <<  to vtp01.mgmt.msstate.edu.
c29s1c.r256.allen(config)#vtp mode client
Device mode already VTP Client for VLANS.
c29s1c.r256.allen(config)#crypto pki trustpoint TP-self-signed-2494998912
c29s1c.r256.allen(ca-trustpoint)# enrollment selfsigned
c29s1c.r
 << 256.allen(ca-trustpoint)# subject-name cn=IOS-Self-Signed-Certificate$me cn=IOS-Self-Signed-Certificate-         249499891Self-Signed-Certificate-2494998912   
 <<       
c29s1c.r256.allen(ca-trustpoint)# revocation-check none
c29s1c.r256.allen(ca-trustpoint)# rsakeypair TP-self-signed-2494998912
c29s1c.r256.allen(ca-trustpoint)#crypto pki certificate chain TP-self-signed-
 << $certificate chain TP-self-signed-2         494998912
c29s1c.r256.allen(config-cert-chain)# certificate self-signed 01 nvram:IOS-Se$e self-signed 01 nvram:IOS-Sel         f-Sig#323
 << ned 01 nvram:IOS-Self-Sig#3232         .cer
c29s1c.r256.allen(config-cert-chain)#spanning-tree portfast bpduguard default
c29s1c.r256.allen(config)#spanning-tree extend system-id
c29s1c.r256.allen(config)#vla
 << n internal allocation policy ascending
c29s1c.r256.allen(config)#errdisable recovery cause all
c29s1c.r256.allen(config)#errdisable recovery interval 1800
c29s1c.r256.allen(config)#
Mar 30 02:33:57: % Multiple self signed certificates in config
    c
 << ertificate for trust point TP-self-signed-2494998912 ignored
interface Vlan1
c29s1c.r256.allen(config-if)# no ip address
c29s1c.r256.allen(config-if)# no ip route-cache
c29s1c.r256.allen(config-if)# shutdown
c29s1c.r256.allen(config-if)#interface Vla
 << n92
c29s1c.r256.allen(config-if)#ip http server
c29s1c.r256.allen(config)#ip http secure-server
c29s1c.r256.allen(config)#logging facility local1
c29s1c.r256.allen(config)#access-list 1 permit 10.92.0.0 0.0.255.255
c29s1c.r256.allen(config)#snmp-serv
 << er community sysnet RO 1
c29s1c.r256.allen(config)#snmp-server community c2-b2=a2 RW 1
c29s1c.r256.allen(config)#snmp-server enable traps snmp authentication linkdo$ enable traps snmp authentication lin
 << kdow         n linkup aps snmp authentication linkdown linkup c         oldstart uthentication linkdown linkup coldstart w         
 << armstart
c29s1c.r256.allen(config)#snmp-server enable traps transceiver all
c29s1c.r256.allen(config)#snmp-server enable traps tty
c29s1c.r256.allen(config)#snmp-server enable traps cluster
c29s1c.r256.allen(config)#snmp-server enable traps config-
 << copy
c29s1c.r256.allen(config)#snmp-server enable traps config
c29s1c.r256.allen(config)#snmp-server enable traps config-ctid
c29s1c.r256.allen(config)#snmp-server enable traps dot1x auth-fail-vlan guest
 << $ enable traps dot1x auth-fail-vlan guest-         vlan no-aaps dot1x auth-fail-vlan guest-vlan no-au         th-fail-vuth-fail-vlan gue
 << st-vlan no-auth-fail-vl         an no-guevlan guest-vlan no-auth-fail-vlan no-gues         t-vlan
c29s1c.r256.allen(config)#snmp-server enable traps entity
c29s1c.r256.allen(config)#snm
 << p-server enable traps power-ethernet police
c29s1c.r256.allen(config)#snmp-server enable traps cpu threshold
c29s1c.r256.allen(config)#snmp-server enable traps rep
c29s1c.r256.allen(config)#snmp-server enable traps bridge newroot topologycha
 << $ enable traps bridge newroot topologychan         ge
c29s1c.r256.allen(config)#snmp-server enable traps stpx inconsistency root-in$ enable traps stpx inc
 << onsistency root-inc         onsistencaps stpx inconsistency root-inconsistency          loop-incnconsistency root-inconsistency loop-inco
 <<          nsistency
c29s1c.r256.allen(config)#snmp-server enable traps syslog
c29s1c.r256.allen(config)#snmp-server enable traps vtp
c29s1c.r256.allen(config)#snmp-server enable traps vlancreate
c29s1c.r256.allen(config)#snmp-server enable tra
 << ps vlandelete
c29s1c.r256.allen(config)#snmp-server enable traps flash insertion removal
c29s1c.r256.allen(config)#snmp-server enable traps port-security
c29s1c.r256.allen(config)#snmp-server enable traps envmon fan shutdown supply
 << $ enable traps envmon fan shutdown supply          temperatuaps envmon fan shutdown supply temperatur         e status
c29s1c.r256.allen(config)#snmp-server
 <<  enable traps errdisable
c29s1c.r256.allen(config)#snmp-server enable traps mac-notification change mo$ enable traps mac-notification change mov         e thresho
 << aps mac-notification change move threshol         d
c29s1c.r256.allen(config)#snmp-server enable traps vlan-membership
c29s1c.r256.allen(config)#snmp-server host 130.18.2.208 sysnet 
c29s1c.r256.allen(config)#line con 0
c29s
 << 1c.r256.allen(config-line)#line vty 0 4
c29s1c.r256.allen(config-line)# password Area=l*w
c29s1c.r256.allen(config-line)# login
c29s1c.r256.allen(config-line)#line vty 5 15
c29s1c.r256.allen(config-line)# password Area=l*w
c29s1c.r256.allen(config-li
 << ne)# login
c29s1c.r256.allen(config-line)#ntp server 10.92.0.3
c29s1c.r256.allen(config)#end
c29s1c.r256.allen#
 << 
Mar 30 02:34:08: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1c.r256.allen#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1c.r256.allen(config)#
Expect: matched string 1: (config)#
 >> spanning-tree mode mst

 >> spanning-tree etherchannel guard misconfig

 >> spanning-tree mst configuration

 >>  name msstate

 >>  revision 1

 >>  instance 1 vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 63, 70

 >>  instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 160

 >>  instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 230, 232, 242, 246

 >>  instance 1 vlan 256, 611-612, 654, 741, 996, 999

 >>  instance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037, 2039-2040

 >>  instance 2 vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096, 2104, 2110, 2126

 >>  instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 2189, 2194, 2202

 >>  instance 2 vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 2654, 2999

 >>  instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176, 196

 >>  instance 3 vlan 244, 248, 927

 >>  instance 4 vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072, 2108, 2113, 2128

 >>  instance 4 vlan 2144, 2176, 2196, 2244, 2248, 2927

 >>  instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 228

 >>  instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216, 2228

 >>  instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116, 124

 >>  instance 7 vlan 172, 186, 192, 204-208, 210, 240-241, 251-252, 630, 928

 >>  instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082, 2084

 >>  instance 8 vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208, 2210

 >>  instance 8 vlan 2240-2241, 2251-2252, 2630, 2928

 >>  instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102, 112

 >>  instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 500, 505, 510-511

 >>  instance 9 vlan 522, 551-570, 603, 629, 633, 742, 802, 926, 929

 >>  instance 10 vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 2057, 2062, 2068

 >>  instance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148, 2158

 >>  instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522, 2603, 2629, 2633

 >>  instance 10 vlan 2802, 2926, 2929

 >>  instance 11 vlan 8, 43, 52, 146, 156-157, 180, 200, 218

 >>  instance 12 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180, 2200, 2218

 >> 

 >> end

Expect: searching for 1 strs:  :Configured
 << spanning-tree mode mst
c29s1c.r256.allen(config)#spanning-tree etherchannel guard misconfig
c29s1c.r256.allen(config)#spanning-tree mst configuration
c29s1c.r256.allen(config-mst)# name msstate
c29s1c.r256.allen(config-mst)# revision 1
c29s1c.r256.al
 << len(config-mst)# instance 1 vlan 2, 7, 11, 20, 22, 24, 31, 35, $ vlan 2, 7, 11, 20, 22, 24, 31, 35, 3         7, 39-40,, 11, 20, 22, 24, 31, 35, 37, 39-4
 << 0,          50, 60, 622, 24, 31, 35, 37, 39-40, 50, 60, 63         , 70
c29s1c.r256.allen(config-mst)# instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 
 << $ vlan 78, 80, 86, 91, 96, 104, 110, 1         26, 136, 80, 86, 91, 96, 104, 110, 126, 136, 1         40, 152, , 96, 104, 110, 126, 136, 14
 << 0, 152, 1         60
c29s1c.r256.allen(config-mst)# instance 1 vlan 162-163, 168, 189, 194, 202, 2$ vlan 162-163, 168, 189, 194, 202, 22         0, 222, 2
 << 163, 168, 189, 194, 202, 220, 222, 23         0, 232, 289, 194, 202, 220, 222, 230, 232, 24         2, 246
c29s1c.r256.allen(config-mst)# instance 1 vlan 256, 611-612, 654, 741, 99
 << 6, 9$ vlan 256, 611-612, 654, 741, 996, 99         9
c29s1c.r256.allen(config-mst)# instance 2 vlan 2002, 2007, 2011, 2020, 2022, $ vlan 2002, 2007, 20
 << 11, 2020, 2022, 2         024, 2031, 2007, 2011, 2020, 2022, 2024, 2031,          2035, 2011, 2020, 2022, 2024, 2031, 2035, 203         
 << 7, 2039-22022, 2024, 2031, 2035, 2037, 2039-20         40
c29s1c.r256.allen(config-mst)# instance 2 vlan 2050, 2060, 2063, 2070, 2080, $ vlan 2050, 2060
 << , 2063, 2070, 2080, 2         086, 2096, 2060, 2063, 2070, 2080, 2086, 2096,          2104, 2163, 2070, 2080, 2086, 2096, 2104, 211         
 << 0, 2126
c29s1c.r256.allen(config-mst)# instance 2 vlan 2136, 2140, 2152, 2160, 2162-2$ vlan 2136, 2140, 2152, 2160, 2162-21         63, 2168,, 2140,
 <<  2152, 2160, 2162-2163, 2168,          2189, 21952, 2160, 2162-2163, 2168, 2189, 2194         , 2202
c29s1c.r256.allen(config-mst)# instance 2 vlan 2220, 2222, 2232, 2242, 2246, 
 << $ vlan 2220, 2222, 2232, 2242, 2246, 2         611-2612,, 2222, 2232, 2242, 2246, 2611-2612,          2654, 299
 << 32, 2242, 2246, 2611-2612, 2654, 2999         
c29s1c.r256.allen(config-mst)# instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 10$ vlan 42, 51, 59, 64, 66, 69, 72, 108         , 113, 12
 << 51, 59, 64, 66, 69, 72, 108, 113, 128         , 144, 17, 66, 69, 72, 108, 113, 128, 144, 176         , 196
c29s1c.r256.allen(config-mst)# instance 3 vla
 << n 244, 248, 927
c29s1c.r256.allen(config-mst)# instance 4 vlan 2042, 2051, 2059, 2064, 2066, $ vlan 2042, 2051, 2059, 2064, 2066, 2         069, 2072, 2
 << 051, 2059, 2064, 2066, 2069, 2072,          2108, 2159, 2064, 2066, 2069, 2072, 2108, 211         3, 2128
c29s1c.r256.allen(config-mst)# instance 4 vlan 2144, 2176, 2196, 2244, 2248, 
 << $ vlan 2144, 2176, 2196, 2244, 2248, 2         927
c29s1c.r256.allen(config-mst)# instance 5 vlan 16, 48, 58, 88, 121, 131, 133-$ vlan 16, 48, 58, 88, 121, 13
 << 1, 133-1         34, 216, 48, 58, 88, 121, 131, 133-134, 216, 2         28
c29s1c.r256.allen(config-mst)# instance 6 vlan 2016, 2048, 2058, 2088, 2121, 
 << $ vlan 2016, 2048, 2058, 2088, 2121, 2         131, 2133, 2048, 2058, 2088, 2121, 2131, 2133-         2134, 22158, 2088, 2121, 2131, 213
 << 3-2134, 2216         , 2228
c29s1c.r256.allen(config-mst)# instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, $ vlan 9, 33-34, 38, 54, 56, 71, 75, 8         2, 84, 97
 << 3-34, 38, 54, 56, 71, 75, 82, 84, 97,          114, 11654, 56, 71, 75, 82, 84, 97, 114, 116,          124
c29s1c.r256.allen(config-mst)# instance 7 vlan 172, 186, 192, 204-
 << 208, 210, 2$ vlan 172, 186, 192, 204-208, 210, 24         0-241, 25186, 192, 204-208, 210, 240-241, 251         -252, 630
 << 204-208, 210, 240-241, 251-252, 630,          928
c29s1c.r256.allen(config-mst)# instance 8 vlan 2009, 2033-2034, 2038, 2054, 2$ vlan 2009, 2033-2034, 2038, 2054, 20         
 << 56, 2071,, 2033-2034, 2038, 2054, 2056, 2071,          2075, 2084, 2038, 2054, 2056, 2071, 2075, 2082         , 2084
c29s1c.r256.allen(con
 << fig-mst)# instance 8 vlan 2097, 2114, 2116, 2124, 2172, $ vlan 2097, 2114, 2116, 2124, 2172, 2         186, 2192, 2114, 2116, 2124, 2172, 2186, 2192,    
 <<       2204-22016, 2124, 2172, 2186, 2192, 2204-2208         , 2210
c29s1c.r256.allen(config-mst)# instance 8 vlan 2240-2241, 2251-2252, 2630, 29
 << $ vlan 2240-2241, 2251-2252, 2630, 292         8
c29s1c.r256.allen(config-mst)# instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62$ vlan 4-5, 12, 18-19, 32, 44, 57, 62,          68, 76, 
 << 12, 18-19, 32, 44, 57, 62, 68, 76, 9         8-99, 102, 32, 44, 57, 62, 68, 76, 98-99, 102,          112
c29s1c.r256.allen(config-mst)# instance 9 vlan
 <<  130, 132, 147-148, 158, 212, 2$ vlan 130, 132, 147-148, 158, 212, 22         6, 236, 5132, 147-148, 158, 212, 226, 236, 50         0, 505, 5
 << 148, 158, 212, 226, 236, 500, 505, 51         0-511
c29s1c.r256.allen(config-mst)# instance 9 vlan 522, 551-570, 603, 629, 633, 7$ vlan 522, 551-570, 603, 6
 << 29, 633, 74         2, 802, 9551-570, 603, 629, 633, 742, 802, 92         6, 929
c29s1c.r256.allen(config-mst)# instance 10 vlan 2004-2005, 2012, 2018-2019, 2
 << $0 vlan 2004-2005, 2012, 2018-2019, 20         32, 2044,4-2005, 2012, 2018-2019, 2032, 2044,          2057, 20612, 2018-2019, 2032,
 <<  2044, 2057, 2062         , 2068
c29s1c.r256.allen(config-mst)# instance 10 vlan 2076, 2098-2099, 2102, 2112, $0 vlan 2076, 2098-2099, 2102, 2112, 2         130, 2132
 << 6, 2098-2099, 2102, 2112, 2130, 2132,          2147-21499, 2102, 2112, 2130, 2132, 2147-2148         , 2158
c29s1c.r256.allen(config-mst)# instance 10 vlan 2212, 2236,
 <<  2500, 2505, 2510-$0 vlan 2212, 2236, 2500, 2505, 2510-2         511, 25222, 2236, 2500, 2505, 2510-2511, 2522,          2603, 26
 << 500, 2505, 2510-2511, 2522, 2603, 262         9, 2633
c29s1c.r256.allen(config-mst)# instance 10 vlan 2802, 2926, 2929
c29s1c.r256.allen(config-mst)# instance 11 vlan 8, 43, 52, 146, 156-157, 180,
 << $1 vlan 8, 43, 52, 146, 156-157, 180,          200, 218
c29s1c.r256.allen(config-mst)# instance 12 vlan 2008, 2043, 2052, 2146, 2156-$2 vlan 2008, 2043, 2052, 2146, 215
 << 6-2         157, 21808, 2043, 2052, 2146, 2156-2157, 2180,          2200, 22052, 2146, 2156-2157, 2180, 2200, 221         8
c29s1c.r256
 << .allen(config-mst)#
c29s1c.r256.allen(config-mst)#end
c29s1c.r256.allen#
 << 
Mar 30 02:34:25: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1c.r256.allen#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1c.r256.allen(config)#
Expect: matched string 1: (config)#
 >> hostname c29s1c.r256.allen 

Expect: searching for 2 strs:  :# :>
 << hostname c29s1c.r256.allen 
c29s1c.r256.allen(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s1c.r256.allen#
 << 
Mar 30 02:34:32: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1c.r256.allen#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1c.r256.allen(config)#
Expect: matched string 1: (config)#
 >> snmp-server contact  

Expect: searching for 1 strs:  :#
 << snmp-server contact  
% Incomplete command.

c29s1c.r256.allen(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s1c.r256.allen#
 << 
Mar 30 02:34:38: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1c.r256.allen#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1c.r256.allen(config)#
Expect: matched string 1: (config)#
 >> interface vlan 92

Expect: searching for 1 strs:  :(config-if)#
 << interface vlan 92
c29s1c.r256.allen(config-if)#
Expect: matched string 1: (config-if)#
 >> ip address 10.92.1.201 255.255.0.0

 >> ip broadcast-address 10.92.255.255

 >> end

Expect: searching for 1 strs:  :Configured
 << ip address 10.92.1.201 255.255.0.0
c29s1c.r256.allen(config-if)#ip broadcast-address 10.92.255.255
c29s1c.r256.allen(config-if)#end
c29s1c.r256.allen#
 << 
Mar 30 02:34:44: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1c.r256.allen#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1c.r256.allen(config)#
Expect: matched string 1: (config)#
 >> interface Vlan92

Expect: searching for 1 strs:  :(config-if)#
 << interface Vlan92
c29s1c.r256.allen(config-if)#
Expect: matched string 1: (config-if)#
 >> ip default-gateway 10.92.0.1

 >> end

Expect: searching for 1 strs:  :Configured
 << ip default-gateway 10.92.0.1
c29s1c.r256.allen(config)#end
c29s1c.r256.allen#
Mar 30 02:34:50: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1c.r256.allen#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1c.r256.allen(config)#
Expect: matched string 1: (config)#
 >> ip dhcp snooping

Expect: searching for 1 strs:  :#
 << ip dhcp snooping
c29s1c.r256.allen(config)#
Expect: matched string 1: #
 >> ip dhcp snooping vlan 24

Expect: searching for 1 strs:  :#
 << ip dhcp snooping vlan 24
c29s1c.r256.allen(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s1c.r256.allen#
Mar 30 02:34:57: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1c.r256.allen#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1c.r256.allen(config)#
Expect: matched string 1: (config)#
 >> default interface range fa0/1 - 8 

 >> interface range fa0/1 - 8 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range fa0/1 - 8 
c29s1c.r256.allen(config)#interface range fa0/1 - 8 
c29s1c.r256.allen(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport access vlan 24

 >> switchport mode access

 >> spanning-tree portfast

 >> switchport port-security maximum 2

 >> switchport port-security

 >> switchport port-security aging time 15

 >> switchport port-security violation protect

 >> switchport port-security aging type inactivity

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport access vlan 24
c29s1c.r256.allen(config-if-range)#switchport mode access
c29s1c.r256.allen(config-if-range)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, concentrator
 << s, switches, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast will be configured in 8 interfaces due to the range command 
 but will only have effect when the interfaces ar
 << e in a non-trunking mode.
c29s1c.r256.allen(config-if-range)#switchport port-security maximum 2
c29s1c.r256.allen(config-if-range)#switchport port-security
c29s1c.r256.allen(config-if-range)#switchport port-security aging time 15
c29s1c.r256.allen(con
 << fig-if-range)#switchport port-security violation protect
c29s1c.r256.allen(config-if-range)#switchport port-security aging type inacti$port-security aging type inactiv         ity
c29s1c.r256.allen(conf
 << ig-if-range)#end
c29s1c.r256.allen#
 << 
Mar 30 02:35:10: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1c.r256.allen#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1c.r256.allen(config)#
Expect: matched string 1: (config)#
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s1c.r256.allen#
 << 
Mar 30 02:35:19: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> write mem

Expect: searching for 2 strs:  :# :>
 << 
c29s1c.r256.allen#write mem
Building configuration...
[OK]
c29s1c.r256.allen#
Expect: matched string 1: #
 >> 
Expect: searching for 2 strs:  :# :>
 << 
c29s1c.r256.allen#
c29s1c.r256.allen#
Expect: matched string 1: #
 >> sh run

Expect: searching for 2 strs:  :# :>
 << sh run
Building configuration...

Current configuration : 8097 bytes
!
! Last configuration change at 02:35:19 CDT Wed Mar 30 2011
! NVRAM config last updated at 02:35:27 CDT Wed Mar 30 2011
!
version 15.0
no service pad
service timestamps debug
 <<  datetime localtime
service timestamps log datetime localtime
service password-encryption
!
hostname c29s1c.r256.allen
!
boot-start-marker
boot-end-marker
!
enable secret 5 $1$VOia$I0YENRuZlzO2GGHGmG1Q71
enable password 7 0227165E0A5B036B5B
!

 << no aaa new-model
clock summer-time CDT recurring
system mtu routing 1500
authentication mac-move permit
!
!
ip dhcp snooping vlan 24
ip dhcp snooping
ip domain-name mgmt.msstate.edu
ip name-server 130.18.2.210
!
!
crypto pki trustpoint TP-self
 << -signed-2494998912
 enrollment selfsigned
 subject-name cn=IOS-Self-Signed-Certificate-2494998912
 revocation-check none
 rsakeypair TP-self-signed-2494998912
!
!
crypto pki certificate chain TP-self-signed-2494998912
!
spanning-tree mode mst
sp
 << anning-tree portfast bpduguard default
spanning-tree extend system-id
!
spanning-tree mst configuration
 name msstate
 revision 1
 instance 1 vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 63, 70
 instance 1 vlan 78, 80, 86, 91, 96, 104, 110
 << , 126, 136, 140, 152, 160
 instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 230, 232, 242, 246
 instance 1 vlan 256, 611-612, 654, 741, 996, 999
 instance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037, 2039-2040
 instance 2 vlan 20
 << 50, 2060, 2063, 2070, 2080, 2086, 2096, 2104, 2110, 2126
 instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 2189, 2194, 2202
 instance 2 vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 2654, 2999
 instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 1
 << 13, 128, 144, 176, 196
 instance 3 vlan 244, 248, 927
 instance 4 vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072, 2108, 2113, 2128
 instance 4 vlan 2144, 2176, 2196, 2244, 2248, 2927
 instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 228
 instan
 << ce 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216, 2228
 instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116, 124
 instance 7 vlan 172, 186, 192, 204-208, 210, 240-241, 251-252, 630, 928
 instance 8 vlan 2009, 2033-2034, 2038
 << , 2054, 2056, 2071, 2075, 2082, 2084
 instance 8 vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208, 2210
 instance 8 vlan 2240-2241, 2251-2252, 2630, 2928
 instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102, 112
 instance 9 vlan
 <<  130, 132, 147-148, 158, 212, 226, 236, 500, 505, 510-511
 instance 9 vlan 522, 551-570, 603, 629, 633, 742, 802, 926, 929
 instance 10 vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 2057, 2062, 2068
 instance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2
 << 132, 2147-2148, 2158
 instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522, 2603, 2629, 2633
 instance 10 vlan 2802, 2926, 2929
 instance 11 vlan 8, 43, 52, 146, 156-157, 180, 200, 218
 instance 12 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180, 220
 << 0, 2218
!
!
!
!
!
!
errdisable recovery cause udld
errdisable recovery cause bpduguard
errdisable recovery cause security-violation
errdisable recovery cause channel-misconfig (STP)
errdisable recovery cause pagp-flap
errdisable recovery cause
 <<  dtp-flap
errdisable recovery cause link-flap
errdisable recovery cause sfp-config-mismatch
errdisable recovery cause gbic-invalid
errdisable recovery cause psecure-violation
errdisable recovery cause port-mode-failure
errdisable recovery cause dhcp
 << -rate-limit
errdisable recovery cause pppoe-ia-rate-limit
errdisable recovery cause mac-limit
errdisable recovery cause vmps
errdisable recovery cause storm-control
errdisable recovery cause inline-power
errdisable recovery cause arp-inspection
err
 << disable recovery cause loopback
errdisable recovery cause small-frame
errdisable recovery cause psp
errdisable recovery interval 1800
!
!
!
!
vlan internal allocation policy ascending
!
!
! 
!
!
!
!
!
!
!
!
interface FastEthernet0/1
 
 << switchport access vlan 24
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spa
 << nning-tree portfast
!
interface FastEthernet0/2
 switchport access vlan 24
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 
 << switchport port-security aging type inactivity
 spanning-tree portfast
!
interface FastEthernet0/3
 switchport access vlan 24
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging tim
 << e 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface FastEthernet0/4
 switchport access vlan 24
 switchport mode access
 switchport port-security maximum 2
 switchpor
 << t port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface FastEthernet0/5
 switchport access vlan 24
 switchport mode acc
 << ess
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface FastEthernet0
 << /6
 switchport access vlan 24
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 << 
 spanning-tree portfast
!
interface FastEthernet0/7
 switchport access vlan 24
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation prote
 << ct
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface FastEthernet0/8
 switchport access vlan 24
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security agin
 << g time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet0/1
 switchport trunk native vlan 92
 switchport mode trunk
 ip dhcp snooping trust
!
interf
 << ace GigabitEthernet0/2
 switchport trunk native vlan 92
 switchport mode trunk
 ip dhcp snooping trust
!
interface Vlan1
 no ip address
 no ip route-cache
 shutdown
!
interface Vlan92
 ip address 10.92.1.201 255.255.0.0
 ip broadcast-address 1
 << 0.92.255.255
!
ip default-gateway 10.92.0.1
ip http server
ip http secure-server
!
logging facility local1
access-list 1 permit 10.92.0.0 0.0.255.255
snmp-server community sysnet RO 1
snmp-server community c2-b2=a2 RW 1
snmp-server enable traps 
 << snmp authentication linkdown linkup coldstart warmstart
snmp-server enable traps transceiver all
snmp-server enable traps tty
snmp-server enable traps cluster
snmp-server enable traps config-copy
snmp-server enable traps config
snmp-server enable tr
 << aps config-ctid
snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-auth-fail-vlan no-guest-vlan
snmp-server enable traps entity
snmp-server enable traps power-ethernet police
snmp-server enable traps cpu threshold
snmp-server enable traps re
 << p
snmp-server enable traps bridge newroot topologychange
snmp-server enable traps stpx inconsistency root-inconsistency loop-inconsistency
snmp-server enable traps syslog
snmp-server enable traps vtp
snmp-server enable traps vlancreate
snmp-server e
 << nable traps vlandelete
snmp-server enable traps flash insertion removal
snmp-server enable traps port-security
snmp-server enable traps envmon fan shutdown supply temperature status
snmp-server enable traps errdisable
snmp-server enable traps mac-not
 << ification change move threshold
snmp-server enable traps vlan-membership
snmp-server host 130.18.2.208 sysnet 
!
!
line con 0
line vty 0 4
 password 7 002501030506074C18
 login
line vty 5 15
 password 7 132405170A5108603C
 login
!
ntp server 
 << 10.92.0.3
end

c29s1c.r256.allen#
Expect: matched string 1: #
 >> show interface status

Expect: searching for 2 strs:  :# :>
 << show interface status

Port      Name               Status       Vlan       Duplex  Speed Type
Fa0/1                        notconnect   24           auto   auto 10/100BaseTX
Fa0/2                        notconnect   24           auto   auto 10/100Bas
 << eTX
Fa0/3                        notconnect   24           auto   auto 10/100BaseTX
Fa0/4                        notconnect   24           auto   auto 10/100BaseTX
Fa0/5                        notconnect   24           auto   auto 10/100BaseTX
Fa0/6  
 <<                       notconnect   24           auto   auto 10/100BaseTX
Fa0/7                        notconnect   24           auto   auto 10/100BaseTX
Fa0/8                        notconnect   24           auto   auto 10/100BaseTX
Gi0/1              
 <<           notconnect   1            auto   auto Not Present
Gi0/2                        notconnect   1            auto   auto Not Present
c29s1c.r256.allen#
Expect: matched string 1: #
