trying to use serial port: /dev/ttyUSB0
 >> 
 >> 

Expect: searching for 4 strs:  :[yes/no] :Press RETURN to get started. :# :Switch>
 << 
c29s1c.r113.cvm.wise#
c29s1c.r113.cvm.wise#
c29s1c.r113.cvm.wise#
c29s1c.r113.cvm.wise#
Expect: matched string 3: #
 >> term len 0

Expect: searching for 2 strs:  :# :>
 << term len 0
c29s1c.r113.cvm.wise#
Expect: matched string 1: #
 >> show version

Expect: searching for 2 strs:  :# :>
 << show version
Cisco IOS Software, C2960C Software (C2960c405-UNIVERSALK9-M), Version 15.0(2)SE5, RELEASE SOFTWARE (fc1)
Technical Support: http://www.cisco.com/techsupport
Copyright (c) 1986-2013 by Cisco Systems, Inc.
Compiled Fri 25-Oct-13 14:35 by p
 << rod_rel_team

ROM: Bootstrap program is C2960C boot loader
BOOTLDR: C2960C Boot Loader (C2960c405-HBOOT-M) Version 12.2(55r)EX9, RELEASE SOFTWARE (fc1)

c29s1c.r113.cvm.wise uptime is 7 minutes
System returned to ROM by power-on
System restarted at
 <<  02:27:24 CDT Wed Mar 30 2011
System image file is "flash:/c2960c405-universalk9-mz.150-2.SE5/c2960c405-universalk9-mz.150-2.SE5.bin"


This product contains cryptographic features and is subject to United
States and local country laws governing impo
 << rt, export, transfer and
use. Delivery of Cisco cryptographic products does not imply
third-party authority to import, export, distribute or use encryption.
Importers, exporters, distributors and users are responsible for
compliance with U.S. and loca
 << l country laws. By using this product you
agree to comply with applicable laws and regulations. If you are unable
to comply with U.S. and local laws, return this product immediately.

A summary of U.S. laws governing Cisco cryptographic products may b
 << e found at:
http://www.cisco.com/wwl/export/crypto/tool/stqrg.html

If you require further assistance please contact us by sending email to
export@cisco.com.

License Level: lanbase
License Type: Permanent
Next reload license Level: lanbase

cis
 << co WS-C2960C-8TC-L (PowerPC405) processor (revision F0) with 131072K bytes of memory.
Processor board ID FOC1845Y69R
Last reset from power-on
2 Virtual Ethernet interfaces
8 FastEthernet interfaces
2 Gigabit Ethernet interfaces
The password-recovery
 <<  mechanism is enabled.

64K bytes of flash-simulated non-volatile configuration memory.
Base ethernet MAC Address       : E0:89:9D:DB:E3:80
Motherboard assembly number     : 73-13530-04
Power supply part number        : 341-0208-02
Motherboard seria
 << l number       : FOC18453LZB
Power supply serial number      : LIT18420NUB
Model revision number           : F0
Motherboard revision number     : A0
Model number                    : WS-C2960C-8TC-L
System serial number            : FOC1845Y69R
Top 
 << Assembly Part Number        : 800-35230-01
Top Assembly Revision Number    : L0
Version ID                      : V01
CLEI Code Number                : CMMGB00ARA
Hardware Board Revision Number  : 0x01


Switch Ports Model              SW Version  
 <<           SW Image                 
------ ----- -----              ----------            ----------               
*    1 10    WS-C2960C-8TC-L    15.0(2)SE5            C2960c405-UNIVERSALK9-M  


Configuration register is 0xF

c29s1c.r113.cvm.wis
 << e#
Expect: matched string 1: #
 >> enable

Expect: searching for 2 strs:  :Password: :#
 << enable
c29s1c.r113.cvm.wise#
Expect: matched string 2: #
 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1c.r113.cvm.wise(config)#
Expect: matched string 1: (config)#
 >> no service pad

 >> service timestamps debug datetime localtime

 >> service timestamps log datetime localtime

 >> service password-encryption

 >> boot-start-marker

 >> boot-end-marker

 >> enable secret Area=l*w

 >> enable password Area=l*w

 >> no aaa new-model

 >> clock summer-time CDT recurring

 >> authentication mac-move permit

 >> ip domain-name mgmt.msstate.edu

 >> ip name-server 130.18.2.210

 >> vtp domain vtp01.mgmt.msstate.edu

 >> vtp mode client

 >> crypto pki trustpoint TP-self-signed-2494998912

 >>  enrollment selfsigned

 >>  subject-name cn=IOS-Self-Signed-Certificate-2494998912

 >>  revocation-check none

 >>  rsakeypair TP-self-signed-2494998912

 >> crypto pki certificate chain TP-self-signed-2494998912

 >>  certificate self-signed 01 nvram:IOS-Self-Sig#3232.cer

 >> spanning-tree portfast bpduguard default

 >> spanning-tree extend system-id

 >> vlan internal allocation policy ascending

 >> errdisable recovery cause all

 >> errdisable recovery interval 1800

 >> interface Vlan1

 >>  no ip address

 >>  no ip route-cache

 >>  shutdown

 >> interface Vlan92

 >> ip http server

 >> ip http secure-server

 >> logging facility local1

 >> access-list 1 permit 10.92.0.0 0.0.255.255

 >> snmp-server community sysnet RO 1

 >> snmp-server community c2-b2=a2 RW 1

 >> snmp-server enable traps snmp authentication linkdown linkup coldstart warmstart

 >> snmp-server enable traps transceiver all

 >> snmp-server enable traps tty

 >> snmp-server enable traps cluster

 >> snmp-server enable traps config-copy

 >> snmp-server enable traps config

 >> snmp-server enable traps config-ctid

 >> snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-auth-fail-vlan no-guest-vlan

 >> snmp-server enable traps entity

 >> snmp-server enable traps power-ethernet police

 >> snmp-server enable traps cpu threshold

 >> snmp-server enable traps rep

 >> snmp-server enable traps bridge newroot topologychange

 >> snmp-server enable traps stpx inconsistency root-inconsistency loop-inconsistency

 >> snmp-server enable traps syslog

 >> snmp-server enable traps vtp

 >> snmp-server enable traps vlancreate

 >> snmp-server enable traps vlandelete

 >> snmp-server enable traps flash insertion removal

 >> snmp-server enable traps port-security

 >> snmp-server enable traps envmon fan shutdown supply temperature status

 >> snmp-server enable traps errdisable

 >> snmp-server enable traps mac-notification change move threshold

 >> snmp-server enable traps vlan-membership

 >> snmp-server host 130.18.2.208 sysnet 

 >> line con 0

 >> line vty 0 4

 >>  password Area=l*w

 >>  login

 >> line vty 5 15

 >>  password Area=l*w

 >>  login

 >> ntp server 10.92.0.3

 >> end

Expect: searching for 1 strs:  :Configured
 << no service pad
c29s1c.r113.cvm.wise(config)#service timestamps debug datetime localtime
c29s1c.r113.cvm.wise(config)#service timestamps log datetime localtime
c29s1c.r113.cvm.wise(config)#service password-encryption
c29s1c.r113.cvm.wise(config)#boot-s
 << tart-marker
c29s1c.r113.cvm.wise(config)#boot-end-marker
c29s1c.r113.cvm.wise(config)#enable secret Area=l*w
The enable secret you have chosen is the same as your enable password.
This is not recommended.  Re-enter the enable secret.

c29s1c.r113.cv
 << m.wise(config)#enable password Area=l*w
The enable password you have chosen is the same as your enable secret.
This is not recommended.  Re-enter the enable password.

c29s1c.r113.cvm.wise(config)#no aaa new-model
c29s1c.r113.cvm.wise(config)#clock s
 << ummer-time CDT recurring
c29s1c.r113.cvm.wise(config)#authentication mac-move permit
c29s1c.r113.cvm.wise(config)#ip domain-name mgmt.msstate.edu
c29s1c.r113.cvm.wise(config)#ip name-server 130.18.2.210
c29s1c.r113.cvm.wise(config)#vtp domain vtp01.mg
 << mt.msstate.edu
Domain name already set to vtp01.mgmt.msstate.edu.
c29s1c.r113.cvm.wise(config)#vtp mode client
Device mode already VTP Client for VLANS.
c29s1c.r113.cvm.wise(config)#crypto pki trustpoint TP-self-signed-2494998912
c29s1c.r113.cvm.wise
 << (ca-trustpoint)# enrollment selfsigned
c29s1c.r113.cvm.wise(ca-trustpoint)# subject-name cn=IOS-Self-Signed-Certific$me cn=IOS-Self-Signed-Certifica         te-249499
 << Self-Signed-Certificate-2494998         912
c29s1c.r113.cvm.wise(ca-trustpoint)# revocation-check none
c29s1c.r113.cvm.wise(ca-trustpoint)# rsakeypair TP-self-signed-2494998912
c29s1c.r113.cvm.wise(ca-trustpoint)#crypto pki certificate chain
 <<  TP-self-sign$certificate chain TP-self-signe         d-2494998e chain TP-self-signed-24949989         12
c29s1c.r113.cvm.wise(config-cert-chain)# certific
 << ate self-signed 01 nvram:IOS$e self-signed 01 nvram:IOS-         Self-Sig#ned 01 nvram:IOS-Self-Sig#3         232.cer
c29s1c.r113.cvm.wise(config-cert-chain)#spann
 << ing-tree portfast bpduguard defa$ee portfast bpduguard defau         lt
c29s1c.r113.cvm.wise(config)#spanning-tree extend system-id
c29s1c.r113.cvm.wise(config)#vlan internal allocation policy ascending
c29
 << s1c.r113.cvm.wise(config)#errdisable recovery cause all
c29s1c.r113.cvm.wise(config)#errdisable recovery interval 1800
c29s1c.r113.cvm.wise(config)#
Mar 30 02:36:21: % Multiple self signed certificates in config
    certificate for trust point TP-self
 << -signed-2494998912 ignored
interface Vlan1
c29s1c.r113.cvm.wise(config-if)# no ip address
c29s1c.r113.cvm.wise(config-if)# no ip route-cache
c29s1c.r113.cvm.wise(config-if)# shutdown
c29s1c.r113.cvm.wise(config-if)#interface Vlan92
c29s1c.r113.cvm.w
 << ise(config-if)#ip http server
c29s1c.r113.cvm.wise(config)#ip http secure-server
c29s1c.r113.cvm.wise(config)#logging facility local1
c29s1c.r113.cvm.wise(config)#access-list 1 permit 10.92.0.0 0.0.255.255
c29s1c.r113.cvm.wise(config)#snmp-server comm
 << unity sysnet RO 1
c29s1c.r113.cvm.wise(config)#snmp-server community c2-b2=a2 RW 1
c29s1c.r113.cvm.wise(config)#snmp-server enable traps snmp authentication lin$ enable traps snmp authentication link      
 <<    down linkaps snmp authentication linkdown linku         p coldstauthentication linkdown linkup coldstar         t warmsta
 << ion linkdown linkup coldstart warmstar         t
c29s1c.r113.cvm.wise(config)#snmp-server enable traps transceiver all
c29s1c.r113.cvm.wise(config)#snmp-server enable traps tty
c29s1c.r113.cvm.wise(config)#
 << snmp-server enable traps cluster
c29s1c.r113.cvm.wise(config)#snmp-server enable traps config-copy
c29s1c.r113.cvm.wise(config)#snmp-server enable traps config
c29s1c.r113.cvm.wise(config)#snmp-server enable traps config-ctid
c29s1c.r113.cvm.wise(conf
 << ig)#snmp-server enable traps dot1x auth-fail-vlan gu$ enable traps dot1x auth-fail-vlan gue         st-vlan naps dot1x auth-fail-vlan guest-vlan no    
 <<      -auth-faiuth-fail-vlan guest-vlan no-auth-fail         -vlan no-vlan guest-vlan no-auth-fail-vlan no-g         uest-vlan
c29s1c.r
 << 113.cvm.wise(config)#snmp-server enable traps entity
c29s1c.r113.cvm.wise(config)#snmp-server enable traps power-ethernet police
c29s1c.r113.cvm.wise(config)#snmp-server enable traps cpu threshold
c29s1c.r113.cvm.wise(config)#snmp-server enable traps r
 << ep
c29s1c.r113.cvm.wise(config)#snmp-server enable traps bridge newroot topology$ enable traps bridge newroot topologyc         hange
c29s1c.r113.cvm.wise(config)#snmp-server enable traps stpx inc
 << onsistency root$ enable traps stpx inconsistency root-         inconsistaps stpx inconsistency root-inconsiste         ncy loop-
 << nconsistency root-inconsistency loop-i         nconsistecy root-inconsistency loop-inconsisten         cy
c29s1c.r113.cvm.wise(config)#snmp-server enable tr
 << aps syslog
c29s1c.r113.cvm.wise(config)#snmp-server enable traps vtp
c29s1c.r113.cvm.wise(config)#snmp-server enable traps vlancreate
c29s1c.r113.cvm.wise(config)#snmp-server enable traps vlandelete
c29s1c.r113.cvm.wise(config)#snmp-server enable trap
 << s flash insertion removal
c29s1c.r113.cvm.wise(config)#snmp-server enable traps port-security
c29s1c.r113.cvm.wise(config)#snmp-server enable traps envmon fan shutdown sup$ enable traps envmon fan shutdown
 <<  supp         ly temperaps envmon fan shutdown supply tempera         ture stat fan shutdown supply temperature statu         s
c29s1
 << c.r113.cvm.wise(config)#snmp-server enable traps errdisable
c29s1c.r113.cvm.wise(config)#snmp-server enable traps mac-notification change$ enable traps mac-notification change          move thre
 << aps mac-notification change move thres         hold
c29s1c.r113.cvm.wise(config)#snmp-server enable traps vlan-membership
c29s1c.r113.cvm.wise(config)#snmp-server host 130.18.2.208 sysnet 
c29s1c.r11
 << 3.cvm.wise(config)#line con 0
c29s1c.r113.cvm.wise(config-line)#line vty 0 4
c29s1c.r113.cvm.wise(config-line)# password Area=l*w
c29s1c.r113.cvm.wise(config-line)# login
c29s1c.r113.cvm.wise(config-line)#line vty 5 15
c29s1c.r113.cvm.wise(config-lin
 << e)# password Area=l*w
c29s1c.r113.cvm.wise(config-line)# login
c29s1c.r113.cvm.wise(config-line)#ntp server 10.92.0.3
c29s1c.r113.cvm.wise(config)#end
c29s1c.r113.cvm.wise#
 << 
Mar 30 02:36:32: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1c.r113.cvm.wise#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1c.r113.cvm.wise(config)#
Expect: matched string 1: (config)#
 >> spanning-tree mode mst

 >> spanning-tree etherchannel guard misconfig

 >> spanning-tree mst configuration

 >>  name msstate

 >>  revision 1

 >>  instance 1 vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 63, 70

 >>  instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 160

 >>  instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 230, 232, 242, 246

 >>  instance 1 vlan 256, 611-612, 654, 741, 996, 999

 >>  instance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037, 2039-2040

 >>  instance 2 vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096, 2104, 2110, 2126

 >>  instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 2189, 2194, 2202

 >>  instance 2 vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 2654, 2999

 >>  instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176, 196

 >>  instance 3 vlan 244, 248, 927

 >>  instance 4 vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072, 2108, 2113, 2128

 >>  instance 4 vlan 2144, 2176, 2196, 2244, 2248, 2927

 >>  instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 228

 >>  instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216, 2228

 >>  instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116, 124

 >>  instance 7 vlan 172, 186, 192, 204-208, 210, 240-241, 251-252, 630, 928

 >>  instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082, 2084

 >>  instance 8 vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208, 2210

 >>  instance 8 vlan 2240-2241, 2251-2252, 2630, 2928

 >>  instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102, 112

 >>  instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 500, 505, 510-511

 >>  instance 9 vlan 522, 551-570, 603, 629, 633, 742, 802, 926, 929

 >>  instance 10 vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 2057, 2062, 2068

 >>  instance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148, 2158

 >>  instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522, 2603, 2629, 2633

 >>  instance 10 vlan 2802, 2926, 2929

 >>  instance 11 vlan 8, 43, 52, 146, 156-157, 180, 200, 218

 >>  instance 12 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180, 2200, 2218

 >> 

 >> end

Expect: searching for 1 strs:  :Configured
 << spanning-tree mode mst
c29s1c.r113.cvm.wise(config)#spanning-tree etherchannel guard misconfig
c29s1c.r113.cvm.wise(config)#spanning-tree mst configuration
c29s1c.r113.cvm.wise(config-mst)# name msstate
c29s1c.r113.cvm.wise(config-mst)# revision 1
c2
 << 9s1c.r113.cvm.wise(config-mst)# instance 1 vlan 2, 7, 11, 20, 22, 24, 31, 3$ vlan 2, 7, 11, 20, 22, 24, 31, 35         , 37, 39-, 11, 20, 22, 24, 31, 35, 37, 3
 << 9-4         0, 50, 6022, 24, 31, 35, 37, 39-40, 50, 60,          63, 70
c29s1c.r113.cvm.wise(config-mst)# instance 1 vlan 78, 80, 86, 91, 96, 104, 11
 << $ vlan 78, 80, 86, 91, 96, 104, 110         , 126, 1380, 86, 91, 96, 104, 110, 126, 136         , 140, 15, 96, 104, 110, 126, 136, 140, 152         
 << , 160
c29s1c.r113.cvm.wise(config-mst)# instance 1 vlan 162-163, 168, 189, 194, 202$ vlan 162-163, 168, 189, 194, 202,          220, 222163, 168, 189, 1
 << 94, 202, 220, 222,          230, 23289, 194, 202, 220, 222, 230, 232,          242, 246
c29s1c.r113.cvm.wise(config-mst)# instance 1 vlan 256, 611-612, 654, 741, 996
 << $ vlan 256, 611-612, 654, 741, 996,          999
c29s1c.r113.cvm.wise(config-mst)# instance 2 vlan 2002, 2007, 2011, 2020, 202$ vlan 2002, 2007, 2011, 2020, 2022         , 2024,
 <<  2, 2007, 2011, 2020, 2022, 2024, 20         31, 2035,11, 2020, 2022, 2024, 2031, 2035,          2037, 20320
 << 22, 2024, 2031, 2035, 2037, 2039         -2040
c29s1c.r113.cvm.wise(config-mst)# instance 2 vlan 2050, 2060, 2063, 2070, 208$ vlan 2050, 2060, 2063, 2070, 2080         , 2086, 2
 << , 2060, 2063, 2070, 2080, 2086, 20         96, 2104,63, 2070, 2080, 2086, 2096, 2104,          2110, 2122080, 2086, 2096, 2
 << 104, 2110, 2126         
c29s1c.r113.cvm.wise(config-mst)# instance 2 vlan 2136, 2140, 2152, 2160, 216$ vlan 2136, 2140, 2152, 2160, 2162         -2163, 21
 << , 2140, 2152, 2160, 2162-2163, 216         8, 2189, 52, 2160, 2162-2163, 2168, 2189, 2         194, 2202
c29s1c.r113.cvm.wise(config-mst)# instance 2 vlan 2220, 2222, 2232, 2242, 224
 << $ vlan 2220, 2222, 2232, 2242, 2246         , 2611-26, 2222, 2232, 2242, 2246, 2611-261         2, 2654, 32, 224
 << 2, 2246, 2611-2612, 2654, 2         999
c29s1c.r113.cvm.wise(config-mst)# instance 3 vlan 42, 51, 59, 64, 66, 69, 72,$ vlan 42, 51, 59, 64, 66, 69, 72,          108, 113,
 << 51, 59, 64, 66, 69, 72, 108, 113,          128, 144,, 66, 69, 72, 108, 113, 128, 144,          176, 196
c29s1c.r113.cvm.wise(config-mst)# instance 3 vlan 244, 248, 927
c29
 << s1c.r113.cvm.wise(config-mst)# instance 4 vlan 2042, 2051, 2059, 2064, 206$ vlan 2042, 2051, 2059, 2064, 2066         , 2069, 2, 2051, 2059, 2064, 2066, 2069, 
 << 20         72, 2108,59, 2064, 2066, 2069, 2072, 2108,          2113, 2122066, 2069, 2072, 2108, 2113, 2128         
c29s1c.r113.cvm.wise(conf
 << ig-mst)# instance 4 vlan 2144, 2176, 2196, 2244, 224$ vlan 2144, 2176, 2196, 2244, 2248         , 2927
c29s1c.r113.cvm.wise(config-mst)# instance 5 vlan 16, 48, 58, 88, 121, 131, 1
 << $ vlan 16, 48, 58, 88, 121, 131, 13         3-134, 2148, 58, 88, 121, 131, 133-134, 216         , 228
c29s1c.r113.cvm.wise(config-mst)# instance 6 vlan 2016, 2048, 2058, 
 << 2088, 212$ vlan 2016, 2048, 2058, 2088, 2121         , 2131, 2, 2048, 2058, 2088, 2121, 2131, 21         33-2134, 
 << 58, 2088, 2121, 2131, 2133-2134, 2         216, 2228
c29s1c.r113.cvm.wise(config-mst)# instance 7 vlan 9, 33-34, 38, 54, 56, 71, 7$ vlan 9, 33-34, 38, 54, 56, 71, 75         , 82, 84,
 << 3-34, 38, 54, 56, 71, 75, 82, 84,          97, 114, 54, 56, 71, 75, 82, 84, 97, 114, 1         16, 124
c29s1c.r113.cvm.wise(config-mst)# instance 7 vlan
 <<  172, 186, 192, 204-208, 210$ vlan 172, 186, 192, 204-208, 210,          240-241,186, 192, 204-208, 210, 240-241,          251-252, 
 << 204-208, 210, 240-241, 251-252, 6         30, 928
c29s1c.r113.cvm.wise(config-mst)# instance 8 vlan 2009, 2033-2034, 2038, 2054$ vlan 2009, 2033-2034, 2038, 2054,         
 <<  2056, 20, 2033-2034, 2038, 2054, 2056, 207         1, 2075, 4, 2038, 2054, 2056, 2071, 2075, 2         082, 2084
c29s1c.r113.cvm.wise(config-mst)# 
 << instance 8 vlan 2097, 2114, 2116, 2124, 217$ vlan 2097, 2114, 2116, 2124, 2172         , 2186, 2, 2114, 2116, 2124, 2172, 2186, 21         92, 2204-
 << 16, 2124, 2172, 2186, 2192, 2204-2         208, 2210
c29s1c.r113.cvm.wise(config-mst)# instance 8 vlan 2240-2241, 2251-2252, 2630,$ vlan 2240-2241, 2251-2252, 2
 << 630,          2928
c29s1c.r113.cvm.wise(config-mst)# instance 9 vlan 4-5, 12, 18-19, 32, 44, 57,$ vlan 4-5, 12, 18-19, 32, 44, 57,          62, 68, 71
 << 2, 18-19, 32, 44, 57, 62, 68, 76         , 98-99, , 32, 44, 57, 62, 68, 76, 98-99, 1         02, 112
c29s1c.r113.cvm.wise(config-mst)# instance 9 vlan 130, 132, 147-148, 158, 212
 << $ vlan 130, 132, 147-148, 158, 212,          226, 236132, 147-148, 158, 212, 226, 236,          500, 505148, 158, 212, 226,
 <<  236, 500, 505,          510-511
c29s1c.r113.cvm.wise(config-mst)# instance 9 vlan 522, 551-570, 603, 629, 633$ vlan 522, 551-570, 603, 629, 633,          742, 802
 << 551-570, 603, 629, 633, 742, 802,          926, 929
c29s1c.r113.cvm.wise(config-mst)# instance 10 vlan 2004-2005, 2012, 2018-2019$0 vlan 2004-2005, 2012, 2018-2019,          2032,
 <<  204-2005, 2012, 2018-2019, 2032, 204         4, 2057, 12, 2018-2019, 2032, 2044, 2057, 2         062, 2068
c29s1c.r113.cvm.wise(config-mst)# instance
 <<  10 vlan 2076, 2098-2099, 2102, 211$0 vlan 2076, 2098-2099, 2102, 2112         , 2130, 26, 2098-2099, 2102, 2112, 2130, 21         32, 2147-
 << 99, 2102, 2112, 2130, 2132, 2147-2         148, 2158
c29s1c.r113.cvm.wise(config-mst)# instance 10 vlan 2212, 2236, 2500, 2505, 25$0 vlan 2212, 2236, 2500, 2505, 251   
 <<       0-2511, 22, 2236, 2500, 2505, 2510-2511, 25         22, 2603,500, 2505, 2510-2511, 2522, 2603,          2629, 263
 <<  2510-2511, 2522, 2603, 2629, 2633         
c29s1c.r113.cvm.wise(config-mst)# instance 10 vlan 2802, 2926, 2929
c29s1c.r113.cvm.wise(config-mst)# instance 11 vlan 8, 43, 52, 146, 156-157, 1
 << $1 vlan 8, 43, 52, 146, 156-157, 18         0, 200, 243, 52, 146, 156-157, 180, 200, 21         8
c29s1c.r113.cvm.wise(config-mst)# instance 12 vlan 2008, 2043, 2052, 2146, 21
 << $2 vlan 2008, 2043, 2052, 2146, 215         6-2157, 28, 2043, 2052, 2146, 2156-2157, 21         80, 2200,052, 2146, 
 << 2156-2157, 2180, 2200,          2218
c29s1c.r113.cvm.wise(config-mst)#
c29s1c.r113.cvm.wise(config-mst)#end
c29s1c.r113.cvm.wise#
 << 
Mar 30 02:36:50: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1c.r113.cvm.wise#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1c.r113.cvm.wise(config)#
Expect: matched string 1: (config)#
 >> hostname c29s1c.r113.wise 

Expect: searching for 2 strs:  :# :>
 << hostname c29s1c.r113.wise 
c29s1c.r113.wise(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s1c.r113.wise#
 << 
Mar 30 02:36:56: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1c.r113.wise#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1c.r113.wise(config)#
Expect: matched string 1: (config)#
 >> snmp-server contact  

Expect: searching for 1 strs:  :#
 << snmp-server contact  
% Incomplete command.

c29s1c.r113.wise(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s1c.r113.wise#
 << 
Mar 30 02:37:03: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1c.r113.wise#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1c.r113.wise(config)#
Expect: matched string 1: (config)#
 >> interface vlan 92

Expect: searching for 1 strs:  :(config-if)#
 << interface vlan 92
c29s1c.r113.wise(config-if)#
Expect: matched string 1: (config-if)#
 >> ip address 10.92.1.211 255.255.0.0

 >> ip broadcast-address 10.92.255.255

 >> end

Expect: searching for 1 strs:  :Configured
 << ip address 10.92.1.211 255.255.0.0
c29s1c.r113.wise(config-if)#ip broadcast-address 10.92.255.255
c29s1c.r113.wise(config-if)#end
c29s1c.r113.wise#
 << 
Mar 30 02:37:09: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1c.r113.wise#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1c.r113.wise(config)#
Expect: matched string 1: (config)#
 >> interface Vlan92

Expect: searching for 1 strs:  :(config-if)#
 << interface Vlan92
c29s1c.r113.wise(config-if)#
Expect: matched string 1: (config-if)#
 >> ip default-gateway 10.92.0.1

 >> end

Expect: searching for 1 strs:  :Configured
 << ip default-gateway 10.92.0.1
c29s1c.r113.wise(config)#end
c29s1c.r113.wise#
Mar 30 02:37:15: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1c.r113.wise#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1c.r113.wise(config)#
Expect: matched string 1: (config)#
 >> ip dhcp snooping

Expect: searching for 1 strs:  :#
 << ip dhcp snooping
c29s1c.r113.wise(config)#
Expect: matched string 1: #
 >> ip dhcp snooping vlan 136

Expect: searching for 1 strs:  :#
 << ip dhcp snooping vlan 136
c29s1c.r113.wise(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s1c.r113.wise#
Mar 30 02:37:22: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1c.r113.wise#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1c.r113.wise(config)#
Expect: matched string 1: (config)#
 >> default interface range fa0/1 - 8 

 >> interface range fa0/1 - 8 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range fa0/1 - 8 
c29s1c.r113.wise(config)#interface range fa0/1 - 8 
c29s1c.r113.wise(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport access vlan 136

 >> switchport mode access

 >> spanning-tree portfast

 >> switchport port-security maximum 2

 >> switchport port-security

 >> switchport port-security aging time 15

 >> switchport port-security violation protect

 >> switchport port-security aging type inactivity

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport access vlan 136
c29s1c.r113.wise(config-if-range)#switchport mode access
c29s1c.r113.wise(config-if-range)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, concentrators
 << , switches, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast will be configured in 8 interfaces due to the range command 
 but will only have effect when the interfaces are
 <<  in a non-trunking mode.
c29s1c.r113.wise(config-if-range)#switchport port-security maximum 2
c29s1c.r113.wise(config-if-range)#switchport port-security
c29s1c.r113.wise(config-if-range)#switchport port-security aging time 15
c29s1c.r113.wise(config-i
 << f-range)#switchport port-security violation protect
c29s1c.r113.wise(config-if-range)#switchport port-security aging type inactiv$port-security aging type inactivi         ty
c29s1c.r113.wise(config-if
 << -range)#end
c29s1c.r113.wise#
 << 
Mar 30 02:37:35: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1c.r113.wise#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1c.r113.wise(config)#
Expect: matched string 1: (config)#
 >> default interface range gi0/1 - 2 

 >> interface range gi0/1 - 2 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi0/1 - 2 
c29s1c.r113.wise(config)#interface range gi0/1 - 2 
c29s1c.r113.wise(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport mode trunk

 >> switchport trunk native vlan 92

 >> ip dhcp snooping trust

 >> no keepalive

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport mode trunk
c29s1c.r113.wise(config-if-range)#switchport trunk native vlan 92
c29s1c.r113.wise(config-if-range)#ip dhcp snooping trust
c29s1c.r113.wise(config-if-range)#no keepalive
c29s1c.r113.wise(config-if-range)#end
c29s1c.r113.wise#
 << 
Mar 30 02:37:46: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> write mem

Expect: searching for 2 strs:  :# :>
 << 
c29s1c.r113.wise#write mem
Building configuration...
[OK]
c29s1c.r113.wise#
Expect: matched string 1: #
 >> 
Expect: searching for 2 strs:  :# :>
 << 
c29s1c.r113.wise#
c29s1c.r113.wise#
Expect: matched string 1: #
 >> sh run

Expect: searching for 2 strs:  :# :>
 << sh run
Building configuration...

Current configuration : 8109 bytes
!
! Last configuration change at 02:37:46 CDT Wed Mar 30 2011
! NVRAM config last updated at 02:37:53 CDT Wed Mar 30 2011
!
version 15.0
no service pad
service timestamps debug
 <<  datetime localtime
service timestamps log datetime localtime
service password-encryption
!
hostname c29s1c.r113.wise
!
boot-start-marker
boot-end-marker
!
enable secret 5 $1$Wr0h$6NxMN9HH/eG0WTx24NKBc.
enable password 7 08005E4B0844095D05
!
n
 << o aaa new-model
clock summer-time CDT recurring
system mtu routing 1500
authentication mac-move permit
!
!
ip dhcp snooping vlan 136,152
ip dhcp snooping
ip domain-name mgmt.msstate.edu
ip name-server 130.18.2.210
!
!
crypto pki trustpoint TP-
 << self-signed-2494998912
 enrollment selfsigned
 subject-name cn=IOS-Self-Signed-Certificate-2494998912
 revocation-check none
 rsakeypair TP-self-signed-2494998912
!
!
crypto pki certificate chain TP-self-signed-2494998912
!
spanning-tree mode mst
 << 
spanning-tree portfast bpduguard default
spanning-tree extend system-id
!
spanning-tree mst configuration
 name msstate
 revision 1
 instance 1 vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 63, 70
 instance 1 vlan 78, 80, 86, 91, 96, 104,
 <<  110, 126, 136, 140, 152, 160
 instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 230, 232, 242, 246
 instance 1 vlan 256, 611-612, 654, 741, 996, 999
 instance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037, 2039-2040
 instance 2 vla
 << n 2050, 2060, 2063, 2070, 2080, 2086, 2096, 2104, 2110, 2126
 instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 2189, 2194, 2202
 instance 2 vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 2654, 2999
 instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 10
 << 8, 113, 128, 144, 176, 196
 instance 3 vlan 244, 248, 927
 instance 4 vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072, 2108, 2113, 2128
 instance 4 vlan 2144, 2176, 2196, 2244, 2248, 2927
 instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 228
 in
 << stance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216, 2228
 instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116, 124
 instance 7 vlan 172, 186, 192, 204-208, 210, 240-241, 251-252, 630, 928
 instance 8 vlan 2009, 2033-2034, 
 << 2038, 2054, 2056, 2071, 2075, 2082, 2084
 instance 8 vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208, 2210
 instance 8 vlan 2240-2241, 2251-2252, 2630, 2928
 instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102, 112
 instance 9 
 << vlan 130, 132, 147-148, 158, 212, 226, 236, 500, 505, 510-511
 instance 9 vlan 522, 551-570, 603, 629, 633, 742, 802, 926, 929
 instance 10 vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 2057, 2062, 2068
 instance 10 vlan 2076, 2098-2099, 2102, 2112, 213
 << 0, 2132, 2147-2148, 2158
 instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522, 2603, 2629, 2633
 instance 10 vlan 2802, 2926, 2929
 instance 11 vlan 8, 43, 52, 146, 156-157, 180, 200, 218
 instance 12 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180,
 <<  2200, 2218
!
!
!
!
!
!
errdisable recovery cause udld
errdisable recovery cause bpduguard
errdisable recovery cause security-violation
errdisable recovery cause channel-misconfig (STP)
errdisable recovery cause pagp-flap
errdisable recovery c
 << ause dtp-flap
errdisable recovery cause link-flap
errdisable recovery cause sfp-config-mismatch
errdisable recovery cause gbic-invalid
errdisable recovery cause psecure-violation
errdisable recovery cause port-mode-failure
errdisable recovery cause 
 << dhcp-rate-limit
errdisable recovery cause pppoe-ia-rate-limit
errdisable recovery cause mac-limit
errdisable recovery cause vmps
errdisable recovery cause storm-control
errdisable recovery cause inline-power
errdisable recovery cause arp-inspection
 << 
errdisable recovery cause loopback
errdisable recovery cause small-frame
errdisable recovery cause psp
errdisable recovery interval 1800
!
!
!
!
vlan internal allocation policy ascending
!
!
! 
!
!
!
!
!
!
!
!
interface FastEthernet0/
 << 1
 switchport access vlan 136
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 << 
 spanning-tree portfast
!
interface FastEthernet0/2
 switchport access vlan 136
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation prot
 << ect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface FastEthernet0/3
 switchport access vlan 136
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security ag
 << ing time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface FastEthernet0/4
 switchport access vlan 136
 switchport mode access
 switchport port-security maximum 2
 s
 << witchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface FastEthernet0/5
 switchport access vlan 136
 switchport
 <<  mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface Fast
 << Ethernet0/6
 switchport access vlan 136
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type i
 << nactivity
 spanning-tree portfast
!
interface FastEthernet0/7
 switchport access vlan 136
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security viol
 << ation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface FastEthernet0/8
 switchport access vlan 136
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-s
 << ecurity aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet0/1
 switchport trunk native vlan 92
 switchport mode trunk
 ip dhcp snooping trus
 << t
!
interface GigabitEthernet0/2
 switchport trunk native vlan 92
 switchport mode trunk
 ip dhcp snooping trust
!
interface Vlan1
 no ip address
 no ip route-cache
 shutdown
!
interface Vlan92
 ip address 10.92.1.211 255.255.0.0
 ip broadca
 << st-address 10.92.255.255
!
ip default-gateway 10.92.0.1
ip http server
ip http secure-server
!
logging facility local1
access-list 1 permit 10.92.0.0 0.0.255.255
snmp-server community sysnet RO 1
snmp-server community c2-b2=a2 RW 1
snmp-server e
 << nable traps snmp authentication linkdown linkup coldstart warmstart
snmp-server enable traps transceiver all
snmp-server enable traps tty
snmp-server enable traps cluster
snmp-server enable traps config-copy
snmp-server enable traps config
snmp-serv
 << er enable traps config-ctid
snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-auth-fail-vlan no-guest-vlan
snmp-server enable traps entity
snmp-server enable traps power-ethernet police
snmp-server enable traps cpu threshold
snmp-server ena
 << ble traps rep
snmp-server enable traps bridge newroot topologychange
snmp-server enable traps stpx inconsistency root-inconsistency loop-inconsistency
snmp-server enable traps syslog
snmp-server enable traps vtp
snmp-server enable traps vlancreate
s
 << nmp-server enable traps vlandelete
snmp-server enable traps flash insertion removal
snmp-server enable traps port-security
snmp-server enable traps envmon fan shutdown supply temperature status
snmp-server enable traps errdisable
snmp-server enable t
 << raps mac-notification change move threshold
snmp-server enable traps vlan-membership
snmp-server host 130.18.2.208 sysnet 
!
!
line con 0
line vty 0 4
 password 7 096D5C0C18581B581C
 login
line vty 5 15
 password 7 0227165E0A5B036B5B
 login
!
 << 
ntp server 10.92.0.3
end

c29s1c.r113.wise#
Expect: matched string 1: #
 >> show interface status

Expect: searching for 2 strs:  :# :>
 << show interface status

Port      Name               Status       Vlan       Duplex  Speed Type
Fa0/1                        notconnect   136          auto   auto 10/100BaseTX
Fa0/2                        notconnect   136          auto   auto 10/100Bas
 << eTX
Fa0/3                        notconnect   136          auto   auto 10/100BaseTX
Fa0/4                        notconnect   136          auto   auto 10/100BaseTX
Fa0/5                        notconnect   136          auto   auto 10/100BaseTX
Fa0/6  
 <<                       notconnect   136          auto   auto 10/100BaseTX
Fa0/7                        notconnect   136          auto   auto 10/100BaseTX
Fa0/8                        notconnect   136          auto   auto 10/100BaseTX
Gi0/1              
 <<           notconnect   1            auto   auto Not Present
Gi0/2                        notconnect   1            auto   auto Not Present
c29s1c.r113.wise#
Expect: matched string 1: #
