trying to use serial port: /dev/ttyUSB0
 >> 
 >> 

Expect: searching for 4 strs:  :[yes/no] :Press RETURN to get started. :# :Switch>
 << 
Switch>
Switch>
Switch>
Switch>
Expect: matched string 4: Switch>
 >> term len 0

Expect: searching for 2 strs:  :# :>
 << term len 0
Switch>
Expect: matched string 2: >
 >> show version

Expect: searching for 2 strs:  :# :>
 << show version
Cisco IOS Software, C3560CX Software (C3560CX-UNIVERSALK9-M), Version 15.2(3)E1, RELEASE SOFTWARE (fc3)
Technical Support: http://www.cisco.com/techsupport
Copyright (c) 1986-2015 by Cisco Systems, Inc.
Compiled Tue 28-Apr-15 01:46 by pro
 << d_rel_team

ROM: Bootstrap program is C3560CX boot loader
BOOTLDR: C3560CX Boot Loader (C3560CX-HBOOT-M) Version 15.2(3r)E, RELEASE SOFTWARE (fc1)

Switch uptime is 28 minutes
System returned to ROM by power-on
System restarted at 15:28:55 UTC Sat 
 << Apr 8 2000
System image file is "flash:/c3560cx-universalk9-mz.152-3.E1/c3560cx-universalk9-mz.152-3.E1.bin"
Last reload reason: Unknown reason



This product contains cryptographic features and is subject to United
States and local country laws g
 << overning import, export, transfer and
use. Delivery of Cisco cryptographic products does not imply
third-party authority to import, export, distribute or use encryption.
Importers, exporters, distributors and users are responsible for
compliance with 
 << U.S. and local country laws. By using this product you
agree to comply with applicable laws and regulations. If you are unable
to comply with U.S. and local laws, return this product immediately.

A summary of U.S. laws governing Cisco cryptographic p
 << roducts may be found at:
http://www.cisco.com/wwl/export/crypto/tool/stqrg.html

If you require further assistance please contact us by sending email to
export@cisco.com.

License Level: ipbase
License Type: Default. No valid license found.
Next r
 << eload license Level: ipbase

cisco WS-C3560CX-8PC-S (APM86XXX) processor (revision C0) with 524288K bytes of memory.
Processor board ID FOC1933Z0WT
Last reset from power-on
1 Virtual Ethernet interface
12 Gigabit Ethernet interfaces
The password-re
 << covery mechanism is enabled.

512K bytes of flash-simulated non-volatile configuration memory.
Base ethernet MAC Address       : 38:20:56:F8:87:80
Motherboard assembly number     : 73-16471-04
Power supply part number        : 341-0675-02
Motherboar
 << d serial number       : FOC1933007G
Power supply serial number      : DCC192001L0
Model revision number           : C0
Motherboard revision number     : A0
Model number                    : WS-C3560CX-8PC-S
System serial number            : FOC1933Z0
 << WT
Top Assembly Part Number        : 68-5359-01
Top Assembly Revision Number    : C0
Version ID                      : V01
CLEI Code Number                : CMM1400DRA
Hardware Board Revision Number  : 0x02


Switch Ports Model                    
 <<  SW Version            SW Image                 
------ ----- -----                     ----------            ----------               
*    1 12    WS-C3560CX-8PC-S          15.2(3)E1             C3560CX-UNIVERSALK9-M    


Configuration register is
 <<  0xF

Switch>
Expect: matched string 2: >
 >> enable

Expect: searching for 2 strs:  :Password: :#
 << enable
Switch#
Expect: matched string 2: #
 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
Expect: matched string 1: (config)#
 >> no service pad

 >> service timestamps debug datetime localtime

 >> service timestamps log datetime localtime

 >> service password-encryption

 >> logging buffered informational

 >> enable secret Area=l*w

 >> enable password Area=l*w

 >> no aaa new-model

 >> clock timezone CST -6

 >> clock summer-time CDT recurring

 >> system mtu routing 1500

 >> ip subnet-zero

 >> ip domain-name mgmt.msstate.edu

 >> ip name-server 130.18.80.13

 >> ip name-server 130.18.80.12

 >> vtp domain vtp01.mgmt.msstate.edu

 >> vtp mode client

 >> spanning-tree portfast bpduguard default

 >> spanning-tree extend system-id

 >> errdisable recovery cause all

 >> errdisable recovery interval 1800

 >> interface Vlan1

 >>  no ip address

 >>  no ip route-cache

 >> interface Vlan92

 >> no ip http server

 >> logging facility local1

 >> logging loghost.msstate.edu

 >> access-list 1 permit 10.92.0.0 0.0.255.255

 >> snmp-server community sysnet RO 1

 >> snmp-server community c2-b2=a2 RW 1

 >> snmp-server enable traps snmp authentication linkdown linkup coldstart warmstart

 >> snmp-server enable traps tty

 >> snmp-server enable traps cluster

 >> snmp-server enable traps config-copy

 >> snmp-server enable traps config

 >> snmp-server enable traps entity

 >> snmp-server enable traps power-ethernet group 1

 >> snmp-server enable traps cpu threshold

 >> snmp-server enable traps rtr

 >> snmp-server enable traps bridge newroot topologychange

 >> snmp-server enable traps stpx inconsistency root-inconsistency loop-inconsistency

 >> snmp-server enable traps syslog

 >> snmp-server enable traps vtp

 >> snmp-server enable traps vlancreate

 >> snmp-server enable traps vlandelete

 >> snmp-server enable traps flash insertion removal

 >> snmp-server enable traps port-security

 >> snmp-server enable traps envmon fan shutdown supply temperature status

 >> snmp-server enable traps vlan-membership

 >> snmp-server host 130.18.2.208 sysnet 

 >> line con 0

 >> line vty 0 4

 >>  password Area=l*w

 >>  login

 >> line vty 5 15

 >>  password Area=l*w

 >>  login

 >> ntp clock-period 36026023

 >> ntp server 10.92.0.3

 >> end

 >> end

Expect: searching for 1 strs:  :Configured
 << no service pad
Switch(config)#service timestamps debug datetime localtime
Switch(config)#service timestamps log datetime localtime
Switch(config)#service password-encryption
Switch(config)#logging buffered informational
Switch(config)#enable secret A
 << rea=l*w
Switch(config)#enable password Area=l*w
The enable password you have chosen is the same as your enable secret.
This is not recommended.  Re-enter the enable password.

Switch(config)#no aaa new-model
Switch(config)#clock timezone CST -6
Swi
 << tch(config)#clock summer-time CDT recurring
Switch(config)#system mtu routing 1500
Switch(config)#ip subnet-zero
Switch(config)#ip domain-name mgmt.msstate.edu
Switch(config)#
Apr  8 15:57:35: %SYS-5-LOG_CONFIG_CHANGE: Buffer logging: level informati
 << onal, xml disabled, filtering disabled, size (4096)ip name-server 130.18.80.13
Switch(config)#ip name-server 130.18.80.12
Switch(config)#vtp domain vtp01.mgmt.msstate.edu
Changing VTP domain name from NULL to vtp01.mgmt.msstate.edu
Switch(config)#vtp 
 << mode client
Setting device to VTP Client mode for VLANS.
Switch(config)#
Apr  8 09:57:36: %SYS-6-CLOCKUPDATE: System clock has been updated from 15:57:36 UTC Sat Apr 8 2000 to 09:57:36 CST Sat Apr 8 2000, configured from console by console.
Apr  8 10:
 << 57:36: %SYS-6-CLOCKUPDATE: System clock has been updated from 09:57:36 CST Sat Apr 8 2000 to 10:57:36 CDT Sat Apr 8 2000, configured from console by console.spanning-tree portfast bpduguard default
Switch(config)#spanning-tree extend system-id
Switch(co
 << nfig)#errdisable recovery cause all
Switch(config)#errdisable recovery interval 1800
Switch(config)#interface Vlan1
Switch(config-if)#
Apr  8 10:57:38: %SW_VLAN-6-VTP_DOMAIN_NAME_CHG: VTP domain name changed to vtp01.mgmt.msstate.edu. no ip address
S
 << witch(config-if)# no ip route-cache
Switch(config-if)#interface Vlan92
Switch(config-if)#no ip http server
Switch(config)#logging facility local1
Switch(config)#logging loghost.msstate.edu

Apr  8 10:57:40: %LINEPROTO-5-UPDOWN: Line protocol on Inter
 << face Vlan92, changed state to down
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 <<                        ^
% Invalid input detected at '^' marker.

Switch(config)#access-list 1 permit 10.92.0.0 0.0.255.255
Switch(config)#snmp-server community sysnet RO 1
Switch(config)#snmp-server community c2-b2=a2 RW 1
Switch(config)#snmp-serve
Expect: did not match any strings!
...
no service pad
Switch(config)#service timestamps debug datetime localtime
Switch(config)#service timestamps log datetime localtime
Switch(config)#service password-encryption
Switch(config)#logging buffered informational
Switch(config)#enable secret Area=l*w
Switch(config)#enable password Area=l*w
The enable password you have chosen is the same as your enable secret.
This is not recommended.  Re-enter the enable password.

Switch(config)#no aaa new-model
Switch(config)#clock timezone CST -6
Switch(config)#clock summer-time CDT recurring
Switch(config)#system mtu routing 1500
Switch(config)#ip subnet-zero
Switch(config)#ip domain-name mgmt.msstate.edu
Switch(config)#
Apr  8 15:57:35: %SYS-5-LOG_CONFIG_CHANGE: Buffer logging: level informational, xml disabled, filtering disabled, size (4096)ip name-server 130.18.80.13
Switch(config)#ip name-server 130.18.80.12
Switch(config)#vtp domain vtp01.mgmt.msstate.edu
Changing VTP domain name from NULL to vtp01.mgmt.msstate.edu
Switch(config)#vtp mode client
Setting device to VTP Client mode for VLANS.
Switch(config)#
Apr  8 09:57:36: %SYS-6-CLOCKUPDATE: System clock has been updated from 15:57:36 UTC Sat Apr 8 2000 to 09:57:36 CST Sat Apr 8 2000, configured from console by console.
Apr  8 10:57:36: %SYS-6-CLOCKUPDATE: System clock has been updated from 09:57:36 CST Sat Apr 8 2000 to 10:57:36 CDT Sat Apr 8 2000, configured from console by console.spanning-tree portfast bpduguard default
Switch(config)#spanning-tree extend system-id
Switch(config)#errdisable recovery cause all
Switch(config)#errdisable recovery interval 1800
Switch(config)#interface Vlan1
Switch(config-if)#
Apr  8 10:57:38: %SW_VLAN-6-VTP_DOMAIN_NAME_CHG: VTP domain name changed to vtp01.mgmt.msstate.edu. no ip address
Switch(config-if)# no ip route-cache
Switch(config-if)#interface Vlan92
Switch(config-if)#no ip http server
Switch(config)#logging facility local1
Switch(config)#logging loghost.msstate.edu

Apr  8 10:57:40: %LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan92, changed state to down                       ^
% Invalid input detected at '^' marker.

Switch(config)#access-list 1 permit 10.92.0.0 0.0.255.255
Switch(config)#snmp-server community sysnet RO 1
Switch(config)#snmp-server community c2-b2=a2 RW 1
Switch(config)#snmp-serve
...

 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << r enable traps snmp authentication linkdown linkup c$ enable traps snmp authentication linkdown linkup co         ldstart w
 << aps snmp authentication linkdown linkup coldstart wa         rmstart
Switch(config)#snmp-server enable traps tty
Switch(config)#snmp-server enable traps cluster
Switch(config)#snmp-server enable traps config-copy
Switch(config)#snmp-server en
Expect: matched string 1: (config)#
 >> spanning-tree mode mst

 >> spanning-tree etherchannel guard misconfig

 >> spanning-tree mst configuration

 >>  name msstate

 >>  revision 1

 >>  instance 1 vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 63, 70

 >>  instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 160

 >>  instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 230, 232, 242, 246

 >>  instance 1 vlan 256, 611-612, 654, 741, 996, 999

 >>  instance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037, 2039-2040

 >>  instance 2 vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096, 2104, 2110, 2126

 >>  instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 2189, 2194, 2202

 >>  instance 2 vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 2654, 2999

 >>  instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176, 196

 >>  instance 3 vlan 244, 248, 927

 >>  instance 4 vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072, 2108, 2113, 2128

 >>  instance 4 vlan 2144, 2176, 2196, 2244, 2248, 2927

 >>  instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 228

 >>  instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216, 2228

 >>  instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116, 124

 >>  instance 7 vlan 172, 186, 192, 204-208, 210, 240-241, 251-252, 630, 928

 >>  instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082, 2084

 >>  instance 8 vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208, 2210

 >>  instance 8 vlan 2240-2241, 2251-2252, 2630, 2928

 >>  instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102, 112

 >>  instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 500, 505, 510-511

 >>  instance 9 vlan 522, 551-570, 603, 629, 633, 742, 802, 926, 929

 >>  instance 10 vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 2057, 2062, 2068

 >>  instance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148, 2158

 >>  instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522, 2603, 2629, 2633

 >>  instance 10 vlan 2802, 2926, 2929

 >>  instance 11 vlan 8, 43, 52, 146, 156-157, 180, 200, 218

 >>  instance 12 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180, 2200, 2218

 >> 

 >> end

Expect: searching for 1 strs:  :Configured
 << able traps config
Switch(config)#snmp-server enable traps entity
Switch(config)#snmp-server enable traps power-ethernet group 1
Switch(config)#snmp-server enable traps cpu threshold
Switch(config)#snmp-server enable traps rtr
Switch(config)#snmp-serv
 << er enable traps bridge newroot topologychange
Switch(config)#snmp-server enable traps stpx inconsistency root-inconsistency$ enable traps stpx inconsistency root-inconsistency          
 << loop-incoaps stpx inconsistency root-inconsistency loop-incon         sistency
Switch(config)#snmp-server enable traps syslog
Switch(config)#snmp-server enable traps vtp
Switch(con
 << fig)#snmp-server enable traps vlancreate
Switch(config)#snmp-server enable traps vlandelete
Switch(config)#snmp-server enable traps flash insertion removal
Switch(config)#snmp-server enable traps port-security
Switch(config)#snmp-server enable traps e
 << nvmon fan shutdown supply temperatur$ enable traps envmon fan shutdown supply temperature          status
Switch(config)#snmp-server enable traps vlan-membership
Switch(config)#snmp-
 << server host 130.18.2.208 sysnet 
Switch(config)#line con 0
Switch(config-line)#line vty 0 4
Switch(config-line)# password Area=l*w
Switch(config-line)# login
Switch(config-line)#line vty 5 15
Switch(config-line)# password Area=l*w
Switch(config-lin
 << e)# login
Switch(config-line)#ntp clock-period 36026023
%NTP: This configuration command is depreceated.
Switch(config)#ntp server 10.92.0.3
Switch(config)#end
Switch#end
Translating "end"...domain server (130.18.80.13)
Apr  8 10:58:01: %SYS-5-CONF
 << IG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 <<  (130.18.80.12)
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
% Unknown command or computer name, or unable to find computer address
Switch#
Switch#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#spanning-tree mode mst
Switch(config)#spanning-tree etherchannel g
Expect: matched string 1: (config)#
 >> hostname test 

Expect: searching for 2 strs:  :# :>
 << uard misconfig
Switch(config)#spanning-tree mst configuration
Switch(config-mst)# name msstate
Switch(config-mst)# revision 1
Switch(config-mst)# instance 1 vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40, 
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << $ vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40, 5         0, 60, 63, 11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 63,          70
Switch(config-mst)# instance 1 vlan 78, 8
 << 0, 86, 91, 96, 104, 110, 126, 136, 1$ vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 14         0, 152, 180, 86, 91, 96, 104, 110, 12
 << 6, 136, 140, 152, 16         0
Switch(config-mst)# instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 23$ vlan 162-163, 168, 189, 194, 202, 220, 222, 230         , 232, 24
 << 163, 168, 189, 194, 202, 220, 222, 230, 232, 242         , 246
Switch(config-mst)# instance 1 vlan 256, 611-612, 654, 741, 996, 999
Switch(config-mst)# instance 2 vlan 2002, 2007, 2011, 2020
 << , 2022, 2024, 2031,$ vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031,          2035, 203, 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2
 << 037         , 2039-2011, 2020, 2022, 2024, 2031, 2035, 2037, 2039-204         0
Switch(config-mst)# instance 2 vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096,
 << $ vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096,          2104, 211, 2060, 2063, 2070, 2080, 2086, 2096, 2104, 2110         , 2126
Switch(confi
 << g-mst)# instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, $ vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 2         189, 2194
 << , 2140, 2152, 2160, 2162-2163, 2168, 2189, 2194,          2202
Switch(config-mst)# instance 2 vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, $ vlan 2220, 2222, 2232, 2242, 2246, 2611-2612
 << , 2         654, 2999
Switch(config-mst)# instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128$ vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128,          144, 176
 << 51, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176,          196
Switch(config-mst)# instance 3 vlan 244, 248, 927
Switch(config-mst)# instance 4 vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072,
 << $ vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072,          2108, 211, 2051, 2059, 2064, 2066, 2069, 2072, 2108, 2113         , 2128

 << Switch(config-mst)# instance 4 vlan 2144, 2176, 2196, 2244, 2248, 2927
Switch(config-mst)# instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 2$ vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 2
 << 2         8
Switch(config-mst)# instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-$ vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-2         134, 2216
 << , 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216,          2228
Switch(config-mst)# instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97,$ vlan 9, 33
 << -34, 38, 54, 56, 71, 75, 82, 84, 97,          114, 116,3-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116,          124
Switch(config-mst)# instance 7 vlan 172, 186, 192, 204-208, 210
 << , 240-241, 251$ vlan 172, 186, 192, 204-208, 210, 240-241, 251-         252, 630,186, 192, 204-208, 210, 240-241, 251-252, 630,     
 <<      928
Switch(config-mst)# instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, $ vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, 2         075, 2082
 << , 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082,          2084
Switch(config-mst)# instance 8 vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192,$ vlan 2097, 21
 << 14, 2116, 2124, 2172, 2186, 2192,          2204-2208, 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208,          2210
Switch(config-mst)# instance 8 vlan 2240-2241, 2251-2252, 2630, 
 << 2928
Switch(config-mst)# instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 9$ vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 98         -99, 102,
 << 12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102,          112
Switch(config-mst)# instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 50$ vlan 130, 132, 147-148, 158, 2
 << 12, 226, 236, 500         , 505, 51132, 147-148, 158, 212, 226, 236, 500, 505, 510         -511
Switch(config-mst)# instance 9 vlan 522, 551-570, 603, 629, 633, 742, 802, 92
 << $ vlan 522, 551-570, 603, 629, 633, 742, 802, 926         , 929
Switch(config-mst)# instance 10 vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 
 << $0 vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 2         057, 20624-2005, 2012, 2018-2019, 2032, 2044, 2057, 2062,          2068
Switch(config-mst)# instance 10 vlan 2076, 2
 << 098-2099, 2102, 2112, 2130, 2132,$0 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132,          2147-21486, 2098-2099, 2102, 2112, 2130,
 <<  2132, 2147-2148,          2158
Switch(config-mst)# instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522,$0 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522,          2603, 262
 << 2, 2236, 2500, 2505, 2510-2511, 2522, 2603, 2629         , 2633
Switch(config-mst)# instance 10 vlan 2802, 2926, 2929
Switch(config-mst)# instance 11 vlan 8, 43, 52, 146, 156-157, 180, 200,
 <<  218
Switch(config-mst)# instance 12 vlan 2008, 2043, 2052, 2146,hostname test 
                                                            ^
% Invalid input detected at '^' marker.
Command has been interpreted up to this marker.
Switch(config-mst)#e
 << nd
Switch#
 << 
Apr  8 10:58:28: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
Switch#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
Expect: matched string 1: (config)#
 >> snmp-server contact test

Expect: searching for 1 strs:  :#
 << snmp-server contact test
Switch(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
Switch#
 << 
Apr  8 10:58:34: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
Switch#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
Expect: matched string 1: (config)#
 >> interface vlan 92

Expect: searching for 1 strs:  :(config-if)#
 << interface vlan 92
Switch(config-if)#
Expect: matched string 1: (config-if)#
 >> ip address 10.92.1.214 255.255.0.0

 >> ip broadcast-address 10.92.255.255

 >> end

Expect: searching for 1 strs:  :Configured
 << ip address 10.92.1.214 255.255.0.0
Switch(config-if)#ip broadcast-address 10.92.255.255
Switch(config-if)#end
Switch#
 << 
Apr  8 10:58:40: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
Switch#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
Expect: matched string 1: (config)#
 >> interface Vlan92

Expect: searching for 1 strs:  :(config-if)#
 << interface Vlan92
Switch(config-if)#
Expect: matched string 1: (config-if)#
 >> ip default-gateway 10.92.0.1

 >> end

Expect: searching for 1 strs:  :Configured
 << ip default-gateway 10.92.0.1
Switch(config)#end
Switch#
Apr  8 10:58:46: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
Switch#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
Expect: matched string 1: (config)#
 >> default interface range gi0/1 - 8 

 >> interface range gi0/1 - 8 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi0/1 - 8 
Switch(config)#interface range gi0/1 - 8 
Switch(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport access vlan 123

 >> switchport mode access

 >> spanning-tree portfast

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport access vlan 123
Switch(config-if-range)#switchport mode access
Switch(config-if-range)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, concentrators, switches, bridges,
 <<  etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast will be configured in 8 interfaces due to the range command 
 but will only have effect when the interfaces are in a non-trunking m
 << ode.
Switch(config-if-range)#end
Switch#
 << 
Apr  8 10:58:58: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
Switch#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
Expect: matched string 1: (config)#
 >> default interface range gi0/9 - 12 

 >> interface range gi0/9 - 12 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi0/9 - 12 
Switch(config)#interface range gi0/9 - 12 
Switch(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport mode trunk

 >> switchport trunk native vlan 92

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport mode trunk
Switch(config-if-range)#switchport trunk native vlan 92
Switch(config-if-range)#end
Switch#
 << 
Apr  8 10:59:08: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> write mem

Expect: searching for 2 strs:  :# :>
 << 
Switch#write mem
Building configuration...
[OK]
Switch#
Expect: matched string 1: #
 >> 
Expect: searching for 2 strs:  :# :>
 << 
Switch#
Switch#
Expect: matched string 1: #
 >> sh run

Expect: searching for 2 strs:  :# :>
 << sh run
Building configuration...

Current configuration : 6258 bytes
!
! Last configuration change at 10:59:08 CDT Sat Apr 8 2000
! NVRAM config last updated at 10:59:17 CDT Sat Apr 8 2000
!
version 15.2
no service pad
service timestamps debug d
 << atetime localtime
service timestamps log datetime localtime
service password-encryption
!
hostname Switch
!
boot-start-marker
boot-end-marker
!
logging buffered informational
enable secret 5 $1$mo14$jwuaPPNw8eKBr7tMFO8PU0
enable password 7 1238
 << 17121356004E3D
!
no aaa new-model
clock timezone CST -6 0
clock summer-time CDT recurring
system mtu routing 1500
!
!
ip domain-name mgmt.msstate.edu
ip name-server 130.18.80.13
ip name-server 130.18.80.12
!
!
!
!
!
!
!
!
!
spanning-tr
 << ee mode mst
spanning-tree portfast bpduguard default
spanning-tree extend system-id
!
spanning-tree mst configuration
 name msstate
 revision 1
 instance 1 vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 63, 70
 instance 1 vlan 78, 80, 86, 9
 << 1, 96, 104, 110, 126, 136, 140, 152, 160
 instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 230, 232, 242, 246
 instance 1 vlan 256, 611-612, 654, 741, 996, 999
 instance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037, 2039-2040
 ins
 << tance 2 vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096, 2104, 2110, 2126
 instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 2189, 2194, 2202
 instance 2 vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 2654, 2999
 instance 3 vlan 42, 51, 59, 64, 66,
 <<  69, 72, 108, 113, 128, 144, 176, 196
 instance 3 vlan 244, 248, 927
 instance 4 vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072, 2108, 2113, 2128
 instance 4 vlan 2144, 2176, 2196, 2244, 2248, 2927
 instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 21
 << 6, 228
 instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216, 2228
 instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116, 124
 instance 7 vlan 172, 186, 192, 204-208, 210, 240-241, 251-252, 630, 928
 instance 8 vlan 2009, 
 << 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082, 2084
 instance 8 vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208, 2210
 instance 8 vlan 2240-2241, 2251-2252, 2630, 2928
 instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102, 112
 
 << instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 500, 505, 510-511
 instance 9 vlan 522, 551-570, 603, 629, 633, 742, 802, 926, 929
 instance 10 vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 2057, 2062, 2068
 instance 10 vlan 2076, 2098-2099, 2102
 << , 2112, 2130, 2132, 2147-2148, 2158
 instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522, 2603, 2629, 2633
 instance 10 vlan 2802, 2926, 2929
 instance 11 vlan 8, 43, 52, 146, 156-157, 180, 200, 218
!
errdisable recovery cause udld
errdisable r
 << ecovery cause bpduguard
errdisable recovery cause security-violation
errdisable recovery cause channel-misconfig
errdisable recovery cause pagp-flap
errdisable recovery cause dtp-flap
errdisable recovery cause link-flap
errdisable recovery cause sfp
 << -config-mismatch
errdisable recovery cause gbic-invalid
errdisable recovery cause l2ptguard
errdisable recovery cause psecure-violation
errdisable recovery cause port-mode-failure
errdisable recovery cause dhcp-rate-limit
errdisable recovery cause p
 << ppoe-ia-rate-limit
errdisable recovery cause mac-limit
errdisable recovery cause vmps
errdisable recovery cause storm-control
errdisable recovery cause inline-power
errdisable recovery cause arp-inspection
errdisable recovery cause loopback
errdisa
 << ble recovery cause small-frame
errdisable recovery cause psp
errdisable recovery interval 1800
!
!
!
!
vlan internal allocation policy ascending
!
!
! 
!
!
!
!
!
!
!
!
interface GigabitEthernet0/1
 switchport access vlan 123
 switchpo
 << rt mode access
 spanning-tree portfast
!
interface GigabitEthernet0/2
 switchport access vlan 123
 switchport mode access
 spanning-tree portfast
!
interface GigabitEthernet0/3
 switchport access vlan 123
 switchport mode access
 spanning-tree 
 << portfast
!
interface GigabitEthernet0/4
 switchport access vlan 123
 switchport mode access
 spanning-tree portfast
!
interface GigabitEthernet0/5
 switchport access vlan 123
 switchport mode access
 spanning-tree portfast
!
interface GigabitE
 << thernet0/6
 switchport access vlan 123
 switchport mode access
 spanning-tree portfast
!
interface GigabitEthernet0/7
 switchport acce