trying to use serial port: /dev/ttyUSB0
 >> 
 >> 

Expect: searching for 4 strs:  :[yes/no] :Press RETURN to get started. :# :Switch>
 << 
Switch>
Switch>
Switch>
Switch>
Expect: matched string 4: Switch>
 >> term len 0

Expect: searching for 2 strs:  :# :>
 << term len 0
Switch>
Expect: matched string 2: >
 >> show version

Expect: searching for 2 strs:  :# :>
 << show version
Cisco IOS Software, C2960S Software (C2960S-UNIVERSALK9-M), Version 12.2(55)SE5, RELEASE SOFTWARE (fc1)
Technical Support: http://www.cisco.com/techsupport
Copyright (c) 1986-2012 by Cisco Systems, Inc.
Compiled Thu 09-Feb-12 19:22 by pro
 << d_rel_team
Image text-base: 0x00003000, data-base: 0x01B00000

ROM: Bootstrap program is Alpha board boot loader
BOOTLDR: C2960S Boot Loader (C2960S-HBOOT-M) Version 12.2(55r)SE, RELEASE SOFTWARE (fc1)

Switch uptime is 3 minutes
System returned to
 <<  ROM by power-on
System image file is "flash:/c2960s-universalk9-mz.122-55.SE5/c2960s-universalk9-mz.122-55.SE5.bin"


This product contains cryptographic features and is subject to United
States and local country laws governing import, export, trans
 << fer and
use. Delivery of Cisco cryptographic products does not imply
third-party authority to import, export, distribute or use encryption.
Importers, exporters, distributors and users are responsible for
compliance with U.S. and local country laws. B
 << y using this product you
agree to comply with applicable laws and regulations. If you are unable
to comply with U.S. and local laws, return this product immediately.

A summary of U.S. laws governing Cisco cryptographic products may be found at:
http
 << ://www.cisco.com/wwl/export/crypto/tool/stqrg.html

If you require further assistance please contact us by sending email to
export@cisco.com.

cisco WS-C2960S-48FPD-L (PowerPC) processor (revision E0) with 131072K bytes of memory.
Processor board ID
 <<  FOC1629Z0FZ
Last reset from power-on
1 Virtual Ethernet interface
1 FastEthernet interface
50 Gigabit Ethernet interfaces
2 Ten Gigabit Ethernet interfaces
The password-recovery mechanism is enabled.

512K bytes of flash-simulated non-volatile co
 << nfiguration memory.
Base ethernet MAC Address       : 64:D8:14:9D:BB:00
Motherboard assembly number     : 73-12561-09
Power supply part number        : 341-0382-02
Motherboard serial number       : FOC16280T82
Power supply serial number      : DCA162
 << 4V3J8
Model revision number           : E0
Motherboard revision number     : A0
Model number                    : WS-C2960S-48FPD-L
Daughterboard assembly number   : 73-11933-04
Daughterboard serial number     : FOC16287TZX
System serial number     
 <<        : FOC1629Z0FZ
Top Assembly Part Number        : 800-32643-03
Top Assembly Revision Number    : A0
Version ID                      : V03
CLEI Code Number                : COMGH00ARC
Daughterboard revision number   : A0
Hardware Board Revision 
 << Number  : 0x01


Switch Ports Model              SW Version            SW Image                 
------ ----- -----              ----------            ----------               
*    1 52    WS-C2960S-48FPD-L  12.2(55)SE5           C2960S-UNIVERSALK9-
 << M     


Configuration register is 0xF

Switch>
Expect: matched string 2: >
 >> enable

Expect: searching for 2 strs:  :Password: :#
 << enable
Switch#
Expect: matched string 2: #
 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
Expect: matched string 1: (config)#
 >> no service pad

 >> service timestamps debug datetime localtime

 >> service timestamps log datetime localtime

 >> service password-encryption

 >> boot-start-marker

 >> boot-end-marker

 >> enable secret Area=l*w

 >> enable password Area=l*w

 >> no aaa new-model

 >> clock timezone CST -6

 >> clock summer-time CDT recurring

 >> authentication mac-move permit

 >> ip domain-name mgmt.msstate.edu

 >> ip name-server 130.18.2.210

 >> vtp domain vtp01.mgmt.msstate.edu

 >> vtp mode client

 >> crypto pki trustpoint TP-self-signed-2494998912

 >>  enrollment selfsigned

 >>  subject-name cn=IOS-Self-Signed-Certificate-2494998912

 >>  revocation-check none

 >>  rsakeypair TP-self-signed-2494998912

 >> crypto pki certificate chain TP-self-signed-2494998912

 >>  certificate self-signed 01 nvram:IOS-Self-Sig#3232.cer

 >> spanning-tree portfast bpduguard default

 >> spanning-tree extend system-id

 >> vlan internal allocation policy ascending

 >> errdisable recovery cause all

 >> errdisable recovery interval 1800

 >> interface FastEthernet0

 >>  no ip address

 >>  shutdown

 >> interface Vlan1

 >>  no ip address

 >>  no ip route-cache

 >>  shutdown

 >> interface Vlan92

 >> ip http server

 >> ip http secure-server

 >> ip sla enable reaction-alerts

 >> logging facility local1

 >> logging loghost.msstate.edu

 >> access-list 1 permit 10.92.0.0 0.0.255.255

 >> snmp-server community sysnet RO 1

 >> snmp-server community c2-b2=a2 RW 1

 >> snmp-server enable traps snmp authentication linkdown linkup coldstart warmstart

 >> snmp-server enable traps transceiver all

 >> snmp-server enable traps tty

 >> snmp-server enable traps cluster

 >> snmp-server enable traps config-copy

 >> snmp-server enable traps config

 >> snmp-server enable traps config-ctid

 >> snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-auth-fail-vlan no-guest-vlan

 >> snmp-server enable traps entity

 >> snmp-server enable traps power-ethernet group 1

 >> snmp-server enable traps power-ethernet police

 >> snmp-server enable traps cpu threshold

 >> snmp-server enable traps rep

 >> snmp-server enable traps rtr

 >> snmp-server enable traps bridge newroot topologychange

 >> snmp-server enable traps stpx inconsistency root-inconsistency loop-inconsistency

 >> snmp-server enable traps syslog

 >> snmp-server enable traps vtp

 >> snmp-server enable traps vlancreate

 >> snmp-server enable traps vlandelete

 >> snmp-server enable traps flash insertion removal

 >> snmp-server enable traps port-security

 >> snmp-server enable traps envmon fan shutdown supply temperature status

 >> snmp-server enable traps errdisable

 >> snmp-server enable traps mac-notification change move threshold

 >> snmp-server enable traps vlan-membership

 >> snmp-server host 130.18.2.208 sysnet 

 >> line con 0

 >> line vty 0 4

 >>  password Area=l*w

 >>  login

 >> line vty 5 15

 >>  password Area=l*w

 >>  login

 >> ntp clock-period 22519226

 >> ntp server 10.92.0.5

 >> end

Expect: searching for 1 strs:  :Configured
 << no service pad
Switch(config)#service timestamps debug datetime localtime
Switch(config)#service timestamps log datetime localtime
Switch(config)#service password-encryption
Switch(config)#boot-start-marker
Switch(config)#boot-end-marker
Switch(conf
 << ig)#enable secret Area=l*w
Switch(config)#enable password Area=l*w
The enable password you have chosen is the same as your enable secret.
This is not recommended.  Re-enter the enable password.

Switch(config)#no aaa new-model
Switch(config)#clock t
 << imezone CST -6
Switch(config)#clock summer-time CDT recurring
Switch(config)#authentication mac-move permit
Switch(config)#ip domain-name mgmt.msstate.edu
Switch(config)#ip name-server 130.18.2.210
Switch(config)#vtp domain vtp01.mgmt.msstate.edu
Ch
 << anging VTP domain name from NULL to vtp01.mgmt.msstate.edu
Switch(config)#vtp mode client
Setting device to VTP Client mode for VLANS.
Switch(config)#crypto pki trustpoint TP-self-signed-2494998912
Switch(ca-trustpoint)# enrollment selfsigned
Switch(
 << ca-trustpoint)#
*Feb 28 18:05:21: %SYS-6-CLOCKUPDATE: System clock has been updated from 00:05:21 UTC Mon Mar 1 1993 to 18:05:21 CST Sun Feb 28 1993, configured from console by console.
*Feb 28 18:05:21: %SYS-6-CLOCKUPDATE: System clock has been updated
 <<  from 18:05:21 CST Sun Feb 28 1993 to 18:05:21 CST Sun Feb 28 1993, configured from console by console. subject-name cn=IOS-Self-Signed-Certificate-2494998912
Switch(ca-trustpoint)# revocation-check none
Switch(ca-trustpoint)# rsakeypair TP-self-signed-
 << 2494998912
Switch(ca-trustpoint)#crypto pki certificate chain TP-self-signed-2494998912
Switch(config-cert-chain)# certificate self-signed 01 nvram:IOS-Self-Sig#
*Feb 28 18:05:22: %SW_VLAN-6-VTP_DOMAIN_NAME_CHG: VTP domain name changed to vtp01.mgmt.ms
 << state.edu.3232$e self-signed 01 nvram:IOS-Self-Sig#3232.         cer
Switch(config-cert-chain)#spanning-tree portfast bpduguard default
Switch(config)#spanning-tree extend system-id
Switch(con
 << fig)#vlan internal allocation policy ascending
Switch(config)#errdisable recovery cause all
Switch(config)#errdisable recovery interval 1800
Switch(config)#interface FastEthernet0
Switch(config-if)# no ip address
Switch(config-if)# shutdown
Switch(c
 << onfig-if)#interface Vlan1
Switch(config-if)# no ip address
Switch(config-if)# no ip route-cache
Switch(config-if)# shutdown
Switch(config-if)#interface Vlan92
Switch(config-if)#ip http server
Switch(config)#ip http secure-server
% Generating 1024 b
 << it RSA keys, keys will be non-exportable...
*Feb 28 18:05:27: %LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan92, changed state to down
*Feb 28 18:05:28: %LINK-5-CHANGED: Interface FastEthernet0, changed state to administratively down
*Feb 28 18:05
 << :28: %LINK-5-CHANGED: Interface Vlan1, changed state to administratively down[OK]

Switch(config)#ip sla enable reaction-alerts
Switch(config)#logging facility local1
Switch(config)#logging loghost.msstate.edu
Translating "loghost.msstate.edu"...doma
 << in server (130.18.2.210)
                       ^
% Invalid input detected at '^' marker.

Switch(config)#access-list 1 permit 10.92.0.0 0.0.255.255
Switch(config)#snmp-server community sysnet RO 1
Switch(config)#snmp-server community c2-b2=a2 RW 1
 << 
Switch(config)#snmp-server enable traps snmp authentication linkdown linkup c$ enable traps snmp aut
*Feb 28 18:05:33: %SSH-5-ENABLED: SSH 1.99 has been enabled
*Feb 28 18:05:35: %PKI-4-NOAU
 << TOSAVE: Configuration was modified.  Issue "write memory" to save new certificatehentication linkdown linkup co         ldstart waps snmp authentication linkdown linkup coldstart wa    
 <<      rmstart
Switch(config)#snmp-server enable traps transceiver all
Switch(config)#snmp-server enable traps tty
Switch(config)#snmp-server enable traps cluster
Switch(config)#snmp-server enable traps config-copy
Switch(config)#snmp-server e
 << nable traps config
Switch(config)#snmp-server enable traps config-ctid
Switch(config)#snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-au$ enable traps dot1x auth-fail-vlan guest-v
 << lan no-aut         h-fail-vlaps dot1x auth-fail-vlan guest-vlan no-auth-fail-vla         n no-guesuth-fail-vlan gues
 << t-vlan no-auth-fail-vlan no-guest         -vlan
Switch(config)#snmp-server enable traps entity
Switch(config)#snmp-server enable traps power-ethernet group 1
Switch(config)#snmp-server enable traps power-ethernet police
Switch(config)#snmp-se
 << rver enable traps cpu threshold
Switch(config)#snmp-server enable traps rep
Switch(config)#snmp-server enable traps rtr
Switch(config)#snmp-server enable traps bridge newroot topologychange
Switch(config)#snmp-server enable traps stpx inconsistency ro
 << ot-inconsistency$ enable traps stpx inconsistency root-inconsistency          loop-incoaps stpx inconsistency root-inconsis
 << tency loop-incon         sistency
Switch(config)#snmp-server enable traps syslog
Switch(config)#snmp-server enable traps vtp
Switch(config)#snmp-server enable traps vlancreate
Switch(config)#snmp-server enable traps vlandelete
Switch(config)
 << #snmp-server enable traps flash insertion removal
Switch(config)#snmp-server enable traps port-security
Switch(config)#snmp-server enable traps envmon fan shutdown supply temperatur$ enable t
 << raps envmon fan shutdown supply temperature          status
Switch(config)#snmp-server enable traps errdisable
Switch(config)#snmp-server enable traps mac-notification change move threshol
 << $ enable traps mac-notification change move threshold         
Switch(config)#snmp-server enable traps vlan-membership
Switch(config)#snmp-server host 130.18.2.208 sysnet 
Switch(config)#line con 0
Switch(config-line)#line vty 0 4
Swit
 << ch(config-line)# password Area=l*w
Switch(config-line)# login
Switch(config-line)#line vty 5 15
Switch(config-line)# password Area=l*w
Switch(config-line)# login
Switch(config-line)#ntp clock-period 22519226
Switch(config)#ntp server 10.92.0.5
Swit
 << ch(config)#end
Switch#
 << 
*Feb 28 18:05:39: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
Switch#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
Expect: matched string 1: (config)#
 >> spanning-tree mode mst

 >> spanning-tree etherchannel guard misconfig

 >> spanning-tree mst configuration

 >>  name msstate

 >>  revision 1

 >>  instance 1 vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 63, 70

 >>  instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 160

 >>  instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 230, 232, 242, 246

 >>  instance 1 vlan 256, 611-612, 654, 741, 996, 999

 >>  instance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037, 2039-2040

 >>  instance 2 vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096, 2104, 2110, 2126

 >>  instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 2189, 2194, 2202

 >>  instance 2 vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 2654, 2999

 >>  instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176, 196

 >>  instance 3 vlan 244, 248, 927

 >>  instance 4 vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072, 2108, 2113, 2128

 >>  instance 4 vlan 2144, 2176, 2196, 2244, 2248, 2927

 >>  instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 228

 >>  instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216, 2228

 >>  instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116, 124

 >>  instance 7 vlan 172, 186, 192, 204-208, 210, 240-241, 251-252, 630, 928

 >>  instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082, 2084

 >>  instance 8 vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208, 2210

 >>  instance 8 vlan 2240-2241, 2251-2252, 2630, 2928

 >>  instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102, 112

 >>  instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 500, 505, 510-511

 >>  instance 9 vlan 522, 551-570, 603, 629, 633, 742, 802, 926, 929

 >>  instance 10 vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 2057, 2062, 2068

 >>  instance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148, 2158

 >>  instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522, 2603, 2629, 2633

 >>  instance 10 vlan 2802, 2926, 2929

 >>  instance 11 vlan 8, 43, 52, 146, 156-157, 180, 200, 218

 >>  instance 12 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180, 2200, 2218

 >> 

 >> end

Expect: searching for 1 strs:  :Configured
 << spanning-tree mode mst
Switch(config)#spanning-tree etherchannel guard misconfig
Switch(config)#spanning-tree mst configuration
Switch(config-mst)# name msstate
Switch(config-mst)# revision 1
Switch(config-mst)# instance 1 vlan 2, 7, 11, 20, 22, 24, 
 << 31, 35, 37, 39-40, $ vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40, 5         0, 60, 63, 11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 
 << 63,          70
Switch(config-mst)# instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 1$ vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 14         0, 152, 1
 << 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 16         0
Switch(config-mst)# instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 23$ vlan 162-1
 << 63, 168, 189, 194, 202, 220, 222, 230         , 232, 24163, 168, 189, 194, 202, 220, 222, 230, 232, 242         , 246
Switch(config-mst)# instance 1 vlan 256, 611-612, 654, 741, 9
 << 96, 999
Switch(config-mst)# instance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031,$ vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031,          2035, 203
 << , 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037         , 2039-2011, 2020, 2022, 2024, 2031, 2035, 2037, 2039-204         0
Switch(config-mst)# instance 2 v
 << lan 2050, 2060, 2063, 2070, 2080, 2086, 2096,$ vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096,          2104, 211, 2060, 2063, 2070,
 <<  2080, 2086, 2096, 2104, 2110         , 2126
Switch(config-mst)# instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, $ vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 2         
 << 189, 2194, 2140, 2152, 2160, 2162-2163, 2168, 2189, 2194,          2202
Switch(config-mst)# instance 2 vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 
 << $ vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 2         654, 2999
Switch(config-mst)# instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128$ vlan 42, 51, 59, 64
 << , 66, 69, 72, 108, 113, 128,          144, 17651, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176,          196
Switch(config-mst)# instance 3 vlan 244, 248, 927
Switch(config-mst)# 
 << instance 4 vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072,$ vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072,          2108, 211, 2051,
 <<  2059, 2064, 2066, 2069, 2072, 2108, 2113         , 2128
Switch(config-mst)# instance 4 vlan 2144, 2176, 2196, 2244, 2248, 2927
Switch(config-mst)# instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 2
 << $ vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 22         8
Switch(config-mst)# instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-$ vlan 2016, 2048, 2058, 2088, 
 << 2121, 2131, 2133-2         134, 2216, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216,          2228
Switch(config-mst)# instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97,
 << $ vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97,          114, 116,3-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116,          1
 << 24
Switch(config-mst)# instance 7 vlan 172, 186, 192, 204-208, 210, 240-241, 251$ vlan 172, 186, 192, 204-208, 210, 240-241, 251-         252, 630,
 << 186, 192, 204-208, 210, 240-241, 251-252, 630,          928
Switch(config-mst)# instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, $ vlan 2009, 2033-2034, 2038, 2054
 << , 2056, 2071, 2         075, 2082, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082,          2084
Switch(config-mst)# instance 8 vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192,
 << $ vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192,          2204-2208, 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208,          221
 << 0
Switch(config-mst)# instance 8 vlan 2240-2241, 2251-2252, 2630, 2928
Switch(config-mst)# instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 9$ vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 
 << 98         -99, 102,12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102,          112
Switch(config-mst)# instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 50
 << $ vlan 130, 132, 147-148, 158, 212, 226, 236, 500         , 505, 51132, 147-148, 158, 212, 226, 236, 500, 505, 510         -511
Switch(config-mst
 << )# instance 9 vlan 522, 551-570, 603, 629, 633, 742, 802, 92$ vlan 522, 551-570, 603, 629, 633, 742, 802, 926         , 929
Switch(config-mst)# instance 10 vlan 2004-2005, 2012, 2018-2019
 << , 2032, 2044, $0 vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 2         057, 20624-2005, 2012, 2018-2019, 2032, 2044, 2057, 2062,  
 <<         2068
Switch(config-mst)# instance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132,$0 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132,          2147-2148
 << 6, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148,          2158
Switch(config-mst)# instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522,$0 vlan 221
 << 2, 2236, 2500, 2505, 2510-2511, 2522,          2603, 2622, 2236, 2500, 2505, 2510-2511, 2522, 2603, 2629         , 2633
Switch(config-mst)# instance 10 vlan 2802, 2926, 2929
Swit
 << ch(config-mst)# instance 11 vlan 8, 43, 52, 146, 156-157, 180, 200, 218
Switch(config-mst)# instance 12 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180,$2 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180
 << ,          2200, 2218, 2043, 2052, 2146, 2156-2157, 2180, 2200, 2218         
Switch(config-mst)#
Switch(config-mst)#end
Switch#
 << 
*Feb 28 18:05:54: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
Switch#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
Expect: matched string 1: (config)#
 >> hostname c29s1p.f1.williams 

Expect: searching for 2 strs:  :# :>
 << hostname c29s1p.f1.williams 
c29s1p.f1.williams(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s1p.f1.williams#
 << 
*Feb 28 18:06:00: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.f1.williams#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.f1.williams(config)#
Expect: matched string 1: (config)#
 >> snmp-server contact 6F-1496

Expect: searching for 1 strs:  :#
 << snmp-server contact 6F-1496
c29s1p.f1.williams(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s1p.f1.williams#
 << 
*Feb 28 18:06:06: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.f1.williams#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.f1.williams(config)#
Expect: matched string 1: (config)#
 >> interface vlan 92

Expect: searching for 1 strs:  :(config-if)#
 << interface vlan 92
c29s1p.f1.williams(config-if)#
Expect: matched string 1: (config-if)#
 >> ip address 10.92.1.68 255.255.0.0

 >> ip broadcast-address 10.92.255.255

 >> end

Expect: searching for 1 strs:  :Configured
 << ip address 10.92.1.68 255.255.0.0
c29s1p.f1.williams(config-if)#ip broadcast-address 10.92.255.255
c29s1p.f1.williams(config-if)#end
c29s1p.f1.williams#
 << 
*Feb 28 18:06:13: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.f1.williams#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.f1.williams(config)#
Expect: matched string 1: (config)#
 >> interface Vlan92

Expect: searching for 1 strs:  :(config-if)#
 << interface Vlan92
c29s1p.f1.williams(config-if)#
Expect: matched string 1: (config-if)#
 >> ip default-gateway 10.92.0.1

 >> end

Expect: searching for 1 strs:  :Configured
 << ip default-gateway 10.92.0.1
c29s1p.f1.williams(config)#end
c29s1p.f1.williams#
 << 
*Feb 28 18:06:19: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.f1.williams#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.f1.williams(config)#
Expect: matched string 1: (config)#
 >> ip dhcp snooping

Expect: searching for 1 strs:  :#
 << ip dhcp snooping
c29s1p.f1.williams(config)#
Expect: matched string 1: #
 >> ip dhcp snooping vlan 97

Expect: searching for 1 strs:  :#
 << ip dhcp snooping vlan 97
c29s1p.f1.williams(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s1p.f1.williams#
 << 
*Feb 28 18:06:26: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.f1.williams#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.f1.williams(config)#
Expect: matched string 1: (config)#
 >> default interface range gi1/0/1 - 48 

 >> interface range gi1/0/1 - 48 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi1/0/1 - 48 

 << c29s1p.f1.williams(config)#interface range gi1/0/1 - 48 
c29s1p.f1.williams(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport access vlan 97

 >> switchport mode access

 >> spanning-tree portfast

 >> switchport port-security maximum 2

 >> switchport port-security

 >> switchport port-security aging time 15

 >> switchport port-security violation protect

 >> switchport port-security aging type inactivity

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport access vlan 97
c29s1p.f1.williams(config-if-range)#switchport mode access
c29s1p.f1.williams(config-if-range)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, concentrat
 << ors, switches, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast will be configured in 48 interfaces due to the range command 
 but will only have effect when the interfaces
 <<  are in a non-trunking mode.
c29s1p.f1.williams(config-if-range)#switchport port-security maximum 2
c29s1p.f1.williams(config-if-range)#switchport port-security
c29s1p.f1.williams(config-if-range)#switchport port-security aging time 15
c29s1p.f1.willi
 << ams(config-if-range)#switchport port-security violation protec$port-security violation protect         
c29s1p.f1.williams(config-if-range)#switchport port-security aging type inact
 << $port-security aging type inacti         vity
c29s1p.f1.williams(config-if-range)#end
c29s1p.f1.williams#
 << 
*Feb 28 18:06:45: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.f1.williams#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.f1.williams(config)#
Expect: matched string 1: (config)#
 >> default interface gi1/0/2 

 >> interface gi1/0/2 

Expect: searching for 1 strs:  :(config-if)#
 << default interface gi1/0/2 
Interface GigabitEthernet1/0/2 set to default configuration
c29s1p.f1.williams(config)#interface gi1/0/2 
c29s1p.f1.williams(config-if)#
Expect: matched string 1: (config-if)#
 >> switchport access vlan 176

 >> switchport mode access

 >> spanning-tree portfast

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport access vlan 176
c29s1p.f1.williams(config-if)#switchport mode access
c29s1p.f1.williams(config-if)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, concentrators, switch
 << es, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast has been configured on GigabitEthernet1/0/2 but will only
 have effect when the interface is in a non-trunking mode.
c
 << 29s1p.f1.williams(config-if)#end
c29s1p.f1.williams#
 << 
*Feb 28 18:06:56: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.f1.williams#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.f1.williams(config)#
Expect: matched string 1: (config)#
 >> default interface gi1/0/41 

 >> interface gi1/0/41 

Expect: searching for 1 strs:  :(config-if)#
 << default interface gi1/0/41 
Interface GigabitEthernet1/0/41 set to default configuration
c29s1p.f1.williams(config)#interface gi1/0/41 
c29s1p.f1.williams(config-if)#
Expect: matched string 1: (config-if)#
 >> switchport access vlan 92

 >> switchport mode access

 >> spanning-tree portfast

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport access vlan 92
c29s1p.f1.williams(config-if)#switchport mode access
c29s1p.f1.williams(config-if)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, concentrators, switche
 << s, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast has been configured on GigabitEthernet1/0/41 but will only
 have effect when the interface is in a non-trunking mode.
c
 << 29s1p.f1.williams(config-if)#end
c29s1p.f1.williams#
 << 
*Feb 28 18:07:02: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.f1.williams#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.f1.williams(config)#
Expect: matched string 1: (config)#
 >> default interface range gi1/0/42 - 47 

 >> interface range gi1/0/42 - 47 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi1/0/42 - 47 
c29s1p.f1.williams(config)#interface range gi1/0/42 - 47 
c29s1p.f1.williams(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport access vlan 563

 >> switchport mode access

 >> spanning-tree portfast

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport access vlan 563
c29s1p.f1.williams(config-if-range)#switchport mode access
c29s1p.f1.williams(config-if-range)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, concentra
 << tors, switches, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast will be configured in 6 interfaces due to the range command 
 but will only have effect when the interfaces
 <<  are in a non-trunking mode.
c29s1p.f1.williams(config-if-range)#end
c29s1p.f1.williams#
*Feb 28 18:07:09: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.f1.williams#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.f1.williams(config)#
Expect: matched string 1: (config)#
 >> default interface gi1/0/48 

 >> interface gi1/0/48 

Expect: searching for 1 strs:  :(config-if)#
 << default interface gi1/0/48 
Interface GigabitEthernet1/0/48 set to default configuration
c29s1p.f1.williams(config)#interface gi1/0/48 
c29s1p.f1.williams(config-if)#
Expect: matched string 1: (config-if)#
 >> switchport mode trunk

 >> switchport trunk native vlan 92

 >> ip dhcp snooping trust

 >> no keepalive

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport mode trunk
c29s1p.f1.williams(config-if)#switchport trunk native vlan 92
c29s1p.f1.williams(config-if)#ip dhcp snooping trust
c29s1p.f1.williams(config-if)#no keepalive
c29s1p.f1.williams(config-if)#end
c29s1p.f1.williams#
 << 
*Feb 28 18:07:20: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.f1.williams#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.f1.williams(config)#
Expect: matched string 1: (config)#
 >> default interface range te1/0/1 - 2 

 >> interface range te1/0/1 - 2 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range te1/0/1 - 2 
c29s1p.f1.williams(config)#interface range te1/0/1 - 2 
c29s1p.f1.williams(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport mode trunk

 >> switchport trunk native vlan 92

 >> ip dhcp snooping trust

 >> no keepalive

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport mode trunk
c29s1p.f1.williams(config-if-range)#switchport trunk native vlan 92
c29s1p.f1.williams(config-if-range)#ip dhcp snooping trust
c29s1p.f1.williams(config-if-range)#no keepalive
c29s1p.f1.williams(config-if-range)#end
c29s1p.f1.wi
 << lliams#
 << 
*Feb 28 18:07:31: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.f1.williams#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.f1.williams(config)#
Expect: matched string 1: (config)#
 >> default interface range gi1/0/49 - 50 

 >> interface range gi1/0/49 - 50 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi1/0/49 - 50 
c29s1p.f1.williams(config)#interface range gi1/0/49 - 50 
c29s1p.f1.williams(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport mode trunk

 >> switchport trunk native vlan 92

 >> ip dhcp snooping trust

 >> no keepalive

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport mode trunk
c29s1p.f1.williams(config-if-range)#switchport trunk native vlan 92
c29s1p.f1.williams(config-if-range)#ip dhcp snooping trust
c29s1p.f1.williams(config-if-range)#no keepalive
c29s1p.f1.williams(config-if-range)#end
c29s1p.f1.wi
 << lliams#
 << 
*Feb 28 18:07:37: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> write mem

Expect: searching for 2 strs:  :# :>
 << 
c29s1p.f1.williams#write mem
Building configuration...

Expect: matched string 1: #
 >> 
Expect: searching for 2 strs:  :# :>
 << [OK]
c29s1p.f1.williams#
c29s1p.f1.williams#
c29s1p.f1.williams#
Expect: matched string 1: #
 >> sh run

Expect: searching for 2 strs:  :# :>
 << sh run
Building configuration...

Current configuration : 20264 bytes
!
version 12.2
no service pad
service timestamps debug datetime localtime
service timestamps log datetime localtime
service password-encryption
!
hostname c29s1p.f1.williams
 << 
!
boot-start-marker
boot-end-marker
!
enable secret 5 $1$vYFX$pJj4I1Md3OJTnjIMA2t1P.
enable password 7 08005E4B0844095D05
!
!
!
no aaa new-model
clock timezone CST -6
clock summer-time CDT recurring
switch 1 provision ws-c2960s-48fpd-l
authe
 << ntication mac-move permit
!
!
ip dhcp snooping vlan 97
ip dhcp snooping
ip domain-name mgmt.msstate.edu
ip name-server 130.18.2.210
!
!
crypto pki trustpoint TP-self-signed-345881344
 enrollment selfsigned
 subject-name cn=IOS-Self-Signed-Certi
 << ficate-345881344
 revocation-check none
 rsakeypair TP-self-signed-345881344
!
!
crypto pki certificate chain TP-self-signed-345881344
 certificate self-signed 01
  3082024D 308201B6 A0030201 02020101 300D0609 2A864886 F70D0101 04050030 
  30312E3
 << 0 2C060355 04031325 494F532D 53656C66 2D536967 6E65642D 43657274 
  69666963 6174652D 33343538 38313334 34301E17 0D393330 33303130 30303533 
  355A170D 32303031 30313030 30303030 5A303031 2E302C06 03550403 1325494F 
  532D5365 6C662D53 69676E65 642D436
 << 5 72746966 69636174 652D3334 35383831 
  33343430 819F300D 06092A86 4886F70D 01010105 0003818D 00308189 02818100 
  B475CADC 12DBCCAA 473BA752 6EE9B06D 5432D076 69A59EED 00DB1BCA CB7FB13C 
  3E35B5D2 E43BE204 CA64349A C24F0627 1B000ED1 F776CFDF DA3D79A
 << 6 3B0428AA 
  1C3AECD7 C7B26A86 CA7BACB0 B7DB63EF 027FD6DF 8652EFA5 219CAAE1 B61981FF 
  53243B56 E8EDB932 95A8A7B1 44CF9008 ECA45D59 1351E751 231C26DF 8FAC3EF3 
  02030100 01A37730 75300F06 03551D13 0101FF04 05300301 01FF3022 0603551D 
  11041B30 198
 << 21753 77697463 682E6D67 6D742E6D 73737461 74652E65 6475301F 
  0603551D 23041830 1680147B CB0B6B54 7CAC91F6 36F78879 AC5E0B3F F576C930 
  1D060355 1D0E0416 04147BCB 0B6B547C AC91F636 F78879AC 5E0B3FF5 76C9300D 
  06092A86 4886F70D 01010405 00038181 002
 << F43A3 99FD463A C2D24378 830A4975 
  3F68D0A6 A61EF80D 2DFA7A95 9FC735FE 24BB786A 64028BCD EE9412AB 7C45EC4A 
  3DD33885 6C9214AA 76AAA6E7 D74628EF BB918007 6B2033E5 A06D144E 92DDA5BF 
  10911C36 D232A50A 075EF5C8 E9972A4E 5397DACE 481A8F6D CFBAAD9F 4E9
 << 3961A 
  1A26BAA2 9BC686BE 7C97AA18 B912CE4C 4D
  quit
!
spanning-tree mode mst
spanning-tree portfast bpduguard default
spanning-tree extend system-id
!
spanning-tree mst configuration
 name msstate
 revision 1
 instance 1 vlan 2, 7, 11, 20, 2
 << 2, 24, 31, 35, 37, 39-40, 50, 60, 63, 70
 instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 160
 instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 230, 232, 242, 246
 instance 1 vlan 256, 611-612, 654, 741, 996, 999
 instance 2 vl
 << an 2002, 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037, 2039-2040
 instance 2 vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096, 2104, 2110, 2126
 instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 2189, 2194, 2202
 instance 2 vlan 2220, 2222, 2232,
 <<  2242, 2246, 2611-2612, 2654, 2999
 instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176, 196
 instance 3 vlan 244, 248, 927
 instance 4 vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072, 2108, 2113, 2128
 instance 4 vlan 2144, 2176, 2196, 
 << 2244, 2248, 2927
 instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 228
 instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216, 2228
 instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116, 124
 instance 7 vlan 172, 186
 << , 192, 204-208, 210, 240-241, 251-252, 630, 928
 instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082, 2084
 instance 8 vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208, 2210
 instance 8 vlan 2240-2241, 2251-2252, 2630, 2928
 in
 << stance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102, 112
 instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 500, 505, 510-511
 instance 9 vlan 522, 551-570, 603, 629, 633, 742, 802, 926, 929
 instance 10 vlan 2004-2005, 2012, 2018-201
 << 9, 2032, 2044, 2057, 2062, 2068
 instance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148, 2158
 instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522, 2603, 2629, 2633
 instance 10 vlan 2802, 2926, 2929
 instance 11 vlan 8, 43, 52, 146,
 <<  156-157, 180, 200, 218
 instance 12 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180, 2200, 2218
!
!
!
!
errdisable recovery cause udld
errdisable recovery cause bpduguard
errdisable recovery cause security-violation
errdisable recovery cause channe
 << l-misconfig (STP)
errdisable recovery cause pagp-flap
errdisable recovery cause dtp-flap
errdisable recovery cause link-flap
errdisable recovery cause sfp-config-mismatch
errdisable recovery cause gbic-invalid
errdisable recovery cause psecure-viola
 << tion
errdisable recovery cause port-mode-failure
errdisable recovery cause dhcp-rate-limit
errdisable recovery cause pppoe-ia-rate-limit
errdisable recovery cause mac-limit
errdisable recovery cause vmps
errdisable recovery cause storm-control
errd
 << isable recovery cause inline-power
errdisable recovery cause arp-inspection
errdisable recovery cause loopback
errdisable recovery cause small-frame
errdisable recovery interval 1800
!
vlan internal allocation policy ascending
!
!
!
interface Fa
 << stEthernet0
 no ip address
 shutdown
!
interface GigabitEthernet1/0/1
 switchport access vlan 97
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-secur
 << ity violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/2
 switchport access vlan 176
 switchport mode access
 spanning-tree portfast
!
interface GigabitEthernet1/0/3
 switchpo
 << rt access vlan 97
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tr
 << ee portfast
!
interface GigabitEthernet1/0/4
 switchport access vlan 97
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 swi
 << tchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/5
 switchport access vlan 97
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging t
 << ime 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/6
 switchport access vlan 97
 switchport mode access
 switchport port-security maximum 2
 sw
 << itchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/7
 switchport access vlan 97
 switchp
 << ort mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface G
 << igabitEthernet1/0/8
 switchport access vlan 97
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging
 <<  type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/9
 switchport access vlan 97
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-se
 << curity violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/10
 switchport access vlan 97
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 s
 << witchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/11
 switchport access vlan 97
 switchport mode access
 switchp
 << ort port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/12
 sw
 << itchport access vlan 97
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spann
 << ing-tree portfast
!
interface GigabitEthernet1/0/13
 switchport access vlan 97
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protec
 << t
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/14
 switchport access vlan 97
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security
 <<  aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/15
 switchport access vlan 97
 switchport mode access
 switchport port-security maxim
 << um 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/16
 switchport access vlan 97
 << 
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
i
 << nterface GigabitEthernet1/0/17
 switchport access vlan 97
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-sec
 << urity aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/18
 switchport access vlan 97
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switch
 << port port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/19
 switchport access vlan 97
 switchport mode access
 switchport port-security maximum 2
 switchport port-
 << security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/20
 switchport access vlan 97
 switchport mode acce
 << ss
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEtherne
 << t1/0/21
 switchport access vlan 97
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inacti
 << vity
 spanning-tree portfast
!
interface GigabitEthernet1/0/22
 switchport access vlan 97
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security viol
 << ation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/23
 switchport access vlan 97
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport p
 << ort-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/24
 switchport access vlan 97
 switchport mode access
 switchport port-se
 << curity maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/25
 switchport ac
 << cess vlan 97
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree po
 << rtfast
!
interface GigabitEthernet1/0/26
 switchport access vlan 97
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchp
 << ort port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/27
 switchport access vlan 97
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time
 <<  15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/28
 switchport access vlan 97
 switchport mode access
 switchport port-security maximum 2
 swit
 << chport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/29
 switchport access vlan 97
 switchpo
 << rt mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface Gi
 << gabitEthernet1/0/30
 switchport access vlan 97
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging
 <<  type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/31
 switchport access vlan 97
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-s
 << ecurity violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/32
 switchport access vlan 97
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 
 << switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/33
 switchport access vlan 97
 switchport mode access
 switch
 << port port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/34
 s
 << witchport access vlan 97
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 span
 << ning-tree portfast
!
interface GigabitEthernet1/0/35
 switchport access vlan 97
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation prote
 << ct
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/36
 switchport access vlan 97
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-securit
 << y aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/37
 switchport access vlan 97
 switchport mode access
 switchport port-security maxi
 << mum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/38
 switchport access vlan 9
 << 7
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!

 << interface GigabitEthernet1/0/39
 switchport access vlan 97
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-se
 << curity aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/40
 switchport access vlan 97
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switc
 << hport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/41
 switchport access vlan 92
 switchport mode access
 spanning-tree portfast
!
interface GigabitEthernet
 << 1/0/42
 switchport access vlan 563
 switchport mode access
 spanning-tree portfast
!
interface GigabitEthernet1/0/43
 switchport access vlan 563
 switchport mode access
 spanning-tree portfast
!
interface GigabitEthernet1/0/44
 switchport acces
 << s vlan 563
 switchport mode access
 spanning-tree portfast
!
interface GigabitEthernet1/0/45
 switchport access vlan 563
 switchport mode access
 spanning-tree portfast
!
interface GigabitEthernet1/0/46
 switchport access vlan 563
 switchport m
 << ode access
 spanning-tree portfast
!
interface GigabitEthernet1/0/47
 switchport access vlan 563
 switchport mode access
 spanning-tree portfast
!
interface GigabitEthernet1/0/48
 switchport trunk native vlan 92
 switchport mode trunk
 no keepa
 << live
 ip dhcp snooping trust
!
interface GigabitEthernet1/0/49
 switchport trunk native vlan 92
 switchport mode trunk
 ip dhcp snooping trust
!
interface GigabitEthernet1/0/50
 switchport trunk native vlan 92
 switchport mode trunk
 ip dhcp sn
 << ooping trust
!
interface TenGigabitEthernet1/0/1
 switchport trunk native vlan 92
 switchport mode trunk
 ip dhcp snooping trust
!
interface TenGigabitEthernet1/0/2
 switchport trunk native vlan 92
 switchport mode trunk
 ip dhcp snooping trust
 << 
!
interface Vlan1
 no ip address
 no ip route-cache
 shutdown
!
interface Vlan92
 ip address 10.92.1.68 255.255.0.0
 ip broadcast-address 10.92.255.255
!
ip default-gateway 10.92.0.1
ip http server
ip http secure-server
ip sla enable reactio
 <