trying to use serial port: /dev/ttyUSB1
 >> 
 >> 

Expect: searching for 4 strs:  :[yes/no] :Press RETURN to get started. :# :Switch>
 << 


         --- System Configuration Dialog ---

Enable secret warning
----------------------------------
In order to access the device manager, an enable secret is required
If you enter the initial configuration dialog, you will be prompted for t
 << he enable secret
If you choose not to enter the intial configuration dialog, or if you exit setup without setting the enable secret,
please set an enable secret using the following CLI in configuration mode-
enable secret 0 <cleartext password>
------
 << ----------------------------
Would you like to enter the initial configuration dialog? [yes/no]: 
% Please answer 'yes' or 'no'.
Would you like to enter the initial configuration dialog? [yes/no]: 
% Please answer 'yes' or 'no'.
Would you like to ent
Expect: matched string 1: [yes/no]
 >> 

 >> no

 >> term len 0

Expect: searching for 2 strs:  :# :>
 << er the initial configuration dialog? [yes/no]: 
% Please answer 'yes' or 'no'.
Would you like to enter the initial configuration dialog? [yes/no]: 
% Please answer 'yes' or 'no'.
Would you like to enter the initial configuration dialog? [yes/no]: 
% 
 << Please answer 'yes' or 'no'.
Would you like to enter the initial configuration dialog? [yes/no]: no
Switch>term len 0
Switch>
Expect: matched string 2: >
 >> show version

Expect: searching for 2 strs:  :# :>
 << show version
Cisco IOS Software, C2960X Software (C2960X-UNIVERSALK9-M), Version 15.0(2)EX5, RELEASE SOFTWARE (fc1)
Technical Support: http://www.cisco.com/techsupport
Copyright (c) 1986-2014 by Cisco Systems, Inc.
Compiled Fri 21-Feb-14 05:54 by prod
 << _rel_team

ROM: Bootstrap program is C2960X boot loader
BOOTLDR: C2960X Boot Loader (C2960X-HBOOT-M) Version 15.2(2r)E1, RELEASE SOFTWARE (fc1)

Switch uptime is 50 minutes
System returned to ROM by power-on
System restarted at 20:12:31 UTC Mon Dec
 <<  7 2015
System image file is "flash:/c2960x-universalk9-mz.150-2.EX5/c2960x-universalk9-mz.150-2.EX5.bin"


This product contains cryptographic features and is subject to United
States and local country laws governing import, export, transfer and
us
 << e. Delivery of Cisco cryptographic products does not imply
third-party authority to import, export, distribute or use encryption.
Importers, exporters, distributors and users are responsible for
compliance with U.S. and local country laws. By using thi
 << s product you
agree to comply with applicable laws and regulations. If you are unable
to comply with U.S. and local laws, return this product immediately.

A summary of U.S. laws governing Cisco cryptographic products may be found at:
http://www.cisc
 << o.com/wwl/export/crypto/tool/stqrg.html

If you require further assistance please contact us by sending email to
export@cisco.com.

cisco WS-C2960X-48TS-L (APM86XXX) processor (revision H0) with 524288K bytes of memory.
Processor board ID FCW1904B3H
 << J
Last reset from power-on
1 Virtual Ethernet interface
1 FastEthernet interface
52 Gigabit Ethernet interfaces
The password-recovery mechanism is enabled.

512K bytes of flash-simulated non-volatile configuration memory.
Base ethernet MAC Address
 <<        : A0:55:4F:AC:43:00
Motherboard assembly number     : 73-15971-02
Power supply part number        : 341-0537-02
Motherboard serial number       : FOC19043B0B
Power supply serial number      : LIT18480N0Z
Model revision number           : H0
M
 << otherboard revision number     : B0
Model number                    : WS-C2960X-48TS-L
Daughterboard assembly number   : 73-14200-03
Daughterboard serial number     : FOC190398NS
System serial number            : FCW1904B3HJ
Top Assembly Part Number 
 <<        : 800-41468-01
Top Assembly Revision Number    : C0
Version ID                      : V03
CLEI Code Number                : CMMNF00ARB
Daughterboard revision number   : A0
Hardware Board Revision Number  : 0x12


Switch Ports Model         
 <<      SW Version            SW Image                 
------ ----- -----              ----------            ----------               
*    1 52    WS-C2960X-48TS-L   15.0(2)EX5            C2960X-UNIVERSALK9-M     


Configuration register is 0xF

Sw
 << itch>
Expect: matched string 2: >
 >> enable

Expect: searching for 2 strs:  :Password: :#
 << enable
Switch#
Expect: matched string 2: #
 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
Expect: matched string 1: (config)#
 >> no service pad

 >> service timestamps debug datetime localtime

 >> service timestamps log datetime localtime

 >> service password-encryption

 >> boot-start-marker

 >> boot-end-marker

 >> enable secret Area=l*w

 >> enable password Area=l*w

 >> no aaa new-model

 >> clock timezone CST -6 0

 >> clock summer-time CDT recurring

 >> authentication mac-move permit

 >> ip domain-name mgmt.msstate.edu

 >> ip name-server 130.18.2.210

 >> vtp domain vtp01.mgmt.msstate.edu

 >> vtp mode client

 >> crypto pki trustpoint TP-self-signed-2494998912

 >>  enrollment selfsigned

 >>  subject-name cn=IOS-Self-Signed-Certificate-2494998912

 >>  revocation-check none

 >>  rsakeypair TP-self-signed-2494998912

 >> crypto pki certificate chain TP-self-signed-2494998912

 >>  certificate self-signed 01 nvram:IOS-Self-Sig#3232.cer

 >> spanning-tree portfast bpduguard default

 >> spanning-tree extend system-id

 >> vlan internal allocation policy ascending

 >> errdisable recovery cause all

 >> errdisable recovery interval 1800

 >> interface FastEthernet0

 >>  no ip address

 >>  shutdown

 >> interface Vlan1

 >>  no ip address

 >>  no ip route-cache

 >>  shutdown

 >> interface Vlan92

 >> ip http server

 >> ip http secure-server

 >> logging facility local1

 >> logging host 130.18.8.12

 >> access-list 1 permit 10.92.0.0 0.0.255.255

 >> snmp-server community sysnet RO 1

 >> snmp-server community c2-b2=a2 RW 1

 >> snmp-server enable traps snmp authentication linkdown linkup coldstart warmstart

 >> snmp-server enable traps transceiver all

 >> snmp-server enable traps tty

 >> snmp-server enable traps cluster

 >> snmp-server enable traps config-copy

 >> snmp-server enable traps config

 >> snmp-server enable traps config-ctid

 >> snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-auth-fail-vlan no-guest-vlan

 >> snmp-server enable traps entity

 >> snmp-server enable traps power-ethernet police

 >> snmp-server enable traps cpu threshold

 >> snmp-server enable traps rep

 >> snmp-server enable traps bridge newroot topologychange

 >> snmp-server enable traps stpx inconsistency root-inconsistency loop-inconsistency

 >> snmp-server enable traps syslog

 >> snmp-server enable traps vtp

 >> snmp-server enable traps vlancreate

 >> snmp-server enable traps vlandelete

 >> snmp-server enable traps flash insertion removal

 >> snmp-server enable traps port-security

 >> snmp-server enable traps envmon fan shutdown supply temperature status

 >> snmp-server enable traps errdisable

 >> snmp-server enable traps mac-notification change move threshold

 >> snmp-server enable traps vlan-membership

 >> snmp-server host 130.18.2.208 sysnet 

 >> line con 0

 >> line vty 0 4

 >>  password Area=l*w

 >>  login

 >> line vty 5 15

 >>  password Area=l*w

 >>  login

 >> ntp server 10.92.0.5

 >> end

Expect: searching for 1 strs:  :Configured
 << no service pad
Switch(config)#service timestamps debug datetime localtime
Switch(config)#service timestamps log datetime localtime
Switch(config)#service password-encryption
Switch(config)#boot-start-marker
Switch(config)#boot-end-marker
Switch(conf
 << ig)#enable secret Area=l*w
Switch(config)#enable password Area=l*w
The enable password you have chosen is the same as your enable secret.
This is not recommended.  Re-enter the enable password.

Switch(config)#no aaa new-model
Switch(config)#clock t
 << imezone CST -6 0
Switch(config)#clock summer-time CDT recurring

Dec  7 15:04:57: %SYS-6-CLOCKUPDATE: System clock has been updated from 21:04:55 UTC Mon Dec 7 2015 to 15:04:57 CST Mon Dec 7 2015, configured from console by console.
Switch(config)#auth
 << entication mac-move permit
Switch(config)#ip domain-name mgmt.msstate.edu
Switch(config)#ip name-server 130.18.2.210
Switch(config)#vtp domain vtp01.mgmt.msstate.edu
Changing VTP domain name from NULL to vtp01.mgmt.msstate.edu
Switch(config)#vtp mode
 <<  client
Setting device to VTP Client mode for VLANS.
Switch(config)#crypto pki trustpoint TP-self-signed-2494998912
Switch(ca-trustpoint)# enrollment selfsigned
Switch(ca-trustpoint)# subject-name cn=IOS-Self-Signed-Certificate-2494998912
Switch(ca-t
 << rustpoint)# revocation-check none
Switch(ca-trustpoint)# rsakeypair TP-self-signed-2494998912
Switch(ca-trustpoint)#crypto pki certificate chain TP-self-signed-2494998912
Switch(config-cert-chain)# certificate self-signed 01 nvram:IOS-Self-Sig#3232
 << $e self-signed 01 nvram:IOS-Self-Sig#3232.         cer
Switch(config-cert-chain)#spanning-tree portfast bpduguard default
Switch(config)#spanning-tree extend system-id
Switch(config)#vlan internal
 <<  allocation policy ascending
Switch(config)#errdisable recovery cause all
Switch(confi
Dec  7 15:04:59: %SYS-6-CLOCKUPDATE: System clock has been updated from 15:04:57 CST Mon Dec 7 2015 to 15:04:59 CST Mon Dec 7 2015, configured from console by consol
 << e.
Dec  7 15:04:59: %SW_VLAN-6-VTP_DOMAIN_NAME_CHG: VTP domain name changed to vtp01.mgmt.msstate.edu.g)#errdisable recovery interval 1800
Switch(config)#interface FastEthernet0
Switch(config-if)# no ip address
Switch(config-if)# shutdown
Switch(conf
 << ig-if)#interface Vlan1
Switch(config-if)# no ip address
Switch(config-if)# no ip route-cache
Switch(config-if)# shutdown
Switch(config-if)#interface Vlan92
Switch(config-if)#ip http server
Switch(config)#ip http secure-server
% Generating 1024 bit 
 << RSA keys, keys will be non-exportable...
Dec  7 15:05:01: %LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan92, changed state to down
[OK] (elapsed time was 2 seconds)

Switch(config)#logging facility local1
Switch(config)#logging host 13
Dec  7 1
 << 5:05:03: %LINK-5-CHANGED: Interface FastEthernet0, changed state to administratively down
Dec  7 15:05:03: %LINK-5-CHANGED: Interface Vlan1, changed state to administratively down
Dec  7 15:05:03: %SSH-5-ENABLED: SSH 1.99 has been enabled0.18.8.12
Swit
 << ch(config)#access-list 1 permit 10.92.0.0 0.0.255.255
Switch(config)#snmp-server community sysnet RO 1
Switch(config)#snmp-server community c2-b2=a2 RW 1
Switch(config)#snmp-server enable traps snmp authentication linkdown linkup c
 << $ enable traps snmp authentication linkdown linkup co         ldstart waps snmp authentication linkdown linkup coldstart wa         rms
 << tart
Switch(config)#snmp-server enable traps transceiver all
Switch(config)#snmp-server enable traps tty
Switch(config)#snmp-server enable traps cluster
Switch(config)#snmp-server enable traps config-copy
Switch(config)#snmp-s
Dec  7 15:05:03: %PKI-
 << 4-NOAUTOSAVE: Configuration was modified.  Issue "write memory" to save new certificateerver enable traps config
Switch(config)#snmp-server enable traps config-ctid
Switch(config)#snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-au
 << $ enable traps dot1x auth-fail-vlan guest-vlan no-aut         h-fail-vlaps dot1x auth-fail-vlan guest-vlan no-auth-fail-vla         
 << n no-guesuth-fail-vlan guest-vlan no-auth-fail-vlan no-guest         -vlan
Switch(config)#snmp-server enable traps entity
Switch(config)#snmp-server enable traps power-ethernet 
 << police
Switch(config)#snmp-server enable traps cpu threshold
Switch(config)#snmp-server enable traps rep
Switch(config)#
Dec  7 15:05:04: %SYS-6-LOGGINGHOST_STARTSTOP: Logging to host 130.18.8.12 port 514 started - CLI initiatedsnmp-server enable trap
 << s bridge newroot topologychange
Switch(config)#snmp-server enable traps stpx inconsistency root-inconsistency$ enable traps stpx inconsistency root-inconsistency          loop-inco
 << aps stpx inconsistency root-inconsistency loop-incon         sistency
Switch(config)#snmp-server enable traps syslog
Switch(config)#snmp-server enable traps vtp
Switch(config)#snmp-serv
 << er enable traps vlancreate
Switch(config)#snmp-server enable traps vlandelete
Switch(config)#snmp-server enable traps flash insertion removal
Switch(config)#snmp-server enable traps port-security
Switch(config)#snmp-server enable traps envmon fan shut
 << down supply temperatur$ enable traps envmon fan shutdown supply temperature          status
Switch(config)#snmp-server enable traps errdisable
Switch(config)#snmp-server enable traps
 <<  mac-notification change move threshol$ enable traps mac-notification change move threshold         
Switch(config)#snmp-server enable traps vlan-membership
Switch(config)#snmp-serve
 << r host 130.18.2.208 sysnet 
Switch(config)#line con 0
Switch(config-line)#line vty 0 4
Switch(config-line)# password Area=l*w
Switch(config-line)# login
Switch(config-line)#line vty 5 15
Switch(config-line)# password Area=l*w
Switch(config-line)# l
 << ogin
Switch(config-line)#ntp server 10.92.0.5
Switch(config)#end
Switch#
 << 
Dec  7 15:05:10: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
Switch#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
Expect: matched string 1: (config)#
 >> spanning-tree mode pvst

 >> no spanning-tree vlan 2-91,93-237,240-242,244,246,248,251-252,256,359,500,502

 >> no spanning-tree vlan 505,509,511-515,520,522,551-560,562-570,601-603,605-606

 >> no spanning-tree vlan 610,629-630,632-633,635-637,654,674-676,701,741-742,800

 >> no spanning-tree vlan 801-805,807,880,901-904,908,910-913,915-916,926-930,970

 >> no spanning-tree vlan 995-1000

 >> spanning-tree vlan 1-1000 priority 57344

 >> 

 >> end

Expect: searching for 1 strs:  :Configured
 << spanning-tree mode pvst
Switch(config)#no spanning-tree vlan 2-91,93-237,240-242,244,246,248,251-252,$-tree vlan 2-91,93-237,240-242,244,246,248,251-252,2         56,359,50
 <<  2-91,93-237,240-242,244,246,248,251-252,256,359,500         ,502
Switch(config)#no spanning-tree vlan 505,509,511-515,520,522,551-560,562-570,
 << $-tree vlan 505,509,511-515,520,522,551-560,562-570,6         01-603,60 505,509,511-515,520,522,551-560,562-570,601-603,605         -606
Switch(config)#no spanning-t
 << ree vlan 610,629-630,632-633,635-637,654,674-676,$-tree vlan 610,629-630,632-633,635-637,654,674-676,7         01,741-74 61
 << 0,629-630,632-633,635-637,654,674-676,701,741-742         ,800
Switch(config)#no spanning-tree vlan 801-805,807,880,901-904,908,910-913,915-$-tree vlan 801-805,807,880,901-904,908,910
 << -913,915-9         16,926-93 801-805,807,880,901-904,908,910-913,915-916,926-930         ,970
Switch(config)#no spanning-tree vlan 995-1000
Switch(config)#spanning-tree vlan 
 << 1-1000 priority 57344
Switch(config)#
Switch(config)#end
Switch#
 << 
Dec  7 15:05:17: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
Switch#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
Expect: matched string 1: (config)#
 >> hostname c29s6.a38.meridian 

Expect: searching for 2 strs:  :# :>
 << hostname c29s6.a38.meridian 
c29s6.a38.meridian(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s6.a38.meridian#
 << 
Dec  7 15:05:24: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s6.a38.meridian#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s6.a38.meridian(config)#
Expect: matched string 1: (config)#
 >> snmp-server contact 6F-2080

Expect: searching for 1 strs:  :#
 << snmp-server contact 6F-2080
c29s6.a38.meridian(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s6.a38.meridian#
 << 
Dec  7 15:05:30: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s6.a38.meridian#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s6.a38.meridian(config)#
Expect: matched string 1: (config)#
 >> interface vlan 92

Expect: searching for 1 strs:  :(config-if)#
 << interface vlan 92
c29s6.a38.meridian(config-if)#
Expect: matched string 1: (config-if)#
 >> ip address 10.92.2.160 255.255.0.0

 >> ip broadcast-address 10.92.255.255

 >> end

Expect: searching for 1 strs:  :Configured
 << ip address 10.92.2.160 255.255.0.0
c29s6.a38.meridian(config-if)#ip broadcast-address 10.92.255.255
c29s6.a38.meridian(config-if)#end
c29s6.a38.meridian#
 << 
Dec  7 15:05:36: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s6.a38.meridian#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s6.a38.meridian(config)#
Expect: matched string 1: (config)#
 >> interface Vlan92

Expect: searching for 1 strs:  :(config-if)#
 << interface Vlan92
c29s6.a38.meridian(config-if)#
Expect: matched string 1: (config-if)#
 >> ip default-gateway 10.92.0.1

 >> end

Expect: searching for 1 strs:  :Configured
 << ip default-gateway 10.92.0.1
c29s6.a38.meridian(config)#end
c29s6.a38.meridian#
Dec  7 15:05:42: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s6.a38.meridian#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s6.a38.meridian(config)#
Expect: matched string 1: (config)#
 >> ip dhcp snooping

Expect: searching for 1 strs:  :#
 << ip dhcp snooping
c29s6.a38.meridian(config)#
Expect: matched string 1: #
 >> ip dhcp snooping vlan 649

Expect: searching for 1 strs:  :#
 << ip dhcp snooping vlan 649
c29s6.a38.meridian(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s6.a38.meridian#
Dec  7 15:05:49: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s6.a38.meridian#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s6.a38.meridian(config)#
Expect: matched string 1: (config)#
 >> default interface range gi1/0/1 - 48 

 >> interface range gi1/0/1 - 48 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi1/0/1 - 48 
c29s6.a38.meridian(config)#interface range gi1/0/1 - 48 
c29s6.a38.meridian(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport access vlan 649

 >> switchport mode access

 >> spanning-tree portfast

 >> switchport port-security maximum 2

 >> switchport port-security

 >> switchport port-security aging time 15

 >> switchport port-security violation protect

 >> switchport port-security aging type inactivity

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport access vlan 649
c29s6.a38.meridian(config-if-range)#switchport mode access
c29s6.a38.meridian(config-if-range)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, concentra
 << tors, switches, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast will be configured in 48 interfaces due to the range command 
 but will only have effect when the interface
 << s are in a non-trunking mode.
c29s6.a38.meridian(config-if-range)#switchport port-security maximum 2
c29s6.a38.meridian(config-if-range)#switchport port-security
c29s6.a38.meridian(config-if-range)#switchport port-security aging time 15
c29s6.a38.meri
 << dian(config-if-range)#switchport port-security violation protec$port-security violation protect         
c29s6.a38.meridian(config-if-range)#switchport port-security aging type inact
 << $port-security aging type inacti         vity
c29s6.a38.meridian(config-if-range)#end
c29s6.a38.meridian#
 << 
Dec  7 15:06:02: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s6.a38.meridian#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s6.a38.meridian(config)#
Expect: matched string 1: (config)#
 >> default interface range gi1/0/47 - 48 

 >> interface range gi1/0/47 - 48 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi1/0/47 - 48 
c29s6.a38.meridian(config)#interface range gi1/0/47 - 48 
c29s6.a38.meridian(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport mode trunk

 >> switchport trunk native vlan 92

 >> ip dhcp snooping trust

 >> no keepalive

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport mode trunk
c29s6.a38.meridian(config-if-range)#switchport trunk native vlan 92
c29s6.a38.meridian(config-if-range)#ip dhcp snooping trust
c29s6.a38.meridian(config-if-range)#no keepalive
c29s6.a38.meridian(config-if-range)#end
c29s6.a38.me
 << ridian#
 << 
Dec  7 15:06:13: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s6.a38.meridian#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s6.a38.meridian(config)#
Expect: matched string 1: (config)#
 >> default interface range gi1/0/49 - 52 

 >> interface range gi1/0/49 - 52 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi1/0/49 - 52 
c29s6.a38.meridian(config)#interface range gi1/0/49 - 52 
c29s6.a38.meridian(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport mode trunk

 >> switchport trunk native vlan 92

 >> ip dhcp snooping trust

 >> no keepalive

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport mode trunk
c29s6.a38.meridian(config-if-range)#switchport trunk native vlan 92
c29s6.a38.meridian(config-if-range)#ip dhcp snooping trust
c29s6.a38.meridian(config-if-range)#no keepalive
c29s6.a38.meridian(config-if-range)#end
c29s6.a38.me
 << ridian#
 << 
Dec  7 15:06:24: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s6.a38.meridian#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s6.a38.meridian(config)#
Expect: matched string 1: (config)#
 >> default interface range gi1/0/49 - 52 

 >> interface range gi1/0/49 - 52 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi1/0/49 - 52 
c29s6.a38.meridian(config)#interface range gi1/0/49 - 52 
c29s6.a38.meridian(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport mode trunk

 >> switchport trunk native vlan 92

 >> ip dhcp snooping trust

 >> no keepalive

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport mode trunk
c29s6.a38.meridian(config-if-range)#switchport trunk native vlan 92
c29s6.a38.meridian(config-if-range)#ip dhcp snooping trust
c29s6.a38.meridian(config-if-range)#no keepalive
c29s6.a38.meridian(config-if-range)#end
c29s6.a38.me
 << ridian#
 << 
Dec  7 15:06:30: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s6.a38.meridian#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s6.a38.meridian(config)#
Expect: matched string 1: (config)#
 >> default interface range gi1/0/49 - 52 

 >> interface range gi1/0/49 - 52 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi1/0/49 - 52 
c29s6.a38.meridian(config)#interface range gi1/0/49 - 52 
c29s6.a38.meridian(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport mode trunk

 >> switchport trunk native vlan 92

 >> ip dhcp snooping trust

 >> no keepalive

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport mode trunk
c29s6.a38.meridian(config-if-range)#switchport trunk native vlan 92
c29s6.a38.meridian(config-if-range)#ip dhcp snooping trust
c29s6.a38.meridian(config-if-range)#no keepalive
c29s6.a38.meridian(config-if-range)#end
c29s6.a38.me
 << ridian#
 << 
Dec  7 15:06:36: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> write mem

Expect: searching for 2 strs:  :# :>
 << 
c29s6.a38.meridian#write mem
Building configuration...

Expect: matched string 1: #
 >> 
Expect: searching for 2 strs:  :# :>
 << [OK]
c29s6.a38.meridian#
c29s6.a38.meridian#
c29s6.a38.meridian#
Expect: matched string 1: #
 >> sh run

Expect: searching for 2 strs:  :# :>
 << sh run
Building configuration...

Current configuration : 20096 bytes
!
! Last configuration change at 15:06:36 CST Mon Dec 7 2015
! NVRAM config last updated at 15:06:44 CST Mon Dec 7 2015
!
version 15.0
no service pad
service timestamps debug 
 << datetime localtime
service timestamps log datetime localtime
service password-encryption
!
hostname c29s6.a38.meridian
!
boot-start-marker
boot-end-marker
!
enable secret 5 $1$odRb$rxgi2sQZUhuoA2imPgVKC0
enable password 7 132405170A5108603C
!

 << no aaa new-model
clock timezone CST -6 0
clock summer-time CDT recurring
switch 1 provision ws-c2960x-48ts-l
authentication mac-move permit
!
!
ip dhcp snooping vlan 649
ip dhcp snooping
ip domain-name mgmt.msstate.edu
ip name-server 130.18.2.21
 << 0
!
!
crypto pki trustpoint TP-self-signed-1336689408
 enrollment selfsigned
 subject-name cn=IOS-Self-Signed-Certificate-1336689408
 revocation-check none
 rsakeypair TP-self-signed-1336689408
!
!
crypto pki certificate chain TP-self-signed-133
 << 6689408
 certificate self-signed 01
  3082022B 30820194 A0030201 02020101 300D0609 2A864886 F70D0101 05050030 
  31312F30 2D060355 04031326 494F532D 53656C66 2D536967 6E65642D 43657274 
  69666963 6174652D 31333336 36383934 3038301E 170D3135 31323037 
 << 32313035 
  30335A17 0D323030 31303130 30303030 305A3031 312F302D 06035504 03132649 
  4F532D53 656C662D 5369676E 65642D43 65727469 66696361 74652D31 33333636 
  38393430 3830819F 300D0609 2A864886 F70D0101 01050003 818D0030 81890281 
  8100A41D 90402
 << 265 178E7CBF 4A398F6B DDCEEA19 213E07EC FF693B25 095878CF 
  3B8D0B4D 91AF56F0 EDB9D014 B265B07B CD7595F9 9B6E6349 051A1F4F D6924A85 
  6D13CE25 C880382B 236AC97E 7F252B73 06EE8B48 95F6DDFF 21C5926B 21D29CF2 
  2097E7A8 DE4ECDE7 242CD3FE D4A74E08 05860
 << DB9 E10AFD92 8211FF34 6D41BD28 
  2B670203 010001A3 53305130 0F060355 1D130101 FF040530 030101FF 301F0603 
  551D2304 18301680 14157BB5 67D6DD71 D9F6BB44 2ADA3B90 153B51DB FB301D06 
  03551D0E 04160414 157BB567 D6DD71D9 F6BB442A DA3B9015 3B51DBFB 300D0
 << 609 
  2A864886 F70D0101 05050003 8181002D F13CF517 76EE353B 3E25EA7C EFA5A019 
  4175DB2D CB9FE8F0 16198002 5B299DC4 9DA487A3 A42FB0F0 810DB6B5 10F3B9D3 
  A58B39BC 16A2B34E 71C01B8F 08CF2196 C628EE80 3086B8BE ACA07E13 3E62414E 
  5D93EF32 A7660740 E
 << 2B50FE1 044CA56F D32CA9DC E71DBFC4 F4227433 F998CA21 
  786786AC 5B7A0740 59CF79F6 020688
  	quit
!
spanning-tree mode pvst
spanning-tree portfast bpduguard default
spanning-tree extend system-id
no spanning-tree vlan 2-91,93-237,240-242,244,246,24
 << 8,251-252,256,359,500,502
no spanning-tree vlan 505,509,511-515,520,522,551-560,562-570,601-603,605-606
no spanning-tree vlan 610,629-630,632-633,635-637,654,674-676,701,741-742,800
no spanning-tree vlan 801-805,807,880,901-904,908,910-913,915-916,926-
 << 930,970
no spanning-tree vlan 995-1000
spanning-tree vlan 1-1000 priority 57344
!
!
!
!
!
errdisable recovery cause udld
errdisable recovery cause bpduguard
errdisable recovery cause security-violation
errdisable recovery cause channel-misconfi
 << g (STP)
errdisable recovery cause pagp-flap
errdisable recovery cause dtp-flap
errdisable recovery cause link-flap
errdisable recovery cause sfp-config-mismatch
errdisable recovery cause gbic-invalid
errdisable recovery cause psecure-violation
errd
 << isable recovery cause port-mode-failure
errdisable recovery cause dhcp-rate-limit
errdisable recovery cause pppoe-ia-rate-limit
errdisable recovery cause mac-limit
errdisable recovery cause vmps
errdisable recovery cause storm-control
errdisable rec
 << overy cause inline-power
errdisable recovery cause arp-inspection
errdisable recovery cause loopback
errdisable recovery cause small-frame
errdisable recovery cause psp
errdisable recovery interval 1800
!
vlan internal allocation policy ascending

 << !
!
!
!
!
!
interface FastEthernet0
 no ip address
 shutdown
!
interface GigabitEthernet1/0/1
 switchport access vlan 649
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging 
 << time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/2
 switchport access vlan 649
 switchport mode access
 switchport port-security maximum 2
 
 << switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/3
 switchport access vlan 649
 swit
 << chport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interfac
 << e GigabitEthernet1/0/4
 switchport access vlan 649
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security a
 << ging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/5
 switchport access vlan 649
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport po
 << rt-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/6
 switchport access vlan 649
 switchport mode access
 switchport port-security maximum 2
 switchport port-securit
 << y
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/7
 switchport access vlan 649
 switchport mode access
 sw
 << itchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/8
 << 
 switchport access vlan 649
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 
 << spanning-tree portfast
!
interface GigabitEthernet1/0/9
 switchport access vlan 649
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation p
 << rotect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/10
 switchport access vlan 649
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-se
 << curity aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/11
 switchport access vlan 649
 switchport mode access
 switchport port-securit
 << y maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/12
 switchport access 
 << vlan 649
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfa
 << st
!
interface GigabitEthernet1/0/13
 switchport access vlan 649
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport
 <<  port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/14
 switchport access vlan 649
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 1
 << 5
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/15
 switchport access vlan 649
 switchport mode access
 switchport port-security maximum 2
 switc
 << hport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/16
 switchport access vlan 649
 switchpo
 << rt mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface Gi
 << gabitEthernet1/0/17
 switchport access vlan 649
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security agin
 << g type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/18
 switchport access vlan 649
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port
 << -security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/19
 switchport access vlan 649
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 << 
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/20
 switchport access vlan 649
 switchport mode access
 sw
 << itchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/21
 << 
 switchport access vlan 649
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity

 <<  spanning-tree portfast
!
interface GigabitEthernet1/0/22
 switchport access vlan 649
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation
 <<  protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/23
 switchport access vlan 649
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-
 << security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/24
 switchport access vlan 649
 switchport mode access
 switchport port-secur
 << ity maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/25
 switchport acces
 << s vlan 649
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree port
 << fast
!
interface GigabitEthernet1/0/26
 switchport access vlan 649
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchpo
 << rt port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/27
 switchport access vlan 649
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time
 <<  15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/28
 switchport access vlan 649
 switchport mode access
 switchport port-security maximum 2
 swi
 << tchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/29
 switchport access vlan 649
 switch
 << port mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface 
 << GigabitEthernet1/0/30
 switchport access vlan 649
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security ag
 << ing type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/31
 switchport access vlan 649
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport po
 << rt-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/32
 switchport access vlan 649
 switchport mode access
 switchport port-security maximum 2
 switchport port-securi
 << ty
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/33
 switchport access vlan 649
 switchport mode access
 
 << switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/
 << 34
 switchport access vlan 649
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 << 
 spanning-tree portfast
!
interface GigabitEthernet1/0/35
 switchport access vlan 649
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violati
 << on protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/36
 switchport access vlan 649
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport por
 << t-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/37
 switchport access vlan 649
 switchport mode access
 switchport port-sec
 << urity maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/38
 switchport acc
 << ess vlan 649
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree po
 << rtfast
!
interface GigabitEthernet1/0/39
 switchport access vlan 649
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switch
 << port port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/40
 switchport access vlan 649
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging ti
 << me 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/41
 switchport access vlan 649
 switchport mode access
 switchport port-security maximum 2
 s
 << witchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/42
 switchport access vlan 649
 swit
 << chport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interfac
 << e GigabitEthernet1/0/43
 switchport access vlan 649
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security 
 << aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/44
 switchport access vlan 649
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport 
 << port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/45
 switchport access vlan 649
 switchport mode access
 switchport port-security maximum 2
 switchport port-secu
 << rity
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/46
 switchport access vlan 649
 switchport mode access
 << 
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/
 << 0/47
 switchport trunk native vlan 92
 switchport mode trunk
 no keepalive
 ip dhcp snooping trust
!
interface GigabitEthernet1/0/48
 switchport trunk native vlan 92
 switchport mode trunk
 no keepalive
 ip dhcp snooping trust
!
interface Giga
 << bitEthernet1/0/49
 switchport trunk native vlan 92
 switchport mode trunk
 ip dhcp snooping trust
!
interface GigabitEthernet1/0/50
 switchport trunk native vlan 92
 switchport mode trunk
 ip dhcp snooping trust
!
interface GigabitEthernet1/0/51
 << 
 switchport trunk native vlan 92
 switchport mode trunk
 ip dhcp snooping trust
!
interface GigabitEthernet1/0/52
 switchport trunk native vlan 92
 switchport mode trunk
 ip dhcp snooping trust
!
interface Vlan1
 no ip address
 no ip route-ca
 << che
 shutdown
!
interface Vlan92
 ip address 10.92.2.160 255.255.0.0
 ip broadcast-address 10.92.255.255
!
ip default-gateway 10.92.0.1
ip http server
ip http secure-server
!
logging facility local1
logging host 130.18.8.12
access-list 1 perm
 << it 10.92.0.0 0.0.255.255
!
snmp-server community sysnet RO 1
snmp-server community c2-b2=a2 RW 1
snmp-server contact 6F-2080
snmp-server enable traps snmp authentication linkdown linkup coldstart warmstart
snmp-server enable traps transceiver all
s
 << nmp-server enable traps tty
snmp-server enable traps cluster
snmp-server enable traps config-copy
snmp-server enable traps config
snmp-server enable traps config-ctid
snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-auth-fail-vlan no-guest
 << -vlan
snmp-server enable traps entity
snmp-server enable traps power-ethernet police
snmp-server enable traps cpu threshold
snmp-server enable traps rep
snmp-server enable traps bridge newroot topologychange
snmp-server enable traps stpx inconsisten
 << cy root-inconsistency loop-inconsistency
snmp-server enable traps syslog
snmp-server enable traps vtp
snmp-server enable traps vlancreate
snmp-server enable traps vlandelete
snmp-server enable traps flash insertion removal
snmp-server enable traps p
 << ort-security
snmp-server enable traps envmon fan shutdown supply temperature status
snmp-server enable traps errdisable
snmp-server enable traps mac-notification change move threshold
snmp-server enable traps vlan-membership
snmp-server host 130.18.2
 << .208 sysnet 
!
!
line con 0
line vty 0 4
 password 7 132405170A5108603C
 login
line vty 5 15
 password 7 0325490E07522D0659
 login
!
ntp server 10.92.0.5
end

c29s6.a38.meridian#
Expect: matched string 1: #
 >> show interface status

Expect: searching for 2 strs:  :# :>
 << show interface status

Port      Name               Status       Vlan       Duplex  Speed Type
Gi1/0/1                      notconnect   649          auto   auto 10/100/1000BaseTX
Gi1/0/2                      notconnect   649          auto   auto 10/1
 << 00/1000BaseTX
Gi1/0/3                      notconnect   649          auto   auto 10/100/1000BaseTX
Gi1/0/4                      notconnect   649          auto   auto 10/100/1000BaseTX
Gi1/0/5                      notconnect   649          auto   auto 1
 << 0/100/1000BaseTX
Gi1/0/6                      notconnect   649          auto   auto 10/100/1000BaseTX
Gi1/0/7                      notconnect   649          auto   auto 10/100/1000BaseTX
Gi1/0/8                      notconnect   649          auto   aut
 << o 10/100/1000BaseTX
Gi1/0/9                      notconnect   649          auto   auto 10/100/1000BaseTX
Gi1/0/10                     notconnect   649          auto   auto 10/100/1000BaseTX
Gi1/0/11                     notconnect   649          auto   
 << auto 10/100/1000BaseTX
Gi1/0/12                     notconnect   649          auto   auto 10/100/1000BaseTX
Gi1/0/13                     notconnect   649          auto   auto 10/100/1000BaseTX
Gi1/0/14                     notconnect   649          auto
 <<    auto 10/100/1000BaseTX
Gi1/0/15                     notconnect   649          auto   auto 10/100/1000BaseTX
Gi1/0/16                     notconnect   649          auto   auto 10/100/1000BaseTX
Gi1/0/17                     notconnect   649          a
 << uto   auto 10/100/1000BaseTX
Gi1/0/18                     notconnect   649          auto   auto 10/100/1000BaseTX
Gi1/0/19                     notconnect   649          auto   auto 10/100/1000BaseTX
Gi1/0/20                     notconnect   649        
 <<   auto   auto 10/100/1000BaseTX
Gi1/0/21                     notconnect   649          auto   auto 10/100/1000BaseTX
Gi1/0/22                     notconnect   649          auto   auto 10/100/1000BaseTX
Gi1/0/23                     notconnect   649     
 <<      auto   auto 10/100/1000BaseTX
Gi1/0/24                     notconnect   649          auto   auto 10/100/1000BaseTX
Gi1/0/25                     notconnect   649          auto   auto 10/100/1000BaseTX
Gi1/0/26                     notconnect   649  
 <<         auto   auto 10/100/1000BaseTX
Gi1/0/27                     notconnect   649          auto   auto 10/100/1000BaseTX
Gi1/0/28                     notconnect   649          auto   auto 10/100/1000BaseTX
Gi1/0/29                     notconnect   64
 << 9          auto   auto 10/100/1000BaseTX
Gi1/0/30                     notconnect   649          auto   auto 10/100/1000BaseTX
Gi1/0/31                     notconnect   649          auto   auto 10/100/1000BaseTX
Gi1/0/32                     notconnect  
 <<  649          auto   auto 10/100/1000BaseTX
Gi1/0/33                     notconnect   649          auto   auto 10/100/1000BaseTX
Gi1/0/34                     notconnect   649          auto   auto 10/100/1000BaseTX
Gi1/0/35                     notconnec
 << t   649          auto   auto 10/100/1000BaseTX
Gi1/0/36                     notconnect   649          auto   auto 10/100/1000BaseTX
Gi1/0/37                     notconnect   649          auto   auto 10/100/1000BaseTX
Gi1/0/38                     notcon
 << nect   649          auto   auto 10/100/1000BaseTX
Gi1/0/39                     notconnect   649          auto   auto 10/100/1000BaseTX
Gi1/0/40                     notconnect   649          auto   auto 10/100/1000BaseTX
Gi1/0/41                     not
 << connect   649          auto   auto 10/100/1000BaseTX
Gi1/0/42                     notconnect   649          auto   auto 10/100/1000BaseTX
Gi1/0/43                     notconnect   649          auto   auto 10/100/1000BaseTX
Gi1/0/44                     
 << notconnect   649          auto   auto 10/100/1000BaseTX
Gi1/0/45                     notconnect   649          auto   auto 10/100/1000BaseTX
Gi1/0/46                     notconnect   649          auto   auto 10/100/1000BaseTX
Gi1/0/47                  
 <<    notconnect   1            auto   auto 10/100/1000BaseTX
Gi1/0/48                     notconnect   1            auto   auto 10/100/1000BaseTX
Gi1/0/49                     notconnect   1            auto   auto Not Present
Gi1/0/50                     
 << notconnect   1            auto   auto Not Present
Gi1/0/51                     notconnect   1            auto   auto Not Present
Gi1/0/52                     notconnect   1            auto   auto Not Present
Fa0                          disabled     ro
 << uted       auto   auto 10/100BaseTX
c29s6.a38.meridian#
Expect: matched string 1: #
