trying to use serial port: /dev/ttyUSB1
 >> 
 >> 

Expect: searching for 4 strs:  :[yes/no] :Press RETURN to get started. :# :Switch>
 << 


         --- System Configuration Dialog ---

Enable secret warning
----------------------------------
In order to access the device manager, an enable secret is required
If you enter the initial configuration dialog, you will be prompted for t
 << he enable secret
If you choose not to enter the intial configuration dialog, or if you exit setup without setting the enable secret,
please set an enable secret using the following CLI in configuration mode-
enable secret 0 <cleartext password>
------
 << ----------------------------
Would you like to enter the initial configuration dialog? [yes/no]: 
% Please answer 'yes' or 'no'.
Would you like to enter the initial configuration dialog? [yes/no]: 
% Please answer 'yes' or 'no'.
Would you like to ent
Expect: matched string 1: [yes/no]
 >> 

 >> no

 >> term len 0

Expect: searching for 2 strs:  :# :>
 << er the initial configuration dialog? [yes/no]: 
% Please answer 'yes' or 'no'.
Would you like to enter the initial configuration dialog? [yes/no]: 
% Please answer 'yes' or 'no'.
Would you like to enter the initial configuration dialog? [yes/no]: 
% 
 << Please answer 'yes' or 'no'.
Would you like to enter the initial configuration dialog? [yes/no]: no
Switch>term len 0
Switch>
Expect: matched string 2: >
 >> show version

Expect: searching for 2 strs:  :# :>
 << show version
Cisco IOS Software, C2960X Software (C2960X-UNIVERSALK9-M), Version 15.0(2)EX5, RELEASE SOFTWARE (fc1)
Technical Support: http://www.cisco.com/techsupport
Copyright (c) 1986-2014 by Cisco Systems, Inc.
Compiled Fri 21-Feb-14 05:54 by prod
 << _rel_team

ROM: Bootstrap program is C2960X boot loader
BOOTLDR: C2960X Boot Loader (C2960X-HBOOT-M) Version 15.2(2r)E1, RELEASE SOFTWARE (fc1)

Switch uptime is 58 minutes
System returned to ROM by power-on
System restarted at 20:09:38 UTC Mon Dec
 <<  7 2015
System image file is "flash:/c2960x-universalk9-mz.150-2.EX5/c2960x-universalk9-mz.150-2.EX5.bin"


This product contains cryptographic features and is subject to United
States and local country laws governing import, export, transfer and
us
 << e. Delivery of Cisco cryptographic products does not imply
third-party authority to import, export, distribute or use encryption.
Importers, exporters, distributors and users are responsible for
compliance with U.S. and local country laws. By using thi
 << s product you
agree to comply with applicable laws and regulations. If you are unable
to comply with U.S. and local laws, return this product immediately.

A summary of U.S. laws governing Cisco cryptographic products may be found at:
http://www.cisc
 << o.com/wwl/export/crypto/tool/stqrg.html

If you require further assistance please contact us by sending email to
export@cisco.com.

cisco WS-C2960X-48TS-L (APM86XXX) processor (revision H0) with 524288K bytes of memory.
Processor board ID FCW1904B3H
 << 9
Last reset from power-on
1 Virtual Ethernet interface
1 FastEthernet interface
52 Gigabit Ethernet interfaces
The password-recovery mechanism is enabled.

512K bytes of flash-simulated non-volatile configuration memory.
Base ethernet MAC Address
 <<        : A0:55:4F:AC:63:80
Motherboard assembly number     : 73-15971-02
Power supply part number        : 341-0537-02
Motherboard serial number       : FOC19043BZU
Power supply serial number      : LIT18480N12
Model revision number           : H0
M
 << otherboard revision number     : B0
Model number                    : WS-C2960X-48TS-L
Daughterboard assembly number   : 73-14200-03
Daughterboard serial number     : FOC1903994D
System serial number            : FCW1904B3H9
Top Assembly Part Number 
 <<        : 800-41468-01
Top Assembly Revision Number    : C0
Version ID                      : V03
CLEI Code Number                : CMMNF00ARB
Daughterboard revision number   : A0
Hardware Board Revision Number  : 0x12


Switch Ports Model         
 <<      SW Version            SW Image                 
------ ----- -----              ----------            ----------               
*    1 52    WS-C2960X-48TS-L   15.0(2)EX5            C2960X-UNIVERSALK9-M     


Configuration register is 0xF

Sw
 << itch>
Expect: matched string 2: >
 >> enable

Expect: searching for 2 strs:  :Password: :#
 << enable
Switch#
Expect: matched string 2: #
 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
Expect: matched string 1: (config)#
 >> no service pad

 >> service timestamps debug datetime localtime

 >> service timestamps log datetime localtime

 >> service password-encryption

 >> boot-start-marker

 >> boot-end-marker

 >> enable secret Area=l*w

 >> enable password Area=l*w

 >> no aaa new-model

 >> clock timezone CST -6 0

 >> clock summer-time CDT recurring

 >> authentication mac-move permit

 >> ip domain-name mgmt.msstate.edu

 >> ip name-server 130.18.2.210

 >> vtp domain vtp01.mgmt.msstate.edu

 >> vtp mode client

 >> crypto pki trustpoint TP-self-signed-2494998912

 >>  enrollment selfsigned

 >>  subject-name cn=IOS-Self-Signed-Certificate-2494998912

 >>  revocation-check none

 >>  rsakeypair TP-self-signed-2494998912

 >> crypto pki certificate chain TP-self-signed-2494998912

 >>  certificate self-signed 01 nvram:IOS-Self-Sig#3232.cer

 >> spanning-tree portfast bpduguard default

 >> spanning-tree extend system-id

 >> vlan internal allocation policy ascending

 >> errdisable recovery cause all

 >> errdisable recovery interval 1800

 >> interface FastEthernet0

 >>  no ip address

 >>  shutdown

 >> interface Vlan1

 >>  no ip address

 >>  no ip route-cache

 >>  shutdown

 >> interface Vlan92

 >> ip http server

 >> ip http secure-server

 >> logging facility local1

 >> logging host 130.18.8.12

 >> access-list 1 permit 10.92.0.0 0.0.255.255

 >> snmp-server community sysnet RO 1

 >> snmp-server community c2-b2=a2 RW 1

 >> snmp-server enable traps snmp authentication linkdown linkup coldstart warmstart

 >> snmp-server enable traps transceiver all

 >> snmp-server enable traps tty

 >> snmp-server enable traps cluster

 >> snmp-server enable traps config-copy

 >> snmp-server enable traps config

 >> snmp-server enable traps config-ctid

 >> snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-auth-fail-vlan no-guest-vlan

 >> snmp-server enable traps entity

 >> snmp-server enable traps power-ethernet police

 >> snmp-server enable traps cpu threshold

 >> snmp-server enable traps rep

 >> snmp-server enable traps bridge newroot topologychange

 >> snmp-server enable traps stpx inconsistency root-inconsistency loop-inconsistency

 >> snmp-server enable traps syslog

 >> snmp-server enable traps vtp

 >> snmp-server enable traps vlancreate

 >> snmp-server enable traps vlandelete

 >> snmp-server enable traps flash insertion removal

 >> snmp-server enable traps port-security

 >> snmp-server enable traps envmon fan shutdown supply temperature status

 >> snmp-server enable traps errdisable

 >> snmp-server enable traps mac-notification change move threshold

 >> snmp-server enable traps vlan-membership

 >> snmp-server host 130.18.2.208 sysnet 

 >> line con 0

 >> line vty 0 4

 >>  password Area=l*w

 >>  login

 >> line vty 5 15

 >>  password Area=l*w

 >>  login

 >> ntp server 10.92.0.5

 >> end

Expect: searching for 1 strs:  :Configured
 << no service pad
Switch(config)#service timestamps debug datetime localtime
Switch(config)#service timestamps log datetime localtime
Switch(config)#service password-encryption
Switch(config)#boot-start-marker
Switch(config)#boot-end-marker
Switch(conf
 << ig)#enable secret Area=l*w
Switch(config)#enable password Area=l*w
The enable password you have chosen is the same as your enable secret.
This is not recommended.  Re-enter the enable password.

Switch(config)#no aaa new-model
Switch(config)#clock t
 << imezone CST -6 0
Switch(config)#clock summer-time CDT recurring

Dec  7 15:09:15: %SYS-6-CLOCKUPDATE: System clock has been updated from 21:09:13 UTC Mon Dec 7 2015 to 15:09:15 CST Mon Dec 7 2015, configured from console by console.
Switch(config)#auth
 << entication mac-move permit
Switch(config)#ip domain-name mgmt.msstate.edu
Switch(config)#ip name-server 130.18.2.210
Switch(config)#vtp domain vtp01.mgmt.msstate.edu
Changing VTP domain name from NULL to vtp01.mgmt.msstate.edu
Switch(config)#vtp mode
 <<  client
Setting device to VTP Client mode for VLANS.
Switch(config)#crypto pki trustpoint TP-self-signed-2494998912
Switch(ca-trustpoint)# enrollment selfsigned
Switch(ca-trustpoint)# subject-name cn=IOS-Self-Signed-Certificate-2494998912
Switch(ca-t
 << rustpoint)# revocation-check none
Switch(ca-trustpoint)# rsakeypair TP-self-signed-2494998912
Switch(ca-trustpoint)#crypto pki certificate chain TP-self-signed-2494998912
Switch(config-cert-chain)# certificate self-signed 01 nvram:IOS-Self-Sig#3232
 << $e self-signed 01 nvram:IOS-Self-Sig#3232.         cer
Switch(config-cert-chain)#spanning-tree portfast bpduguard default
Switch(config)#spanning-tree extend system-id
Switch(config)#vlan internal
 <<  allocation policy ascending
Switch(config)#errdisable recovery cause all
Switch(config)#errdisable recovery interval 1800
Switch(config)#interface FastEthernet0
Switch(config-if)# no ip address
Switch(config-if)# shutdown
Switch(config-if)#interfac
 << e Vlan1
Switch(config-if)# no ip address
Switch(config-if)# no ip route-cache
Switch(config-if)#
Dec  7 15:09:17: %SYS-6-CLOCKUPDATE: System clock has been updated from 15:09:15 CST Mon Dec 7 2015 to 15:09:17 CST Mon Dec 7 2015, configured from consol
 << e by console.
Dec  7 15:09:17: %SW_VLAN-6-VTP_DOMAIN_NAME_CHG: VTP domain name changed to vtp01.mgmt.msstate.edu. shutdown
Switch(config-if)#interface Vlan92
Switch(config-if)#ip http server
Switch(config)#ip http secure-server
% Generating 1024 bit 
 << RSA keys, keys will be non-exportable...
[OK] (elapsed time was 1 seconds)

Dec  7 15:09:19: %LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan92, changed state to down
Switch(config)#logging facility local1
Switch(config)#logging host 130.18.8.12
 << 
Switch(config)#access-list 1 permit 10.92.0.0 0.0.255.255
Switch(config)#snmp-server community sysnet RO 1
Switch(config)#snmp-server community c2-b2=a2 RW 1
Switch(config)#snmp-server enable traps snmp authentication linkdown linkup c
 << $ enable traps snmp authentication linkdown linkup co         ldstart waps snmp authentication linkdown linkup coldstart wa         
 << rmstart
Switch(config)#snmp-server enable traps transceiver all
Switch(config)#snmp-server enable traps tty
Switch(config)#snmp-server enable traps cluster
Switch(config)#snmp-server enable traps config-copy
Switch(config)#
Dec  7 15:09:20: %LINK-
 << 5-CHANGED: Interface FastEthernet0, changed state to administratively down
Dec  7 15:09:20: %SSH-5-ENABLED: SSH 1.99 has been enabled
Dec  7 15:09:20: %LINK-5-CHANGED: Interface Vlan1, changed state to administratively downsnmp-server enable traps confi
 << g
Switch(config)#snmp-server enable traps config-ctid
Switch(config)#snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-au$ enable traps dot1x auth-fail-vlan guest-vlan no-aut       
 <<   h-fail-vlaps dot1x auth-fail-vlan guest-vlan no-auth-fail-vla         n no-guesuth-fail-vlan guest-vlan no-auth-fa
 << il-vlan no-guest         -vlan
Switch(config)#snmp-server enable traps entity
Switch(config)#snmp-server enable traps power-ethernet police
Switch(config)#
Dec  7 15:09:21: %PKI-4-NOAUTOSAVE: Configuration was modified.  Issue "write memory" 
 << to save new certificatesnmp-server enable traps cpu threshold
Switch(config)#snmp-server enable traps rep
Switch(config)#snmp-server enable traps bridge newroot topologychange
Switch(config)#snmp-server enable traps stpx inconsistency root-inconsistenc
 << y$ enable traps stpx inconsistency root-inconsistency          loop-incoaps stpx inconsistency root-inconsistency loop-inco
 << n         sistency
Switch(config)#snmp-server enable traps syslog
Switch(config)#
Dec  7 15:09:22: %SYS-6-LOGGINGHOST_STARTSTOP: Logging to host 130.18.8.12 port 514 started - CLI initiatedsnmp-server enable traps vtp
Switch(config)#snmp-serv
 << er enable traps vlancreate
Switch(config)#snmp-server enable traps vlandelete
Switch(config)#snmp-server enable traps flash insertion removal
Switch(config)#snmp-server enable traps port-security
Switch(config)#snmp-server enable traps envmon fan shut
 << down supply temperatur$ enable traps envmon fan shutdown supply temperature          status
Switch(config)#snmp-server enable traps errdisable
Switch(config)#snmp-server enable traps
 <<  mac-notification change move threshol$ enable traps mac-notification change move threshold         
Switch(config)#snmp-server enable traps vlan-membership
Switch(config)#snmp-serve
 << r host 130.18.2.208 sysnet 
Switch(config)#line con 0
Switch(config-line)#line vty 0 4
Switch(config-line)# password Area=l*w
Switch(config-line)# login
Switch(config-line)#line vty 5 15
Switch(config-line)# password Area=l*w
Switch(config-line)# l
 << ogin
Switch(config-line)#ntp server 10.92.0.5
Switch(config)#end
Switch#
 << 
Dec  7 15:09:27: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
Switch#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
Expect: matched string 1: (config)#
 >> spanning-tree mode pvst

 >> no spanning-tree vlan 2-91,93-237,240-242,244,246,248,251-252,256,359,500,502

 >> no spanning-tree vlan 505,509,511-515,520,522,551-560,562-570,601-603,605-606

 >> no spanning-tree vlan 610,629-630,632-633,635-637,654,674-676,701,741-742,800

 >> no spanning-tree vlan 801-805,807,880,901-904,908,910-913,915-916,926-930,970

 >> no spanning-tree vlan 995-1000

 >> spanning-tree vlan 1-1000 priority 57344

 >> 

 >> end

Expect: searching for 1 strs:  :Configured
 << spanning-tree mode pvst
Switch(config)#no spanning-tree vlan 2-91,93-237,240-242,244,246,248,251-252,$-tree vlan 2-91,93-237,240-242,244,246,248,251-252,2         56,359,50
 <<  2-91,93-237,240-242,244,246,248,251-252,256,359,500         ,502
Switch(config)#no spanning-tree vlan 505,509,511-515,520,522,551-560,562-570,
 << $-tree vlan 505,509,511-515,520,522,551-560,562-570,6         01-603,60 505,509,511-515,520,522,551-560,562-570,601-603,605         -606
Switch(config)#no spanning-t
 << ree vlan 610,629-630,632-633,635-637,654,674-676,$-tree vlan 610,629-630,632-633,635-637,654,674-676,7         01,741-74 61
 << 0,629-630,632-633,635-637,654,674-676,701,741-742         ,800
Switch(config)#no spanning-tree vlan 801-805,807,880,901-904,908,910-913,915-$-tree vlan 801-805,807,880,901-904,908,910
 << -913,915-9         16,926-93 801-805,807,880,901-904,908,910-913,915-916,926-930         ,970
Switch(config)#no spanning-tree vlan 995-1000
Switch(config)#spanning-tree vlan 
 << 1-1000 priority 57344
Switch(config)#
Switch(config)#end
Switch#
 << 
Dec  7 15:09:36: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
Switch#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
Expect: matched string 1: (config)#
 >> hostname c29s8.a38.meridian 

Expect: searching for 2 strs:  :# :>
 << hostname c29s8.a38.meridian 
c29s8.a38.meridian(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s8.a38.meridian#
 << 
Dec  7 15:09:42: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s8.a38.meridian#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s8.a38.meridian(config)#
Expect: matched string 1: (config)#
 >> snmp-server contact 6F-2076

Expect: searching for 1 strs:  :#
 << snmp-server contact 6F-2076
c29s8.a38.meridian(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s8.a38.meridian#
 << 
Dec  7 15:09:48: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s8.a38.meridian#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s8.a38.meridian(config)#
Expect: matched string 1: (config)#
 >> interface vlan 92

Expect: searching for 1 strs:  :(config-if)#
 << interface vlan 92
c29s8.a38.meridian(config-if)#
Expect: matched string 1: (config-if)#
 >> ip address 10.92.2.162 255.255.0.0

 >> ip broadcast-address 10.92.255.255

 >> end

Expect: searching for 1 strs:  :Configured
 << ip address 10.92.2.162 255.255.0.0
c29s8.a38.meridian(config-if)#ip broadcast-address 10.92.255.255
c29s8.a38.meridian(config-if)#end
c29s8.a38.meridian#
 << 
Dec  7 15:09:55: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s8.a38.meridian#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s8.a38.meridian(config)#
Expect: matched string 1: (config)#
 >> interface Vlan92

Expect: searching for 1 strs:  :(config-if)#
 << interface Vlan92
c29s8.a38.meridian(config-if)#
Expect: matched string 1: (config-if)#
 >> ip default-gateway 10.92.0.1

 >> end

Expect: searching for 1 strs:  :Configured
 << ip default-gateway 10.92.0.1
c29s8.a38.meridian(config)#end
c29s8.a38.meridian#
Dec  7 15:10:00: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s8.a38.meridian#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s8.a38.meridian(config)#
Expect: matched string 1: (config)#
 >> ip dhcp snooping

Expect: searching for 1 strs:  :#
 << ip dhcp snooping
c29s8.a38.meridian(config)#
Expect: matched string 1: #
 >> ip dhcp snooping vlan 649

Expect: searching for 1 strs:  :#
 << ip dhcp snooping vlan 649
c29s8.a38.meridian(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s8.a38.meridian#
Dec  7 15:10:07: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s8.a38.meridian#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s8.a38.meridian(config)#
Expect: matched string 1: (config)#
 >> default interface range gi1/0/1 - 48 

 >> interface range gi1/0/1 - 48 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi1/0/1 - 48 
c29s8.a38.meridian(config)#interface range gi1/0/1 - 48 
c29s8.a38.meridian(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport access vlan 649

 >> switchport mode access

 >> spanning-tree portfast

 >> switchport port-security maximum 2

 >> switchport port-security

 >> switchport port-security aging time 15

 >> switchport port-security violation protect

 >> switchport port-security aging type inactivity

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport access vlan 649
c29s8.a38.meridian(config-if-range)#switchport mode access
c29s8.a38.meridian(config-if-range)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, concentra
 << tors, switches, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast will be configured in 48 interfaces due to the range command 
 but will only have effect when the interface
 << s are in a non-trunking mode.
c29s8.a38.meridian(config-if-range)#switchport port-security maximum 2
c29s8.a38.meridian(config-if-range)#switchport port-security
c29s8.a38.meridian(config-if-range)#switchport port-security aging time 15
c29s8.a38.meri
 << dian(config-if-range)#switchport port-security violation protec$port-security violation protect         
c29s8.a38.meridian(config-if-range)#switchport port-security aging type inact
 << $port-security aging type inacti         vity
c29s8.a38.meridian(config-if-range)#end
c29s8.a38.meridian#
 << 
Dec  7 15:10:20: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s8.a38.meridian#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s8.a38.meridian(config)#
Expect: matched string 1: (config)#
 >> default interface range gi1/0/47 - 48 

 >> interface range gi1/0/47 - 48 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi1/0/47 - 48 
c29s8.a38.meridian(config)#interface range gi1/0/47 - 48 
c29s8.a38.meridian(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport mode trunk

 >> switchport trunk native vlan 92

 >> ip dhcp snooping trust

 >> no keepalive

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport mode trunk
c29s8.a38.meridian(config-if-range)#switchport trunk native vlan 92
c29s8.a38.meridian(config-if-range)#ip dhcp snooping trust
c29s8.a38.meridian(config-if-range)#no keepalive
c29s8.a38.meridian(config-if-range)#end
c29s8.a38.me
 << ridian#
 << 
Dec  7 15:10:31: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s8.a38.meridian#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s8.a38.meridian(config)#
Expect: matched string 1: (config)#
 >> default interface range gi1/0/49 - 52 

 >> interface range gi1/0/49 - 52 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi1/0/49 - 52 
c29s8.a38.meridian(config)#interface range gi1/0/49 - 52 
c29s8.a38.meridian(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport mode trunk

 >> switchport trunk native vlan 92

 >> ip dhcp snooping trust

 >> no keepalive

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport mode trunk
c29s8.a38.meridian(config-if-range)#switchport trunk native vlan 92
c29s8.a38.meridian(config-if-range)#ip dhcp snooping trust
c29s8.a38.meridian(config-if-range)#no keepalive
c29s8.a38.meridian(config-if-range)#end
c29s8.a38.me
 << ridian#
 << 
Dec  7 15:10:42: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> write mem

Expect: searching for 2 strs:  :# :>
 << 
c29s8.a38.meridian#write mem
Building configuration...

Expect: matched string 1: #
 >> 
Expect: searching for 2 strs:  :# :>
 << [OK]
c29s8.a38.meridian#
c29s8.a38.meridian#
c29s8.a38.meridian#
Expect: matched string 1: #
 >> sh run

Expect: searching for 2 strs:  :# :>
 << sh run
Building configuration...

Current configuration : 20096 bytes
!
! Last configuration change at 15:10:42 CST Mon Dec 7 2015
! NVRAM config last updated at 15:10:50 CST Mon Dec 7 2015
!
version 15.0
no service pad
service timestamps debug 
 << datetime localtime
service timestamps log datetime localtime
service password-encryption
!
hostname c29s8.a38.meridian
!
boot-start-marker
boot-end-marker
!
enable secret 5 $1$Q5XO$kdsEqPZYe.WK1hj4pEX1l.
enable password 7 123817121356004E3D
!

 << no aaa new-model
clock timezone CST -6 0
clock summer-time CDT recurring
switch 1 provision ws-c2960x-48ts-l
authentication mac-move permit
!
!
ip dhcp snooping vlan 649
ip dhcp snooping
ip domain-name mgmt.msstate.edu
ip name-server 130.18.2.21
 << 0
!
!
crypto pki trustpoint TP-self-signed-1336697728
 enrollment selfsigned
 subject-name cn=IOS-Self-Signed-Certificate-1336697728
 revocation-check none
 rsakeypair TP-self-signed-1336697728
!
!
crypto pki certificate chain TP-self-signed-133
 << 6697728
 certificate self-signed 01
  3082022B 30820194 A0030201 02020101 300D0609 2A864886 F70D0101 05050030 
  31312F30 2D060355 04031326 494F532D 53656C66 2D536967 6E65642D 43657274 
  69666963 6174652D 31333336 36393737 3238301E 170D3135 31323037 
 << 32313039 
  32305A17 0D323030 31303130 30303030 305A3031 312F302D 06035504 03132649 
  4F532D53 656C662D 5369676E 65642D43 65727469 66696361 74652D31 33333636 
  39373732 3830819F 300D0609 2A864886 F70D0101 01050003 818D0030 81890281 
  8100AD5B 4D302
 << AA1 A3824E3B CA6EE2DD E636496F 5E0FDF10 7480D711 A1FC1F52 
  40F05886 2A86FB89 95EFFC4E F38F672A E36D67A0 C87DFDEF B41A831F 852BDBEA 
  CB302D67 C7042E45 214E3D53 717B44E5 74C866AE 31B9C565 D43FBB8F D33DB9C2 
  D758132E 9B831E24 2143831D DD4498FF 419B2
 << 91D 0296A587 F2EAF84F E1895C6B 
  78130203 010001A3 53305130 0F060355 1D130101 FF040530 030101FF 301F0603 
  551D2304 18301680 14790F83 12B7C66D 7CC6BEBF 9963A2B9 497BEFB6 70301D06 
  03551D0E 04160414 790F8312 B7C66D7C C6BEBF99 63A2B949 7BEFB670 300D0
 << 609 
  2A864886 F70D0101 05050003 8181004A C056F6A7 4BEC47DB C1AD207D 60BB8E39 
  068B11B4 0C62E0D0 61A0EA93 A40C31D5 67889BD5 407D851D 1D1B134F 9CA504C8 
  C822F126 065E5C02 F46E2C5D 93A87D64 05FE6D93 D8A31752 647B7125 748F25FD 
  77C5D0D2 546292AB B
 << B3736BF 6250DF79 F12D96B0 939E2EBB E656C628 7A0340AB 
  984BA761 18C61EB5 29CAA9DE C5AF58
  	quit
!
spanning-tree mode pvst
spanning-tree portfast bpduguard default
spanning-tree extend system-id
no spanning-tree vlan 2-91,93-237,240-242,244,246,24
 << 8,251-252,256,359,500,502
no spanning-tree vlan 505,509,511-515,520,522,551-560,562-570,601-603,605-606
no spanning-tree vlan 610,629-630,632-633,635-637,654,674-676,701,741-742,800
no spanning-tree vlan 801-805,807,880,901-904,908,910-913,915-916,926-
 << 930,970
no spanning-tree vlan 995-1000
spanning-tree vlan 1-1000 priority 57344
!
!
!
!
!
errdisable recovery cause udld
errdisable recovery cause bpduguard
errdisable recovery cause security-violation
errdisable recovery cause channel-misconfi
 << g (STP)
errdisable recovery cause pagp-flap
errdisable recovery cause dtp-flap
errdisable recovery cause link-flap
errdisable recovery cause sfp-config-mismatch
errdisable recovery cause gbic-invalid
errdisable recovery cause psecure-violation
errd
 << isable recovery cause port-mode-failure
errdisable recovery cause dhcp-rate-limit
errdisable recovery cause pppoe-ia-rate-limit
errdisable recovery cause mac-limit
errdisable recovery cause vmps
errdisable recovery cause storm-control
errdisable rec
 << overy cause inline-power
errdisable recovery cause arp-inspection
errdisable recovery cause loopback
errdisable recovery cause small-frame
errdisable recovery cause psp
errdisable recovery interval 1800
!
vlan internal allocation policy ascending

 << !
!
!
!
!
!
interface FastEthernet0
 no ip address
 shutdown
!
interface GigabitEthernet1/0/1
 switchport access vlan 649
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging 
 << time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/2
 switchport access vlan 649
 switchport mode access
 switchport port-security maximum 2
 
 << switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/3
 switchport access vlan 649
 swit
 << chport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interfac
 << e GigabitEthernet1/0/4
 switchport access vlan 649
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security a
 << ging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/5
 switchport access vlan 649
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport po
 << rt-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/6
 switchport access vlan 649
 switchport mode access
 switchport port-security maximum 2
 switchport port-securit
 << y
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/7
 switchport access vlan 649
 switchport mode access
 sw
 << itchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/8
 << 
 switchport access vlan 649
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 
 << spanning-tree portfast
!
interface GigabitEthernet1/0/9
 switchport access vlan 649
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation p
 << rotect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/10
 switchport access vlan 649
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-se
 << curity aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/11
 switchport access vlan 649
 switchport mode access
 switchport port-securit
 << y maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/12
 switchport access 
 << vlan 649
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfa
 << st
!
interface GigabitEthernet1/0/13
 switchport access vlan 649
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport
 <<  port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/14
 switchport access vlan 649
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 1
 << 5
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/15
 switchport access vlan 649
 switchport mode access
 switchport port-security maximum 2
 switc
 << hport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/16
 switchport access vlan 649
 switchpo
 << rt mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface Gi
 << gabitEthernet1/0/17
 switchport access vlan 649
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security agin
 << g type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/18
 switchport access vlan 649
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port
 << -security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/19
 switchport access vlan 649
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 << 
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/20
 switchport access vlan 649
 switchport mode access
 sw
 << itchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/21
 << 
 switchport access vlan 649
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity

 <<  spanning-tree portfast
!
interface GigabitEthernet1/0/22
 switchport access vlan 649
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation
 <<  protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/23
 switchport access vlan 649
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-
 << security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/24
 switchport access vlan 649
 switchport mode access
 switchport port-secur
 << ity maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/25
 switchport acces
 << s vlan 649
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree port
 << fast
!
interface GigabitEthernet1/0/26
 switchport access vlan 649
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchpo
 << rt port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/27
 switchport access vlan 649
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time
 <<  15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/28
 switchport access vlan 649
 switchport mode access
 switchport port-security maximum 2
 swi
 << tchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/29
 switchport access vlan 649
 switch
 << port mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface 
 << GigabitEthernet1/0/30
 switchport access vlan 649
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security ag
 << ing type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/31
 switchport access vlan 649
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport po
 << rt-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/32
 switchport access vlan 649
 switchport mode access
 switchport port-security maximum 2
 switchport port-securi
 << ty
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/33
 switchport access vlan 649
 switchport mode access
 
 << switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/
 << 34
 switchport access vlan 649
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 << 
 spanning-tree portfast
!
interface GigabitEthernet1/0/35
 switchport access vlan 649
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violati
 << on protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/36
 switchport access vlan 649
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport por
 << t-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/37
 switchport access vlan 649
 switchport mode access
 switchport port-sec
 << urity maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/38
 switchport acc
 << ess vlan 649
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree po
 << rtfast
!
interface GigabitEthernet1/0/39
 switchport access vlan 649
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switch
 << port port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/40
 switchport access vlan 649
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging ti
 << me 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/41
 switchport access vlan 649
 switchport mode access
 switchport port-security maximum 2
 s
 << witchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/42
 switchport access vlan 649
 swit
 << chport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interfac
 << e GigabitEthernet1/0/43
 switchport access vlan 649
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security 
 << aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/44
 switchport access vlan 649
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport 
 << port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/45
 switchport access vlan 649
 switchport mode access
 switchport port-security maximum 2
 switchport port-secu
 << rity
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/46
 switchport access vlan 649
 switchport mode access
 << 
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/
 << 0/47
 switchport trunk native vlan 92
 switchport mode trunk
 no keepalive
 ip dhcp snooping trust
!
interface GigabitEthernet1/0/48
 switchport trunk native vlan 92
 switchport mode trunk
 no keepalive
 ip dhcp snooping trust
!
interface Giga
 << bitEthernet1/0/49
 switchport trunk native vlan 92
 switchport mode trunk
 ip dhcp snooping trust
!
interface GigabitEthernet1/0/50
 switchport trunk native vlan 92
 switchport mode trunk
 ip dhcp snooping trust
!
interface GigabitEthernet1/0/51
 << 
 switchport trunk native vlan 92
 switchport mode trunk
 ip dhcp snooping trust
!
interface GigabitEthernet1/0/52
 switchport trunk native vlan 92
 switchport mode trunk
 ip dhcp snooping trust
!
interface Vlan1
 no ip address
 no ip route-ca
 << che
 shutdown
!
interface Vlan92
 ip address 10.92.2.162 255.255.0.0
 ip broadcast-address 10.92.255.255
!
ip default-gateway 10.92.0.1
ip http server
ip http secure-server
!
logging facility local1
logging host 130.18.8.12
access-list 1 perm
 << it 10.92.0.0 0.0.255.255
!
snmp-server community sysnet RO 1
snmp-server community c2-b2=a2 RW 1
snmp-server contact 6F-2076
snmp-server enable traps snmp authentication linkdown linkup coldstart warmstart
snmp-server enable traps transceiver all
s
 << nmp-server enable traps tty
snmp-server enable traps cluster
snmp-server enable traps config-copy
snmp-server enable traps config
snmp-server enable traps config-ctid
snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-auth-fail-vlan no-guest
 << -vlan
snmp-server enable traps entity
snmp-server enable traps power-ethernet police
snmp-server enable traps cpu threshold
snmp-server enable traps rep
snmp-server enable traps bridge newroot topologychange
snmp-server enable traps stpx inconsisten
 << cy root-inconsistency loop-inconsistency
snmp-server enable traps syslog
snmp-server enable traps vtp
snmp-server enable traps vlancreate
snmp-server enable traps vlandelete
snmp-server enable traps flash insertion removal
snmp-server enable traps p
 << ort-security
snmp-server enable traps envmon fan shutdown supply temperature status
snmp-server enable traps errdisable
snmp-server enable traps mac-notification change move threshold
snmp-server enable traps vlan-membership
snmp-server host 130.18.2
 << .208 sysnet 
!
!
line con 0
line vty 0 4
 password 7 0325490E07522D0659
 login
line vty 5 15
 password 7 132405170A5108603C
 login
!
ntp server 10.92.0.5
end

c29s8.a38.meridian#
Expect: matched string 1: #
 >> show interface status

Expect: searching for 2 strs:  :# :>
 << show interface status

Port      Name               Status       Vlan       Duplex  Speed Type
Gi1/0/1                      notconnect   649          auto   auto 10/100/1000BaseTX
Gi1/0/2                      notconnect   649          auto   auto 10/1
 << 00/1000BaseTX
Gi1/0/3                      notconnect   649          auto   auto 10/100/1000BaseTX
Gi1/0/4                      notconnect   649          auto   auto 10/100/1000BaseTX
Gi1/0/5                      notconnect   649          auto   auto 1
 << 0/100/1000BaseTX
Gi1/0/6                      notconnect   649          auto   auto 10/100/1000BaseTX
Gi1/0/7                      notconnect   649          auto   auto 10/100/1000BaseTX
Gi1/0/8                      notconnect   649          auto   aut
 << o 10/100/1000BaseTX
Gi1/0/9                      notconnect   649          auto   auto 10/100/1000BaseTX
Gi1/0/10                     notconnect   649          auto   auto 10/100/1000BaseTX
Gi1/0/11                     notconnect   649          auto   
 << auto 10/100/1000BaseTX
Gi1/0/12                     notconnect   649          auto   auto 10/100/1000BaseTX
Gi1/0/13                     notconnect   649          auto   auto 10/100/1000BaseTX
Gi1/0/14                     notconnect   649          auto
 <<    auto 10/100/1000BaseTX
Gi1/0/15                     notconnect   649          auto   auto 10/100/1000BaseTX
Gi1/0/16                     notconnect   649          auto   auto 10/100/1000BaseTX
Gi1/0/17                     notconnect   649          a
 << uto   auto 10/100/1000BaseTX
Gi1/0/18                     notconnect   649          auto   auto 10/100/1000BaseTX
Gi1/0/19                     notconnect   649          auto   auto 10/100/1000BaseTX
Gi1/0/20                     notconnect   649        
 <<   auto   auto 10/100/1000BaseTX
Gi1/0/21                     notconnect   649          auto   auto 10/100/1000BaseTX
Gi1/0/22                     notconnect   649          auto   auto 10/100/1000BaseTX
Gi1/0/23                     notconnect   649     
 <<      auto   auto 10/100/1000BaseTX
Gi1/0/24                     notconnect   649          auto   auto 10/100/1000BaseTX
Gi1/0/25                     notconnect   649          auto   auto 10/100/1000BaseTX
Gi1/0/26                     notconnect   649  
 <<         auto   auto 10/100/1000BaseTX
Gi1/0/27                     notconnect   649          auto   auto 10/100/1000BaseTX
Gi1/0/28                     notconnect   649          auto   auto 10/100/1000BaseTX
Gi1/0/29                     notconnect   64
 << 9          auto   auto 10/100/1000BaseTX
Gi1/0/30                     notconnect   649          auto   auto 10/100/1000BaseTX
Gi1/0/31                     notconnect   649          auto   auto 10/100/1000BaseTX
Gi1/0/32                     notconnect  
 <<  649          auto   auto 10/100/1000BaseTX
Gi1/0/33                     notconnect   649          auto   auto 10/100/1000BaseTX
Gi1/0/34                     notconnect   649          auto   auto 10/100/1000BaseTX
Gi1/0/35                     notconnec
 << t   649          auto   auto 10/100/1000BaseTX
Gi1/0/36                     notconnect   649          auto   auto 10/100/1000BaseTX
Gi1/0/37                     notconnect   649          auto   auto 10/100/1000BaseTX
Gi1/0/38                     notcon
 << nect   649          auto   auto 10/100/1000BaseTX
Gi1/0/39                     notconnect   649          auto   auto 10/100/1000BaseTX
Gi1/0/40                     notconnect   649          auto   auto 10/100/1000BaseTX
Gi1/0/41                     not
 << connect   649          auto   auto 10/100/1000BaseTX
Gi1/0/42                     notconnect   649          auto   auto 10/100/1000BaseTX
Gi1/0/43                     notconnect   649          auto   auto 10/100/1000BaseTX
Gi1/0/44                     
 << notconnect   649          auto   auto 10/100/1000BaseTX
Gi1/0/45                     notconnect   649          auto   auto 10/100/1000BaseTX
Gi1/0/46                     notconnect   649          auto   auto 10/100/1000BaseTX
Gi1/0/47                  
 <<    notconnect   1            auto   auto 10/100/1000BaseTX
Gi1/0/48                     notconnect   1            auto   auto 10/100/1000BaseTX
Gi1/0/49                     notconnect   1            auto   auto Not Present
Gi1/0/50                     
 << notconnect   1            auto   auto Not Present
Gi1/0/51                     notconnect   1            auto   auto Not Present
Gi1/0/52                     notconnect   1            auto   auto Not Present
Fa0                          disabled     ro
 << uted       auto   auto 10/100BaseTX
c29s8.a38.meridian#
Expect: matched string 1: #
