trying to use serial port: /dev/ttyUSB1
 >> 
 >> 

Expect: searching for 4 strs:  :[yes/no] :Press RETURN to get started. :# :Switch>
 << 


         --- System Configuration Dialog ---

Enable secret warning
----------------------------------
In order to access the device manager, an enable secret is required
If you enter the initial configuration dialog, you will be prompted for t
 << he enable secret
If you choose not to enter the intial configuration dialog, or if you exit setup without setting the enable secret,
please set an enable secret using the following CLI in configuration mode-
enable secret 0 <cleartext password>
------
 << ----------------------------
Would you like to enter the initial configuration dialog? [yes/no]: 
% Please answer 'yes' or 'no'.
Would you like to enter the initial configuration dialog? [yes/no]: 
% Please answer 'yes' or 'no'.
Would you like to ent
Expect: matched string 1: [yes/no]
 >> 

 >> no

 >> term len 0

Expect: searching for 2 strs:  :# :>
 << er the initial configuration dialog? [yes/no]: 
% Please answer 'yes' or 'no'.
Would you like to enter the initial configuration dialog? [yes/no]: 
% Please answer 'yes' or 'no'.
Would you like to enter the initial configuration dialog? [yes/no]: 
% 
 << Please answer 'yes' or 'no'.
Would you like to enter the initial configuration dialog? [yes/no]: no
Switch>term len 0
Switch>
Dec  7 19:28:59.642: %LINK-5-CHANGED: Interface Vlan1, changed state to administratively down
Dec  7 19:28:59.642: %LINK-5-C
Expect: matched string 2: >
 >> show version

Expect: searching for 2 strs:  :# :>
 << HANGED: Interface FastEthernet0, changed state to administratively downshow version
Cisco IOS Software, C2960X Software (C2960X-UNIVERSALK9-M), Version 15.0(2)EX5, RELEASE SOFTWARE (fc1)
Technical Support: http://www.cisco.com/techsupport
Copyright (c)
 <<  1986-2014 by Cisco Systems, Inc.
Compiled Fri 21-Feb-14 05:54 by prod_rel_team

ROM: Bootstrap program is C2960X boot loader
BOOTLDR: C2960X Boot Loader (C2960X-HBOOT-M) Version 15.2(2r)E1, RELEASE SOFTWARE (fc1)

Switch uptime is 3 days, 21 hours,
 <<  28 minutes
System returned to ROM by power-on
System restarted at 22:00:34 UTC Thu Dec 3 2015
System image file is "flash:/c2960x-universalk9-mz.150-2.EX5/c2960x-universalk9-mz.150-2.EX5.bin"


This product contains cryptographic features and is su
 << bject to United
States and local country laws governing import, export, transfer and
use. Delivery of Cisco cryptographic products does not imply
third-party authority to import, export, distribute or use encryption.
Importers, exporters, distributors
 <<  and users are responsible for
compliance with U.S. and local country laws. By using this product you
agree to comply with applicable laws and regulations. If you are unable
to comply with U.S. and local laws, return this product immediately.

A summ
 << ary of U.S. laws governing Cisco cryptographic products may be found at:
http://www.cisco.com/wwl/export/crypto/tool/stqrg.html

If you require further assistance please contact us by sending email to
export@cisco.com.

cisco WS-C2960X-48FPD-L (APM8
 << 6XXX) processor (revision F0) with 524288K bytes of memory.
Processor board ID FOC1906S7QC
Last reset from power-on
1 Virtual Ethernet interface
1 FastEthernet interface
50 Gigabit Ethernet interfaces
2 Ten Gigabit Ethernet interfaces
The password-
 << recovery mechanism is enabled.

512K bytes of flash-simulated non-volatile configuration memory.
Base ethernet MAC Address       : C8:00:84:AC:11:80
Motherboard assembly number     : 73-15964-02
Power supply part number        : 341-0527-01
Motherbo
 << ard serial number       : FOC190681HQ
Power supply serial number      : DCB190465K5
Model revision number           : F0
Motherboard revision number     : C0
Model number                    : WS-C2960X-48FPD-L
Daughterboard assembly number   : 73-142
 << 00-03
Daughterboard serial number     : FOC19064SVD
System serial number            : FOC1906S7QC
Top Assembly Part Number        : 800-41461-01
Top Assembly Revision Number    : C0
Version ID                      : V02
CLEI Code Number             
 <<    : CMMLJ00ARB
Daughterboard revision number   : A0
Hardware Board Revision Number  : 0x12


Switch Ports Model              SW Version            SW Image                 
------ ----- -----              ----------            ----------           
 <<     
*    1 52    WS-C2960X-48FPD-L  15.0(2)EX5            C2960X-UNIVERSALK9-M     


Configuration register is 0xF

Switch>
Expect: matched string 2: >
 >> enable

Expect: searching for 2 strs:  :Password: :#
 << enable
Switch#
Expect: matched string 2: #
 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
Expect: matched string 1: (config)#
 >> no service pad

 >> service timestamps debug datetime localtime

 >> service timestamps log datetime localtime

 >> service password-encryption

 >> boot-start-marker

 >> boot-end-marker

 >> enable secret Area=l*w

 >> enable password Area=l*w

 >> no aaa new-model

 >> clock timezone CST -6 0

 >> clock summer-time CDT recurring

 >> authentication mac-move permit

 >> ip domain-name mgmt.msstate.edu

 >> ip name-server 130.18.2.210

 >> vtp domain vtp01.mgmt.msstate.edu

 >> vtp mode client

 >> crypto pki trustpoint TP-self-signed-2494998912

 >>  enrollment selfsigned

 >>  subject-name cn=IOS-Self-Signed-Certificate-2494998912

 >>  revocation-check none

 >>  rsakeypair TP-self-signed-2494998912

 >> crypto pki certificate chain TP-self-signed-2494998912

 >>  certificate self-signed 01 nvram:IOS-Self-Sig#3232.cer

 >> spanning-tree portfast bpduguard default

 >> spanning-tree extend system-id

 >> vlan internal allocation policy ascending

 >> errdisable recovery cause all

 >> errdisable recovery interval 1800

 >> interface FastEthernet0

 >>  no ip address

 >>  shutdown

 >> interface Vlan1

 >>  no ip address

 >>  no ip route-cache

 >>  shutdown

 >> interface Vlan92

 >> ip http server

 >> ip http secure-server

 >> logging facility local1

 >> logging host loghost.msstate.edu

 >> access-list 1 permit 10.92.0.0 0.0.255.255

 >> snmp-server community sysnet RO 1

 >> snmp-server community c2-b2=a2 RW 1

 >> snmp-server enable traps snmp authentication linkdown linkup coldstart warmstart

 >> snmp-server enable traps transceiver all

 >> snmp-server enable traps tty

 >> snmp-server enable traps cluster

 >> snmp-server enable traps config-copy

 >> snmp-server enable traps config

 >> snmp-server enable traps config-ctid

 >> snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-auth-fail-vlan no-guest-vlan

 >> snmp-server enable traps entity

 >> snmp-server enable traps power-ethernet police

 >> snmp-server enable traps cpu threshold

 >> snmp-server enable traps rep

 >> snmp-server enable traps bridge newroot topologychange

 >> snmp-server enable traps stpx inconsistency root-inconsistency loop-inconsistency

 >> snmp-server enable traps syslog

 >> snmp-server enable traps vtp

 >> snmp-server enable traps vlancreate

 >> snmp-server enable traps vlandelete

 >> snmp-server enable traps flash insertion removal

 >> snmp-server enable traps port-security

 >> snmp-server enable traps envmon fan shutdown supply temperature status

 >> snmp-server enable traps errdisable

 >> snmp-server enable traps mac-notification change move threshold

 >> snmp-server enable traps vlan-membership

 >> snmp-server host 130.18.2.208 sysnet 

 >> line con 0

 >> line vty 0 4

 >>  password Area=l*w

 >>  login

 >> line vty 5 15

 >>  password Area=l*w

 >>  login

 >> ntp server 10.92.0.5

 >> end

Expect: searching for 1 strs:  :Configured
 << no service pad
Switch(config)#service timestamps debug datetime localtime
Switch(config)#service timestamps log datetime localtime
Switch(config)#service password-encryption
Switch(config)#boot-start-marker
Switch(config)#boot-end-marker
Switch(conf
 << ig)#enable secret Area=l*w
Switch(config)#enable password Area=l*w
The enable password you have chosen is the same as your enable secret.
This is not recommended.  Re-enter the enable password.

Switch(config)#no aaa new-model
Switch(config)#clock t
 << imezone CST -6 0
Switch(config)#clock summer-time CDT recurring
Switch(config)#authentication mac-move permit
Switch(config)#ip domain-name mgmt.msstate.edu
Switch(config)#ip name-server 130.18.2.210
Switch(config)#vtp domain vtp01.mgmt.msstate.edu

 << Changing VTP domain name from NULL to vtp01.mgmt.msstate.edu
Switch(config)#vtp mode client
Setting device to VTP Client mode for VLANS.
Switch(config)#crypto pki trustpoint TP-self-signed-2494998912
Switch(ca-trustpoint)# enrollment selfsigned
Switc
 << h(ca-trustpoint)# subject-name cn=IOS-Self-Signed-Certificate-2494998912
Switch(ca-trustpoint)# revocation-check none
Switch(ca-trustpoint)# rsakeypair TP-self-
Dec  7 13:31:35: %SYS-6-CLOCKUPDATE: System clocsigned-2494998912
Switch(ca-trustpoint)#cr
 << ypto pki certificate chain TP-self-signed-2494998912
Switch(config-cert-chain)# certificate self-signed 01 nvram:IOS-Self-Sig#3232$e self-signed 01 nvram:IOS-Self-Sig#3232.         cer
Switch(c
 << onfig-cert-chain)#spanning-tree portfast bpduguard default
Switch(config)#spanning-tree extend system-id
Switch(config)#vlan internal allocation policy ascending
Switch(config)#k has been updated from 19:31:34 UTC Mon Dec 7 2015 to 13:31:35 CST Mon Dec
 <<  7 2015, configured from console by console.
Dec  7 13:31:36: %SYS-6-CLOCKUPDATE: System clock has been updated from 13:31:35 CST Mon Dec 7 2015 to 13:31:36 CST Mon Dec 7 2015, configured from console by console.
Dec  7 13:31:36: %SW_VLAN-6-VTP_DOMAIN_N
 << AME_CHG: VTP domain name changed to vtp01.mgmt.msstate.edu.errdisable recovery cause all
Switch(config)#errdisable recovery interval 1800
Switch(config)#interface FastEthernet0
Switch(config-if)# no ip address
Switch(config-if)# shutdown
Switch(confi
 << g-if)#interface Vlan1
Switch(config-if)# no ip address
Switch(config-if)# no ip route-cache
Switch(config-if)# shutdown
Switch(config-if)#interface Vlan92
Switch(config-if)#ip http server
Switch(config)#ip http secure-server
% Generating 1024 bit R
 << SA keys, keys will be non-exportable...
Dec  7 13:31:39: %LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan92, changed state to down
[OK] (elapsed time was 2 seconds)

Switch(config)#logging facility local1
Switch(config)#logging host loghost.mssta
 << te.edu
Translating "loghost.msstate.edu"...domain server (130.18.2.210)
                            ^
% Invalid input detected at '^' marker.

Switch(config)#access-list 1 permit 10.92.0.0 0.0.255.255
Switch(config)#snmp-server community sysnet RO 1
 << 
Switch(config)#snmp-server community c2-b2=a2 RW 1
Switch(config)#snmp-server enable traps snmp authentication linkdown linkup c$ enable traps snmp authentication linkdown linkup co         
 << ldstart waps snmp authentication linkdown linkup coldstart wa         rmstart
Switch(config)#snmp-server enable traps transceiver all
Switch(config)#s
Dec  7 13:31:42: %SSH-
 << 5-ENABLEDnmp-server enable traps tty
Switch(config)#snmp-server enable traps cluster
Switch(config)#snmp-server enable traps config-copy
Switch(config)#snmp-server enable traps config
Switch(config)#snmp-server enable traps config-ctid
Switch(config)
 << #snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-au$ enable traps dot1x auth-fail-vlan guest-vlan no-aut         h-fail-vl
 << aps dot1x auth-fail-vlan guest-vlan no-auth-fail-vla         n no-guesuth-fail-vlan guest-vlan no-: SSH 1.99 has been enabled
Dec  7 13:31:42: %PKI-4-NOAUTOSAVE: Configuratio
 << n was modified.  Issue "write memory" to save new certificateauth-fail-vlan no-guest         -vlan
Switch(config)#snmp-server enable traps entity
Switch(config)#snmp-server enable traps power-ethernet police
Switch(config)#snmp-server enable t
 << raps cpu threshold
Switch(config)#snmp-server enable traps rep
Switch(config)#snmp-server enable traps bridge newroot topologychange
Switch(config)#snmp-server enable traps stpx inconsistency root-inconsistency
 << $ enable traps stpx inconsistency root-inconsistency          loop-incoaps stpx inconsistency root-inconsistency loop-incon         sistency
Switch(config)
 << #snmp-server enable traps syslog
Switch(config)#snmp-server enable traps vtp
Switch(config)#snmp-server enable traps vlancreate
Switch(config)#snmp-server enable traps vlandelete
Switch(config)#snmp-server enable traps flash insertion removal
Switch(
 << config)#snmp-server enable traps port-security
Switch(config)#snmp-server enable traps envmon fan shutdown supply temperatur$ enable traps envmon fan shutdown supply temperature         
 <<  status
Switch(config)#snmp-server enable traps errdisable
Switch(config)#snmp-server enable traps mac-notification change move threshol$ enable traps mac-notification change move threshol
 << d         
Switch(config)#snmp-server enable traps vlan-membership
Switch(config)#snmp-server host 130.18.2.208 sysnet 
Switch(config)#line con 0
Switch(config-line)#line vty 0 4
Switch(config-line)# password Area=l*w
Switch(config-line)# l
 << ogin
Switch(config-line)#line vty 5 15
Switch(config-line)# password Area=l*w
Switch(config-line)# login
Switch(config-line)#ntp server 10.92.0.5
Switch(config)#end
Switch#
 << 
Dec  7 13:31:48: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
Switch#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
Expect: matched string 1: (config)#
 >> spanning-tree mode pvst

 >> no spanning-tree vlan 2-91,93-237,240-242,244,246,248,251-252,256,359,500,502

 >> no spanning-tree vlan 505,509,511-515,520,522,551-560,562-570,601-603,605-606

 >> no spanning-tree vlan 610,629-630,632-633,635-637,654,674-676,701,741-742,800

 >> no spanning-tree vlan 801-805,807,880,901-904,908,910-913,915-916,926-930,970

 >> no spanning-tree vlan 995-1000

 >> spanning-tree vlan 1-1000 priority 57344
 >> end

Expect: searching for 1 strs:  :Configured
 << spanning-tree mode pvst
Switch(config)#no spanning-tree vlan 2-91,93-237,240-242,244,246,248,251-252,$-tree vlan 2-91,93-237,240-242,244,246,248,251-252,2         56,359,50
 <<  2-91,93-237,240-242,244,246,248,251-252,256,359,500         ,502
Switch(config)#no spanning-tree vlan 505,509,511-515,520,522,551-560,562-570,
 << $-tree vlan 505,509,511-515,520,522,551-560,562-570,6         01-603,60 505,509,511-515,520,522,551-560,562-570,601-603,605         -606
Switch(config)#no spanning-t
 << ree vlan 610,629-630,632-633,635-637,654,674-676,$-tree vlan 610,629-630,632-633,635-637,654,674-676,7         01,741-74 61
 << 0,629-630,632-633,635-637,654,674-676,701,741-742         ,800
Switch(config)#no spanning-tree vlan 801-805,807,880,901-904,908,910-913,915-$-tree vlan 801-805,807,880,901-904,908,910
 << -913,915-9         16,926-93 801-805,807,880,901-904,908,910-913,915-916,926-930         ,970
Switch(config)#no spanning-tree vlan 995-1000
Switch(config)#spanning-tree vlan 
 << 1-1000 priority 57344end
                                                       ^
% Invalid input detected at '^' marker.

Switch(config)#
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...
spanning-tree mode pvst
Switch(config)#no spanning-tree vlan 2-91,93-237,240-242,244,246,248,251-252,$-tree vlan 2-91,93-237,240-242,244,246,248,251-252,2         56,359,50 2-91,93-237,240-242,244,246,248,251-252,256,359,500         ,502
Switch(config)#no spanning-tree vlan 505,509,511-515,520,522,551-560,562-570,$-tree vlan 505,509,511-515,520,522,551-560,562-570,6         01-603,60 505,509,511-515,520,522,551-560,562-570,601-603,605         -606
Switch(config)#no spanning-tree vlan 610,629-630,632-633,635-637,654,674-676,$-tree vlan 610,629-630,632-633,635-637,654,674-676,7         01,741-74 610,629-630,632-633,635-637,654,674-676,701,741-742         ,800
Switch(config)#no spanning-tree vlan 801-805,807,880,901-904,908,910-913,915-$-tree vlan 801-805,807,880,901-904,908,910-913,915-9         16,926-93 801-805,807,880,901-904,908,910-913,915-916,926-930         ,970
Switch(config)#no spanning-tree vlan 995-1000
Switch(config)#spanning-tree vlan 1-1000 priority 57344end
                                                       ^
% Invalid input detected at '^' marker.

Switch(config)#
...

 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
Switch(config)#configure terminal
                ^
% Invalid input detected at '^' marker.

Switch(config)#
Expect: matched string 1: (config)#
 >> hostname c29s1p.a38.meridian 

Expect: searching for 2 strs:  :# :>
 << hostname c29s1p.a38.meridian 
c29s1p.a38.meridian(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s1p.a38.meridian#
 << 
Dec  7 13:32:10: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.a38.meridian#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.a38.meridian(config)#
Expect: matched string 1: (config)#
 >> snmp-server contact 6F-2033

Expect: searching for 1 strs:  :#
 << snmp-server contact 6F-2033
c29s1p.a38.meridian(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s1p.a38.meridian#
 << 
Dec  7 13:32:17: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.a38.meridian#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.a38.meridian(config)#
Expect: matched string 1: (config)#
 >> interface vlan 92

Expect: searching for 1 strs:  :(config-if)#
 << interface vlan 92
c29s1p.a38.meridian(config-if)#
Expect: matched string 1: (config-if)#
 >> ip address 10.92.2.132 255.255.0.0

 >> ip broadcast-address 10.92.255.255

 >> end

Expect: searching for 1 strs:  :Configured
 << ip address 10.92.2.132 255.255.0.0
c29s1p.a38.meridian(config-if)#ip broadcast-address 10.92.255.255
c29s1p.a38.meridian(config-if)#end
c29s1p.a38.meridian#
 << 
Dec  7 13:32:23: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.a38.meridian#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.a38.meridian(config)#
Expect: matched string 1: (config)#
 >> interface Vlan92

Expect: searching for 1 strs:  :(config-if)#
 << interface Vlan92
c29s1p.a38.meridian(config-if)#
Expect: matched string 1: (config-if)#
 >> ip default-gateway 10.92.0.1

 >> end

Expect: searching for 1 strs:  :Configured
 << ip default-gateway 10.92.0.1
c29s1p.a38.meridian(config)#end
c29s1p.a38.meridian#
Dec  7 13:32:29: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.a38.meridian#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.a38.meridian(config)#
Expect: matched string 1: (config)#
 >> ip dhcp snooping

Expect: searching for 1 strs:  :#
 << ip dhcp snooping
c29s1p.a38.meridian(config)#
Expect: matched string 1: #
 >> ip dhcp snooping vlan 649

Expect: searching for 1 strs:  :#
 << ip dhcp snooping vlan 649
c29s1p.a38.meridian(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s1p.a38.meridian#
Dec  7 13:32:36: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.a38.meridian#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.a38.meridian(config)#
Expect: matched string 1: (config)#
 >> default interface range gi1/0/1 - 48 

 >> interface range gi1/0/1 - 48 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi1/0/1 - 48 
c29s1p.a38.meridian(config)#interface range gi1/0/1 - 48 
c29s1p.a38.meridian(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport access vlan 649

 >> switchport mode access

 >> spanning-tree portfast

 >> switchport port-security maximum 2

 >> switchport port-security

 >> switchport port-security aging time 15

 >> switchport port-security violation protect

 >> switchport port-security aging type inactivity

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport access vlan 649
c29s1p.a38.meridian(config-if-range)#switchport mode access
c29s1p.a38.meridian(config-if-range)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, concent
 << rators, switches, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast will be configured in 48 interfaces due to the range command 
 but will only have effect when the interfa
 << ces are in a non-trunking mode.
c29s1p.a38.meridian(config-if-range)#switchport port-security maximum 2
c29s1p.a38.meridian(config-if-range)#switchport port-security
c29s1p.a38.meridian(config-if-range)#switchport port-security aging time 15
c29s1p.a3
 << 8.meridian(config-if-range)#switchport port-security violation prote$port-security violation protec         t
c29s1p.a38.meridian(config-if-range)#switchport port-security aging type inac
 << $port-security aging type inact         ivity
c29s1p.a38.meridian(config-if-range)#end
c29s1p.a38.meridian#
Dec  7 13:32:49: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.a38.meridian#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.a38.meridian(config)#
Expect: matched string 1: (config)#
 >> default interface range gi1/0/47 - 48 

 >> interface range gi1/0/47 - 48 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi1/0/47 - 48 
c29s1p.a38.meridian(config)#interface range gi1/0/47 - 48 
c29s1p.a38.meridian(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport mode trunk

 >> switchport trunk native vlan 92

 >> ip dhcp snooping trust

 >> no keepalive

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport mode trunk
c29s1p.a38.meridian(config-if-range)#switchport trunk native vlan 92
c29s1p.a38.meridian(config-if-range)#ip dhcp snooping trust
c29s1p.a38.meridian(config-if-range)#no keepalive
c29s1p.a38.meridian(config-if-range)#end
c29s1p.a
 << 38.meridian#
 << 
Dec  7 13:33:00: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.a38.meridian#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.a38.meridian(config)#
Expect: matched string 1: (config)#
 >> default interface range te1/0/1 - 2 

 >> interface range te1/0/1 - 2 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range te1/0/1 - 2 
c29s1p.a38.meridian(config)#interface range te1/0/1 - 2 
c29s1p.a38.meridian(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport mode trunk

 >> switchport trunk native vlan 92

 >> ip dhcp snooping trust

 >> no keepalive

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport mode trunk
c29s1p.a38.meridian(config-if-range)#switchport trunk native vlan 92
c29s1p.a38.meridian(config-if-range)#ip dhcp snooping trust
c29s1p.a38.meridian(config-if-range)#no keepalive
c29s1p.a38.meridian(config-if-range)#end
c29s1p.a
 << 38.meridian#
 << 
Dec  7 13:33:11: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.a38.meridian#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.a38.meridian(config)#
Expect: matched string 1: (config)#
 >> default interface range gi1/0/49 - 50 

 >> interface range gi1/0/49 - 50 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi1/0/49 - 50 
c29s1p.a38.meridian(config)#interface range gi1/0/49 - 50 
c29s1p.a38.meridian(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport mode trunk

 >> switchport trunk native vlan 92

 >> ip dhcp snooping trust

 >> no keepalive

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport mode trunk
c29s1p.a38.meridian(config-if-range)#switchport trunk native vlan 92
c29s1p.a38.meridian(config-if-range)#ip dhcp snooping trust
c29s1p.a38.meridian(config-if-range)#no keepalive
c29s1p.a38.meridian(config-if-range)#end
c29s1p.a
 << 38.meridian#
 << 
Dec  7 13:33:17: %SYS-5-CONFIG_I: Configured from console by console
Dec  7 13:33:18: %LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet1/0/49, changed state to down
Dec  7 13:33:18: %LINEPROTO-5-UPDOWN: Line protocol on Interface Gigabit
Expect: matched string 1: Configured
 >> 

 >> write mem

Expect: searching for 2 strs:  :# :>
 << Ethernet1/0/50, changed state to down
c29s1p.a38.meridian#write mem
Building configuration...

Expect: matched string 1: #
 >> 
Expect: searching for 2 strs:  :# :>
 << [OK]
c29s1p.a38.meridian#
c29s1p.a38.meridian#
c29s1p.a38.meridian#
Expect: matched string 1: #
 >> sh run

Expect: searching for 2 strs:  :# :>
 << sh run
Building configuration...

Current configuration : 20036 bytes
!
! Last configuration change at 13:33:17 CST Mon Dec 7 2015
! NVRAM config last updated at 13:33:24 CST Mon Dec 7 2015
!
version 15.0
no service pad
service timestamps debug 
 << datetime localtime
service timestamps log datetime localtime
service password-encryption
!
hostname c29s1p.a38.meridian
!
boot-start-marker
boot-end-marker
!
enable secret 5 $1$jImM$wCvTYNQjTm1dEVs0AyLZT.
enable password 7 013214015A560A4536
!
 << 
no aaa new-model
clock timezone CST -6 0
clock summer-time CDT recurring
switch 1 provision ws-c2960x-48fpd-l
authentication mac-move permit
!
!
ip dhcp snooping vlan 649
ip dhcp snooping
ip domain-name mgmt.msstate.edu
ip name-server 130.18.2.
 << 210
!
!
crypto pki trustpoint TP-self-signed-2225869184
 enrollment selfsigned
 subject-name cn=IOS-Self-Signed-Certificate-2225869184
 revocation-check none
 rsakeypair TP-self-signed-2225869184
!
!
crypto pki certificate chain TP-self-signed-2
 << 225869184
 certificate self-signed 01
  3082022B 30820194 A0030201 02020101 300D0609 2A864886 F70D0101 05050030 
  31312F30 2D060355 04031326 494F532D 53656C66 2D536967 6E65642D 43657274 
  69666963 6174652D 32323235 38363931 3834301E 170D3135 3132303
 << 7 31393331 
  34325A17 0D323030 31303130 30303030 305A3031 312F302D 06035504 03132649 
  4F532D53 656C662D 5369676E 65642D43 65727469 66696361 74652D32 32323538 
  36393138 3430819F 300D0609 2A864886 F70D0101 01050003 818D0030 81890281 
  8100DCB1 C4B
 << FD9DD 28A5A5FF 6056E399 82AB017F B100ADAC 2998E812 2BB5E9AF 
  D708DB97 7AD326ED D9308344 8C93B17B 9FD56FF6 F0E0CBDD E4012EF7 7DF47E9E 
  097AC3C3 9AB4EC33 D3B98BD8 0CAE3848 0415E536 774AF6D1 3D0F4E84 36CB3732 
  47B2F1D0 3B151DB7 72EA9CF8 7949A168 C53
 << 6D2C0 0E6E0C54 ACE1586A F7876909 
  33B50203 010001A3 53305130 0F060355 1D130101 FF040530 030101FF 301F0603 
  551D2304 18301680 149036BC E63478BC B1212090 4703CF91 BD5BA5A3 2B301D06 
  03551D0E 04160414 9036BCE6 3478BCB1 21209047 03CF91BD 5BA5A32B 300
 << D0609 
  2A864886 F70D0101 05050003 818100D0 8F6D2E9F A84E0131 C217E2C8 5D618ACA 
  D1950F63 5B9D9909 DED798F6 59A4D3C6 F4F9E9E4 68229516 449FF55C 818E0842 
  AD0BA78C 060DCD01 7013612E 27EC1008 5250A76A 9ED294BA A7BD9835 56252A4F 
  68E94A0E FED41730
 <<  67A2C036 CBB5C169 E9704F44 FAFBC303 1C4C4B8F 305BFA58 
  F962662B E0097900 5BB67DFF 807E17
  	quit
!
spanning-tree mode pvst
spanning-tree portfast bpduguard default
spanning-tree extend system-id
no spanning-tree vlan 2-91,93-237,240-242,244,246,
 << 248,251-252,256,359,500,502
no spanning-tree vlan 505,509,511-515,520,522,551-560,562-570,601-603,605-606
no spanning-tree vlan 610,629-630,632-633,635-637,654,674-676,701,741-742,800
no spanning-tree vlan 801-805,807,880,901-904,908,910-913,915-916,92
 << 6-930,970
no spanning-tree vlan 995-1000
!
!
!
!
!
errdisable recovery cause udld
errdisable recovery cause bpduguard
errdisable recovery cause security-violation
errdisable recovery cause channel-misconfig (STP)
errdisable recovery cause pagp-
 << flap
errdisable recovery cause dtp-flap
errdisable recovery cause link-flap
errdisable recovery cause sfp-config-mismatch
errdisable recovery cause gbic-invalid
errdisable recovery cause psecure-violation
errdisable recovery cause port-mode-failure
 << 
errdisable recovery cause dhcp-rate-limit
errdisable recovery cause pppoe-ia-rate-limit
errdisable recovery cause mac-limit
errdisable recovery cause vmps
errdisable recovery cause storm-control
errdisable recovery cause inline-power
errdisable rec
 << overy cause arp-inspection
errdisable recovery cause loopback
errdisable recovery cause small-frame
errdisable recovery cause psp
errdisable recovery interval 1800
!
vlan internal allocation policy ascending
!
!
!
!
!
!
interface FastEthernet
 << 0
 no ip address
 shutdown
!
interface GigabitEthernet1/0/1
 switchport access vlan 649
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security viola
 << tion protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/2
 switchport access vlan 649
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport po
 << rt-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/3
 switchport access vlan 649
 switchport mode access
 switchport port-sec
 << urity maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/4
 switchport acce
 << ss vlan 649
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree por
 << tfast
!
interface GigabitEthernet1/0/5
 switchport access vlan 649
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchpo
 << rt port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/6
 switchport access vlan 649
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 
 << 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/7
 switchport access vlan 649
 switchport mode access
 switchport port-security maximum 2
 switc
 << hport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/8
 switchport access vlan 649
 switchpor
 << t mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface Gig
 << abitEthernet1/0/9
 switchport access vlan 649
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging 
 << type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/10
 switchport access vlan 649
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-s
 << ecurity violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/11
 switchport access vlan 649
 switchport mode access
 switchport port-security maximum 2
 switchport port-security

 <<  switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/12
 switchport access vlan 649
 switchport mode access
 swit
 << chport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/13

 <<  switchport access vlan 649
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 s
 << panning-tree portfast
!
interface GigabitEthernet1/0/14
 switchport access vlan 649
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation p
 << rotect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/15
 switchport access vlan 649
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-se
 << curity aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/16
 switchport access vlan 649
 switchport mode access
 switchport port-securit
 << y maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/17
 switchport access 
 << vlan 649
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfa
 << st
!
interface GigabitEthernet1/0/18
 switchport access vlan 649
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport
 <<  port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/19
 switchport access vlan 649
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 1
 << 5
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/20
 switchport access vlan 649
 switchport mode access
 switchport port-security maximum 2
 switc
 << hport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/21
 switchport access vlan 649
 switchpo
 << rt mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface Gi
 << gabitEthernet1/0/22
 switchport access vlan 649
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security agin
 << g type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/23
 switchport access vlan 649
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port
 << -security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/24
 switchport access vlan 649
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 << 
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/25
 switchport access vlan 649
 switchport mode access
 sw
 << itchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/26
 << 
 switchport access vlan 649
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity

 <<  spanning-tree portfast
!
interface GigabitEthernet1/0/27
 switchport access vlan 649
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation
 <<  protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/28
 switchport access vlan 649
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-
 << security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/29
 switchport access vlan 649
 switchport mode access
 switchport port-secur
 << ity maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/30
 switchport acces
 << s vlan 649
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree port
 << fast
!
interface GigabitEthernet1/0/31
 switchport access vlan 649
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchpo
 << rt port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/32
 switchport access vlan 649
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time
 <<  15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/33
 switchport access vlan 649
 switchport mode access
 switchport port-security maximum 2
 swi
 << tchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/34
 switchport access vlan 649
 switch
 << port mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface 
 << GigabitEthernet1/0/35
 switchport access vlan 649
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security ag
 << ing type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/36
 switchport access vlan 649
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport po
 << rt-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/37
 switchport access vlan 649
 switchport mode access
 switchport port-security maximum 2
 switchport port-securi
 << ty
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/38
 switchport access vlan 649
 switchport mode access
 
 << switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/
 << 39
 switchport access vlan 649
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 << 
 spanning-tree portfast
!
interface GigabitEthernet1/0/40
 switchport access vlan 649
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violati
 << on protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/41
 switchport access vlan 649
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport por
 << t-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/42
 switchport access vlan 649
 switchport mode access
 switchport port-sec
 << urity maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/43
 switchport acc
 << ess vlan 649
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree po
 << rtfast
!
interface GigabitEthernet1/0/44
 switchport access vlan 649
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switch
 << port port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/45
 switchport access vlan 649
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging ti
 << me 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/46
 switchport access vlan 649
 switchport mode access
 switchport port-security maximum 2
 s
 << witchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/47
 switchport trunk native vlan 92

 <<  switchport mode trunk
 no keepalive
 ip dhcp snooping trust
!
interface GigabitEthernet1/0/48
 switchport trunk native vlan 92
 switchport mode trunk
 no keepalive
 ip dhcp snooping trust
!
interface GigabitEthernet1/0/49
 switchport trunk nat
 << ive vlan 92
 switchport mode trunk
 ip dhcp snooping trust
!
interface GigabitEthernet1/0/50
 switchport trunk native vlan 92
 switchport mode trunk
 ip dhcp snooping trust
!
interface TenGigabitEthernet1/0/1
 switchport trunk native vlan 92
 s
 << witchport mode trunk
 ip dhcp snooping trust
!
interface TenGigabitEthernet1/0/2
 switchport trunk native vlan 92
 switchport mode trunk
 ip dhcp snooping trust
!
interface Vlan1
 no ip address
 no ip route-cache
 shutdown
!
interface Vlan92
 << 
 ip address 10.92.2.132 255.255.0.0
 ip broadcast-address 10.92.255.255
!
ip default-gateway 10.92.0.1
ip http server
ip http secure-server
!
logging facility local1
access-list 1 permit 10.92.0.0 0.0.255.255
!
snmp-server community sysnet RO 1
 << 
snmp-server community c2-b2=a2 RW 1
snmp-server contact 6F-2033
snmp-server enable traps snmp authentication linkdown linkup coldstart warmstart
snmp-server enable traps transceiver all
snmp-server enable traps tty
snmp-server enable traps cluster
 << 
snmp-server enable traps config-copy
snmp-server enable traps config
snmp-server enable traps config-ctid
snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-auth-fail-vlan no-guest-vlan
snmp-server enable traps entity
snmp-server enable tra
 << ps power-ethernet police
snmp-server enable traps cpu threshold
snmp-server enable traps rep
snmp-server enable traps bridge newroot topologychange
snmp-server enable traps stpx inconsistency root-inconsistency loop-inconsistency
snmp-server enable t
 << raps syslog
snmp-server enable traps vtp
snmp-server enable traps vlancreate
snmp-server enable traps vlandelete
snmp-server enable traps flash insertion removal
snmp-server enable traps port-security
snmp-server enable traps envmon fan shutdown sup
 << ply temperature status
snmp-server enable traps errdisable
snmp-server enable traps mac-notification change move threshold
snmp-server enable traps vlan-membership
snmp-server host 130.18.2.208 sysnet 
!
!
line con 0
line vty 0 4
 password 7 0627
 << 1D244D13055312
 login
line vty 5 15
 password 7 06271D244D13055312
 login
!
ntp server 10.92.0.5
end

c29s1p.a38.meridian#
Expect: matched string 1: #
 >> show interface status

Expect: searching for 2 strs:  :# :>
 << show interface status

Port      Name               Status       Vlan       Duplex  Speed Type
Gi1/0/1                      notconnect   649          auto   auto 10/100/1000BaseTX
Gi1/0/2                      notconnect   649          auto   auto 10/1
 << 00/1000BaseTX
Gi1/0/3                      notconnect   649          auto   auto 10/100/1000BaseTX
Gi1/0/4                      notconnect   649          auto   auto 10/100/1000BaseTX
Gi1/0/5                      notconnect   649          auto   auto 1
 << 0/100/1000BaseTX
Gi1/0/6                      notconnect   649          auto   auto 10/100/1000BaseTX
Gi1/0/7                      notconnect   649          auto   auto 10/100/1000BaseTX
Gi1/0/8                      notconnect   649          auto   aut
 << o 10/100/1000BaseTX
Gi1/0/9                      notconnect   649          auto   auto 10/100/1000BaseTX
Gi1/0/10                     notconnect   649          auto   auto 10/100/1000BaseTX
Gi1/0/11                     notconnect   649          auto   
 << auto 10/100/1000BaseTX
Gi1/0/12                     notconnect   649          auto   auto 10/100/1000BaseTX
Gi1/0/13                     notconnect   649          auto   auto 10/100/1000BaseTX
Gi1/0/14                     notconnect   649          auto
 <<    auto 10/100/1000BaseTX
Gi1/0/15                     notconnect   649          auto   auto 10/100/1000BaseTX
Gi1/0/16                     notconnect   649          auto   auto 10/100/1000BaseTX
Gi1/0/17                     notconnect   649          a
 << uto   auto 10/100/1000BaseTX
Gi1/0/18                     notconnect   649          auto   auto 10/100/1000BaseTX
Gi1/0/19                     notconnect   649          auto   auto 10/100/1000BaseTX
Gi1/0/20                     notconnect   649        
 <<   auto   auto 10/100/1000BaseTX
Gi1/0/21                     notconnect   649          auto   auto 10/100/1000BaseTX
Gi1/0/22                     notconnect   649          auto   auto 10/100/1000BaseTX
Gi1/0/23                     notconnect   649     
 <<      auto   auto 10/100/1000BaseTX
Gi1/0/24                     notconnect   649          auto   auto 10/100/1000BaseTX
Gi1/0/25                     notconnect   649          auto   auto 10/100/1000BaseTX
Gi1/0/26                     notconnect   649  
 <<         auto   auto 10/100/1000BaseTX
Gi1/0/27                     notconnect   649          auto   auto 10/100/1000BaseTX
Gi1/0/28                     notconnect   649          auto   auto 10/100/1000BaseTX
Gi1/0/29                     notconnect   64
 << 9          auto   auto 10/100/1000BaseTX
Gi1/0/30                     notconnect   649          auto   auto 10/100/1000BaseTX
Gi1/0/31                     notconnect   649          auto   auto 10/100/1000BaseTX
Gi1/0/32                     notconnect  
 <<  649          auto   auto 10/100/1000BaseTX
Gi1/0/33                     notconnect   649          auto   auto 10/100/1000BaseTX
Gi1/0/34                     notconnect   649          auto   auto 10/100/1000BaseTX
Gi1/0/35                     notconnec
 << t   649          auto   auto 10/100/1000BaseTX
Gi1/0/36                     notconnect   649          auto   auto 10/100/1000BaseTX
Gi1/0/37                     notconnect   649          auto   auto 10/100/1000BaseTX
Gi1/0/38                     notcon
 << nect   649          auto   auto 10/100/1000BaseTX
Gi1/0/39                     notconnect   649          auto   auto 10/100/1000BaseTX
Gi1/0/40                     notconnect   649          auto   auto 10/100/1000BaseTX
Gi1/0/41                     not
 << connect   649          auto   auto 10/100/1000BaseTX
Gi1/0/42                     notconnect   649          auto   auto 10/100/1000BaseTX
Gi1/0/43                     notconnect   649          auto   auto 10/100/1000BaseTX
Gi1/0/44                     
 << notconnect   649          auto   auto 10/100/1000BaseTX
Gi1/0/45                     notconnect   649          auto   auto 10/100/1000BaseTX
Gi1/0/46                     notconnect   649          auto   auto 10/100/1000BaseTX
Gi1/0/47                  
 <<    notconnect   1            auto   auto 10/100/1000BaseTX
Gi1/0/48                     notconnect   1            auto   auto 10/100/1000BaseTX
Te1/0/1                      notconnect   1            full    10G Not Present
Te1/0/2                      
 << notconnect   1            full    10G Not Present
Fa0                          disabled     routed       auto   auto 10/100BaseTX
c29s1p.a38.meridian#
Expect: matched string 1: #
