trying to use serial port: /dev/ttyUSB1
 >> 
 >> 

Expect: searching for 4 strs:  :[yes/no] :Press RETURN to get started. :# :Switch>
 << 
Switch>
Switch>
Switch>
Switch>
Expect: matched string 4: Switch>
 >> term len 0

Expect: searching for 2 strs:  :# :>
 << term len 0
Switch>
Expect: matched string 2: >
 >> show version

Expect: searching for 2 strs:  :# :>
 << show version
Cisco IOS Software, C2960C Software (C2960c405-UNIVERSALK9-M), Version 15.0(2)SE5, RELEASE SOFTWARE (fc1)
Technical Support: http://www.cisco.com/techsupport
Copyright (c) 1986-2013 by Cisco Systems, Inc.
Compiled Fri 25-Oct-13 14:35 by p
 << rod_rel_team

ROM: Bootstrap program is C2960C boot loader
BOOTLDR: C2960C Boot Loader (C2960c405-HBOOT-M) Version 12.2(55r)EX9, RELEASE SOFTWARE (fc1)

Switch uptime is 36 minutes
System returned to ROM by power-on
System restarted at 01:27:24 UTC
 <<  Wed Mar 30 2011
System image file is "flash:/c2960c405-universalk9-mz.150-2.SE5/c2960c405-universalk9-mz.150-2.SE5.bin"


This product contains cryptographic features and is subject to United
States and local country laws governing import, export, t
 << ransfer and
use. Delivery of Cisco cryptographic products does not imply
third-party authority to import, export, distribute or use encryption.
Importers, exporters, distributors and users are responsible for
compliance with U.S. and local country law
 << s. By using this product you
agree to comply with applicable laws and regulations. If you are unable
to comply with U.S. and local laws, return this product immediately.

A summary of U.S. laws governing Cisco cryptographic products may be found at:

 << http://www.cisco.com/wwl/export/crypto/tool/stqrg.html

If you require further assistance please contact us by sending email to
export@cisco.com.

License Level: lanlite
License Type: Permanent
Next reload license Level: lanlite

cisco WS-C2960C-
 << 8TC-S (PowerPC405) processor (revision H0) with 131072K bytes of memory.
Processor board ID FOC1920W1WR
Last reset from power-on
1 Virtual Ethernet interface
8 FastEthernet interfaces
2 Gigabit Ethernet interfaces
The password-recovery mechanism is 
 << enabled.

64K bytes of flash-simulated non-volatile configuration memory.
Base ethernet MAC Address       : B0:7D:47:FD:03:80
Motherboard assembly number     : 73-13528-04
Power supply part number        : 341-0208-02
Motherboard serial number      
 <<  : FOC19195A66
Power supply serial number      : LIT19170NYJ
Model revision number           : H0
Motherboard revision number     : A0
Model number                    : WS-C2960C-8TC-S
System serial number            : FOC1920W1WR
Top Assembly Part 
 << Number        : 800-35232-01
Top Assembly Revision Number    : M0
Version ID                      : V01
CLEI Code Number                : CMMGA00ARA
Hardware Board Revision Number  : 0x01


Switch Ports Model              SW Version            SW I
 << mage                 
------ ----- -----              ----------            ----------               
*    1 10    WS-C2960C-8TC-S    15.0(2)SE5            C2960c405-UNIVERSALK9-M  


Configuration register is 0xF

Switch>
Expect: matched string 2: >
 >> enable

Expect: searching for 2 strs:  :Password: :#
 << enable
Switch#
Expect: matched string 2: #
 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
Expect: matched string 1: (config)#
 >> no service pad

 >> service timestamps debug datetime localtime

 >> service timestamps log datetime localtime

 >> service password-encryption

 >> boot-start-marker

 >> boot-end-marker

 >> enable secret Area=l*w

 >> enable password Area=l*w

 >> no aaa new-model

 >> clock summer-time CDT recurring

 >> authentication mac-move permit

 >> ip domain-name mgmt.msstate.edu

 >> ip name-server 130.18.2.210

 >> vtp domain vtp01.mgmt.msstate.edu

 >> vtp mode client

 >> crypto pki trustpoint TP-self-signed-2494998912

 >>  enrollment selfsigned

 >>  subject-name cn=IOS-Self-Signed-Certificate-2494998912

 >>  revocation-check none

 >>  rsakeypair TP-self-signed-2494998912

 >> crypto pki certificate chain TP-self-signed-2494998912

 >>  certificate self-signed 01 nvram:IOS-Self-Sig#3232.cer

 >> spanning-tree portfast bpduguard default

 >> spanning-tree extend system-id

 >> vlan internal allocation policy ascending

 >> errdisable recovery cause all

 >> errdisable recovery interval 1800

 >> interface Vlan1

 >>  no ip address

 >>  no ip route-cache

 >>  shutdown

 >> interface Vlan92

 >> ip http server

 >> ip http secure-server

 >> logging facility local1

 >> access-list 1 permit 10.92.0.0 0.0.255.255

 >> snmp-server community sysnet RO 1

 >> snmp-server community c2-b2=a2 RW 1

 >> snmp-server enable traps snmp authentication linkdown linkup coldstart warmstart

 >> snmp-server enable traps transceiver all

 >> snmp-server enable traps tty

 >> snmp-server enable traps cluster

 >> snmp-server enable traps config-copy

 >> snmp-server enable traps config

 >> snmp-server enable traps config-ctid

 >> snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-auth-fail-vlan no-guest-vlan

 >> snmp-server enable traps entity

 >> snmp-server enable traps power-ethernet police

 >> snmp-server enable traps cpu threshold

 >> snmp-server enable traps rep

 >> snmp-server enable traps bridge newroot topologychange

 >> snmp-server enable traps stpx inconsistency root-inconsistency loop-inconsistency

 >> snmp-server enable traps syslog

 >> snmp-server enable traps vtp

 >> snmp-server enable traps vlancreate

 >> snmp-server enable traps vlandelete

 >> snmp-server enable traps flash insertion removal

 >> snmp-server enable traps port-security

 >> snmp-server enable traps envmon fan shutdown supply temperature status

 >> snmp-server enable traps errdisable

 >> snmp-server enable traps mac-notification change move threshold

 >> snmp-server enable traps vlan-membership

 >> snmp-server host 130.18.2.208 sysnet 

 >> line con 0

 >> line vty 0 4

 >>  password Area=l*w

 >>  login

 >> line vty 5 15

 >>  password Area=l*w

 >>  login

 >> ntp server 10.92.0.5

 >> end

Expect: searching for 1 strs:  :Configured
 << no service pad
Switch(config)#service timestamps debug datetime localtime
Switch(config)#service timestamps log datetime localtime
Switch(config)#service password-encryption
Switch(config)#boot-start-marker
Switch(config)#boot-end-marker
Switch(conf
 << ig)#enable secret Area=l*w
Switch(config)#enable password Area=l*w
The enable password you have chosen is the same as your enable secret.
This is not recommended.  Re-enter the enable password.

Switch(config)#no aaa new-model
Switch(config)#clock s
 << ummer-time CDT recurring
Switch(config)#authentication mac-move permit
Switch(config)#ip domain-name mgmt.msstate.edu
Switch(config)#ip name-server 130.18.2.210
Switch(config)#vtp domain vtp01.mgmt.msstate.edu
Changing VTP domain name from NULL to vt
 << p01.mgmt.msstate.edu
Switch(config)#vtp mode client
Setting device to VTP Client mode for VLANS.
Switch(config)#
Mar 30 03:05:03: %SYS-6-CLOCKUPDATE: System clock has been updated from 02:05:03 UTC Wed Mar 30 2011 to 03:05:03 CDT Wed Mar 30 2011, conf
 << igured from console by console.
Mar 30 03:05:04: %SW_VLAN-6-VTP_DOMAIN_NAME_CHG: VTP domain name changed to vtp01.mgmt.msstate.edu.crypto pki trustpoint TP-self-signed-2494998912
Switch(ca-trustpoint)# enrollment selfsigned
Switch(ca-trustpoint)# subje
 << ct-name cn=IOS-Self-Signed-Certificate-2494998912
Switch(ca-trustpoint)# revocation-check none
Switch(ca-trustpoint)# rsakeypair TP-self-signed-2494998912
Switch(ca-trustpoint)#crypto pki certificate chain TP-self-signed-2494998912
Switch(config-cert-
 << chain)# certificate self-signed 01 nvram:IOS-Self-Sig#3232$e self-signed 01 nvram:IOS-Self-Sig#3232.         cer
Switch(config-cert-chain)#spanning-tree portfast bpduguard default
Switch(config
 << )#spanning-tree extend system-id
Switch(config)#vlan internal allocation policy ascending
Switch(config)#errdisable recovery cause all
Switch(config)#errdisable recovery interval 1800
Switch(config)#interface Vlan1
Switch(config-if)# no ip address
S
 << witch(config-if)# no ip route-cache
Switch(config-if)# shutdown
Switch(config-if)#interface Vlan92
Switch(config-if)#ip http server
Switch(config)#ip http secure-server
% Generating 1024 bit RSA keys, keys will be non-exportable...
Mar 30 03:05:08: 
 << %LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan92, changed state to down
[OK] (elapsed time was 5 seconds)

Switch(config)#logging facility local1
Switch(config)#access-list 1 permit 10.92.0.0 0.0.255.255
Switch(config)#snmp-server community sys
 << net RO 1
Switch(config)#snmp-server community c2-b2=a2 RW 1
Switch(config)#snmp-server enable traps snmp authentication linkdown linkup c$ enable traps snmp authentication linkdown linkup co 
 <<         ldstart waps snmp authentication linkdown linkup coldstart wa         rmstart
Switch(config)#snmp-se
Mar 30 03:05:13: %SSH-5-ENABLED: SSH 1.99 has been enabledrver en
 << able traps transceiver all
Switch(config)#snmp-server enable traps tty
Switch(config)#snmp-server enable traps cluster
Switch(config)#snmp-server enable traps config-copy
Switch(config)#snmp-server enable traps config
Switch(config)#snmp-server enabl
 << e traps config-ctid
Switch(config)#snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-au$ enable traps dot1x auth-fail-vlan guest-vlan no-aut         h-fail-vl
 << aps dot1x auth-fail-vlan guest-vlan no-auth-fail-vla         n no-guesuth-fail-vlan guest-vlan no-auth-fail-vlan no-guest         -
 << vlan
Switch(config)#snmp-server enable traps entity
Switch(config)#
Mar 30 03:05:13: %PKI-4-NOAUTOSAVE: Configuration was modified.  Issue "write memory" to save new certificatesnmp-server enable traps power-ethernet police
Switch(config)#snmp-server 
 << enable traps cpu threshold
Switch(config)#snmp-server enable traps rep
Switch(config)#snmp-server enable traps bridge newroot topologychange
Switch(config)#snmp-server enable traps stpx inconsistency root-inconsistency
 << $ enable traps stpx inconsistency root-inconsistency          loop-incoaps stpx inconsistency root-inconsistency loop-incon         sistency
Switch
 << (config)#snmp-server enable traps syslog
Switch(config)#snmp-server enable traps vtp
Switch(config)#snmp-server enable traps vlancreate
Switch(config)#snmp-server enable traps vlandelete
Switch(config)#snmp-server enable traps flash insertion removal
 << 
Switch(config)#snmp-server enable traps port-security
Switch(config)#snmp-server enable traps envmon fan shutdown supply temperatur$ enable traps envmon fan shutdown supply temperature       
 <<    status
Switch(config)#snmp-server enable traps errdisable
Switch(config)#snmp-server enable traps mac-notification change move threshol$ enable traps mac-notification change move 
 << threshold         
Switch(config)#snmp-server enable traps vlan-membership
Switch(config)#snmp-server host 130.18.2.208 sysnet 
Switch(config)#line con 0
Switch(config-line)#line vty 0 4
Switch(config-line)# password Area=l*w
Switch(config-
 << line)# login
Switch(config-line)#line vty 5 15
Switch(config-line)# password Area=l*w
Switch(config-line)# login
Switch(config-line)#ntp server 10.92.0.5
Switch(config)#end
Switch#
 << 
Mar 30 03:05:16: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
Switch#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
Expect: matched string 1: (config)#
 >> spanning-tree mode pvst

 >> no spanning-tree vlan 2-91,93-505,507-560,562-600,602-609,611-616,618-648,653

 >> no spanning-tree vlan 654-1000

 >> spanning-tree vlan 1-1000 priority 61440

 >> 

 >> end

Expect: searching for 1 strs:  :Configured
 << spanning-tree mode pvst
Switch(config)#no spanning-tree vlan 2-91,93-505,507-560,562-600,602-609,611-$-tree vlan 2-91,93-505,507-560,562-600,602-609,611-6         16,618-64
 <<  2-91,93-505,507-560,562-600,602-609,611-616,618-648         ,653
Switch(config)#no spanning-tree vlan 654-1000
Switch(config)#spanning-tree vlan 1-1000 priority 61440
Switch(config)#
Switch(c
 << onfig)#end
Switch#
 << 
Mar 30 03:05:24: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
Switch#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
Expect: matched string 1: (config)#
 >> hostname c29s1c.r217.rosenbaum 

Expect: searching for 2 strs:  :# :>
 << hostname c29s1c.r217.rosenbaum 
c29s1c.r217.rosenbau(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s1c.r217.rosenbaum#
 << 
Mar 30 03:05:30: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1c.r217.rosenbaum#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1c.r217.rosenbau(config)#
Expect: matched string 1: (config)#
 >> snmp-server contact  

Expect: searching for 1 strs:  :#
 << snmp-server contact  
% Incomplete command.

c29s1c.r217.rosenbau(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s1c.r217.rosenbaum#
 << 
Mar 30 03:05:36: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1c.r217.rosenbaum#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1c.r217.rosenbau(config)#
Expect: matched string 1: (config)#
 >> interface vlan 92

Expect: searching for 1 strs:  :(config-if)#
 << interface vlan 92
c29s1c.r217.rosenbau(config-if)#
Expect: matched string 1: (config-if)#
 >> ip address 10.92.2.170 255.255.0.0

 >> ip broadcast-address 10.92.255.255

 >> end

Expect: searching for 1 strs:  :Configured
 << ip address 10.92.2.170 255.255.0.0
c29s1c.r217.rosenbau(config-if)#ip broadcast-address 10.92.255.255
c29s1c.r217.rosenbau(config-if)#end
c29s1c.r217.rosenbaum#
 << 
Mar 30 03:05:42: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1c.r217.rosenbaum#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1c.r217.rosenbau(config)#
Expect: matched string 1: (config)#
 >> interface Vlan92

Expect: searching for 1 strs:  :(config-if)#
 << interface Vlan92
c29s1c.r217.rosenbau(config-if)#
Expect: matched string 1: (config-if)#
 >> ip default-gateway 10.92.0.1

 >> end

Expect: searching for 1 strs:  :Configured
 << ip default-gateway 10.92.0.1
c29s1c.r217.rosenbau(config)#end
c29s1c.r217.rosenbaum#
Mar 30 03:05:48: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1c.r217.rosenbaum#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1c.r217.rosenbau(config)#
Expect: matched string 1: (config)#
 >> ip dhcp snooping

Expect: searching for 1 strs:  :#
 << ip dhcp snooping
c29s1c.r217.rosenbau(config)#
Expect: matched string 1: #
 >> ip dhcp snooping vlan 651

Expect: searching for 1 strs:  :#
 << ip dhcp snooping vlan 651
c29s1c.r217.rosenbau(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s1c.r217.rosenbaum#
Mar 30 03:05:55: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1c.r217.rosenbaum#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1c.r217.rosenbau(config)#
Expect: matched string 1: (config)#
 >> default interface range fa0/1 - 8 

 >> interface range fa0/1 - 8 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range fa0/1 - 8 
c29s1c.r217.rosenbau(config)#interface range fa0/1 - 8 
c29s1c.r217.rosenbau(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport access vlan 651

 >> switchport mode access

 >> spanning-tree portfast

 >> switchport port-security maximum 2

 >> switchport port-security

 >> switchport port-security aging time 15

 >> switchport port-security violation protect

 >> switchport port-security aging type inactivity

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport access vlan 651
c29s1c.r217.rosenbau(config-if-range)#switchport mode access
c29s1c.r217.rosenbau(config-if-range)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, conce
 << ntrators, switches, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast will be configured in 8 interfaces due to the range command 
 but will only have effect when the interf
 << aces are in a non-trunking mode.
c29s1c.r217.rosenbau(config-if-range)#switchport port-security maximum 2
c29s1c.r217.rosenbau(config-if-range)#switchport port-security
c29s1c.r217.rosenbau(config-if-range)#switchport port-security aging time 15
c29s1
 << c.r217.rosenbau(config-if-range)#switchport port-security violation prot$port-security violation prote         ct
c29s1c.r217.rosenbau(config-if-range)#switchport port-security aging type ina
 << $port-security aging type inac         tivity
c29s1c.r217.rosenbau(config-if-range)#end
c29s1c.r217.rosenbaum#
 << 
Mar 30 03:06:09: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1c.r217.rosenbaum#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1c.r217.rosenbau(config)#
Expect: matched string 1: (config)#
 >> default interface range gi0/1 - 2 

 >> interface range gi0/1 - 2 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi0/1 - 2 
c29s1c.r217.rosenbau(config)#interface range gi0/1 - 2 
c29s1c.r217.rosenbau(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport mode trunk

 >> switchport trunk native vlan 92

 >> ip dhcp snooping trust

 >> no keepalive

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport mode trunk
c29s1c.r217.rosenbau(config-if-range)#switchport trunk native vlan 92
c29s1c.r217.rosenbau(config-if-range)#ip dhcp snooping trust
c29s1c.r217.rosenbau(config-if-range)#no keepalive
c29s1c.r217.rosenbau(config-if-range)#end
c29s
 << 1c.r217.rosenbaum#
 << 
Mar 30 03:06:20: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> write mem

Expect: searching for 2 strs:  :# :>
 << 
c29s1c.r217.rosenbaum#write mem
Building configuration...
[OK]
c29s1c.r217.rosenbaum#
Expect: matched string 1: #
 >> 
Expect: searching for 2 strs:  :# :>
 << 
c29s1c.r217.rosenbaum#
c29s1c.r217.rosenbaum#
Expect: matched string 1: #
 >> sh run

Expect: searching for 2 strs:  :# :>
 << sh run
Building configuration...

Current configuration : 7624 bytes
!
! Last configuration change at 03:06:20 CDT Wed Mar 30 2011
! NVRAM config last updated at 03:06:28 CDT Wed Mar 30 2011
!
version 15.0
no service pad
service timestamps debug
 <<  datetime localtime
service timestamps log datetime localtime
service password-encryption
!
hostname c29s1c.r217.rosenbaum
!
boot-start-marker
boot-end-marker
!
!
enable secret 5 $1$F41r$z0KJ2w3QH8Y61eCRw1Krd/
enable password 7 047A19030E7C4004
 << 1E
!
no aaa new-model
clock summer-time CDT recurring
system mtu routing 1500
authentication mac-move permit
!
!
ip dhcp snooping vlan 651
ip dhcp snooping
!
ip domain-name mgmt.msstate.edu
ip name-server 130.18.2.210
!
!
crypto pki trustpo
 << int TP-self-signed-1207763840
 enrollment selfsigned
 subject-name cn=IOS-Self-Signed-Certificate-1207763840
 revocation-check none
 rsakeypair TP-self-signed-1207763840
!
!
crypto pki certificate chain TP-self-signed-1207763840
 certificate self-
 << signed 01
  3082022B 30820194 A0030201 02020101 300D0609 2A864886 F70D0101 05050030 
  31312F30 2D060355 04031326 494F532D 53656C66 2D536967 6E65642D 43657274 
  69666963 6174652D 31323037 37363338 3430301E 170D3131 30333330 30323035 
  31335A17 0D323
 << 030 31303130 30303030 305A3031 312F302D 06035504 03132649 
  4F532D53 656C662D 5369676E 65642D43 65727469 66696361 74652D31 32303737 
  36333834 3030819F 300D0609 2A864886 F70D0101 01050003 818D0030 81890281 
  8100955E 0CAE9BB3 06E8CC6B 0BE3854E 52344
 << 6D9 EDD9671E 2F6E329C B54DF4CE 
  271A9F56 E23CC013 7BBA934F 1AA7A761 9CA7EC7F 4EECEB42 5D669AFA E7E6A57C 
  1B6F9E76 6A3BB54B 37339672 86C50CAA 0BC8BE09 9F0C5565 A979332B 815DA173 
  60503F88 C011D243 9A65BFEC C99297FF 2208EBB8 6DBE9193 15C4BADB A691F
 << EE9 
  98D50203 010001A3 53305130 0F060355 1D130101 FF040530 030101FF 301F0603 
  551D2304 18301680 14F8C27C 53C82E03 419B33DA D5CBAEE6 4FE1C7D6 39301D06 
  03551D0E 04160414 F8C27C53 C82E0341 9B33DAD5 CBAEE64F E1C7D639 300D0609 
  2A864886 F70D0101 0
 << 5050003 81810075 1B15A59E 2947E5C2 992BF061 A3987F7E 
  0536C1C6 ECE8D6B6 0CD66F7B 788FB207 E8DE1763 489661FA 5001905C C949F7B9 
  7FD62377 15288D2A 0BD98827 2B44ECCF 05089624 46E00D38 84ED28B8 831E8060 
  7EA2B565 F318B4E8 3BD0C091 6A7D6871 14104958 2
 << A18B55D 9727FB19 FD336860 
  E31163C0 26C3A77D 061E005F B8059A
  	quit
!
spanning-tree mode pvst
spanning-tree portfast bpduguard default
spanning-tree extend system-id
no spanning-tree vlan 2-91,93-505,507-560,562-600,602-609,611-616,618-648,653

 << no spanning-tree vlan 654-1000
spanning-tree vlan 1-1000 priority 61440
!
!
!
!
!
errdisable recovery cause udld
errdisable recovery cause bpduguard
errdisable recovery cause security-violation
errdisable recovery cause channel-misconfig (STP)

 << errdisable recovery cause pagp-flap
errdisable recovery cause dtp-flap
errdisable recovery cause link-flap
errdisable recovery cause sfp-config-mismatch
errdisable recovery cause gbic-invalid
errdisable recovery cause psecure-violation
errdisable re
 << covery cause port-mode-failure
errdisable recovery cause dhcp-rate-limit
errdisable recovery cause pppoe-ia-rate-limit
errdisable recovery cause mac-limit
errdisable recovery cause vmps
errdisable recovery cause storm-control
errdisable recovery cau
 << se inline-power
errdisable recovery cause loopback
errdisable recovery cause small-frame
errdisable recovery cause psp
errdisable recovery interval 1800
!
!
!
!
vlan internal allocation policy ascending
!
!
! 
!
!
!
!
!
!
!
!
interfac
 << e FastEthernet0/1
 switchport access vlan 651
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging 
 << type inactivity
 spanning-tree portfast
!
interface FastEthernet0/2
 switchport access vlan 651
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-securit
 << y violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface FastEthernet0/3
 switchport access vlan 651
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport 
 << port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface FastEthernet0/4
 switchport access vlan 651
 switchport mode access
 switchport port-securi
 << ty maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface FastEthernet0/5
 switchport access vlan 
 << 651
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
 << 
interface FastEthernet0/6
 switchport access vlan 651
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-secur
 << ity aging type inactivity
 spanning-tree portfast
!
interface FastEthernet0/7
 switchport access vlan 651
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport po
 << rt-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface FastEthernet0/8
 switchport access vlan 651
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 s
 << witchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet0/1
 switchport trunk native vlan 92
 switchport mode trunk
 ip dh
 << cp snooping trust
!
interface GigabitEthernet0/2
 switchport trunk native vlan 92
 switchport mode trunk
 ip dhcp snooping trust
!
interface Vlan1
 no ip address
 no ip route-cache
 shutdown
!
interface Vlan92
 ip address 10.92.2.170 255.255.
 << 0.0
 ip broadcast-address 10.92.255.255
!
ip default-gateway 10.92.0.1
ip http server
ip http secure-server
!
logging facility local1
access-list 1 permit 10.92.0.0 0.0.255.255
snmp-server community sysnet RO 1
snmp-server community c2-b2=a2 RW 
 << 1
snmp-server enable traps snmp authentication linkdown linkup coldstart warmstart
snmp-server enable traps transceiver all
snmp-server enable traps tty
snmp-server enable traps cluster
snmp-server enable traps config-copy
snmp-server enable traps c
 << onfig
snmp-server enable traps config-ctid
snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-auth-fail-vlan no-guest-vlan
snmp-server enable traps entity
snmp-server enable traps power-ethernet police
snmp-server enable traps cpu threshold
 << 
snmp-server enable traps rep
snmp-server enable traps bridge newroot topologychange
snmp-server enable traps stpx inconsistency root-inconsistency loop-inconsistency
snmp-server enable traps syslog
snmp-server enable traps vtp
snmp-server enable tra
 << ps vlancreate
snmp-server enable traps vlandelete
snmp-server enable traps flash insertion removal
snmp-server enable traps port-security
snmp-server enable traps envmon fan shutdown supply temperature status
snmp-server enable traps errdisable
snmp
 << -server enable traps mac-notification change move threshold
snmp-server enable traps vlan-membership
snmp-server host 130.18.2.208 sysnet 
!
!
line con 0
line vty 0 4
 password 7 002501030506074C18
 login
line vty 5 15
 password 7 013214015A560A
 << 4536
 login
!
ntp server 10.92.0.5
end

c29s1c.r217.rosenbaum#
Expect: matched string 1: #
 >> show interface status

Expect: searching for 2 strs:  :# :>
 << show interface status

Port      Name               Status       Vlan       Duplex  Speed Type
Fa0/1                        notconnect   651          auto   auto 10/100BaseTX
Fa0/2                        notconnect   651          auto   auto 10/100Bas
 << eTX
Fa0/3                        notconnect   651          auto   auto 10/100BaseTX
Fa0/4                        notconnect   651          auto   auto 10/100BaseTX
Fa0/5                        notconnect   651          auto   auto 10/100BaseTX
Fa0/6  
 <<                       notconnect   651          auto   auto 10/100BaseTX
Fa0/7                        notconnect   651          auto   auto 10/100BaseTX
Fa0/8                        notconnect   651          auto   auto 10/100BaseTX
Gi0/1              
 <<           notconnect   1            auto   auto Not Present
Gi0/2                        notconnect   1            auto   auto Not Present
c29s1c.r217.rosenbaum#
Expect: matched string 1: #
