trying to use serial port: /dev/ttyUSB0
 >> 
 >> 

Expect: searching for 4 strs:  :[yes/no] :Press RETURN to get started. :# :Switch>
 << 


         --- System Configuration Dialog ---

Enable secret warning
----------------------------------
In order to access the device manager, an enable secret is required
If you enter the initial configuration dialog, you will be prompted for t
 << he enable secret
If you choose not to enter the intial configuration dialog, or if you exit setup without setting the enable secret,
please set an enable secret using the following CLI in configuration mode-
enable secret 0 <cleartext password>
------
 << ----------------------------
Would you like to enter the initial configuration dialog? [yes/no]: 
% Please answer 'yes' or 'no'.
Would you like to enter the initial configuration dialog? [yes/no]: 
% Please answer 'yes' or 'no'.
Would you like to ent
Expect: matched string 1: [yes/no]
 >> 

 >> no

 >> term len 0

Expect: searching for 2 strs:  :# :>
 << er the initial configuration dialog? [yes/no]: 
% Please answer 'yes' or 'no'.
Would you like to enter the initial configuration dialog? [yes/no]: 
% Please answer 'yes' or 'no'.
Would you like to enter the initial configuration dialog? [yes/no]: 
% 
 << Please answer 'yes' or 'no'.
Would you like to enter the initial configuration dialog? [yes/no]: no
Switch>term len 0
Switch>
Expect: matched string 2: >
 >> show version

Expect: searching for 2 strs:  :# :>
 << show version
Cisco IOS Software, C2960S Software (C2960S-UNIVERSALK9-M), Version 12.2(55)SE3, RELEASE SOFTWARE (fc1)
Technical Support: http://www.cisco.com/techsupport
Copyright (c) 1986-2011 by Cisco Systems, Inc.
Compiled Thu 05-May-11 16:56 by pro
 << d_rel_team
Image text-base: 0x00003000, data-base: 0x01B00000

ROM: Bootstrap program is Alpha board boot loader
BOOTLDR: C2960S Boot Loader (C2960S-HBOOT-M) Version 12.2(55r)SE, RELEASE SOFTWARE (fc1)

Switch uptime is 13 minutes
System returned t
 << o ROM by power-on
System image file is "flash:/c2960s-universalk9-mz.122-55.SE3/c2960s-universalk9-mz.122-55.SE3.bin"


This product contains cryptographic features and is subject to United
States and local country laws governing import, export, tran
 << sfer and
use. Delivery of Cisco cryptographic products does not imply
third-party authority to import, export, distribute or use encryption.
Importers, exporters, distributors and users are responsible for
compliance with U.S. and local country laws. 
 << By using this product you
agree to comply with applicable laws and regulations. If you are unable
to comply with U.S. and local laws, return this product immediately.

A summary of U.S. laws governing Cisco cryptographic products may be found at:
htt
 << p://www.cisco.com/wwl/export/crypto/tool/stqrg.html

If you require further assistance please contact us by sending email to
export@cisco.com.

cisco WS-C2960S-48TS-L (PowerPC) processor (revision G0) with 131072K bytes of memory.
Processor board ID
 <<  FOC1615Y3UK
Last reset from power-on
1 Virtual Ethernet interface
1 FastEthernet interface
52 Gigabit Ethernet interfaces
The password-recovery mechanism is enabled.

512K bytes of flash-simulated non-volatile configuration memory.
Base ethernet 
 << MAC Address       : A4:18:75:44:51:00
Motherboard assembly number     : 73-11909-08
Power supply part number        : 341-0327-04
Motherboard serial number       : FOC16150RPK
Power supply serial number      : DCA1608P0CC
Model revision number       
 <<     : G0
Motherboard revision number     : A0
Model number                    : WS-C2960S-48TS-L
Daughterboard assembly number   : 73-11933-04
Daughterboard serial number     : FOC16153TPW
System serial number            : FOC1615Y3UK
Top Assembly P
 << art Number        : 800-30950-05
Top Assembly Revision Number    : A0
Version ID                      : V05
CLEI Code Number                : COMGF00ARE
Daughterboard revision number   : A0
Hardware Board Revision Number  : 0x01


Switch Ports Mod
 << el              SW Version            SW Image                 
------ ----- -----              ----------            ----------               
*    1 52    WS-C2960S-48TS-L   12.2(55)SE3           C2960S-UNIVERSALK9-M     


Configuration register i
 << s 0xF

Switch>
Expect: matched string 2: >
 >> enable

Expect: searching for 2 strs:  :Password: :#
 << enable
Switch#
Expect: matched string 2: #
 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
Expect: matched string 1: (config)#
 >> no service pad

 >> service timestamps debug datetime localtime

 >> service timestamps log datetime localtime

 >> service password-encryption

 >> boot-start-marker

 >> boot-end-marker

 >> enable secret Area=l*w

 >> enable password Area=l*w

 >> no aaa new-model

 >> clock timezone CST -6

 >> clock summer-time CDT recurring

 >> authentication mac-move permit

 >> ip domain-name mgmt.msstate.edu

 >> ip name-server 130.18.2.210

 >> vtp domain vtp01.mgmt.msstate.edu

 >> vtp mode client

 >> crypto pki trustpoint TP-self-signed-2494998912

 >>  enrollment selfsigned

 >>  subject-name cn=IOS-Self-Signed-Certificate-2494998912

 >>  revocation-check none

 >>  rsakeypair TP-self-signed-2494998912

 >> crypto pki certificate chain TP-self-signed-2494998912

 >>  certificate self-signed 01 nvram:IOS-Self-Sig#3232.cer

 >> spanning-tree portfast bpduguard default

 >> spanning-tree extend system-id

 >> vlan internal allocation policy ascending

 >> errdisable recovery cause all

 >> errdisable recovery interval 1800

 >> interface FastEthernet0

 >>  no ip address

 >>  shutdown

 >> interface Vlan1

 >>  no ip address

 >>  no ip route-cache

 >>  shutdown

 >> interface Vlan92

 >> ip http server

 >> ip http secure-server

 >> ip sla enable reaction-alerts

 >> logging facility local1

 >> logging 130.18.8.12

 >> access-list 1 permit 10.92.0.0 0.0.255.255

 >> snmp-server community sysnet RO 1

 >> snmp-server community c2-b2=a2 RW 1

 >> snmp-server enable traps snmp authentication linkdown linkup coldstart warmstart

 >> snmp-server enable traps transceiver all

 >> snmp-server enable traps tty

 >> snmp-server enable traps cluster

 >> snmp-server enable traps config-copy

 >> snmp-server enable traps config

 >> snmp-server enable traps config-ctid

 >> snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-auth-fail-vlan no-guest-vlan

 >> snmp-server enable traps entity

 >> snmp-server enable traps power-ethernet group 1

 >> snmp-server enable traps power-ethernet police

 >> snmp-server enable traps cpu threshold

 >> snmp-server enable traps rep

 >> snmp-server enable traps rtr

 >> snmp-server enable traps bridge newroot topologychange

 >> snmp-server enable traps stpx inconsistency root-inconsistency loop-inconsistency

 >> snmp-server enable traps syslog

 >> snmp-server enable traps vtp

 >> snmp-server enable traps vlancreate

 >> snmp-server enable traps vlandelete

 >> snmp-server enable traps flash insertion removal

 >> snmp-server enable traps port-security

 >> snmp-server enable traps envmon fan shutdown supply temperature status

 >> snmp-server enable traps errdisable

 >> snmp-server enable traps mac-notification change move threshold

 >> snmp-server enable traps vlan-membership

 >> snmp-server host 130.18.2.208 sysnet 

 >> line con 0

 >> line vty 0 4

 >>  password Area=l*w

 >>  login

 >> line vty 5 15

 >>  password Area=l*w

 >>  login

 >> ntp clock-period 22519226

 >> ntp server 10.92.0.5

 >> end

Expect: searching for 1 strs:  :Configured
 << no service pad
Switch(config)#service timestamps debug datetime localtime
Switch(config)#service timestamps log datetime localtime
Switch(config)#service password-encryption
Switch(config)#boot-start-marker
Switch(config)#boot-end-marker
Switch(conf
 << ig)#enable secret Area=l*w
Switch(config)#enable password Area=l*w
The enable password you have chosen is the same as your enable secret.
This is not recommended.  Re-enter the enable password.

Switch(config)#no aaa new-model
Switch(config)#clock t
 << imezone CST -6
Switch(config)#clock summer-time CDT recurring
Switch(config)#authentication mac-move permit
Switch(config)#ip domain-name mgmt.msstate.edu
Switch(config)#ip name-server 130.18.2.210
Switch(config)#vtp domain vtp01.mgmt.msstate.edu
Ch
 << anging VTP domain name from NULL to vtp01.mgmt.msstate.edu
Switch(config)#vtp mode client
Setting device to VTP Client mode for VLANS.
Switch(config)#crypto pki trustpoint TP-self-signed-2494998912
Switch(ca-trustpoint)#
*Feb 28 18:15:25: %SYS-6-CLOC
 << KUPDATE: System clock has been updated from 00:15:25 UTC Mon Mar 1 1993 to 18:15:25 CST Sun Feb 28 1993, configured from console by console.
*Feb 28 18:15:25: %SYS-6-CLOCKUPDATE: System clock has been updated from 18:15:25 CST Sun Feb 28 1993 to 18:15:25
 <<  CST Sun Feb 28 1993, configured from console by console. enrollment selfsigned
Switch(ca-trustpoint)# subject-name cn=IOS-Self-Signed-Certificate-2494998912
Switch(ca-trustpoint)# revocation-check none
Switch(ca-trustpoint)# rsakeypair TP-self-signed-
 << 2494998912
Switch(ca-trustpoint)#crypto pki certificate chain TP-self-signed-2494998912
Switch(config-cert-chain)#
*Feb 28 18:15:26: %SW_VLAN-6-VTP_DOMAIN_NAME_CHG: VTP domain name changed to vtp01.mgmt.msstate.edu. certificate self-signed 01 nvram:IOS
 << -Self-Sig#3232$e self-signed 01 nvram:IOS-Self-Sig#3232.         cer
Switch(config-cert-chain)#spanning-tree portfast bpduguard default
Switch(config)#spanning-tree extend system-id
Switch(con
 << fig)#vlan internal allocation policy ascending
Switch(config)#errdisable recovery cause all
Switch(config)#errdisable recovery interval 1800
Switch(config)#interface FastEthernet0
Switch(config-if)# no ip address
Switch(config-if)# shutdown
Switch(c
 << onfig-if)#interface Vlan1
Switch(config-if)# no ip address
Switch(config-if)# no ip route-cache
Switch(config-if)# shutdown
Switch(config-if)#interface Vlan92
Switch(config-if)#ip http server
Switch(config)#ip http secure-server
% Generating 1024 b
 << it RSA keys, keys will be non-exportable...
*Feb 28 18:15:30: %LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan92, changed state to down
*Feb 28 18:15:31: %LINK-5-CHANGED: Interface FastEthernet0, changed state to administratively down[OK]

*Feb 28
 <<  18:15:32: %LINK-5-CHANGED: Interface Vlan1, changed state to administratively down
*Feb 28 18:15:33: %SSH-5-ENABLED: SSH 1.99 has been enabled
Switch(config)#ip sla enable reaction-alerts
Switch(config)#logging facility local1
Switch(config)#logging 
 << 130.18.8.12
Switch(config)#access-list 1 permit 10.92.0.0 0.0.255.255
Switch(config)#snmp-server community sysnet RO 1
Switch(config)#snmp-server community c2-b2=a2 RW 1
Switch(config)#snmp-server enable traps snmp authentication linkdown linkup c
 << $ enable traps snmp authentication linkdown linkup co         ldstart waps snmp authentication linkdown linkup coldstart wa    
 <<      rmstart
Switch(config)#snmp-server enable traps transceiver all
Switch(config)#snmp-server enable traps tty
Switch(config)#snmp-server enable traps cluster
Switch(config)#snmp-server enable traps config-copy
Switch(config)#snmp-server e
 << nable traps config
Switch(config)#snmp-server enable traps config-ctid
Switch(config)#snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-au$ enable traps dot1x auth-fail-vlan guest-v
 << lan no-aut         h-fail-vl
*Feb 28 18:15:34: %PKI-4-NOAUTOSAVE: Configuration was modified.  Issue "write memory" to save new certificateaps dot1x auth-fail-vlan guest-vlan no-auth-f
 << ail-vla         n no-guesuth-fail-vlan guest-vlan no-auth-fail-vlan no-guest         -vlan
Switch(config)#snmp-server enable traps entity
Switch(config)#snmp-server enable tra
 << ps power-ethernet group 1
Switch(config)#snmp-server enable traps power-ethernet police
Switch(config)#snmp-server enable traps cpu threshold
Switch(config)#snmp-server enable traps rep
Switch(config)#snmp-server enable traps rtr
Switch(config)#snmp-
 << server enable traps bridge newroot topologychange
Switch(config)#snmp-server enable traps stpx inconsistency root-inconsistency$ enable traps stpx inconsistency root-inconsistency          
 << loop-incoaps stpx inconsistency root-inconsistency loop-incon         sistency
Switch(config)#snmp-server enable traps syslog
Switch(config)#snmp-server enable traps vtp
Switch
 << (config)#snmp-server enable traps v
*Feb 28 18:15:35: %SYS-6-LOGGINGHOST_STARTSTOP: Logging to host 130.18.8.12 Port 514 started - CLI initiatedlancreate
Switch(config)#snmp-server enable traps vlandelete
Switch(config)#snmp-server enable traps flash i
 << nsertion removal
Switch(config)#snmp-server enable traps port-security
Switch(config)#snmp-server enable traps envmon fan shutdown supply temperatur$ enable traps envmon fan shutdown supply t
 << emperature          status
Switch(config)#snmp-server enable traps errdisable
Switch(config)#snmp-server enable traps mac-notification change move threshol$ enable traps mac-notifica
 << tion change move threshold         
Switch(config)#snmp-server enable traps vlan-membership
Switch(config)#snmp-server host 130.18.2.208 sysnet 
Switch(config)#line con 0
Switch(config-line)#line vty 0 4
Switch(config-line)# password Area=l*
 << w
Switch(config-line)# login
Switch(config-line)#line vty 5 15
Switch(config-line)# password Area=l*w
Switch(config-line)# login
Switch(config-line)#ntp clock-period 22519226
Switch(config)#ntp server 10.92.0.5
Switch(config)#end
Switch#
 << 
*Feb 28 18:15:40: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
Switch#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
Expect: matched string 1: (config)#
 >> spanning-tree mode mst

 >> spanning-tree etherchannel guard misconfig

 >> spanning-tree mst configuration

 >>  name msstate

 >>  revision 1

 >>  instance 1 vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 63, 70

 >>  instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 160

 >>  instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 230, 232, 242, 246

 >>  instance 1 vlan 256, 611-612, 654, 741, 996, 999

 >>  instance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037, 2039-2040

 >>  instance 2 vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096, 2104, 2110, 2126

 >>  instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 2189, 2194, 2202

 >>  instance 2 vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 2654, 2999

 >>  instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176, 196

 >>  instance 3 vlan 244, 248, 927

 >>  instance 4 vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072, 2108, 2113, 2128

 >>  instance 4 vlan 2144, 2176, 2196, 2244, 2248, 2927

 >>  instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 228

 >>  instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216, 2228

 >>  instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116, 124

 >>  instance 7 vlan 172, 186, 192, 204-208, 210, 240-241, 251-252, 630, 928

 >>  instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082, 2084

 >>  instance 8 vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208, 2210

 >>  instance 8 vlan 2240-2241, 2251-2252, 2630, 2928

 >>  instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102, 112

 >>  instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 500, 505, 510-511

 >>  instance 9 vlan 522, 551-570, 603, 629, 633, 742, 802, 926, 929

 >>  instance 10 vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 2057, 2062, 2068

 >>  instance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148, 2158

 >>  instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522, 2603, 2629, 2633

 >>  instance 10 vlan 2802, 2926, 2929

 >>  instance 11 vlan 8, 43, 52, 146, 156-157, 180, 200, 218

 >>  instance 12 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180, 2200, 2218

 >> 

 >> end

Expect: searching for 1 strs:  :Configured
 << spanning-tree mode mst
Switch(config)#spanning-tree etherchannel guard misconfig
Switch(config)#spanning-tree mst configuration
Switch(config-mst)# name msstate
Switch(config-mst)# revision 1
Switch(config-mst)# instance 1 vlan 2, 7, 11, 20, 22, 24, 
 << 31, 35, 37, 39-40, $ vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40, 5         0, 60, 63, 11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 
 << 63,          70
Switch(config-mst)# instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 1$ vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 14         0, 152, 1
 << 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 16         0
Switch(config-mst)# instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 23$ vlan 162-1
 << 63, 168, 189, 194, 202, 220, 222, 230         , 232, 24163, 168, 189, 194, 202, 220, 222, 230, 232, 242         , 246
Switch(config-mst)# instance 1 vlan 256, 611-612, 654, 741, 9
 << 96, 999
Switch(config-mst)# instance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031,$ vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031,          2035, 203
 << , 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037         , 2039-2011, 2020, 2022, 2024, 2031, 2035, 2037, 2039-204         0
Switch(config-mst)# instance 2 v
 << lan 2050, 2060, 2063, 2070, 2080, 2086, 2096,$ vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096,          2104, 211, 2060, 2063, 2070,
 <<  2080, 2086, 2096, 2104, 2110         , 2126
Switch(config-mst)# instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, $ vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 2         
 << 189, 2194, 2140, 2152, 2160, 2162-2163, 2168, 2189, 2194,          2202
Switch(config-mst)# instance 2 vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 
 << $ vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 2         654, 2999
Switch(config-mst)# instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128$ vlan 42, 51, 59, 64
 << , 66, 69, 72, 108, 113, 128,          144, 17651, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176,          196
Switch(config-mst)# instance 3 vlan 244, 248, 927
Switch(config-mst)# 
 << instance 4 vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072,$ vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072,          2108, 211, 2051,
 <<  2059, 2064, 2066, 2069, 2072, 2108, 2113         , 2128
Switch(config-mst)# instance 4 vlan 2144, 2176, 2196, 2244, 2248, 2927
Switch(config-mst)# instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 2
 << $ vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 22         8
Switch(config-mst)# instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-$ vlan 2016, 2048, 2058, 2088, 
 << 2121, 2131, 2133-2         134, 2216, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216,          2228
Switch(config-mst)# instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97,
 << $ vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97,          114, 116,3-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116,          1
 << 24
Switch(config-mst)# instance 7 vlan 172, 186, 192, 204-208, 210, 240-241, 251$ vlan 172, 186, 192, 204-208, 210, 240-241, 251-         252, 630,
 << 186, 192, 204-208, 210, 240-241, 251-252, 630,          928
Switch(config-mst)# instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, $ vlan 2009, 2033-2034, 2038, 2054
 << , 2056, 2071, 2         075, 2082, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082,          2084
Switch(config-mst)# instance 8 vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192,
 << $ vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192,          2204-2208, 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208,          221
 << 0
Switch(config-mst)# instance 8 vlan 2240-2241, 2251-2252, 2630, 2928
Switch(config-mst)# instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 9$ vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 
 << 98         -99, 102,12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102,          112
Switch(config-mst)# instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 50
 << $ vlan 130, 132, 147-148, 158, 212, 226, 236, 500         , 505, 51132, 147-148, 158, 212, 226, 236, 500, 505, 510         -511
Switch(config-mst
 << )# instance 9 vlan 522, 551-570, 603, 629, 633, 742, 802, 92$ vlan 522, 551-570, 603, 629, 633, 742, 802, 926         , 929
Switch(config-mst)# instance 10 vlan 2004-2005, 2012, 2018-2019
 << , 2032, 2044, $0 vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 2         057, 20624-2005, 2012, 2018-2019, 2032, 2044, 2057, 2062,  
 <<         2068
Switch(config-mst)# instance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132,$0 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132,          2147-2148
 << 6, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148,          2158
Switch(config-mst)# instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522,$0 vlan 221
 << 2, 2236, 2500, 2505, 2510-2511, 2522,          2603, 2622, 2236, 2500, 2505, 2510-2511, 2522, 2603, 2629         , 2633
Switch(config-mst)# instance 10 vlan 2802, 2926, 2929
Swit
 << ch(config-mst)# instance 11 vlan 8, 43, 52, 146, 156-157, 180, 200, 218
Switch(config-mst)# instance 12 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180,$2 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180
 << ,          2200, 2218, 2043, 2052, 2146, 2156-2157, 2180, 2200, 2218         
Switch(config-mst)#
Switch(config-mst)#end
Switch#
*Feb 28 18:15:56: %SYS-5-CONFIG_I: Configured f
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << rom console by console
Switch#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
Expect: matched string 1: (config)#
 >> hostname c29s2.a1558.cvm.wise 

Expect: searching for 2 strs:  :# :>
 << hostname c29s2.a1558.cvm.wise 
c29s2.a1558.cvm.wise(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s2.a1558.cvm.wise#
 << 
*Feb 28 18:16:01: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s2.a1558.cvm.wise#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s2.a1558.cvm.wise(config)#
Expect: matched string 1: (config)#
 >> snmp-server contact 6F-1586

Expect: searching for 1 strs:  :#
 << snmp-server contact 6F-1586
c29s2.a1558.cvm.wise(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s2.a1558.cvm.wise#
 << 
*Feb 28 18:16:07: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s2.a1558.cvm.wise#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s2.a1558.cvm.wise(config)#
Expect: matched string 1: (config)#
 >> interface vlan 92

Expect: searching for 1 strs:  :(config-if)#
 << interface vlan 92
c29s2.a1558.cvm.wise(config-if)#
Expect: matched string 1: (config-if)#
 >> ip address 10.92.2.238 255.255.0.0

 >> ip broadcast-address 10.92.255.255

 >> end

Expect: searching for 1 strs:  :Configured
 << ip address 10.92.2.238 255.255.0.0
c29s2.a1558.cvm.wise(config-if)#ip broadcast-address 10.92.255.255
c29s2.a1558.cvm.wise(config-if)#end
c29s2.a1558.cvm.wise#
 << 
*Feb 28 18:16:13: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s2.a1558.cvm.wise#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s2.a1558.cvm.wise(config)#
Expect: matched string 1: (config)#
 >> interface Vlan92

Expect: searching for 1 strs:  :(config-if)#
 << interface Vlan92
c29s2.a1558.cvm.wise(config-if)#
Expect: matched string 1: (config-if)#
 >> ip default-gateway 10.92.0.1

 >> end

Expect: searching for 1 strs:  :Configured
 << ip default-gateway 10.92.0.1
c29s2.a1558.cvm.wise(config)#end
c29s2.a1558.cvm.wise#
 << 
*Feb 28 18:16:19: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s2.a1558.cvm.wise#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s2.a1558.cvm.wise(config)#
Expect: matched string 1: (config)#
 >> ip dhcp snooping

Expect: searching for 1 strs:  :#
 << ip dhcp snooping
c29s2.a1558.cvm.wise(config)#
Expect: matched string 1: #
 >> ip dhcp snooping vlan 152

Expect: searching for 1 strs:  :#
 << ip dhcp snooping vlan 152
c29s2.a1558.cvm.wise(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s2.a1558.cvm.wise#
 << 
*Feb 28 18:16:26: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s2.a1558.cvm.wise#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s2.a1558.cvm.wise(config)#
Expect: matched string 1: (config)#
 >> default interface range gi1/0/1 - 48 

 >> interface range gi1/0/1 - 48 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi1/0/1 - 48 

 << c29s2.a1558.cvm.wise(config)#interface range gi1/0/1 - 48 
c29s2.a1558.cvm.wise(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport access vlan 152

 >> switchport mode access

 >> spanning-tree portfast

 >> switchport port-security maximum 2

 >> switchport port-security

 >> switchport port-security aging time 15

 >> switchport port-security violation protect

 >> switchport port-security aging type inactivity

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport access vlan 152
c29s2.a1558.cvm.wise(config-if-range)#switchport mode access
c29s2.a1558.cvm.wise(config-if-range)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, conce
 << ntrators, switches, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast will be configured in 48 interfaces due to the range command 
 but will only have effect when the inter
 << faces are in a non-trunking mode.
c29s2.a1558.cvm.wise(config-if-range)#switchport port-security maximum 2
c29s2.a1558.cvm.wise(config-if-range)#switchport port-security
c29s2.a1558.cvm.wise(config-if-range)#switchport port-security aging time 15
c29s
 << 2.a1558.cvm.wise(config-if-range)#switchport port-security violation prot$port-security violation prote         ct
c29s2.a1558.cvm.wise(config-if-range)#switchport port-security aging type ina
 << $port-security aging type inac         tivity
c29s2.a1558.cvm.wise(config-if-range)#end
c29s2.a1558.cvm.wise#
 << 
*Feb 28 18:16:40: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s2.a1558.cvm.wise#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s2.a1558.cvm.wise(config)#
Expect: matched string 1: (config)#
 >> default interface gi1/0/48 

 >> interface gi1/0/48 

Expect: searching for 1 strs:  :(config-if)#
 << default interface gi1/0/48 
Interface GigabitEthernet1/0/48 set to default configuration
c29s2.a1558.cvm.wise(config)#interface gi1/0/48 
c29s2.a1558.cvm.wise(config-if)#
Expect: matched string 1: (config-if)#
 >> switchport mode trunk

 >> switchport trunk native vlan 92

 >> ip dhcp snooping trust

 >> no keepalive

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport mode trunk
c29s2.a1558.cvm.wise(config-if)#switchport trunk native vlan 92
c29s2.a1558.cvm.wise(config-if)#ip dhcp snooping trust
c29s2.a1558.cvm.wise(config-if)#no keepalive
c29s2.a1558.cvm.wise(config-if)#end
c29s2.a1558.cvm.wise#
 << 
*Feb 28 18:16:47: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s2.a1558.cvm.wise#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s2.a1558.cvm.wise(config)#
Expect: matched string 1: (config)#
 >> default interface range gi1/0/49 - 52 

 >> interface range gi1/0/49 - 52 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi1/0/49 - 52 
c29s2.a1558.cvm.wise(config)#interface range gi1/0/49 - 52 
c29s2.a1558.cvm.wise(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport mode trunk

 >> switchport trunk native vlan 92

 >> ip dhcp snooping trust

 >> no keepalive

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport mode trunk
c29s2.a1558.cvm.wise(config-if-range)#switchport trunk native vlan 92
c29s2.a1558.cvm.wise(config-if-range)#ip dhcp snooping trust
c29s2.a1558.cvm.wise(config-if-range)#no keepalive
c29s2.a1558.cvm.wise(config-if-range)#end
c29s
 << 2.a1558.cvm.wise#
 << 
*Feb 28 18:16:53: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> write mem

Expect: searching for 2 strs:  :# :>
 << 
c29s2.a1558.cvm.wise#write mem
Building configuration...

Expect: matched string 1: #
 >> 
Expect: searching for 2 strs:  :# :>
 << [OK]
c29s2.a1558.cvm.wise#
c29s2.a1558.cvm.wise#
c29s2.a1558.cvm.wise#
Expect: matched string 1: #
 >> sh run

Expect: searching for 2 strs:  :# :>
 << sh run
Building configuration...

Current configuration : 21883 bytes
!
version 12.2
no service pad
service timestamps debug datetime localtime
service timestamps log datetime localtime
service password-encryption
!
hostname c29s2.a1558.cvm.wis
 << e
!
boot-start-marker
boot-end-marker
!
enable secret 5 $1$okze$6ACoxy.oMKxqNbUjiRQAA/
enable password 7 08005E4B0844095D05
!
!
!
no aaa new-model
clock timezone CST -6
clock summer-time CDT recurring
switch 1 provision ws-c2960s-48ts-l
auth
 << entication mac-move permit
!
!
ip dhcp snooping vlan 152
ip dhcp snooping
ip domain-name mgmt.msstate.edu
ip name-server 130.18.2.210
!
!
crypto pki trustpoint TP-self-signed-1967411456
 enrollment selfsigned
 subject-name cn=IOS-Self-Signed-Ce
 << rtificate-1967411456
 revocation-check none
 rsakeypair TP-self-signed-1967411456
!
!
crypto pki certificate chain TP-self-signed-1967411456
 certificate self-signed 01
  3082024F 308201B8 A0030201 02020101 300D0609 2A864886 F70D0101 04050030 
  3
 << 1312F30 2D060355 04031326 494F532D 53656C66 2D536967 6E65642D 43657274 
  69666963 6174652D 31393637 34313134 3536301E 170D3933 30333031 30303135 
  33345A17 0D323030 31303130 30303030 305A3031 312F302D 06035504 03132649 
  4F532D53 656C662D 5369676E 6
 << 5642D43 65727469 66696361 74652D31 39363734 
  31313435 3630819F 300D0609 2A864886 F70D0101 01050003 818D0030 81890281 
  8100BF08 A787564C A0BC14C7 0D4777F5 DBD59260 3A0C216F 485B7AD8 0A0358BE 
  3E8F955C 29AF53BB C2F7376C 424D4ABE 1AA9DC22 E7A1A7CC 0
 << 6F10F35 6E361676 
  3E68266D 76F452D7 E0D71F76 1D8E54AA 38802FC5 E4D4A657 47BBD294 887BB57A 
  71200FCD 434767E5 89908FAC 86AB4941 793F5112 F920E553 754A5A8B 1F0D388C 
  3E270203 010001A3 77307530 0F060355 1D130101 FF040530 030101FF 30220603 
  551D11
 << 04 1B301982 17537769 7463682E 6D676D74 2E6D7373 74617465 2E656475 
  301F0603 551D2304 18301680 14DDD478 FC4806B0 9C69A577 4B50CF59 AADA3EBB 
  E5301D06 03551D0E 04160414 DDD478FC 4806B09C 69A5774B 50CF59AA DA3EBBE5 
  300D0609 2A864886 F70D0101 040500
 << 03 818100B3 DA7AFDF1 137A503C 7CB83B41 
  7B940953 42E08EC1 E646C83D 60BC7F60 AECC21B6 47250321 C200A38C 9D38C5C4 
  6B82A93F FE46F531 6DEE5760 2CB412CF CC216467 AA66F52A 9990C132 C2AB3635 
  21F2357B EA390ADF 57A93D97 8E02EC35 F235A981 DA368402 387EB6
 << 79 46E68B2C 
  A6477232 3DA80DA3 3AE72232 40F8946E 21B76B
  quit
!
spanning-tree mode mst
spanning-tree portfast bpduguard default
spanning-tree extend system-id
!
spanning-tree mst configuration
 name msstate
 revision 1
 instance 1 vlan 2, 7,
 <<  11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 63, 70
 instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 160
 instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 230, 232, 242, 246
 instance 1 vlan 256, 611-612, 654, 741, 996, 999
 ins
 << tance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037, 2039-2040
 instance 2 vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096, 2104, 2110, 2126
 instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 2189, 2194, 2202
 instance 2 vlan 2220, 2
 << 222, 2232, 2242, 2246, 2611-2612, 2654, 2999
 instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176, 196
 instance 3 vlan 244, 248, 927
 instance 4 vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072, 2108, 2113, 2128
 instance 4 vlan 2144, 21
 << 76, 2196, 2244, 2248, 2927
 instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 228
 instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216, 2228
 instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116, 124
 instance 7 vla
 << n 172, 186, 192, 204-208, 210, 240-241, 251-252, 630, 928
 instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082, 2084
 instance 8 vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208, 2210
 instance 8 vlan 2240-2241, 2251-2252, 2630,
 <<  2928
 instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102, 112
 instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 500, 505, 510-511
 instance 9 vlan 522, 551-570, 603, 629, 633, 742, 802, 926, 929
 instance 10 vlan 2004-2005, 2012
 << , 2018-2019, 2032, 2044, 2057, 2062, 2068
 instance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148, 2158
 instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522, 2603, 2629, 2633
 instance 10 vlan 2802, 2926, 2929
 instance 11 vlan 8, 43
 << , 52, 146, 156-157, 180, 200, 218
 instance 12 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180, 2200, 2218
!
!
!
!
errdisable recovery cause udld
errdisable recovery cause bpduguard
errdisable recovery cause security-violation
errdisable recovery ca
 << use channel-misconfig (STP)
errdisable recovery cause pagp-flap
errdisable recovery cause dtp-flap
errdisable recovery cause link-flap
errdisable recovery cause sfp-config-mismatch
errdisable recovery cause gbic-invalid
errdisable recovery cause pse
 << cure-violation
errdisable recovery cause port-mode-failure
errdisable recovery cause dhcp-rate-limit
errdisable recovery cause pppoe-ia-rate-limit
errdisable recovery cause mac-limit
errdisable recovery cause vmps
errdisable recovery cause storm-con
 << trol
errdisable recovery cause inline-power
errdisable recovery cause arp-inspection
errdisable recovery cause loopback
errdisable recovery cause small-frame
errdisable recovery interval 1800
!
vlan internal allocation policy ascending
!
!
!
in
 << terface FastEthernet0
 no ip address
 shutdown
!
interface GigabitEthernet1/0/1
 switchport access vlan 152
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport
 <<  port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/2
 switchport access vlan 152
 switchport mode access
 switchport port-security maximum 2
 switchport port-secu
 << rity
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/3
 switchport access vlan 152
 switchport mode access

 <<  switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0
 << /4
 switchport access vlan 152
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 << 
 spanning-tree portfast
!
interface GigabitEthernet1/0/5
 switchport access vlan 152
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violatio
 << n protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/6
 switchport access vlan 152
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-
 << security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/7
 switchport access vlan 152
 switchport mode access
 switchport port-securi
 << ty maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/8
 switchport access 
 << vlan 152
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfa
 << st
!
interface GigabitEthernet1/0/9
 switchport access vlan 152
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport 
 << port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/10
 switchport access vlan 152
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 << 
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/11
 switchport access vlan 152
 switchport mode access
 switchport port-security maximum 2
 switch
 << port port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/12
 switchport access vlan 152
 switchpor
 << t mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface Gig
 << abitEthernet1/0/13
 switchport access vlan 152
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging
 <<  type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/14
 switchport access vlan 152
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-
 << security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/15
 switchport access vlan 152
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 << 
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/16
 switchport access vlan 152
 switchport mode access
 swi
 << tchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/17
 << 
 switchport access vlan 152
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 
 << spanning-tree portfast
!
interface GigabitEthernet1/0/18
 switchport access vlan 152
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation 
 << protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/19
 switchport access vlan 152
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-s
 << ecurity aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/20
 switchport access vlan 152
 switchport mode access
 switchport port-securi
 << ty maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/21
 switchport access
 <<  vlan 152
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portf
 << ast
!
interface GigabitEthernet1/0/22
 switchport access vlan 152
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchpor
 << t port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/23
 switchport access vlan 152
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 
 << 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/24
 switchport access vlan 152
 switchport mode access
 switchport port-security maximum 2
 swit
 << chport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/25
 switchport access vlan 152
 switchp
 << ort mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface G
 << igabitEthernet1/0/26
 switchport access vlan 152
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security agi
 << ng type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/27
 switchport access vlan 152
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport por
 << t-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/28
 switchport access vlan 152
 switchport mode access
 switchport port-security maximum 2
 switchport port-securit
 << y
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/29
 switchport access vlan 152
 switchport mode access
 s
 << witchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/3
 << 0
 switchport access vlan 152
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 << 
 spanning-tree portfast
!
interface GigabitEthernet1/0/31
 switchport access vlan 152
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violatio
 << n protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/32
 switchport access vlan 152
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port
 << -security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/33
 switchport access vlan 152
 switchport mode access
 switchport port-secu
 << rity maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/34
 switchport acce
 << ss vlan 152
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree por
 << tfast
!
interface GigabitEthernet1/0/35
 switchport access vlan 152
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchp
 << ort port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/36
 switchport access vlan 152
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging tim
 << e 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/37
 switchport access vlan 152
 switchport mode access
 switchport port-security maximum 2
 sw
 << itchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/38
 switchport access vlan 152
 switc
 << hport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface
 <<  GigabitEthernet1/0/39
 switchport access vlan 152
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security a
 << ging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/40
 switchport access vlan 152
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport p
 << ort-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/41
 switchport access vlan 152
 switchport mode access
 switchport port-security maximum 2
 switchport port-secur
 << ity
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/42
 switchport access vlan 152
 switchport mode access

 <<  switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0
 << /43
 switchport access vlan 152
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivit
 << y
 spanning-tree portfast
!
interface GigabitEthernet1/0/44
 switchport access vlan 152
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violat
 << ion protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/45
 switchport access vlan 152
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport po
 << rt-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/46
 switchport access vlan 152
 switchport mode access
 switchport port-se
 << curity maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/47
 switchport ac
 << cess vlan 152
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree p
 << ortfast
!
interface GigabitEthernet1/0/48
 switchport trunk native vlan 92
 switchport mode trunk
 no keepalive
 ip dhcp snooping trust
!
interface GigabitEthernet1/0/49
 switchport trunk native vlan 92
 switchport mode trunk
 ip dhcp snooping 
 << trust
!
interface GigabitEthernet1/0/50
 switchport trunk native vlan 92
 switchport mode trunk
 ip dhcp snooping trust
!
interface GigabitEthernet1/0/51
 switchport trunk native vlan 92
 switchport mode trunk
 ip dhcp snooping trust
!
interfa
 << ce GigabitEthernet1/0/52
 switchport trunk native vlan 92
 switchport mode trunk
 ip dhcp snooping trust
!
interface Vlan1
 no ip address
 no ip route-cache
 shutdown
!
interface Vlan92
 ip address 10.92.2.238 255.255.0.0
 ip broadcast-address
 <<  10.92.255.255
!
ip default-gateway 10.92.0.1
ip http server
ip http secure-server
ip sla enable reaction-alerts
logging facility local1
logging 130.18.8.12
access-list 1 permit 10.92.0.0 0.0.255.255
snmp-server community sysnet RO 1
snmp-server
 <<  community c2-b2=a2 RW 1
snmp-server contact 6F-1586
snmp-server enable traps snmp authentication linkdown linkup coldstart warmstart
snmp-server enable traps transceiver all
snmp-server enable traps tty
snmp-server enable traps cluster
snmp-server 
 << enable traps config-copy
snmp-server enable traps config
snmp-server enable traps config-ctid
snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-auth-fail-vlan no-guest-vlan
snmp-server enable traps entity
snmp-server enable traps power-ethe
 << rnet group 1
snmp-server enable traps power-ethernet police
snmp-server enable traps cpu threshold
snmp-server enable traps rep
snmp-server enable traps rtr
snmp-server enable traps bridge newroot topologychange
snmp-server enable traps stpx inconsi
 << stency root-inconsistency loop-inconsistency
snmp-server enable traps syslog
snmp-server enable traps vtp
snmp-server enable traps vlancreate
snmp-server enable traps vlandelete
snmp-server enable traps flash insertion removal
snmp-server enable tra
 << ps port-security
snmp-server enable traps envmon fan shutdown supply temperature status
snmp-server enable traps errdisable
snmp-server enable traps mac-notification change move threshold
snmp-server enable traps vlan-membership
snmp-server host 130.
 << 18.2.208 sysnet 
!
line con 0
line vty 0 4
 password 7 08005E4B0844095D05
 login
line vty 5 15
 password 7 06271D244D13055312
 login
!
ntp clock-period 22519226
ntp server 10.92.0.5
end

c29s2.a1558.cvm.wise#
Expect: matched string 1: #
 >> show interface status

Expect: searching for 2 strs:  :# :>
 << show interface status

Port      Name               Status       Vlan       Duplex  Speed Type
Gi1/0/1                      notconnect   152          auto   auto 10/100/1000BaseTX
Gi1/0/2                      notconnect   152          auto   auto 10/1
 << 00/1000BaseTX
Gi1/0/3                      notconnect   152          auto   auto 10/100/1000BaseTX
Gi1/0/4                      notconnect   152          auto   auto 10/100/1000BaseTX
Gi1/0/5                      notconnect   152          auto   auto 1
 << 0/100/1000BaseTX
Gi1/0/6                      notconnect   152          auto   auto 10/100/1000BaseTX
Gi1/0/7                      notconnect   152          auto   auto 10/100/1000BaseTX
Gi1/0/8                      notconnect   152          auto   aut
 << o 10/100/1000BaseTX
Gi1/0/9                      notconnect   152          auto   auto 10/100/1000BaseTX
Gi1/0/10                     notconnect   152          auto   auto 10/100/1000BaseTX
Gi1/0/11                     notconnect   152          auto   
 << auto 10/100/1000BaseTX
Gi1/0/12                     notconnect   152          auto   auto 10/100/1000BaseTX
Gi1/0/13                     notconnect   152          auto   auto 10/100/1000BaseTX
Gi1/0/14                     notconnect   152          auto
 <<    auto 10/100/1000BaseTX
Gi1/0/15                     notconnect   152          auto   auto 10/100/1000BaseTX
Gi1/0/16                     notconnect   152          auto   auto 10/100/1000BaseTX
Gi1/0/17                     notconnect   152          a
 << uto   auto 10/100/1000BaseTX
Gi1/0/18                     notconnect   152          auto   auto 10/100/1000BaseTX
Gi1/0/19                     notconnect   152          auto   auto 10/100/1000BaseTX
Gi1/0/20                     notconnect   152        
 <<   auto   auto 10/100/1000BaseTX
Gi1/0/21                     notconnect   152          auto   auto 10/100/1000BaseTX
Gi1/0/22                     notconnect   152          auto   auto 10/100/1000BaseTX
Gi1/0/23                     notconnect   152     
 <<      auto   auto 10/100/1000BaseTX
Gi1/0/24                     notconnect   152          auto   auto 10/100/1000BaseTX
Gi1/0/25                     notconnect   152          auto   auto 10/100/1000BaseTX
Gi1/0/26                     notconnect   152  
 <<         auto   auto 10/100/1000BaseTX
Gi1/0/27                     notconnect   152          auto   auto 10/100/1000BaseTX
Gi1/0/28                     notconnect   152          auto   auto 10/100/1000BaseTX
Gi1/0/29                     notconnect   15
 << 2          auto   auto 10/100/1000BaseTX
Gi1/0/30                     notconnect   152          auto   auto 10/100/1000BaseTX
Gi1/0/31                     notconnect   152          auto   auto 10/100/1000BaseTX
Gi1/0/32                     notconnect  
 <<  152          auto   auto 10/100/1000BaseTX
Gi1/0/33                     notconnect   152          auto   auto 10/100/1000BaseTX
Gi1/0/34                     notconnect   152          auto   auto 10/100/1000BaseTX
Gi1/0/35                     notconnec
 << t   152          auto   auto 10/100/1000BaseTX
Gi1/0/36                     notconnect   152          auto   auto 10/100/1000BaseTX
Gi1/0/37                     notconnect   152          auto   auto 10/100/1000BaseTX
Gi1/0/38                     notcon
 << nect   152          auto   auto 10/100/1000BaseTX
Gi1/0/39                     notconnect   152          auto   auto 10/100/1000BaseTX
Gi1/0/40                     notconnect   152          auto   auto 10/100/1000BaseTX
Gi1/0/41                     not
 << connect   152          auto   auto 10/100/1000BaseTX
Gi1/0/42                     notconnect   152          auto   auto 10/100/1000BaseTX
Gi1/0/43                     notconnect   152          auto   auto 10/100/1000BaseTX
Gi1/0/44                     
 << notconnect   152          auto   auto 10/100/1000BaseTX
Gi1/0/45                     notconnect   152          auto   auto 10/100/1000BaseTX
Gi1/0/46                     notconnect   152          auto   auto 10/100/1000BaseTX
Gi1/0/47                  
 <<    notconnect   152          auto   auto 10/100/1000BaseTX
Gi1/0/48                     notconnect   1            auto   auto 10/100/1000BaseTX
Gi1/0/49                     notconnect   1            auto   auto Not Present
Gi1/0/50                     
 << notconnect   1            auto   auto Not Present
Gi1/0/51                     notconnect   1            auto   auto Not Present
Gi1/0/52                     notconnect   1            auto   auto Not Present
Fa0                          disabled     ro
 << uted       auto   auto 10/100BaseTX
c29s2.a1558.cvm.wise#
Expect: matched string 1: #
