trying to use serial port: /dev/ttyUSB0
 >> 
 >> 

Expect: searching for 4 strs:  :[yes/no] :Press RETURN to get started. :# :Switch>
 << 
c29s1.r1127.bryan#
c29s1.r1127.bryan#
c29s1.r1127.bryan#
c29s1.r1127.bryan#
Expect: matched string 3: #
 >> term len 0

Expect: searching for 2 strs:  :# :>
 << term len 0
c29s1.r1127.bryan#
Expect: matched string 1: #
 >> show version

Expect: searching for 2 strs:  :# :>
 << show version
Cisco IOS Software, C2960 Software (C2960-LANBASEK9-M), Version 12.2(46)SE, RELEASE SOFTWARE (fc2)
Copyright (c) 1986-2008 by Cisco Systems, Inc.
Compiled Thu 21-Aug-08 15:59 by nachen
Image text-base: 0x00003000, data-base: 0x01200000

 << 
ROM: Bootstrap program is C2960 boot loader
BOOTLDR: C2960 Boot Loader (C2960-HBOOT-M) Version 12.2(25r)SEE1, RELEASE SOFTWARE (fc1)

c29s1.r1127.bryan uptime is 35 minutes
System returned to ROM by power-on
System image file is "flash:c2960-lanbase
 << k9-mz.122-46.SE.bin"


This product contains cryptographic features and is subject to United
States and local country laws governing import, export, transfer and
use. Delivery of Cisco cryptographic products does not imply
third-party authority to i
 << mport, export, distribute or use encryption.
Importers, exporters, distributors and users are responsible for
compliance with U.S. and local country laws. By using this product you
agree to comply with applicable laws and regulations. If you are unable
 << 
to comply with U.S. and local laws, return this product immediately.

A summary of U.S. laws governing Cisco cryptographic products may be found at:
http://www.cisco.com/wwl/export/crypto/tool/stqrg.html

If you require further assistance please co
 << ntact us by sending email to
export@cisco.com.

cisco WS-C2960-48TC-L (PowerPC405) processor (revision B0) with 61440K/4088K bytes of memory.
Processor board ID FOC1025X5RL
Last reset from power-on
2 Virtual Ethernet interfaces
48 FastEthernet inte
 << rfaces
2 Gigabit Ethernet interfaces
The password-recovery mechanism is enabled.

64K bytes of flash-simulated non-volatile configuration memory.
Base ethernet MAC Address       : 00:18:73:D9:76:80
Motherboard assembly number     : 73-9835-07
Power
 <<  supply part number        : 341-0097-02
Motherboard serial number       : FOC10251843
Power supply serial number      : DCA101828VL
Model revision number           : B0
Motherboard revision number     : C0
Model number                    : WS-C2960-
 << 48TC-L
System serial number            : FOC1025X5RL
Top Assembly Part Number        : 800-26672-02
Top Assembly Revision Number    : B0
Version ID                      : V02
CLEI Code Number                : COM3F00BRA
Hardware Board Revision Numbe
 << r  : 0x02


Switch Ports Model              SW Version            SW Image                 
------ ----- -----              ----------            ----------               
*    1 50    WS-C2960-48TC-L    12.2(46)SE            C2960-LANBASEK9-M       
 <<  


Configuration register is 0xF

c29s1.r1127.bryan#
Expect: matched string 1: #
 >> write mem

Expect: searching for 2 strs:  :# :>
 << write mem
Building configuration...

 << [OK]
c29s1.r1127.bryan#
Expect: matched string 1: #
 >> enable

Expect: searching for 2 strs:  :Password: :#
 << enable
c29s1.r1127.bryan#
Expect: matched string 2: #
 >> wr erase
 >> 

 >> reload

Expect: searching for 2 strs:  :# :>
 << wr erase
Erasing the nvram filesystem will remove all configuration files! Continue? [confirm]
[OK]
Erase of nvram: complete
c29s1.r1127.bryan#reload
Proceed with reload? [confirm]
Expect: matched string 1: #
Expect: searching for 1 strs:  :Save?
 << 
*Feb 28 18:35:35: %SYS-7-NV_BLOCK_INIT: Initialized the geometry of nvram
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

*Feb 28 18:35:35: %SYS-7-NV_BLOCK_INIT: Initialized the geometry of nvram
...

 >> 

