trying to use serial port: /dev/ttyUSB0
 >> 
 >> 

Expect: searching for 4 strs:  :[yes/no] :Press RETURN to get started. :# :Switch>
 << 
Switch>
Switch>
Switch>
Switch>
Expect: matched string 4: Switch>
 >> term len 0

Expect: searching for 2 strs:  :# :>
 << term len 0
Switch>
Expect: matched string 2: >
 >> show version

Expect: searching for 2 strs:  :# :>
 << show version
Cisco IOS Software, C3560 Software (C3560-IPBASEK9-M), Version 12.2(46)SE, RELEASE SOFTWARE (fc2)
Copyright (c) 1986-2008 by Cisco Systems, Inc.
Compiled Thu 21-Aug-08 15:26 by nachen
Image text-base: 0x00003000, data-base: 0x01600000


 << ROM: Bootstrap program is C3560 boot loader
BOOTLDR: C3560 Boot Loader (C3560-HBOOT-M) Version 12.2(25r)SEC, RELEASE SOFTWARE (fc4)

Switch uptime is 1 minute
System returned to ROM by power-on
System image file is "flash:c3560-ipbasek9-mz.122-46.SE.
 << bin"


This product contains cryptographic features and is subject to United
States and local country laws governing import, export, transfer and
use. Delivery of Cisco cryptographic products does not imply
third-party authority to import, export, d
 << istribute or use encryption.
Importers, exporters, distributors and users are responsible for
compliance with U.S. and local country laws. By using this product you
agree to comply with applicable laws and regulations. If you are unable
to comply with
 <<  U.S. and local laws, return this product immediately.

A summary of U.S. laws governing Cisco cryptographic products may be found at:
http://www.cisco.com/wwl/export/crypto/tool/stqrg.html

If you require further assistance please contact us by send
 << ing email to
export@cisco.com.

cisco WS-C3560-24PS (PowerPC405) processor (revision Q0) with 122880K/8184K bytes of memory.
Processor board ID FDO1134Z8Z5
Last reset from power-on
1 Virtual Ethernet interface
24 FastEthernet interfaces
2 Gigabit 
 << Ethernet interfaces
The password-recovery mechanism is enabled.

512K bytes of flash-simulated non-volatile configuration memory.
Base ethernet MAC Address       : 00:1D:45:EF:EA:00
Motherboard assembly number     : 73-9673-09
Power supply part numb
 << er        : 341-0029-05
Motherboard serial number       : FDO113405FU
Power supply serial number      : LIT1129006D
Model revision number           : Q0
Motherboard revision number     : B0
Model number                    : WS-C3560-24PS-S
System se
 << rial number            : FDO1134Z8Z5
Top Assembly Part Number        : 800-25861-04
Top Assembly Revision Number    : D0
Version ID                      : V06
CLEI Code Number                : COM1X00ARC
Hardware Board Revision Number  : 0x01


Sw
 << itch Ports Model              SW Version            SW Image                 
------ ----- -----              ----------            ----------               
*    1 26    WS-C3560-24PS      12.2(46)SE            C3560-IPBASEK9-M         


Configurat
 << ion register is 0xF

Switch>
Expect: matched string 2: >
 >> enable

Expect: searching for 2 strs:  :Password: :#
 << enable
Switch#
Expect: matched string 2: #
 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
Expect: matched string 1: (config)#
 >> 

 >> version 12.2

 >> no service pad

 >> service timestamps debug datetime localtime

 >> service timestamps log datetime localtime

 >> service password-encryption

 >> hostname c35s9p.f2.hand

 >> logging buffered informational

 >> enable secret 5 $1$BiW4$6eTG8jMxTHM0PP8fXlR2d0

 >> enable password 7 072E33494F54154F00

 >> no aaa new-model

 >> clock timezone CST -6

 >> clock summer-time CDT recurring

 >> system mtu routing 1500

 >> ip subnet-zero

 >> ip domain-name mgmt.msstate.edu

 >> ip name-server 130.18.80.12

 >> ip dhcp snooping vlan 144

 >> ip dhcp snooping

 >> errdisable recovery cause udld

 >> errdisable recovery cause bpduguard

 >> errdisable recovery cause security-violation

 >> errdisable recovery cause channel-misconfig

 >> errdisable recovery cause pagp-flap

 >> errdisable recovery cause dtp-flap

 >> errdisable recovery cause link-flap

 >> errdisable recovery cause sfp-config-mismatch

 >> errdisable recovery cause gbic-invalid

 >> errdisable recovery cause l2ptguard

 >> errdisable recovery cause psecure-violation

 >> errdisable recovery cause dhcp-rate-limit

 >> errdisable recovery cause unicast-flood

 >> errdisable recovery cause vmps

 >> errdisable recovery cause storm-control

 >> errdisable recovery cause inline-power

 >> errdisable recovery cause arp-inspection

 >> errdisable recovery cause loopback

 >> errdisable recovery interval 1800

 >> no file verify auto

 >> spanning-tree mode mst

 >> spanning-tree portfast bpduguard default

 >> spanning-tree extend system-id

 >> spanning-tree mst configuration

 >>  name msstate

 >>  revision 1

 >>  instance 1 vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 63, 70

 >>  instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 160

 >>  instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 230, 232, 242, 246

 >>  instance 1 vlan 256, 611-612, 654, 741, 996, 999

 >>  instance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037, 2039-2040

 >>  instance 2 vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096, 2104, 2110, 2126

 >>  instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 2189, 2194, 2202

 >>  instance 2 vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 2654, 2999

 >>  instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176, 196

 >>  instance 3 vlan 244, 248, 927

 >>  instance 4 vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072, 2108, 2113, 2128

 >>  instance 4 vlan 2144, 2176, 2196, 2244, 2248, 2927

 >>  instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 228

 >>  instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216, 2228

 >>  instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116, 124

 >>  instance 7 vlan 172, 186, 192, 204-208, 210, 240-241, 251-252, 630, 928

 >>  instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082, 2084

 >>  instance 8 vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208, 2210

 >>  instance 8 vlan 2240-2241, 2251-2252, 2630, 2928

 >>  instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102, 112

 >>  instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 500, 505, 510-511

 >>  instance 9 vlan 522, 551-570, 603, 629, 633, 742, 802, 926, 929

 >>  instance 10 vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 2057, 2062, 2068

 >>  instance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148, 2158

 >>  instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522, 2603, 2629, 2633

 >>  instance 10 vlan 2802, 2926, 2929

 >>  instance 11 vlan 8, 43, 52, 146, 156-157, 180, 200, 218

 >>  instance 12 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180, 2200, 2218

 >> vlan internal allocation policy ascending

 >> interface FastEthernet0/1

 >>  switchport access vlan 506

 >>  switchport mode access

 >>  spanning-tree portfast

 >> interface FastEthernet0/2

 >>  switchport access vlan 506

 >>  switchport mode access

 >>  spanning-tree portfast

 >> interface FastEthernet0/3

 >>  switchport access vlan 506

 >>  switchport mode access

 >>  spanning-tree portfast

 >> interface FastEthernet0/4

 >>  switchport access vlan 506

 >>  switchport mode access

 >>  spanning-tree portfast

 >> interface FastEthernet0/5

 >>  switchport access vlan 506

 >>  switchport mode access

 >>  spanning-tree portfast

 >> interface FastEthernet0/6

 >>  switchport access vlan 506

 >>  switchport mode access

 >>  spanning-tree portfast

 >> interface FastEthernet0/7

 >>  switchport access vlan 506

 >>  switchport mode access

 >>  spanning-tree portfast

 >> interface FastEthernet0/8

 >>  switchport access vlan 506

 >>  switchport mode access

 >>  spanning-tree portfast

 >> interface FastEthernet0/9

 >>  switchport access vlan 506

 >>  switchport mode access

 >>  spanning-tree portfast

 >> interface FastEthernet0/10

 >>  switchport access vlan 506

 >>  switchport mode access

 >>  spanning-tree portfast

 >> interface FastEthernet0/11

 >>  switchport access vlan 506

 >>  switchport mode access

 >>  spanning-tree portfast

 >> interface FastEthernet0/12

 >>  switchport access vlan 506

 >>  switchport mode access

 >>  spanning-tree portfast

 >> interface FastEthernet0/13

 >>  switchport access vlan 506

 >>  switchport mode access

 >>  spanning-tree portfast

 >> interface FastEthernet0/14

 >>  switchport access vlan 506

 >>  switchport mode access

 >>  spanning-tree portfast

 >> interface FastEthernet0/15

 >>  switchport access vlan 506

 >>  switchport mode access

 >>  spanning-tree portfast

 >> interface FastEthernet0/16

 >>  switchport access vlan 506

 >>  switchport mode access

 >>  spanning-tree portfast

 >> interface FastEthernet0/17

 >>  switchport access vlan 506

 >>  switchport mode access

 >>  spanning-tree portfast

 >> interface FastEthernet0/18

 >>  switchport access vlan 506

 >>  switchport mode access

 >>  spanning-tree portfast

 >> interface FastEthernet0/19

 >>  switchport access vlan 506

 >>  switchport mode access

 >>  spanning-tree portfast

 >> interface FastEthernet0/20

 >>  switchport access vlan 506

 >>  switchport mode access

 >>  spanning-tree portfast

 >> interface FastEthernet0/21

 >>  switchport access vlan 506

 >>  switchport mode access

 >>  spanning-tree portfast

 >> interface FastEthernet0/22

 >>  switchport access vlan 506

 >>  switchport mode access

 >>  spanning-tree portfast

 >> interface FastEthernet0/23

 >>  switchport access vlan 506

 >>  switchport mode access

 >>  spanning-tree portfast

 >> interface FastEthernet0/24

 >>  switchport access vlan 506

 >>  switchport mode access

 >>  spanning-tree portfast

 >> interface GigabitEthernet0/1

 >>  description c29s7.f2.hand

 >>  switchport trunk encapsulation dot1q

 >>  switchport trunk native vlan 92

 >>  switchport trunk pruning vlan none

 >>  switchport mode trunk

 >>  ip dhcp snooping trust

 >> interface GigabitEthernet0/2

 >>  switchport trunk encapsulation dot1q

 >>  switchport trunk native vlan 92

 >>  switchport trunk pruning vlan none

 >>  switchport mode trunk

 >>  ip dhcp snooping trust

 >> interface Vlan1

 >>  no ip address

 >>  no ip route-cache

 >> interface Vlan92

 >>  ip address 10.92.1.248 255.255.0.0

 >>  ip broadcast-address 10.92.255.255

 >> ip default-gateway 10.92.0.1

 >> ip classless

 >> no ip http server

 >> logging facility local1

 >> logging 130.18.8.12

 >> access-list 1 permit 130.18.92.0 0.0.3.255

 >> access-list 1 permit 10.92.0.0 0.0.255.255

 >> snmp-server community sysnet RO 1

 >> snmp-server community c2-b2=a2 RW 1

 >> snmp-server community spongebob RO

 >> snmp-server contact 6f-1028

 >> snmp-server enable traps snmp authentication linkdown linkup coldstart warmstart

 >> snmp-server enable traps tty

 >> snmp-server enable traps cluster

 >> snmp-server enable traps entity

 >> snmp-server enable traps cpu threshold

 >> snmp-server enable traps power-ethernet group 1

 >> snmp-server enable traps vtp

 >> snmp-server enable traps vlancreate

 >> snmp-server enable traps vlandelete

 >> snmp-server enable traps flash insertion removal

 >> snmp-server enable traps port-security

 >> snmp-server enable traps envmon fan shutdown supply temperature status

 >> snmp-server enable traps config-copy

 >> snmp-server enable traps config

 >> snmp-server enable traps rtr

 >> snmp-server enable traps bridge newroot topologychange

 >> snmp-server enable traps stpx inconsistency root-inconsistency loop-inconsistency

 >> snmp-server enable traps syslog

 >> snmp-server enable traps vlan-membership

 >> snmp-server host 130.18.8.12 sysnet 

 >> control-plane

 >> line con 0

 >> line vty 0 4

 >>  password 7 002501030506074C18

 >>  login

 >> line vty 5 15

 >>  password 7 072E33494F54154F00

 >>  login

 >> ntp clock-period 36029235

 >> ntp server 10.92.0.5

 >> end

 >> end

Expect: searching for 1 strs:  :Configured
 << 
Switch(config)#version 12.2
Switch(config)#no service pad
Switch(config)#service timestamps debug datetime localtime
Switch(config)#service timestamps log datetime localtime
Switch(config)#service password-encryption
Switch(config)#hostname c35s9p.
 << f2.hand
c35s9p.f2.hand(config)#logging buffered informational
c35s9p.f2.hand(config)#enable secret 5 $1$BiW4$6eTG8jMxTHM0PP8fXlR2d0
c35s9p.f2.hand(config)#enable password 7 072E33494F54154F00
The enable password you have chosen is the same as your ena
 << ble secret.
This is not recommended.  Re-enter the enable password.

c35s9p.f2.hand(config)#no aaa new-model
c35s9p.f2.hand(config)#clock timezone CST -6
c35s9p.f2.hand(config)#clock summer-time CDT recurring
c35s9p.f2.hand(config)#system mtu routin
 << g 1500
c35s9p.f2.hand(config)#ip subnet-zero
c35s9p.f2.hand(config)#ip domain-name mgmt.msstate.edu
c35s9p.f2.hand(config)#ip name-server 130.18.80.12
c35s9p.f2.hand(config)#ip dhcp snooping vlan 144
c35s9p.f2.hand(config)#ip dhcp snooping
c35s9p.f2
 << .hand(config)#errdisable recovery cause udld
c35s9p.f2.hand(config)#errdisable recovery cause bpduguard
c35s9p.f2.hand(config)#
*Feb 28 18:02:35: %SYS-6-CLOCKUPDATE: System clock has been updated from 00:02:35 UTC Mon Mar 1 1993 to 18:02:35 CST Sun Feb
 <<  28 1993, configured from console by console.
*Feb 28 18:02:35: %SYS-6-CLOCKUPDATE: System clock has been updated from 18:02:35 CST Sun Feb 28 1993 to 18:02:35 CST Sun Feb 28 1993, configured from console by console.errdisable recovery cause security-vio
 << lation
c35s9p.f2.hand(config)#errdisable recovery cause channel-misconfig
c35s9p.f2.hand(config)#errdisable recovery cause pagp-flap
c35s9p.f2.hand(config)#errdisable recovery cause dtp-flap
c35s9p.f2.hand(config)#errdisable recovery cause link-flap

 << c35s9p.f2.hand(config)#errdisable recovery cause sfp-config-mismatch
c35s9p.f2.hand(config)#errdisable recovery cause gbic-invalid
c35s9p.f2.hand(config)#errdisable recovery cause l2ptguard
c35s9p.f2.hand(config)#errdisable recovery cause psecure-viola
 << tion
c35s9p.f2.hand(config)#errdisable recovery cause dhcp-rate-limit
c35s9p.f2.hand(config)#errdisable recovery cause unicast-flood
                                                  ^
% Invalid input detected at '^' marker.

c35s9p.f2.hand(config)#
 << errdisable recovery cause vmps
c35s9p.f2.hand(config)#errdisable recovery cause storm-control
c35s9p.f2.hand(config)#errdisable recovery cause inline-power
c35s9p.f2.hand(config)#errdisable recovery cause arp-inspection
c35s9p.f2.hand(config)#errdisab
 << le recovery cause loopback
c35s9p.f2.hand(config)#errdisable recovery interval 1800
c35s9p.f2.hand(config)#no file verify auto
c35s9p.f2.hand(config)#spanning-tree mode mst
c35s9p.f2.hand(config)#spanning-tree portfast bpduguard default
c35s9p.f2.han
 << d(config)#spanning-tree extend system-id
c35s9p.f2.hand(config)#spanning-tree mst configuration
c35s9p.f2.hand(config-mst)# name msstate
c35s9p.f2.hand(config-mst)# revision 1
c35s9p.f2.hand(config-mst)# instance 1 vlan 2, 7, 11, 20, 22, 24, 31, 35, 3
 << 7,$ vlan 2, 7, 11, 20, 22, 24, 31, 35, 37,          39-40, 50, 11, 20, 22, 24, 31, 35, 37, 39-40, 50,          60, 63, 
 << 22, 24, 31, 35, 37, 39-40, 50, 60, 63, 7         0
c35s9p.f2.hand(config-mst)# instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126$ vlan 78, 80, 86, 91, 96, 104, 110, 
 << 126,          136, 14080, 86, 91, 96, 104, 110, 126, 136, 140,          152, 160
c35s9p.f2.hand(config-mst)# instance 1 vlan 162-163, 168, 189, 194, 202, 220,
 << $ vlan 162-163, 168, 189, 194, 202, 220,          222, 230,163, 168, 189, 194, 202, 220, 222, 230,          232, 242,89
 << , 194, 202, 220, 222, 230, 232, 242,          246
c35s9p.f2.hand(config-mst)# instance 1 vlan 256, 611-612, 654, 741, 996, 999
c35s9p.f2.hand(config-mst)# instance 2 vlan 2002, 2007, 2011, 2020, 2022, 202
 << $ vlan 2002, 2007, 2011, 2020, 2022, 2024         , 2031, 2, 2007, 2011, 2020, 2022, 2024, 2031, 20         35, 2037,11, 2020, 20
 << 22, 2024, 2031, 2035, 2037,          2039-2040
c35s9p.f2.hand(config-mst)# instance 2 vlan 2050, 2060, 2063, 2070, 2080, 208$ vlan 2050, 2060, 2063, 2070, 2080, 2086         , 2096, 2
 << , 2060, 2063, 2070, 2080, 2086, 2096, 21         04, 2110,63, 2070, 2080, 2086, 2096, 2104, 2110,          2126
c35s9p.f2.hand(config-mst)# i
 << nstance 2 vlan 2136, 2140, 2152, 2160, 2162-2163$ vlan 2136, 2140, 2152, 2160, 2162-2163,          2168, 21, 2140, 2152, 2160, 2162-2163, 2168, 218
 <<          9, 2194, 52, 2160, 2162-2163, 2168, 2189, 2194, 2         202
c35s9p.f2.hand(config-mst)# instance 2 vlan 2220, 2222, 2232, 2242, 2246, 261
 << $ vlan 2220, 2222, 2232, 2242, 2246, 2611         -2612, 26, 2222, 2232, 2242, 2246, 2611-2612, 265         4, 2999
c35s9p.f2.hand(config-mst)# instance 3 vlan 42, 51, 59, 64, 
 << 66, 69, 72, 108, $ vlan 42, 51, 59, 64, 66, 69, 72, 108, 1         13, 128, 51, 59, 64, 66, 69, 72, 108, 113, 128, 1         44, 176, 
 << , 66, 69, 72, 108, 113, 128, 144, 176, 1         96
c35s9p.f2.hand(config-mst)# instance 3 vlan 244, 248, 927
c35s9p.f2.hand(config-mst)# instance 4 vlan 2042, 2051, 2059, 2064, 2066, 206
 << $ vlan 2042, 2051, 2059, 2064, 2066, 2069         , 2072, 2, 2051, 2059, 2064, 2066, 2069, 2072, 21         08, 2113,
 << 59, 2064, 2066, 2069, 2072, 2108, 2113,          2128
c35s9p.f2.hand(config-mst)# instance 4 vlan 2144, 2176, 2196, 2244, 2248, 292$ vlan 2144, 2176, 2196, 2244, 2248, 2927       
 <<   
c35s9p.f2.hand(config-mst)# instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134$ vlan 16, 48, 58, 88, 121, 131, 133-134,          216, 228
c35s9p.f2.hand(config-mst)# instance 6 vlan 2
 << 016, 2048, 2058, 2088, 2121, 213$ vlan 2016, 2048, 2058, 2088, 2121, 2131         , 2133-21, 2048, 2058, 2088, 2121, 2131, 2133-213         
 << 4, 2216, 58, 2088, 2121, 2131, 2133-2134, 2216, 2         228
c35s9p.f2.hand(config-mst)# instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, 82,$ vla
 << n 9, 33-34, 38, 54, 56, 71, 75, 82,          84, 97, 13-34, 38, 54, 56, 71, 75, 82, 84, 97, 11         4, 116, 154, 56, 71, 75, 82, 84, 97,
 <<  114, 116, 12         4
c35s9p.f2.hand(config-mst)# instance 7 vlan 172, 186, 192, 204-208, 210, 240-$ vlan 172, 186, 192, 204-208, 210, 240-2         41, 251-2
 << 186, 192, 204-208, 210, 240-241, 251-25         2, 630, 9204-208, 210, 240-241, 251-252, 630, 92         8
c35s9p.f2.hand(config-mst)# instance 8 vlan 2009, 2033-2034
 << , 2038, 2054, 2056$ vlan 2009, 2033-2034, 2038, 2054, 2056,          2071, 20, 2033-2034, 2038, 2054, 2056, 2071, 207         5, 2082, 
 << 4, 2038, 2054, 2056, 2071, 2075, 2082, 2         084
c35s9p.f2.hand(config-mst)# instance 8 vlan 2097, 2114, 2116, 2124, 2172, 218$ vlan 2097, 2114, 
 << 2116, 2124, 2172, 2186         , 2192, 2, 2114, 2116, 2124, 2172, 2186, 2192, 22         04-2208, 16, 2124, 2172, 2186, 2192, 2204-2208, 2 
 <<         210
c35s9p.f2.hand(config-mst)# instance 8 vlan 2240-2241, 2251-2252, 2630, 2928
c35s9p.f2.hand(config-mst)# instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 6$ vlan 4-5, 12, 18-19, 32, 4
 << 4, 57, 62, 68         , 76, 98-12, 18-19, 32, 44, 57, 62, 68, 76, 98-9         9, 102, 1, 32, 44, 57, 62, 68, 76, 98-99, 102, 11         
 << 2
c35s9p.f2.hand(config-mst)# instance 9 vlan 130, 132, 147-148, 158, 212, 226,$ vlan 130, 132, 147-148, 158, 212, 226,          236, 500,132
 << , 147-148, 158, 212, 226, 236, 500,          505, 510-148, 158, 212, 226, 236, 500, 505, 510-5         11
c35s9p.f2.hand(config-mst)# instance 9 vlan 522, 551-570, 603, 629, 633, 742,
 << $ vlan 522, 551-570, 603, 629, 633, 742,          802, 926,551-570, 603, 629, 633, 742, 802, 926,          929
c35s9p.f2.hand(config-mst)# ins
 << tance 10 vlan 2004-2005, 2012, 2018-2019, 2032$0 vlan 2004-2005, 2012, 2018-2019, 2032,          2044, 204-2005, 2012, 2018-2019, 2032, 2044, 205  
 <<        7, 2062, 12, 2018-2019, 2032, 2044, 2057, 2062, 2         068
c35s9p.f2.hand(config-mst)# instance 10 vlan 2076, 2098-2099, 2102, 2112, 213
 << $0 vlan 2076, 2098-2099, 2102, 2112, 2130         , 2132, 26, 2098-2099, 2102, 2112, 2130, 2132, 21         47-2148, 99, 2102, 211
 << 2, 2130, 2132, 2147-2148, 2         158
c35s9p.f2.hand(config-mst)# instance 10 vlan 2212, 2236, 2500, 2505, 2510-251$0 vlan 2212, 2236, 2500, 2505, 2510-2511         , 2522, 2
 << 2, 2236, 2500, 2505, 2510-2511, 2522, 26         03, 2629,500, 2505, 2510-2511, 2522, 2603, 2629,          2633
c35s9p.f2.hand(config-mst)# instance
 <<  10 vlan 2802, 2926, 2929
c35s9p.f2.hand(config-mst)# instance 11 vlan 8, 43, 52, 146, 156-157, 180, 20$1 vlan 8, 43, 52, 146, 156-157, 180, 200         , 218
c35s9p.f2.hand(config-mst)# instanc
 << e 12 vlan 2008, 2043, 2052, 2146, 2156-215$2 vlan 2008, 2043, 2052, 2146, 2156-2157         , 2180, 28, 2043, 2052, 2146, 2156-2157, 2180, 22      
 <<    00, 2218
c35s9p.f2.hand(config-mst)#vlan internal allocation policy ascending
c35s9p.f2.hand(config)#interface FastEthernet0/1
c35s9p.f2.hand(config-if)# switchport access vlan 506
c35s9p.f2.hand(config-if)# switchport mode access
c35s9p.
 << f2.hand(config-if)# spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, concentrators, switches, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridg
 << ing loops.
 Use with CAUTION

%Portfast has been configured on FastEthernet0/1 but will only
 have effect when the interface is in a non-trunking mode.
c35s9p.f2.hand(config-if)#interface FastEthernet0/2
c35s9p.f2.hand(config-if)# switchport access 
 << vlan 506
c35s9p.f2.hand(config-if)# switchport mode access
c35s9p.f2.hand(config-if)# spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, concentrators, switches, bridges, etc... to t
 << his
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast has been configured on FastEthernet0/2 but will only
 have effect when the interface is in a non-trunking mode.
c35s9p.f2.hand(config-if)#inte
 << rface FastEthernet0/3
c35s9p.f2.hand(config-if)# switchport access vlan 506
c35s9p.f2.hand(config-if)# switchport mode access
c35s9p.f2.hand(config-if)# spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 
 << host. Connecting hubs, concentrators, switches, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast has been configured on FastEthernet0/3 but will only
 have effect when the 
 << interface is in a non-trunking mode.
c35s9p.f2.hand(config-if)#interface FastEthernet0/4
c35s9p.f2.hand(config-if)# switchport access vlan 506
c35s9p.f2.hand(config-if)# switchport mode access
c35s9p.f2.hand(config-if)# spanning-tree portfast
%Warnin
 << g: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, concentrators, switches, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast has been
 <<  configured on FastEthernet0/4 but will only
 have effect when the interface is in a non-trunking mode.
c35s9p.f2.hand(config-if)#interface FastEthernet0/5
c35s9p.f2.hand(config-if)# switchport access vlan 506
c35s9p.f2.hand(config-if)# switchport mod
 << e access
c35s9p.f2.hand(config-if)# spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, concentrators, switches, bridges, etc... to this
 interface  when portfast is enabled, can caus
 << e temporary bridging loops.
 Use with CAUTION

%Portfast has been configured on FastEthernet0/5 but will only
 have effect when the interface is in a non-trunking mode.
c35s9p.f2.hand(config-if)#interface FastEthernet0/6
c35s9p.f2.hand(config-if)# s
 << witchport access vlan 506
c35s9p.f2.hand(config-if)# switchport mode access
c35s9p.f2.hand(config-if)# spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, concentrators, switches, bri
 << dges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast has been configured on FastEthernet0/6 but will only
 have effect when the interface is in a non-trunking mode.
c35s9p.f2.han
 << d(config-if)#interface FastEthernet0/7
c35s9p.f2.hand(config-if)# switchport access vlan 506
c35s9p.f2.hand(config-if)# switchport mode access
c35s9p.f2.hand(config-if)# spanning-tree portfast
%Warning: portfast should only be enabled on ports connect
 << ed to a single
 host. Connecting hubs, concentrators, switches, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast has been configured on FastEthernet0/7 but will only
 have
 <<  effect when the interface is in a non-trunking mode.
c35s9p.f2.hand(config-if)#interface FastEthernet0/8
c35s9p.f2.hand(config-if)# switchport access vlan 506
c35s9p.f2.hand(config-if)# switchport mode access
c35s9p.f2.hand(config-if)# spanning-tree 
 << portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, concentrators, switches, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%
 << Portfast has been configured on FastEthernet0/8 but will only
 have effect when the interface is in a non-trunking mode.
c35s9p.f2.hand(config-if)#interface FastEthernet0/9
c35s9p.f2.hand(config-if)# switchport access vlan 506
c35s9p.f2.hand(config-if
 << )# switchport mode access
c35s9p.f2.hand(config-if)# spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, concentrators, switches, bridges, etc... to this
 interface  when portfast is 
 << enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast has been configured on FastEthernet0/9 but will only
 have effect when the interface is in a non-trunking mode.
c35s9p.f2.hand(config-if)#interface FastEthernet0/10
c35s9p.f2.
 << hand(config-if)# switchport access vlan 506
c35s9p.f2.hand(config-if)# switchport mode access
c35s9p.f2.hand(config-if)# spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, concentrat
 << ors, switches, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast has been configured on FastEthernet0/10 but will only
 have effect when the interface is in a non-trunking m
 << ode.
c35s9p.f2.hand(config-if)#interface FastEthernet0/11
c35s9p.f2.hand(config-if)# switchport access vlan 506
c35s9p.f2.hand(config-if)# switchport mode access
c35s9p.f2.hand(config-if)# spanning-tree portfast
%Warning: portfast should only be enab
 << led on ports connected to a single
 host. Connecting hubs, concentrators, switches, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast has been configured on FastEthernet0/11
 <<  but will only
 have effect when the interface is in a non-trunking mode.
c35s9p.f2.hand(config-if)#interface FastEthernet0/12
c35s9p.f2.hand(config-if)# switchport access vlan 506
c35s9p.f2.hand(config-if)# switchport mode access
c35s9p.f2.hand(conf
 << ig-if)# spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, concentrators, switches, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.

 <<  Use with CAUTION

%Portfast has been configured on FastEthernet0/12 but will only
 have effect when the interface is in a non-trunking mode.
c35s9p.f2.hand(config-if)#interface FastEthernet0/13
c35s9p.f2.hand(config-if)# switchport access vlan 506

 << c35s9p.f2.hand(config-if)# switchport mode access
c35s9p.f2.hand(config-if)# spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, concentrators, switches, bridges, etc... to this
 inte
 << rface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast has been configured on FastEthernet0/13 but will only
 have effect when the interface is in a non-trunking mode.
c35s9p.f2.hand(config-if)#interface Fas
 << tEthernet0/14
c35s9p.f2.hand(config-if)# switchport access vlan 506
c35s9p.f2.hand(config-if)# switchport mode access
c35s9p.f2.hand(config-if)# spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Co
 << nnecting hubs, concentrators, switches, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast has been configured on FastEthernet0/14 but will only
 have effect when the interfa
 << ce is in a non-trunking mode.
c35s9p.f2.hand(config-if)#interface FastEthernet0/15
c35s9p.f2.hand(config-if)# switchport access vlan 506
c35s9p.f2.hand(config-if)# switchport mode access
c35s9p.f2.hand(config-if)# spanning-tree portfast
%Warning: por
 << tfast should only be enabled on ports connected to a single
 host. Connecting hubs, concentrators, switches, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast has been confi
 << gured on FastEthernet0/15 but will only
 have effect when the interface is in a non-trunking mode.
c35s9p.f2.hand(config-if)#interface FastEthernet0/16
c35s9p.f2.hand(config-if)# switchport access vlan 506
c35s9p.f2.hand(config-if)# switchport mode ac
 << cess
c35s9p.f2.hand(config-if)# spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, concentrators, switches, bridges, etc... to this
 interface  when portfast is enabled, can cause te
 << mporary bridging loops.
 Use with CAUTION

%Portfast has been configured on FastEthernet0/16 but will only
 have effect when the interface is in a non-trunking mode.
c35s9p.f2.hand(config-if)#interface FastEthernet0/17
c35s9p.f2.hand(config-if)# swi
 << tchport access vlan 506
c35s9p.f2.hand(config-if)# switchport mode access
c35s9p.f2.hand(config-if)# spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, concentrators, switches, bridg
 << es, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast has been configured on FastEthernet0/17 but will only
 have effect when the interface is in a non-trunking mode.
c35s9p.f2.hand
 << (config-if)#interface FastEthernet0/18
c35s9p.f2.hand(config-if)# switchport access vlan 506
c35s9p.f2.hand(config-if)# switchport mode access
c35s9p.f2.hand(config-if)# spanning-tree portfast
%Warning: portfast should only be enabled on ports connect
 << ed to a single
 host. Connecting hubs, concentrators, switches, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast has been configured on FastEthernet0/18 but will only
 hav
 << e effect when the interface is in a non-trunking mode.
c35s9p.f2.hand(config-if)#interface FastEthernet0/19
c35s9p.f2.hand(config-if)# switchport access vlan 506
c35s9p.f2.hand(config-if)# switchport mode access
c35s9p.f2.hand(config-if)# spanning-tre
 << e portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, concentrators, switches, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

 << 
%Portfast has been configured on FastEthernet0/19 but will only
 have effect when the interface is in a non-trunking mode.
c35s9p.f2.hand(config-if)#interface FastEthernet0/20
c35s9p.f2.hand(config-if)# switchport access vlan 506
c35s9p.f2.hand(confi
 << g-if)# switchport mode access
c35s9p.f2.hand(config-if)# spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, concentrators, switches, bridges, etc... to this
 interface  when portfast
 <<  is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast has been configured on FastEthernet0/20 but will only
 have effect when the interface is in a non-trunking mode.
c35s9p.f2.hand(config-if)#interface FastEthernet0/21
c35s9
 << p.f2.hand(config-if)# switchport access vlan 506
c35s9p.f2.hand(config-if)# switchport mode access
c35s9p.f2.hand(config-if)# spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, conce
 << ntrators, switches, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast has been configured on FastEthernet0/21 but will only
 have effect when the interface is in a non-trunk
 << ing mode.
c35s9p.f2.hand(config-if)#interface FastEthernet0/22
c35s9p.f2.hand(config-if)# switchport access vlan 506
c35s9p.f2.hand(config-if)# switchport mode access
c35s9p.f2.hand(config-if)# spanning-tree portfast
%Warning: portfast should only be
 <<  enabled on ports connected to a single
 host. Connecting hubs, concentrators, switches, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast has been configured on FastEtherne
 << t0/22 but will only
 have effect when the interface is in a non-trunking mode.
c35s9p.f2.hand(config-if)#interface FastEthernet0/23
c35s9p.f2.hand(config-if)# switchport access vlan 506
c35s9p.f2.hand(config-if)# switchport mode access
c35s9p.f2.hand
 << (config-if)# spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, concentrators, switches, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loo
 << ps.
 Use with CAUTION

%Portfast has been configured on FastEthernet0/23 but will only
 have effect when the interface is in a non-trunking mode.
c35s9p.f2.hand(config-if)#interface FastEthernet0/24
c35s9p.f2.hand(config-if)# switchport access vlan 
 << 506
c35s9p.f2.hand(config-if)# switchport mode access
c35s9p.f2.hand(config-if)# spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, concentrators, switches, bridges, etc... to this

 <<  interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast has been configured on FastEthernet0/24 but will only
 have effect when the interface is in a non-trunking mode.
c35s9p.f2.hand(config-if)#interfac
 << e GigabitEthernet0/1
c35s9p.f2.hand(config-if)# description c29s7.f2.hand
c35s9p.f2.hand(config-if)# switchport trunk encapsulation dot1q
c35s9p.f2.hand(config-if)# switchport trunk native vlan 92
c35s9p.f2.hand(config-if)# switchport trunk pruning vl
 << an none
c35s9p.f2.hand(config-if)# switchport mode trunk
c35s9p.f2.hand(config-if)# ip dhcp snooping trust
c35s9p.f2.hand(config-if)#interface GigabitEthernet0/2
c35s9p.f2.hand(config-if)# switchport trunk encapsulation dot1q
c35s9p.f2.hand(config-if
 << )# switchport trunk native vlan 92
c35s9p.f2.hand(config-if)# switchport trunk pruning vlan none
c35s9p.f2.hand(config-if)# switchport mode trunk
c35s9p.f2.hand(config-if)# ip dhcp snooping trust
c35s9p.f2.hand(config-if)#interface Vlan1
c35s9p.f2.ha
 << nd(config-if)# no ip address
c35s9p.f2.hand(config-if)# no ip route-cache
c35s9p.f2.hand(config-if)#interface Vlan92
c35s9p.f2.hand(config-if)# ip address 10.92.1.248 255.255.0.0
c35s9p.f2.hand(config-if)# ip broadcast-address 10.92.255.255
c35s9p.f2
 << .hand(config-if)#ip default-gateway 10.92.0.1
c35s9p.f2.hand(config)#ip classless
c35s9p.f2.hand(config)#no ip http server
c35s9p.f2.hand(config)#logging facility local1
c35s9p.f2.hand(config)#logging 130.18.8.12
c35s9p.f2.hand(config)#access-list 1 
 << permit 130.18.92.0 0.0.3.255
c35s9p.f2.hand(config)#access-list 1 permit 10.92.0.0 0.0.255.255
c35s9p.f2.hand(config)#snmp-server community sysnet RO 1
c35s9p.f2.hand(config)#snmp-server community c2-b2=a2 RW 1
c35s9p.f2.hand(config)#snmp-server commu
 << nity spongebob RO
c35s9p.f2.hand(config)#
*Feb 28 18:03:13: %LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan92, changed state to downsnmp-server contact 6f-1028
c35s9p.f2.hand(config)#snmp-server enable traps snmp authentication linkdown 
 << $ enable traps snmp authentication linkdown l         inkup colaps snmp authentication linkdown linkup cold         start war
 << uthentication linkdown linkup coldstart warm         start
c35s9p.f2.hand(config)#snmp-server enable traps tty
c35s9p.f2.hand(config)#snmp-server enable traps cluster
c35s9p.f2.hand(config)#snmp-server ena
 << ble traps entity
c35s9p.f2.hand(config)#
*Feb 28 18:03:14: %SYS-6-LOGGINGHOST_STARTSTOP: Logging to host 130.18.8.12 Port 514 started - CLI initiatedsnmp-server enable traps cpu threshold
c35s9p.f2.hand(config)#snmp-server enable traps power-ethernet g
 << roup 1
c35s9p.f2.hand(config)#snmp-server enable traps vtp
c35s9p.f2.hand(config)#snmp-server enable traps vlancreate
c35s9p.f2.hand(config)#snmp-server enable traps vlandelete
c35s9p.f2.hand(config)#snmp-server enable traps flash insertion removal
c
 << 35s9p.f2.hand(config)#snmp-server enable traps port-security
c35s9p.f2.hand(config)#snmp-server enable traps envmon fan shutdown supply te$ enable traps envmon fan shutdown supply tem         
 << perature aps envmon fan shutdown supply temperature s         tatus
c35s9p.f2.hand(config)#snmp-server enable traps config-copy
c35s9p.f2.hand(config)#snmp-server enable traps config
c35s9p
 << .f2.hand(config)#snmp-server enable traps rtr
                                                 ^
% Invalid input detected at '^' marker.

c35s9p.f2.hand(config)#snmp-server enable traps bridge newroot topologychange
c35s9p.f2.hand(config)#snmp-server
 <<  enable traps stpx inconsistency root-incon$ enable traps stpx inconsistency root-incons         istency laps stpx inconsistency root-incon
 << sistency lo         op-inconsnconsistency root-inconsistency loop-inconsi         stency
c35s9p.f2.hand(config)#snmp-server enable traps syslog
c35s9p.f2.hand(config)#snmp-server ena
 << ble traps vlan-membership
c35s9p.f2.hand(config)#snmp-server host 130.18.8.12 sysnet 
c35s9p.f2.hand(config)#control-plane
c35s9p.f2.hand(config-cp)#line con 0
c35s9p.f2.hand(config-line)#line vty 0 4
c35s9p.f2.hand(config-line)# password 7 002501030
 << 506074C18
c35s9p.f2.hand(config-line)# login
c35s9p.f2.hand(config-line)#line vty 5 15
c35s9p.f2.hand(config-line)# password 7 072E33494F54154F00
c35s9p.f2.hand(config-line)# login
c35s9p.f2.hand(config-line)#ntp clock-period 36029235
c35s9p.f2.hand
 << (config)#ntp server 10.92.0.5
c35s9p.f2.hand(config)#end
c35s9p.f2.hand#end
Translating "end"...domain server (130.18.80.12)
*Feb 28 18:03:22: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> write mem

Expect: searching for 2 strs:  :# :>
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

...

