trying to use serial port: /dev/ttyUSB0
 >> 
 >> 

Expect: searching for 4 strs:  :[yes/no] :Press RETURN to get started. :# :Switch>
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 


Press RETURN to get started!


Expect: did not match any strings!
...



Press RETURN to get started!


...

 >> 

Expect: searching for 2 strs:  :# :>
 << 
 << 
*Mar  1 00:00:12.257: Read env variable - LICENSE_BOOT_LEVEL = 
*Mar  1 00:00:12.918: %IOS_LICENSE_IMAGE_APPLICATION-6-LICENSE_LEVEL: Module name = c2960s_lanbase Next reboot level = lanbase and License = lanbase
*Mar  1 00:02:03.433: %STACKMGR-4-SWIT
 << CH_ADDED: Switch 1 has been ADDED to the stack
*Mar  1 00:02:04.775: %LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan1, changed state to down
*Mar  1 00:02:05.792: %SPANTREE-5-EXTENDED_SYSID: Extended SysId enabled for type vlan
*Feb 28 18:02:51: %
 << S
c29s2.pressbox.softball>
c29s2.pressbox.softball>
c29s2.pressbox.softball>
c29s2.pressbox.softball>
c29s2.pressbox.softball>
c29s2.pressbox.softball>YS-6-CLOCKUPDATE: System clock has been updated from 00:02:51 UTC Mon Mar 1 1993 to 18:02:51 CST S
Expect: matched string 2: >
 >> term len 0

Expect: searching for 2 strs:  :# :>
 << un Feb 28 1993, configured from console by console.
*Feb 28 18:02:51: %SYS-6-CLOCKUPDATE: System clock has been updated from 18:02:51 CST Sun Feb 28 1993 to 18:02:51 CST Sun Feb 28 1993, configured from console by console.
*Feb 28 18:02:54: %LINK-5-CHAN
 << GED: Interface FastEthernet0, changed state to administratively down
*Feb 28 18:02:55: %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0, changed state to down
*Feb 28 18:02:55: %LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan92, changed
 <<  state to down
*Feb 28 18:02:55: %SYS-5-CONFIG_I: Configured from memory by console
*Feb 28 18:02:55: %STACKMGR-5-SWITCH_READY: Switch 1 is READY
*Feb 28 18:02:55: %STACKMGR-4-STACK_LINK_CHANGE: Stack Port 1 Switch 1 has changed to state DOWN
*Feb 28 
 << 18:02:55: %STACKMGR-4-STACK_LINK_CHANGE: Stack Port 2 Switch 1 has changed to state DOWN
*Feb 28 18:02:56: %SYS-5-RESTART: System restarted --
Cisco IOS Software, C2960S Software (C2960S-UNIVERSALK9-M), Version 12.2(55)SE8, RELEASE SOFTWARE (fc2)
Techn
 << ical Support: http://www.cisco.com/techsupport
Copyright (c) 1986-2013 by Cisco Systems, Inc.
Compiled Wed 26-Jun-13 11:40 by prod_rel_team
*Feb 28 18:02:56: %SNMP-5-COLDSTART: SNMP agent on host c29s2.pressbox.softball is undergoing a cold start
*Feb
 <<  28 18:02:56: %STACKMGR-5-MASTER_READY: Master Switch 1 is READY
*Feb 28 18:02:56: %SSH-5-ENABLED: SSH 1.99 has been enabled
*Feb 28 18:02:56: %SYS-6-LOGGINGHterm len 0
c29s2.pressbox.softball>OST_STARTSTOP: Logging to host 130.18.8.12 Port 514 started
Expect: matched string 2: >
 >> show version

Expect: searching for 2 strs:  :# :>
 <<  - CLI initiated
*Feb 28 18:02:57: %LINK-5-CHANGED: Interface Vlan1, changed state to administratively down
*Feb 28 18:03:00: %USB_CONSOLE-6-MEDIA_RJ45: Console media-type is RJ45.show version
Cisco IOS Software, C2960S Software (C2960S-UNIVERSALK9-M),
 <<  Version 12.2(55)SE8, RELEASE SOFTWARE (fc2)
Technical Support: http://www.cisco.com/techsupport
Copyright (c) 1986-2013 by Cisco Systems, Inc.
Compiled Wed 26-Jun-13 11:40 by prod_rel_team
Image text-base: 0x00003000, data-base: 0x01B00000

ROM: Bo
 << otstrap program is Alpha board boot loader
BOOTLDR: C2960S Boot Loader (C2960S-HBOOT-M) Version 12.2(55r)SE1, RELEASE SOFTWARE (fc1)

c29s2.pressbox.softball uptime is 3 minutes
System returned to ROM by power-on
System image file is "flash:/c2960s-u
 << niversalk9-mz.122-55.SE8/c2960s-universalk9-mz.122-55.SE8.bin"


This product contains cryptographic features and is subject to United
States and local country laws governing import, export, transfer and
use. Delivery of Cisco cryptographic products 
 << does not imply
third-party authority to import, export, distribute or use encryption.
Importers, exporters, distributors and users are responsible for
compliance with U.S. and local country laws. By using this product you
agree to comply with applicab
 << le laws and regulations. If you are unable
to comply with U.S. and local laws, return this product immediately.

A summary of U.S. laws governing Cisco cryptographic products may be found at:
http://www.cisco.com/wwl/export/crypto/tool/stqrg.html

I
 << f you require further assistance please contact us by sending email to
export@cisco.com.

cisco WS-C2960S-48TS-L (PowerPC) processor (revision Q0) with 131072K bytes of memory.
Processor board ID FOC1843W7EN
Last reset from power-on
2 Virtual Ethern
 << et interfaces
1 FastEthernet interface
52 Gigabit Ethernet interfaces
The password-recovery mechanism is enabled.

512K bytes of flash-simulated non-volatile configuration memory.
Base ethernet MAC Address       : 5C:FC:66:FD:63:80
Motherboard asse
 << mbly number     : 73-11909-10
Power supply part number        : 341-0327-06
Motherboard serial number       : FOC18434SBW
Power supply serial number      : LIT18410XKQ
Model revision number           : Q0
Motherboard revision number     : A0
Model n
 << umber                    : WS-C2960S-48TS-L
Daughterboard assembly number   : 73-11933-04
Daughterboard serial number     : FOC1842893W
System serial number            : FOC1843W7EN
Top Assembly Part Number        : 800-30950-07
Top Assembly Revision
 <<  Number    : C0
Version ID                      : V07
CLEI Code Number                : CMML510ARA
Daughterboard revision number   : A0
Hardware Board Revision Number  : 0x01


Switch Ports Model              SW Version            SW Image         
 <<         
------ ----- -----              ----------            ----------               
*    1 52    WS-C2960S-48TS-L   12.2(55)SE8           C2960S-UNIVERSALK9-M     


Configuration register is 0xF

c29s2.pressbox.softball>
Expect: matched string 2: >
 >> enable

Expect: searching for 2 strs:  :Password: :#
 << 
*Feb 28 18:03:16: %PKI-6-AUTOSAVE: Running configuration saved to NVRAMenable
Password: 
Expect: matched string 1: Password:
 >> Area=l*w

Expect: searching for 1 strs:  :#
 << 
c29s2.pressbox.softball#
Expect: matched string 1: #
 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s2.pressbox.softb(config)#
Expect: matched string 1: (config)#
 >> hostname c29s2.r110.softball 

Expect: searching for 2 strs:  :# :>
 << hostname c29s2.r110.softball 
c29s2.r110.softball(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s2.r110.softball#
 << 
*Feb 28 18:03:38: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> write mem

Expect: searching for 2 strs:  :# :>
 << 
c29s2.r110.softball#write mem
Building configuration...

Expect: matched string 1: #
