trying to use serial port: /dev/ttyUSB0
 >> 
 >> 

Expect: searching for 4 strs:  :[yes/no] :Press RETURN to get started. :# :Switch>
 << 


         --- System Configuration Dialog ---

Enable secret warning
----------------------------------
In order to access the device manager, an enable secret is required
If you enter the initial configuration dialog, you will be prompted for t
 << he enable secret
If you choose not to enter the intial configuration dialog, or if you exit setup without setting the enable secret,
please set an enable secret using the following CLI in configuration mode-
enable secret 0 <cleartext password>
------
 << ----------------------------
Would you like to enter the initial configuration dialog? [yes/no]: 
% Please answer 'yes' or 'no'.
Would you like to enter the initial configuration dialog? [yes/no]: 
% Please answer 'yes' or 'no'.
Would you like to ent
Expect: matched string 1: [yes/no]
 >> 

 >> no

 >> term len 0

Expect: searching for 2 strs:  :# :>
 << er the initial configuration dialog? [yes/no]: 
% Please answer 'yes' or 'no'.
Would you like to enter the initial configuration dialog? [yes/no]: 
% Please answer 'yes' or 'no'.
Would you like to enter the initial configuration dialog? [yes/no]: 
% 
 << Please answer 'yes' or 'no'.
Would you like to enter the initial configuration dialog? [yes/no]: no
Switch>term len 0
Switch>
Apr  4 14:59:09.687: %LINK-5-CHANGED: Interface Vlan1, changed state to administratively down
Apr  4 14:59:09.687: %LINK-5-C
Expect: matched string 2: >
 >> show version

Expect: searching for 2 strs:  :# :>
 << HANGED: Interface FastEthernet0, changed state to administratively downshow version
Cisco IOS Software, C2960X Software (C2960X-UNIVERSALK9-M), Version 15.0(2a)EX5, RELEASE SOFTWARE (fc3)
Technical Support: http://www.cisco.com/techsupport
Copyright (c
 << ) 1986-2015 by Cisco Systems, Inc.
Compiled Mon 16-Feb-15 08:16 by prod_rel_team

ROM: Bootstrap program is C2960X boot loader
BOOTLDR: C2960X Boot Loader (C2960X-HBOOT-M) Version 15.2(2r)E2, RELEASE SOFTWARE (fc1)

Switch uptime is 33 minutes
Syst
 << em returned to ROM by power-on
System restarted at 14:26:08 UTC Mon Apr 4 2016
System image file is "flash:/c2960x-universalk9-mz.150-2a.EX5/c2960x-universalk9-mz.150-2a.EX5.bin"


This product contains cryptographic features and is subject to United
 << 
States and local country laws governing import, export, transfer and
use. Delivery of Cisco cryptographic products does not imply
third-party authority to import, export, distribute or use encryption.
Importers, exporters, distributors and users are 
 << responsible for
compliance with U.S. and local country laws. By using this product you
agree to comply with applicable laws and regulations. If you are unable
to comply with U.S. and local laws, return this product immediately.

A summary of U.S. law
 << s governing Cisco cryptographic products may be found at:
http://www.cisco.com/wwl/export/crypto/tool/stqrg.html

If you require further assistance please contact us by sending email to
export@cisco.com.

cisco WS-C2960X-48FPS-L (APM86XXX) processor
 <<  (revision J0) with 524288K bytes of memory.
Processor board ID FCW1943B12J
Last reset from power-on
1 Virtual Ethernet interface
1 FastEthernet interface
52 Gigabit Ethernet interfaces
The password-recovery mechanism is enabled.

512K bytes of fl
 << ash-simulated non-volatile configuration memory.
Base ethernet MAC Address       : 18:8B:45:97:4A:00
Motherboard assembly number     : 73-15969-02
Power supply part number        : 341-0527-01
Motherboard serial number       : FOC19427YS4
Power suppl
 << y serial number      : DCB193968JB
Model revision number           : J0
Motherboard revision number     : D0
Model number                    : WS-C2960X-48FPS-L
Daughterboard assembly number   : 73-14200-03
Daughterboard serial number     : FOC194323
 << 9L
System serial number            : FCW1943B12J
Top Assembly Part Number        : 800-41466-01
Top Assembly Revision Number    : F0
Version ID                      : V02
CLEI Code Number                : CMMLN00ARB
Daughterboard revision number   :
 <<  A0
Hardware Board Revision Number  : 0x12


Switch Ports Model              SW Version            SW Image                 
------ ----- -----              ----------            ----------               
*    1 52    WS-C2960X-48FPS-L  15.0(2a)EX5 
 <<           C2960X-UNIVERSALK9-M     


Configuration register is 0xF

Switch>
Expect: matched string 2: >
 >> enable

Expect: searching for 2 strs:  :Password: :#
 << enable
Switch#
Expect: matched string 2: #
 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
Expect: matched string 1: (config)#
 >> no service pad

 >> service timestamps debug datetime localtime

 >> service timestamps log datetime localtime

 >> service password-encryption

 >> boot-start-marker

 >> boot-end-marker

 >> enable secret Area=l*w

 >> enable password Area=l*w

 >> no aaa new-model

 >> clock timezone CST -6 0

 >> clock summer-time CDT recurring

 >> authentication mac-move permit

 >> ip domain-name mgmt.msstate.edu

 >> ip name-server 130.18.80.12

 >> vtp domain vtp01.mgmt.msstate.edu

 >> vtp mode client

 >> crypto pki trustpoint TP-self-signed-2494998912

 >>  enrollment selfsigned

 >>  subject-name cn=IOS-Self-Signed-Certificate-2494998912

 >>  revocation-check none

 >>  rsakeypair TP-self-signed-2494998912

 >> crypto pki certificate chain TP-self-signed-2494998912

 >>  certificate self-signed 01 nvram:IOS-Self-Sig#3232.cer

 >> spanning-tree portfast bpduguard default

 >> spanning-tree extend system-id

 >> vlan internal allocation policy ascending

 >> errdisable recovery cause all

 >> errdisable recovery interval 1800

 >> interface FastEthernet0

 >>  no ip address

 >>  shutdown

 >> interface Vlan1

 >>  no ip address

 >>  no ip route-cache

 >>  shutdown

 >> interface Vlan92

 >> ip http server

 >> ip http secure-server

 >> logging facility local1

 >> logging host 130.18.8.12

 >> access-list 1 permit 10.92.0.0 0.0.255.255

 >> snmp-server community sysnet RO 1

 >> snmp-server community c2-b2=a2 RW 1

 >> snmp-server enable traps snmp authentication linkdown linkup coldstart warmstart

 >> snmp-server enable traps transceiver all

 >> snmp-server enable traps tty

 >> snmp-server enable traps cluster

 >> snmp-server enable traps config-copy

 >> snmp-server enable traps config

 >> snmp-server enable traps config-ctid

 >> snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-auth-fail-vlan no-guest-vlan

 >> snmp-server enable traps entity

 >> snmp-server enable traps power-ethernet police

 >> snmp-server enable traps cpu threshold

 >> snmp-server enable traps rep

 >> snmp-server enable traps bridge newroot topologychange

 >> snmp-server enable traps stpx inconsistency root-inconsistency loop-inconsistency

 >> snmp-server enable traps syslog

 >> snmp-server enable traps vtp

 >> snmp-server enable traps vlancreate

 >> snmp-server enable traps vlandelete

 >> snmp-server enable traps flash insertion removal

 >> snmp-server enable traps port-security

 >> snmp-server enable traps envmon fan shutdown supply temperature status

 >> snmp-server enable traps errdisable

 >> snmp-server enable traps mac-notification change move threshold

 >> snmp-server enable traps vlan-membership

 >> snmp-server host 130.18.8.12 

 >> line con 0

 >> line vty 0 4

 >>  password Area=l*w

 >>  login

 >> line vty 5 15

 >>  password Area=l*w

 >>  login

 >> ntp server 10.92.0.5

 >> end

Expect: searching for 1 strs:  :Configured
 << no service pad
Switch(config)#service timestamps debug datetime localtime
Switch(config)#service timestamps log datetime localtime
Switch(config)#service password-encryption
Switch(config)#boot-start-marker
Switch(config)#boot-end-marker
Switch(conf
 << ig)#enable secret Area=l*w
Switch(config)#enable password Area=l*w
The enable password you have chosen is the same as your enable secret.
This is not recommended.  Re-enter the enable password.

Switch(config)#no aaa new-model
Switch(config)#clock t
 << imezone CST -6 0
Switch(config)#clock summer-time CDT recurring

Apr  4 09:00:39: %SYS-6-CLOCKUPDATE: System clock has been updated from 15:00:38 UTC Mon Apr 4 2016 to 09:00:39 CST Mon Apr 4 2016, configured from console by console.
Switch(config)#auth
 << entication mac-move permit
Switch(config)#ip domain-name mgmt.msstate.edu
Switch(config)#ip name-server 130.18.80.12
Switch(config)#vtp domain vtp01.mgmt.msstate.edu
Domain name already set to vtp01.mgmt.msstate.edu.
Switch(config)#vtp mode client
D
 << evice mode already VTP Client for VLANS.
Switch(config)#crypto pki trustpoint TP-self-signed-2494998912
Switch(ca-trustpoint)# enrollment selfsigned
Switch(ca-trustpoint)# subject-name cn=IOS-Self-Signed-Certificate-2494998912
Switch(ca-trustpoint)# r
 << evocation-check none
Switch(ca-trustpoint)# rsakeypair TP-self-signed-2494998912
Switch(ca-trustpoint)#crypto pki certificate chain TP-self-signed-2494998912
Switch(config-cert-chain)# certificate self-signed 01 nvram:IOS-Self-Sig#3232
 << $e self-signed 01 nvram:IOS-Self-Sig#3232.         cer
Switch(config-cert-chain)#spanning-tree portfast bpduguard default
Switch(config)#spanning-tree extend system-id
Switch(config)#vlan internal allocation p
 << olicy ascending
Switch(config)#errdis
Apr  4 10:00:41: %SYS-6-CLOCKUPDATE: System clock has been updated from 09:00:39 CST Mon Apr 4 2016 to 10:00:41 CDT Mon Apr 4 2016, configured from console by console.able recovery cause all
Switch(config)#errdisab
 << le recovery interval 1800
Switch(config)#interface FastEthernet0
Switch(config-if)# no ip address
Switch(config-if)# shutdown
Switch(config-if)#interface Vlan1
Switch(config-if)# no ip address
Switch(config-if)# no ip route-cache
Switch(config-if)#
 <<  shutdown
Switch(config-if)#interface Vlan92
Switch(config-if)#ip http server
Switch(config)#ip http secure-server
% Generating 1024 bit RSA keys, keys will be non-exportable...
Apr  4 10:00:43: %LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan92,
 <<  changed state to down
[OK] (elapsed time was 2 seconds)

Switch(config)#logging facility local1
Switch(config)#logging host 130.18.8.12
Switch(config)#access-list 1 permit 10.92.0.0 0.0.255.255
Switch(config)#snmp-server community sysnet RO 1
Swit
 << ch(config)#snmp-server community c2-b2=a2 RW 1
Switch(config)#snmp-server enable traps snmp authentication linkdown linkup c$ enable traps snmp authentication linkdown linkup co         
 << ldstart waps snmp authentication linkdown linkup coldstart wa         rmstart
Switch(config)#snmp-server enable traps transceiver all
Switch(config)#snmp-server enable traps tty
S
 << witch(config)#snmp-server enable traps cluster
Switch(config)#snmp-server enable traps config-copy
Switch(config)#snmp-server enable traps config
Switch(config)#snmp-server enable traps config-ctid
Switch(config)#
Apr  4 10:00:46: %SSH-5-ENABLED: SSH
 <<  1.99 has been enabledsnmp-server enable traps dot1x auth-fail-vlan guest-vlan no-au$ enable traps dot1x auth-fail-vlan guest-vlan no-aut         h-fail-vl
 << aps dot1x auth-fail-vlan guest-vlan no-auth-fail-vla         n no-guesuth-fail-vlan guest-vlan no-auth-fail-vlan no-guest         -vlan
Switch(c
 << onfig)#snmp-server enable traps entity
Switch(config)#snmp-server enable traps power-ethernet police
Switch(config)#snmp-server enable traps cpu threshold
Switch(config)#snmp-server enable traps rep
Switch(config)#
Apr  4 10:00:46: %PKI-4-NOAUTOSAVE:
 <<  Configuration was modified.  Issue "write memory" to save new certificatesnmp-server enable traps bridge newroot topologychange
Switch(config)#snmp-server enable traps stpx inconsistency root-inconsistency
 << $ enable traps stpx inconsistency root-inconsistency          loop-incoaps stpx inconsistency root-inconsistency loop-incon         sistency
Switch(config)#snmp-
 << server enable traps syslog
Switch(config)#snmp-server enable traps vtp
Switch(config)#snmp-server enable traps vlancreate
Switch(config)#
Apr  4 10:00:47: %SYS-6-LOGGINGHOST_STARTSTOP: Logging to host 130.18.8.12 port 514 started - CLI initiatedsnmp-s
 << erver enable traps vlandelete
Switch(config)#snmp-server enable traps flash insertion removal
Switch(config)#snmp-server enable traps port-security
Switch(config)#snmp-server enable traps envmon fan shutdown supply temperatur
 << $ enable traps envmon fan shutdown supply temperature          status
Switch(config)#snmp-server enable traps errdisable
Switch(config)#snmp-server enable traps mac-notification change move threshol
 << $ enable traps mac-notification change move threshold         
Switch(config)#snmp-server enable traps vlan-membership
Switch(config)#snmp-server host 130.18.8.12 
% Incomplete command.

Swi
 << tch(config)#line con 0
Switch(config-line)#line vty 0 4
Switch(config-line)# password Area=l*w
Switch(config-line)# login
Switch(config-line)#line vty 5 15
Switch(config-line)# password Area=l*w
Switch(config-line)# login
Switch(config-line)#ntp se
 << rver 10.92.0.5
Switch(config)#end
Switch#
 << 
Apr  4 10:00:52: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
Switch#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
Expect: matched string 1: (config)#
 >> spanning-tree mode mst

 >> spanning-tree etherchannel guard misconfig

 >> spanning-tree mst configuration

 >>  name msstate

 >>  revision 1

 >>  instance 1 vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 63, 70

 >>  instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 160

 >>  instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 230, 232, 242, 246

 >>  instance 1 vlan 256, 611-612, 654, 741, 996, 999

 >>  instance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037, 2039-2040

 >>  instance 2 vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096, 2104, 2110, 2126

 >>  instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 2189, 2194, 2202

 >>  instance 2 vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 2654, 2999

 >>  instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176, 196

 >>  instance 3 vlan 244, 248, 927

 >>  instance 4 vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072, 2108, 2113, 2128

 >>  instance 4 vlan 2144, 2176, 2196, 2244, 2248, 2927

 >>  instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 228

 >>  instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216, 2228

 >>  instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116, 124

 >>  instance 7 vlan 172, 186, 192, 204-208, 210, 240-241, 251-252, 630, 928

 >>  instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082, 2084

 >>  instance 8 vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208, 2210

 >>  instance 8 vlan 2240-2241, 2251-2252, 2630, 2928

 >>  instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102, 112

 >>  instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 500, 505, 510-511

 >>  instance 9 vlan 522, 551-570, 603, 629, 633, 742, 802, 926, 929

 >>  instance 10 vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 2057, 2062, 2068

 >>  instance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148, 2158

 >>  instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522, 2603, 2629, 2633

 >>  instance 10 vlan 2802, 2926, 2929

 >>  instance 11 vlan 8, 43, 52, 146, 156-157, 180, 200, 218

 >>  instance 12 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180, 2200, 2218

 >> 

 >> end

Expect: searching for 1 strs:  :Configured
 << spanning-tree mode mst
Switch(config)#spanning-tree etherchannel guard misconfig
Switch(config)#spanning-tree mst configuration
Switch(config-mst)# name msstate
Switch(config-mst)# revision 1
Switch(config-mst)# instance 1 vlan 2, 7, 11, 20, 22, 24, 
 << 31, 35, 37, 39-40, $ vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40, 5         0, 60, 63, 11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 
 << 63,          70
Switch(config-mst)# instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 1$ vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 14         0, 152, 1
 << 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 16         0
Switch(config-mst)# instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 23$ vlan 162-1
 << 63, 168, 189, 194, 202, 220, 222, 230         , 232, 24163, 168, 189, 194, 202, 220, 222, 230, 232, 242         , 246
Switch(config-mst)# instance 1 vlan 256, 611-612, 654, 741, 9
 << 96, 999
Switch(config-mst)# instance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031,$ vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031,          2035, 203
 << , 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037         , 2039-2011, 2020, 2022, 2024, 2031, 2035, 2037, 2039-204         0
Switch(config-mst)# instance 2 v
 << lan 2050, 2060, 2063, 2070, 2080, 2086, 2096,$ vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096,          2104, 211, 2060, 2063, 2070,
 <<  2080, 2086, 2096, 2104, 2110         , 2126
Switch(config-mst)# instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, $ vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 2         
 << 189, 2194, 2140, 2152, 2160, 2162-2163, 2168, 2189, 2194,          2202
Switch(config-mst)# instance 2 vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 
 << $ vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 2         654, 2999
Switch(config-mst)# instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128$ vlan 42, 51, 59, 64
 << , 66, 69, 72, 108, 113, 128,          144, 17651, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176,          196
Switch(config-mst)# instance 3 vlan 244, 248, 927
Switch(config-mst)# 
 << instance 4 vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072,$ vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072,          2108, 211, 2051,
 <<  2059, 2064, 2066, 2069, 2072, 2108, 2113         , 2128
Switch(config-mst)# instance 4 vlan 2144, 2176, 2196, 2244, 2248, 2927
Switch(config-mst)# instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 2
 << $ vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 22         8
Switch(config-mst)# instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-$ vlan 2016, 2048, 2058, 2088, 
 << 2121, 2131, 2133-2         134, 2216, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216,          2228
Switch(config-mst)# instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97,
 << $ vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97,          114, 116,3-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116,          1
 << 24
Switch(config-mst)# instance 7 vlan 172, 186, 192, 204-208, 210, 240-241, 251$ vlan 172, 186, 192, 204-208, 210, 240-241, 251-         252, 630,
 << 186, 192, 204-208, 210, 240-241, 251-252, 630,          928
Switch(config-mst)# instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, $ vlan 2009, 2033-2034, 2038, 2054
 << , 2056, 2071, 2         075, 2082, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082,          2084
Switch(config-mst)# instance 8 vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192,
 << $ vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192,          2204-2208, 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208,          221
 << 0
Switch(config-mst)# instance 8 vlan 2240-2241, 2251-2252, 2630, 2928
Switch(config-mst)# instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 9$ vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 
 << 98         -99, 102,12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102,          112
Switch(config-mst)# instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 50
 << $ vlan 130, 132, 147-148, 158, 212, 226, 236, 500         , 505, 51132, 147-148, 158, 212, 226, 236, 500, 505, 510         -511
Switch(config-mst
 << )# instance 9 vlan 522, 551-570, 603, 629, 633, 742, 802, 92$ vlan 522, 551-570, 603, 629, 633, 742, 802, 926         , 929
Switch(config-mst)# instance 10 vlan 2004-2005, 2012, 2018-2019
 << , 2032, 2044, $0 vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 2         057, 20624-2005, 2012, 2018-2019, 2032, 2044, 2057, 2062,  
 <<         2068
Switch(config-mst)# instance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132,$0 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132,          2147-2148
 << 6, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148,          2158
Switch(config-mst)# instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522,$0 vlan 221
 << 2, 2236, 2500, 2505, 2510-2511, 2522,          2603, 2622, 2236, 2500, 2505, 2510-2511, 2522, 2603, 2629         , 2633
Switch(config-mst)# instance 10 vlan 2802, 2926, 2929
Swit
 << ch(config-mst)# instance 11 vlan 8, 43, 52, 146, 156-157, 180, 200, 218
Switch(config-mst)# instance 12 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180,$2 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180
 << ,          2200, 2218, 2043, 2052, 2146, 2156-2157, 2180, 2200, 2218         
Switch(config-mst)#
Switch(config-mst)#end
Switch#
Apr  4 10:01:07: %SYS-5-CONFIG_I: Configured fr
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << om console by console
Switch#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
Expect: matched string 1: (config)#
 >> hostname c29s1p.r100.daviswade 

Expect: searching for 2 strs:  :# :>
 << hostname c29s1p.r100.daviswade 
c29s1p.r100.daviswad(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s1p.r100.daviswade#
 << 
Apr  4 10:01:12: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.r100.daviswade#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.r100.daviswad(config)#
Expect: matched string 1: (config)#
 >> snmp-server contact 6F-2087

Expect: searching for 1 strs:  :#
 << snmp-server contact 6F-2087
c29s1p.r100.daviswad(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s1p.r100.daviswade#
 << 
Apr  4 10:01:18: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.r100.daviswade#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.r100.daviswad(config)#
Expect: matched string 1: (config)#
 >> interface vlan 92

Expect: searching for 1 strs:  :(config-if)#
 << interface vlan 92
c29s1p.r100.daviswad(config-if)#
Expect: matched string 1: (config-if)#
 >> ip address 10.92.3.70 255.255.0.0

 >> ip broadcast-address 10.92.255.255

 >> end

Expect: searching for 1 strs:  :Configured
 << ip address 10.92.3.70 255.255.0.0
c29s1p.r100.daviswad(config-if)#ip broadcast-address 10.92.255.255
c29s1p.r100.daviswad(config-if)#end
c29s1p.r100.daviswade#
 << 
Apr  4 10:01:25: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.r100.daviswade#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.r100.daviswad(config)#
Expect: matched string 1: (config)#
 >> interface Vlan92

Expect: searching for 1 strs:  :(config-if)#
 << interface Vlan92
c29s1p.r100.daviswad(config-if)#
Expect: matched string 1: (config-if)#
 >> ip default-gateway 10.92.0.1

 >> end

Expect: searching for 1 strs:  :Configured
 << ip default-gateway 10.92.0.1
c29s1p.r100.daviswad(config)#end
c29s1p.r100.daviswade#
Apr  4 10:01:31: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.r100.daviswade#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.r100.daviswad(config)#
Expect: matched string 1: (config)#
 >> ip dhcp snooping

Expect: searching for 1 strs:  :#
 << ip dhcp snooping
c29s1p.r100.daviswad(config)#
Expect: matched string 1: #
 >> ip dhcp snooping vlan 236

Expect: searching for 1 strs:  :#
 << ip dhcp snooping vlan 236
c29s1p.r100.daviswad(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s1p.r100.daviswade#
Apr  4 10:01:38: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.r100.daviswade#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.r100.daviswad(config)#
Expect: matched string 1: (config)#
 >> default interface range gi1/0/1 - 48 

 >> interface range gi1/0/1 - 48 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi1/0/1 - 48 
c29s1p.r100.daviswad(config)#interface range gi1/0/1 - 48 
c29s1p.r100.daviswad(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport access vlan 236

 >> switchport mode access

 >> spanning-tree portfast

 >> switchport port-security maximum 2

 >> switchport port-security

 >> switchport port-security aging time 15

 >> switchport port-security violation protect

 >> switchport port-security aging type inactivity

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport access vlan 236
c29s1p.r100.daviswad(config-if-range)#switchport mode access
c29s1p.r100.daviswad(config-if-range)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, conce
 << ntrators, switches, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast will be configured in 48 interfaces due to the range command 
 but will only have effect when the inter
 << faces are in a non-trunking mode.
c29s1p.r100.daviswad(config-if-range)#switchport port-security maximum 2
c29s1p.r100.daviswad(config-if-range)#switchport port-security
c29s1p.r100.daviswad(config-if-range)#switchport port-security aging time 15
c29s
 << 1p.r100.daviswad(config-if-range)#switchport port-security violation prot$port-security violation prote         ct
c29s1p.r100.daviswad(config-if-range)#switchport port-security aging type ina
 << $port-security aging type inac         tivity
c29s1p.r100.daviswad(config-if-range)#end
c29s1p.r100.daviswade#
Apr  4 10:01:46: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.r100.daviswade#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.r100.daviswad(config)#
Expect: matched string 1: (config)#
 >> default interface range gi1/0/49 - 52 

 >> interface range gi1/0/49 - 52 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi1/0/49 - 52 
c29s1p.r100.daviswad(config)#interface range gi1/0/49 - 52 
c29s1p.r100.daviswad(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport mode trunk

 >> switchport trunk native vlan 92

 >> ip dhcp snooping trust

 >> no keepalive

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport mode trunk
c29s1p.r100.daviswad(config-if-range)#switchport trunk native vlan 92
c29s1p.r100.daviswad(config-if-range)#ip dhcp snooping trust
c29s1p.r100.daviswad(config-if-range)#no keepalive
c29s1p.r100.daviswad(config-if-range)#end
c29s
 << 1p.r100.daviswade#
 << 
Apr  4 10:01:52: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> write mem

Expect: searching for 2 strs:  :# :>
 << 
c29s1p.r100.daviswade#write mem
Building configuration...

Expect: matched string 1: #
 >> 
Expect: searching for 2 strs:  :# :>
 << [OK]
c29s1p.r100.daviswade#
c29s1p.r100.daviswade#
c29s1p.r100.daviswade#
Expect: matched string 1: #
 >> sh run

Expect: searching for 2 strs:  :# :>
 << sh run
Building configuration...

Current configuration : 21975 bytes
!
! Last configuration change at 10:01:52 CDT Mon Apr 4 2016
! NVRAM config last updated at 10:01:54 CDT Mon Apr 4 2016
!
version 15.0
no service pad
service timestamps debug 
 << datetime localtime
service timestamps log datetime localtime
service password-encryption
!
hostname c29s1p.r100.daviswade
!
boot-start-marker
boot-end-marker
!
enable secret 5 $1$wh8B$aWv4frfRLru2.fiRCXXLB/
enable password 7 153319090577276E3F

 << !
no aaa new-model
clock timezone CST -6 0
clock summer-time CDT recurring
switch 1 provision ws-c2960x-48fps-l
authentication mac-move permit
!
!
ip dhcp snooping vlan 236
ip dhcp snooping
ip domain-name mgmt.msstate.edu
ip name-server 130.18.
 << 80.12
!
!
crypto pki trustpoint TP-self-signed-1167542784
 enrollment selfsigned
 subject-name cn=IOS-Self-Signed-Certificate-1167542784
 revocation-check none
 rsakeypair TP-self-signed-1167542784
!
!
crypto pki certificate chain TP-self-signed
 << -1167542784
 certificate self-signed 01
  3082022B 30820194 A0030201 02020101 300D0609 2A864886 F70D0101 05050030 
  31312F30 2D060355 04031326 494F532D 53656C66 2D536967 6E65642D 43657274 
  69666963 6174652D 31313637 35343237 3834301E 170D3136 30343
 << 034 31353030 
  34365A17 0D323030 31303130 30303030 305A3031 312F302D 06035504 03132649 
  4F532D53 656C662D 5369676E 65642D43 65727469 66696361 74652D31 31363735 
  34323738 3430819F 300D0609 2A864886 F70D0101 01050003 818D0030 81890281 
  8100AECC 1
 << 8331707 10AE4C5A BC9B0455 F504ED9B 44832F53 585A5BF5 7B8BC0FC 
  B65109C3 F1B9B96E 4D74A192 EB986A57 2BF614D8 F32BA7C3 9132B477 72BFB429 
  5E5F5AEB 4F4ED4B1 96685301 2269BF99 4D130AF4 1661AD2E 8A9662E5 9289726C 
  532BAB57 7DB6D565 BD04D94F B450C78C 3
 << 8AFEEC6 C831825D 016343C3 3E4D73A8 
  93E30203 010001A3 53305130 0F060355 1D130101 FF040530 030101FF 301F0603 
  551D2304 18301680 14673630 DF0A3809 AFAF2880 B795365E 413B2725 81301D06 
  03551D0E 04160414 673630DF 0A3809AF AF2880B7 95365E41 3B272581 3
 << 00D0609 
  2A864886 F70D0101 05050003 818100A5 6C58CA35 934ED4FE 329F89B1 34F91B48 
  438D1C5E E6A4B86F 7C6EF5BD 6A61EDEE 75D3ECD9 A524E823 B8BC7634 E9CBDDC9 
  58DA862D 73FFAB78 FF67E0BD 60036C89 ED667F26 74BBB538 2BAFBAED 6CBE9B51 
  9CFE8FCD 129D04
 << B5 7E7A5D25 7D26893F FF83268A 038475B1 C2D0CB66 446496A4 
  C55EBF71 6637439C 8A67D020 762038
  	quit
!
spanning-tree mode mst
spanning-tree portfast bpduguard default
spanning-tree extend system-id
!
spanning-tree mst configuration
 name msstate
 << 
 revision 1
 instance 1 vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 63, 70
 instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 160
 instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 230, 232, 242, 246
 instance 1 vlan 2
 << 56, 611-612, 654, 741, 996, 999
 instance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037, 2039-2040
 instance 2 vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096, 2104, 2110, 2126
 instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 2189,
 <<  2194, 2202
 instance 2 vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 2654, 2999
 instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176, 196
 instance 3 vlan 244, 248, 927
 instance 4 vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072, 2108, 
 << 2113, 2128
 instance 4 vlan 2144, 2176, 2196, 2244, 2248, 2927
 instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 228
 instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216, 2228
 instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 8
 << 4, 97, 114, 116, 124
 instance 7 vlan 172, 186, 192, 204-208, 210, 240-241, 251-252, 630, 928
 instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082, 2084
 instance 8 vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208, 2210
 instan
 << ce 8 vlan 2240-2241, 2251-2252, 2630, 2928
 instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102, 112
 instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 500, 505, 510-511
 instance 9 vlan 522, 551-570, 603, 629, 633, 742, 802, 926, 9
 << 29
 instance 10 vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 2057, 2062, 2068
 instance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148, 2158
 instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522, 2603, 2629, 2633
 instance 10 vlan 2802
 << , 2926, 2929
 instance 11 vlan 8, 43, 52, 146, 156-157, 180, 200, 218
 instance 12 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180, 2200, 2218
!
!
!
!
!
!
errdisable recovery cause udld
errdisable recovery cause bpduguard
errdisable recovery cause
 <<  security-violation
errdisable recovery cause channel-misconfig (STP)
errdisable recovery cause pagp-flap
errdisable recovery cause dtp-flap
errdisable recovery cause link-flap
errdisable recovery cause sfp-config-mismatch
errdisable recovery cause 
 << gbic-invalid
errdisable recovery cause psecure-violation
errdisable recovery cause port-mode-failure
errdisable recovery cause dhcp-rate-limit
errdisable recovery cause pppoe-ia-rate-limit
errdisable recovery cause mac-limit
errdisable recovery caus
 << e vmps
errdisable recovery cause storm-control
errdisable recovery cause inline-power
errdisable recovery cause arp-inspection
errdisable recovery cause loopback
errdisable recovery cause small-frame
errdisable recovery cause psp
errdisable recover
 << y interval 1800
!
vlan internal allocation policy ascending
!
!
!
!
!
!
interface FastEthernet0
 no ip address
 shutdown
!
interface GigabitEthernet1/0/1
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum
 <<  2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/2
 switchport access vlan 236

 <<  switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
int
 << erface GigabitEthernet1/0/3
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-secur
 << ity aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/4
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchpo
 << rt port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/5
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-se
 << curity
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/6
 switchport access vlan 236
 switchport mode access
 << 
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1
 << /0/7
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivi
 << ty
 spanning-tree portfast
!
interface GigabitEthernet1/0/8
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violat
 << ion protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/9
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport por
 << t-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/10
 switchport access vlan 236
 switchport mode access
 switchport port-sec
 << urity maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/11
 switchport acc
 << ess vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree po
 << rtfast
!
interface GigabitEthernet1/0/12
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switch
 << port port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/13
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging ti
 << me 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/14
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 s
 << witchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/15
 switchport access vlan 236
 swit
 << chport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interfac
 << e GigabitEthernet1/0/16
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security 
 << aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/17
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport 
 << port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/18
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-secu
 << rity
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/19
 switchport access vlan 236
 switchport mode access
 << 
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/
 << 0/20
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivi
 << ty
 spanning-tree portfast
!
interface GigabitEthernet1/0/21
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security viola
 << tion protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/22
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport p
 << ort-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/23
 switchport access vlan 236
 switchport mode access
 switchport port-s
 << ecurity maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/24
 switchport a
 << ccess vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree 
 << portfast
!
interface GigabitEthernet1/0/25
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 swit
 << chport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/26
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging 
 << time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/27
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2

 <<  switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/28
 switchport access vlan 236
 sw
 << itchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interf
 << ace GigabitEthernet1/0/29
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-securit
 << y aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/30
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchpor
 << t port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/31
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-se
 << curity
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/32
 switchport access vlan 236
 switchport mode acces
 << s
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet
 << 1/0/33
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inacti
 << vity
 spanning-tree portfast
!
interface GigabitEthernet1/0/34
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security vio
 << lation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/35
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport
 <<  port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/36
 switchport access vlan 236
 switchport mode access
 switchport port
 << -security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/37
 switchport
 <<  access vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tre
 << e portfast
!
interface GigabitEthernet1/0/38
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 sw
 << itchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/39
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security agin
 << g time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/40
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 << 
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/41
 switchport access vlan 236
 
 << switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
inte
 << rface GigabitEthernet1/0/42
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-secur
 << ity aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/43
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchp
 << ort port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/44
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-
 << security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/45
 switchport access vlan 236
 switchport mode acc
 << ess
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthern
 << et1/0/46
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inac
 << tivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/47
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security v
 << iolation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/48
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchpo
 << rt port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet1/0/49
 switchport trunk native vlan 92
 switchport mode trunk
 ip dhcp s
 << nooping trust
!
interface GigabitEthernet1/0/50
 switchport trunk native vlan 92
 switchport mode trunk
 ip dhcp snooping trust
!
interface GigabitEthernet1/0/51
 switchport trunk native vlan 92
 switchport mode trunk
 ip dhcp snooping trust
!
 << 
interface GigabitEthernet1/0/52
 switchport trunk native vlan 92
 switchport mode trunk
 ip dhcp snooping trust
!
interface Vlan1
 no ip address
 no ip route-cache
 shutdown
!
interface Vlan92
 ip address 10.92.3.70 255.255.0.0
 ip broadcast-
 << address 10.92.255.255
!
ip default-gateway 10.92.0.1
ip http server
ip http secure-server
!
logging facility local1
logging host 130.18.8.12
access-list 1 permit 10.92.0.0 0.0.255.255
!
snmp-server community sysnet RO 1
snmp-server community c2
 << -b2=a2 RW 1
snmp-server contact 6F-2087
snmp-server enable traps snmp authentication linkdown linkup coldstart warmstart
snmp-server enable traps transceiver all
snmp-server enable traps tty
snmp-server enable traps cluster
snmp-server enable traps 
 << config-copy
snmp-server enable traps config
snmp-server enable traps config-ctid
snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-auth-fail-vlan no-guest-vlan
snmp-server enable traps entity
snmp-server enable traps power-ethernet police

 << snmp-server enable traps cpu threshold
snmp-server enable traps rep
snmp-server enable traps bridge newroot topologychange
snmp-server enable traps stpx inconsistency root-inconsistency loop-inconsistency
snmp-server enable traps syslog
snmp-server e
 << nable traps vtp
snmp-server enable traps vlancreate
snmp-server enable traps vlandelete
snmp-server enable traps flash insertion removal
snmp-server enable traps port-security
snmp-server enable traps envmon fan shutdown supply temperature status
sn
 << mp-server enable traps errdisable
snmp-server enable traps mac-notification change move threshold
snmp-server enable traps vlan-membership
!
!
line con 0
line vty 0 4
 password 7 002501030506074C18
 login
line vty 5 15
 password 7 0227165E0A5B03
 << 6B5B
 login
!
ntp server 10.92.0.5
end

c29s1p.r100.daviswade#
Expect: matched string 1: #
 >> show interface status

Expect: searching for 2 strs:  :# :>
 << show interface status

Port      Name               Status       Vlan       Duplex  Speed Type
Gi1/0/1                      notconnect   236          auto   auto 10/100/1000BaseTX
Gi1/0/2                      notconnect   236          auto   auto 10/1
 << 00/1000BaseTX
Gi1/0/3                      notconnect   236          auto   auto 10/100/1000BaseTX
Gi1/0/4                      notconnect   236          auto   auto 10/100/1000BaseTX
Gi1/0/5                      notconnect   236          auto   auto 1
 << 0/100/1000BaseTX
Gi1/0/6                      notconnect   236          auto   auto 10/100/1000BaseTX
Gi1/0/7                      notconnect   236          auto   auto 10/100/1000BaseTX
Gi1/0/8                      notconnect   236          auto   aut
 << o 10/100/1000BaseTX
Gi1/0/9                      notconnect   236          auto   auto 10/100/1000BaseTX
Gi1/0/10                     notconnect   236          auto   auto 10/100/1000BaseTX
Gi1/0/11                     notconnect   236          auto   
 << auto 10/100/1000BaseTX
Gi1/0/12                     notconnect   236          auto   auto 10/100/1000BaseTX
Gi1/0/13                     notconnect   236          auto   auto 10/100/1000BaseTX
Gi1/0/14                     notconnect   236          auto
 <<    auto 10/100/1000BaseTX
Gi1/0/15                     notconnect   236          auto   auto 10/100/1000BaseTX
Gi1/0/16                     notconnect   236          auto   auto 10/100/1000BaseTX
Gi1/0/17                     notconnect   236          a
 << uto   auto 10/100/1000BaseTX
Gi1/0/18                     notconnect   236          auto   auto 10/100/1000BaseTX
Gi1/0/19                     notconnect   236          auto   auto 10/100/1000BaseTX
Gi1/0/20                     notconnect   236        
 <<   auto   auto 10/100/1000BaseTX
Gi1/0/21                     notconnect   236          auto   auto 10/100/1000BaseTX
Gi1/0/22                     notconnect   236          auto   auto 10/100/1000BaseTX
Gi1/0/23                     notconnect   236     
 <<      auto   auto 10/100/1000BaseTX
Gi1/0/24                     notconnect   236          auto   auto 10/100/1000BaseTX
Gi1/0/25                     notconnect   236          auto   auto 10/100/1000BaseTX
Gi1/0/26                     notconnect   236  
 <<         auto   auto 10/100/1000BaseTX
Gi1/0/27                     notconnect   236          auto   auto 10/100/1000BaseTX
Gi1/0/28                     notconnect   236          auto   auto 10/100/1000BaseTX
Gi1/0/29                     notconnect   23
 << 6          auto   auto 10/100/1000BaseTX
Gi1/0/30                     notconnect   236          auto   auto 10/100/1000BaseTX
Gi1/0/31                     notconnect   236          auto   auto 10/100/1000BaseTX
Gi1/0/32                     notconnect  
 <<  236          auto   auto 10/100/1000BaseTX
Gi1/0/33                     notconnect   236          auto   auto 10/100/1000BaseTX
Gi1/0/34                     notconnect   236          auto   auto 10/100/1000BaseTX
Gi1/0/35                     notconnec
 << t   236          auto   auto 10/100/1000BaseTX
Gi1/0/36                     notconnect   236          auto   auto 10/100/1000BaseTX
Gi1/0/37                     notconnect   236          auto   auto 10/100/1000BaseTX
Gi1/0/38                     notcon
 << nect   236          auto   auto 10/100/1000BaseTX
Gi1/0/39                     notconnect   236          auto   auto 10/100/1000BaseTX
Gi1/0/40                     notconnect   236          auto   auto 10/100/1000BaseTX
Gi1/0/41                     not
 << connect   236          auto   auto 10/100/1000BaseTX
Gi1/0/42                     notconnect   236          auto   auto 10/100/1000BaseTX
Gi1/0/43                     notconnect   236          auto   auto 10/100/1000BaseTX
Gi1/0/44                     
 << notconnect   236          auto   auto 10/100/1000BaseTX
Gi1/0/45                     notconnect   236          auto   auto 10/100/1000BaseTX
Gi1/0/46                     notconnect   236          auto   auto 10/100/1000BaseTX
Gi1/0/47                  
 <<    notconnect   236          auto   auto 10/100/1000BaseTX
Gi1/0/48                     notconnect   236          auto   auto 10/100/1000BaseTX
Gi1/0/49                     notconnect   1            auto   auto 1000BaseSX SFP
Gi1/0/50                  
 <<    notconnect   1            auto   auto Not Present
Gi1/0/51                     notconnect   1            auto   auto 1000BaseSX SFP
Gi1/0/52                     notconnect   1            auto   auto Not Present
Fa0                          disabled 
 <<     routed       auto   auto 10/100BaseTX
c29s1p.r100.daviswade#
Expect: matched string 1: #
