trying to use serial port: /dev/ttyUSB0
 >> 
 >> 

Expect: searching for 4 strs:  :[yes/no] :Press RETURN to get started. :# :Switch>
 << 
Switch>
Switch>
Switch>
Switch>
Expect: matched string 4: Switch>
 >> term len 0

Expect: searching for 2 strs:  :# :>
 << term len 0
Switch>
Expect: matched string 2: >
 >> show version

Expect: searching for 2 strs:  :# :>
 << show version
Cisco IOS Software, C2960 Software (C2960-LANBASEK9-M), Version 12.2(55)SE9, RELEASE SOFTWARE (fc1)
Technical Support: http://www.cisco.com/techsupport
Copyright (c) 1986-2014 by Cisco Systems, Inc.
Compiled Mon 03-Mar-14 22:53 by prod_re
 << l_team
Image text-base: 0x00003000, data-base: 0x01900000

ROM: Bootstrap program is C2960 boot loader
BOOTLDR: C2960 Boot Loader (C2960-HBOOT-M) Version 12.2(44)SE5, RELEASE SOFTWARE (fc1)

Switch uptime is 3 hours, 31 minutes
System returned to R
 << OM by power-on
System image file is "flash:c2960-lanbasek9-mz.122-55.SE9/c2960-lanbasek9-mz.122-55.SE9.bin"


This product contains cryptographic features and is subject to United
States and local country laws governing import, export, transfer and

 << use. Delivery of Cisco cryptographic products does not imply
third-party authority to import, export, distribute or use encryption.
Importers, exporters, distributors and users are responsible for
compliance with U.S. and local country laws. By using t
 << his product you
agree to comply with applicable laws and regulations. If you are unable
to comply with U.S. and local laws, return this product immediately.

A summary of U.S. laws governing Cisco cryptographic products may be found at:
http://www.ci
 << sco.com/wwl/export/crypto/tool/stqrg.html

If you require further assistance please contact us by sending email to
export@cisco.com.

cisco WS-C2960-48TC-L (PowerPC405) processor (revision D0) with 65536K bytes of memory.
Processor board ID FOC1143X
 << 5UZ
Last reset from power-on
1 Virtual Ethernet interface
48 FastEthernet interfaces
2 Gigabit Ethernet interfaces
The password-recovery mechanism is enabled.

64K bytes of flash-simulated non-volatile configuration memory.
Base ethernet MAC Addre
 << ss       : 00:1E:49:3F:A1:00
Motherboard assembly number     : 73-9835-14
Power supply part number        : 341-0097-02
Motherboard serial number       : FOC11433WRZ
Power supply serial number      : AZS1140048C
Model revision number           : D0

 << Motherboard revision number     : C0
Model number                    : WS-C2960-48TC-L
System serial number            : FOC1143X5UZ
Top Assembly Part Number        : 800-26672-08
Top Assembly Revision Number    : F0
Version ID                      :
 <<  V09
CLEI Code Number                : COMP200ARB
Hardware Board Revision Number  : 0x02


Switch Ports Model              SW Version            SW Image                 
------ ----- -----              ----------            ----------              
 <<  
*    1 50    WS-C2960-48TC-L    12.2(55)SE9           C2960-LANBASEK9-M        


Configuration register is 0xF

Switch>
Expect: matched string 2: >
 >> enable

Expect: searching for 2 strs:  :Password: :#
 << enable
Switch#
Expect: matched string 2: #
 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
Expect: matched string 1: (config)#
 >> no service pad

 >> service timestamps debug datetime localtime

 >> service timestamps log datetime localtime

 >> service password-encryption

 >> boot-start-marker

 >> boot-end-marker

 >> enable secret Area=l*w

 >> enable password Area=l*w

 >> no aaa new-model

 >> clock timezone CST -6

 >> clock summer-time CDT recurring

 >> authentication mac-move permit

 >> ip domain-name mgmt.msstate.edu

 >> ip name-server 130.18.80.12

 >> vtp domain vtp01.mgmt.msstate.edu

 >> vtp mode client

 >> crypto pki trustpoint TP-self-signed-2494998912

 >>  enrollment selfsigned

 >>  subject-name cn=IOS-Self-Signed-Certificate-2494998912

 >>  revocation-check none

 >>  rsakeypair TP-self-signed-2494998912

 >> crypto pki certificate chain TP-self-signed-2494998912

 >>  certificate self-signed 01 nvram:IOS-Self-Sig#3232.cer

 >> spanning-tree portfast bpduguard default

 >> spanning-tree extend system-id

 >> vlan internal allocation policy ascending

 >> errdisable recovery cause all

 >> errdisable recovery interval 1800

 >> interface FastEthernet0

 >>  no ip address

 >>  shutdown

 >> interface Vlan1

 >>  no ip address

 >>  no ip route-cache

 >>  shutdown

 >> interface Vlan92

 >> ip http server

 >> ip http secure-server

 >> ip sla enable reaction-alerts

 >> logging facility local1

 >> logging 130.18.8.12

 >> username root privilege 15 secret Area=l*w

 >> snmp-server community sysnet RO 1

 >> snmp-server community c2-b2=a2 RW 1

 >> snmp-server enable traps snmp authentication linkdown linkup coldstart warmstart

 >> snmp-server enable traps transceiver all

 >> snmp-server enable traps tty

 >> snmp-server enable traps cluster

 >> snmp-server enable traps config-copy

 >> snmp-server enable traps config

 >> snmp-server enable traps config-ctid

 >> snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-auth-fail-vlan no-guest-vlan

 >> snmp-server enable traps entity

 >> snmp-server enable traps power-ethernet group 1

 >> snmp-server enable traps power-ethernet police

 >> snmp-server enable traps cpu threshold

 >> snmp-server enable traps rep

 >> snmp-server enable traps rtr

 >> snmp-server enable traps bridge newroot topologychange

 >> snmp-server enable traps stpx inconsistency root-inconsistency loop-inconsistency

 >> snmp-server enable traps syslog

 >> snmp-server enable traps vtp

 >> snmp-server enable traps vlancreate

 >> snmp-server enable traps vlandelete

 >> snmp-server enable traps flash insertion removal

 >> snmp-server enable traps port-security

 >> snmp-server enable traps envmon fan shutdown supply temperature status

 >> snmp-server enable traps errdisable

 >> snmp-server enable traps mac-notification change move threshold

 >> snmp-server enable traps vlan-membership

 >> snmp-server host 130.18.8.12 

 >> line con 0

 >> line vty 0 4

 >>  password Area=l*w

 >>  login

 >> line vty 5 15

 >>  password Area=l*w

 >>  login

 >> ntp clock-period 22519226

 >> ntp server 10.92.0.5

 >> end

Expect: searching for 1 strs:  :Configured
 << no service pad
Switch(config)#service timestamps debug datetime localtime
Switch(config)#service timestamps log datetime localtime
Switch(config)#service password-encryption
Switch(config)#boot-start-marker
Switch(config)#boot-end-marker
Switch(conf
 << ig)#enable secret Area=l*w
Switch(config)#enable password Area=l*w
The enable password you have chosen is the same as your enable secret.
This is not recommended.  Re-enter the enable password.

Switch(config)#no aaa new-model
Switch(config)#clock t
 << imezone CST -6
Switch(config)#clock summer-time CDT recurring
Switch(config)#authentication mac-move permit
Switch(config)#ip domain-name mgmt.msstate.edu
Switch(config)#ip name-server 130.18.80.12
Switch(config)#vtp domain vtp01.mgmt.msstate.edu
Ch
 << anging VTP domain name from NULL to vtp01.mgmt.msstate.edu
Switch(config)#vtp mode client
Setting device to VTP Client mode for VLANS.
Switch(config)#crypto pki trustpoint TP-self-signed-2494998912
Switch(ca-trustpoint)# enrollment selfsigned
Switch(
 << ca-trustpoint)# 
*Feb 28 21:33:30: %SYS-6-CLOCKUPDATE: System clock has been updated from 03:33:30 UTC Mon Mar 1 1993 to 21:33:30 CST Sun Feb 28 1993, configured from console by console.
*Feb 28 21:33:30: %SYS-6-CLOCKUPDATE: System clock has been update
 << d from 21:33:30 CST Sun Feb 28 1993 to 21:33:30 CST Sun Feb 28 1993, configured from console by console.subject-name cn=IOS-Self-Signed-Certificate-2494998912
Switch(ca-trustpoint)# revocation-check none
Switch(ca-trustpoint)# rsakeypair TP-self-signed-
 << 2494998912
Switch(ca-trustpoint)#crypto pki certificate chain TP-self-signed-2494998912
Switch(config-cert-chain)# certificate self-signed 01 nvram:IOS-Self-Sig#3232$e self-signed 01 nvram:IOS-Self-Sig#
 << 3232.         cer
Switch(config-cert-chain)#
*Feb 28 21:33:31: %SW_VLAN-6-VTP_DOMAIN_NAME_CHG: VTP domain name changed to vtp01.mgmt.msstate.edu.spanning-tree portfast bpduguard default
Switch(config)#spanning-tree extend system-id
Switch(con
 << fig)#vlan internal allocation policy ascending
Switch(config)#errdisable recovery cause all
Switch(config)#errdisable recovery interval 1800
Switch(config)#interface FastEthernet0
% Incomplete command.

Switch(config)# no ip address
% Incomplete co
 << mmand.

Switch(config)# shutdown
% Incomplete command.

Switch(config)#interface Vlan1
Switch(config-if)# no ip address
Switch(config-if)# no ip route-cache
Switch(config-if)# shutdown
Switch(config-if)#interface Vlan92
Switch(config-if)#ip http
 <<  server
Switch(config)#ip http secure-server
% Generating 1024 bit RSA keys, keys will be non-exportable...
*Feb 28 21:33:36: %LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan92, changed state to down
*Feb 28 21:33:37: %LINK-5-CHANGED: Interface Vl
 << an1, changed state to administratively down[OK]

*Feb 28 21:33:40: %SSH-5-ENABLED: SSH 1.99 has been enabled
Switch(config)#ip sla enable reaction-alerts
Switch(config)#logging facility local1
Switch(config)#logging 130.18.8.12
Switch(config)#userna
 << me root privilege 15 secret Area=l*w
Switch(config)#snmp-server community sysnet RO 1
Switch(config)#snmp-server community c2-b2=a2 RW 1
Switch(config)#snmp-server enable traps snmp authentication linkdown linkup c
 << $ enable traps snmp authentication linkdown linkup co         ldstart waps snmp authentication linkdown linkup coldstart wa         rmstart
Switch(conf
 << ig)#snmp-server enable traps transceiver all
Switch(config)#snmp-server enable traps tty
Switch(config)#snmp-server enable traps cluster
Switch(config)#snmp-server enable traps config-copy
Switch(config)#snmp-server enable traps config
Switch(config)
 << #snmp-server enable traps config-ctid
Switch(config)#snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-au$ enable traps dot1x auth-fail-vlan guest-vlan no-aut         h-fail
 << -vlaps dot1x auth-fail-vlan guest-vlan no-auth-fail-vla         n no-guesuth-fail-vlan guest-vlan no-auth-fail-vlan no-guest 
 <<         -vlan
Switch(config)#snmp-server enable traps entity
Switch(config)#snmp-server enable traps power-ethernet group 1
Switch(config)#snmp-server enable traps power-ethernet police
Switch(config)#snmp-server enable traps cpu threshold
S
 << witch(config)#snmp-server enable traps rep
Switch(config)#snmp-server enable traps rtr
Swi
*Feb 28 21:33:42: %PKI-4-NOAUTOSAVE: Configuration was modified.  Issue "write memory" to save new certificatetch(config)#snmp-server enable traps bridge newroot
 <<  topologychange
Switch(config)#snmp-server enable traps stpx inconsistency root-inconsistency$ enable traps stpx inconsistency root-inconsistency          loop-inco
 << aps stpx inconsistency root-inconsistency loop-incon         sistency
Switch(config)#snmp-server enable traps syslog
Switch(config)#snmp-server enable traps vtp
Switch(config)#snmp-server enable traps 
 << vl
*Feb 28 21:33:43: %SYS-6-LOGGINGHOST_STARTSTOP: Logging to host 130.18.8.12 Port 514 started - CLI initiatedancreate
Switch(config)#snmp-server enable traps vlandelete
Switch(config)#snmp-server enable traps flash insertion removal
Switch(config)#s
 << nmp-server enable traps port-security
Switch(config)#snmp-server enable traps envmon fan shutdown supply temperatur$ enable traps envmon fan shutdown supply temperature          statu
 << s
Switch(config)#snmp-server enable traps errdisable
Switch(config)#snmp-server enable traps mac-notification change move threshol$ enable traps mac-notification change move threshold        
 <<  
Switch(config)#snmp-server enable traps vlan-membership
Switch(config)#snmp-server host 130.18.8.12 
% Incomplete command.

Switch(config)#line con 0
Switch(config-line)#line vty 0 4
Switch(config-line)# password Area=l*w
Switch(config-
 << line)# login
Switch(config-line)#line vty 5 15
Switch(config-line)# password Area=l*w
Switch(config-line)# login
Switch(config-line)#ntp clock-period 22519226
%NTP: unreasonable value
Switch(config)#ntp server 10.92.0.5
Switch(config)#end
Switch#
 << 
*Feb 28 21:33:46: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
Switch#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
Expect: matched string 1: (config)#
 >> spanning-tree mode mst

 >> spanning-tree etherchannel guard misconfig

 >> spanning-tree mst configuration

 >>  name msstate

 >>  revision 1

 >>  instance 1 vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 63, 70

 >>  instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 160

 >>  instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 230, 232, 242, 246

 >>  instance 1 vlan 256, 611-612, 654, 741, 996, 999

 >>  instance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037, 2039-2040

 >>  instance 2 vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096, 2104, 2110, 2126

 >>  instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 2189, 2194, 2202

 >>  instance 2 vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 2654, 2999

 >>  instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176, 196

 >>  instance 3 vlan 244, 248, 927

 >>  instance 4 vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072, 2108, 2113, 2128

 >>  instance 4 vlan 2144, 2176, 2196, 2244, 2248, 2927

 >>  instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 228

 >>  instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216, 2228

 >>  instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116, 124

 >>  instance 7 vlan 172, 186, 192, 204-208, 210, 240-241, 251-252, 630, 928

 >>  instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082, 2084

 >>  instance 8 vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208, 2210

 >>  instance 8 vlan 2240-2241, 2251-2252, 2630, 2928

 >>  instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102, 112

 >>  instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 500, 505, 510-511

 >>  instance 9 vlan 522, 551-570, 603, 629, 633, 742, 802, 926, 929

 >>  instance 10 vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 2057, 2062, 2068

 >>  instance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148, 2158

 >>  instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522, 2603, 2629, 2633

 >>  instance 10 vlan 2802, 2926, 2929

 >>  instance 11 vlan 8, 43, 52, 146, 156-157, 180, 200, 218

 >>  instance 12 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180, 2200, 2218

 >> 

 >> end

Expect: searching for 1 strs:  :Configured
 << spanning-tree mode mst
Switch(config)#spanning-tree etherchannel guard misconfig
Switch(config)#spanning-tree mst configuration
Switch(config-mst)# name msstate
Switch(config-mst)# revision 1
Switch(config-mst)# instance 1 vlan 2, 7, 11, 20, 22, 24, 
 << 31, 35, 37, 39-40, $ vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40, 5         0, 60, 63, 11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 
 << 63,          70
Switch(config-mst)# instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 1$ vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 14         0, 152, 1
 << 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 16         0
Switch(config-mst)# instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 23$ vlan 162-1
 << 63, 168, 189, 194, 202, 220, 222, 230         , 232, 24163, 168, 189, 194, 202, 220, 222, 230, 232, 242         , 246
Switch(config-mst)# instance 1 vlan 256, 611-612, 654, 741, 9
 << 96, 999
Switch(config-mst)# instance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031,$ vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031,          2035, 203
 << , 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037         , 2039-2011, 2020, 2022, 2024, 2031, 2035, 2037, 2039-204         0
Switch(config-mst)# instance 2 v
 << lan 2050, 2060, 2063, 2070, 2080, 2086, 2096,$ vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096,          2104, 211, 2060, 2063, 2070,
 <<  2080, 2086, 2096, 2104, 2110         , 2126
Switch(config-mst)# instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, $ vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 2         
 << 189, 2194, 2140, 2152, 2160, 2162-2163, 2168, 2189, 2194,          2202
Switch(config-mst)# instance 2 vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 
 << $ vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 2         654, 2999
Switch(config-mst)# instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128$ vlan 42, 51, 59, 64
 << , 66, 69, 72, 108, 113, 128,          144, 17651, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176,          196
Switch(config-mst)# instance 3 vlan 244, 248, 927
Switch(config-mst)# 
 << instance 4 vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072,$ vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072,          2108, 211, 2051,
 <<  2059, 2064, 2066, 2069, 2072, 2108, 2113         , 2128
Switch(config-mst)# instance 4 vlan 2144, 2176, 2196, 2244, 2248, 2927
Switch(config-mst)# instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 2
 << $ vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 22         8
Switch(config-mst)# instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-$ vlan 2016, 2048, 2058, 2088, 
 << 2121, 2131, 2133-2         134, 2216, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216,          2228
Switch(config-mst)# instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97,
 << $ vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97,          114, 116,3-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116,          1
 << 24
Switch(config-mst)# instance 7 vlan 172, 186, 192, 204-208, 210, 240-241, 251$ vlan 172, 186, 192, 204-208, 210, 240-241, 251-         252, 630,
 << 186, 192, 204-208, 210, 240-241, 251-252, 630,          928
Switch(config-mst)# instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, $ vlan 2009, 2033-2034, 2038, 2054
 << , 2056, 2071, 2         075, 2082, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082,          2084
Switch(config-mst)# instance 8 vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192,
 << $ vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192,          2204-2208, 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208,          221
 << 0
Switch(config-mst)# instance 8 vlan 2240-2241, 2251-2252, 2630, 2928
Switch(config-mst)# instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 9$ vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 
 << 98         -99, 102,12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102,          112
Switch(config-mst)# instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 50
 << $ vlan 130, 132, 147-148, 158, 212, 226, 236, 500         , 505, 51132, 147-148, 158, 212, 226, 236, 500, 505, 510         -511
Switch(config-mst
 << )# instance 9 vlan 522, 551-570, 603, 629, 633, 742, 802, 92$ vlan 522, 551-570, 603, 629, 633, 742, 802, 926         , 929
Switch(config-mst)# instance 10 vlan 2004-2005, 2012, 2018-2019
 << , 2032, 2044, $0 vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 2         057, 20624-2005, 2012, 2018-2019, 2032, 2044, 2057, 2062,  
 <<         2068
Switch(config-mst)# instance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132,$0 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132,          2147-2148
 << 6, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148,          2158
Switch(config-mst)# instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522,$0 vlan 221
 << 2, 2236, 2500, 2505, 2510-2511, 2522,          2603, 2622, 2236, 2500, 2505, 2510-2511, 2522, 2603, 2629         , 2633
Switch(config-mst)# instance 10 vlan 2802, 2926, 2929
Swit
 << ch(config-mst)# instance 11 vlan 8, 43, 52, 146, 156-157, 180, 200, 218
Switch(config-mst)# instance 12 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180,$2 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180
 << ,          2200, 2218, 2043, 2052, 2146, 2156-2157, 2180, 2200, 2218         
Switch(config-mst)#
Switch(config-mst)#end
Switch#
 << 
*Feb 28 21:34:02: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
Switch#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
Expect: matched string 1: (config)#
 >> hostname c29s11.ra1422.cvm.wise 

Expect: searching for 2 strs:  :# :>
 << hostname c29s11.ra1422.cvm.wise 
c29s11.ra1422.cvm.wi(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s11.ra1422.cvm.wise#
 << 
*Feb 28 21:34:09: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s11.ra1422.cvm.wise#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s11.ra1422.cvm.wi(config)#
Expect: matched string 1: (config)#
 >> snmp-server contact  

Expect: searching for 1 strs:  :#
 << snmp-server contact  
% Incomplete command.

c29s11.ra1422.cvm.wi(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s11.ra1422.cvm.wise#
 << 
*Feb 28 21:34:15: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s11.ra1422.cvm.wise#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s11.ra1422.cvm.wi(config)#
Expect: matched string 1: (config)#
 >> interface vlan 92

Expect: searching for 1 strs:  :(config-if)#
 << interface vlan 92
c29s11.ra1422.cvm.wi(config-if)#
Expect: matched string 1: (config-if)#
 >> ip address 10.92.3.95 255.255.0.0

 >> ip broadcast-address 10.92.255.255

 >> end

Expect: searching for 1 strs:  :Configured
 << ip address 10.92.3.95 255.255.0.0
c29s11.ra1422.cvm.wi(config-if)#ip broadcast-address 10.92.255.255
c29s11.ra1422.cvm.wi(config-if)#end
c29s11.ra1422.cvm.wise#
 << 
*Feb 28 21:34:21: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s11.ra1422.cvm.wise#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s11.ra1422.cvm.wi(config)#
Expect: matched string 1: (config)#
 >> interface Vlan92

Expect: searching for 1 strs:  :(config-if)#
 << interface Vlan92
c29s11.ra1422.cvm.wi(config-if)#
Expect: matched string 1: (config-if)#
 >> ip default-gateway 10.92.0.1

 >> end

Expect: searching for 1 strs:  :Configured
 << ip default-gateway 10.92.0.1
c29s11.ra1422.cvm.wi(config)#end
c29s11.ra1422.cvm.wise#
*Feb 28 21:34:27: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s11.ra1422.cvm.wise#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s11.ra1422.cvm.wi(config)#
Expect: matched string 1: (config)#
 >> ip dhcp snooping

Expect: searching for 1 strs:  :#
 << ip dhcp snooping
c29s11.ra1422.cvm.wi(config)#
Expect: matched string 1: #
 >> ip dhcp snooping vlan 152

Expect: searching for 1 strs:  :#
 << ip dhcp snooping vlan 152
c29s11.ra1422.cvm.wi(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s11.ra1422.cvm.wise#
*Feb 28 21:34:34: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s11.ra1422.cvm.wise#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s11.ra1422.cvm.wi(config)#
Expect: matched string 1: (config)#
 >> default interface range fa0/1 - 48 

 >> interface range fa0/1 - 48 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range fa0/1 - 48 

 << 
 << 
 << 
 << c29s11.ra1422.cvm.wi(config)#interface range fa0/1 - 48 
c29s11.ra1422.cvm.wi(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport access vlan 152

 >> switchport mode access

 >> spanning-tree portfast

 >> switchport port-security maximum 2

 >> switchport port-security

 >> switchport port-security aging time 15

 >> switchport port-security violation protect

 >> switchport port-security aging type inactivity

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport access vlan 152
c29s11.ra1422.cvm.wi(config-if-range)#switchport mode access
c29s11.ra1422.cvm.wi(config-if-range)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, conce
 << ntrators, switches, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast will be configured in 48 interfaces due to the range command 
 but will only have effect when the inter
 << faces are in a non-trunking mode.
c29s11.ra1422.cvm.wi(config-if-range)#switchport port-security maximum 2
c29s11.ra1422.cvm.wi(config-if-range)#switchport port-security
c29s11.ra1422.cvm.wi(config-if-range)#switchport port-security aging time 15
c29s
 << 11.ra1422.cvm.wi(config-if-range)#switchport port-security violation prot$port-security violation prote         ct
c29s11.ra1422.cvm.wi(config-if-range)#switchport port-security aging type ina
 << $port-security aging type inac         tivity
c29s11.ra1422.cvm.wi(config-if-range)#end
c29s11.ra1422.cvm.wise#
 << 
*Feb 28 21:34:58: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s11.ra1422.cvm.wise#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s11.ra1422.cvm.wi(config)#
Expect: matched string 1: (config)#
 >> default interface fa0/48 

 >> interface fa0/48 

Expect: searching for 1 strs:  :(config-if)#
 << default interface fa0/48 
Interface FastEthernet0/48 set to default configuration
c29s11.ra1422.cvm.wi(config)#interface fa0/48 
c29s11.ra1422.cvm.wi(config-if)#
Expect: matched string 1: (config-if)#
 >> switchport mode trunk

 >> switchport trunk native vlan 92

 >> ip dhcp snooping trust

 >> no keepalive

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport mode trunk
c29s11.ra1422.cvm.wi(config-if)#switchport trunk native vlan 92
c29s11.ra1422.cvm.wi(config-if)#ip dhcp snooping trust
c29s11.ra1422.cvm.wi(config-if)#no keepalive
c29s11.ra1422.cvm.wi(config-if)#end
c29s11.ra1422.cvm.wise#
 << 
*Feb 28 21:35:10: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s11.ra1422.cvm.wise#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s11.ra1422.cvm.wi(config)#
Expect: matched string 1: (config)#
 >> default interface range gi0/1 - 2 

 >> interface range gi0/1 - 2 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi0/1 - 2 
c29s11.ra1422.cvm.wi(config)#interface range gi0/1 - 2 
c29s11.ra1422.cvm.wi(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport mode trunk

 >> switchport trunk native vlan 92

 >> ip dhcp snooping trust

 >> no keepalive

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport mode trunk
c29s11.ra1422.cvm.wi(config-if-range)#switchport trunk native vlan 92
c29s11.ra1422.cvm.wi(config-if-range)#ip dhcp snooping trust
c29s11.ra1422.cvm.wi(config-if-range)#no keepalive
c29s11.ra1422.cvm.wi(config-if-range)#end
c29s
 << 11.ra1422.cvm.wise#
 << 
*Feb 28 21:35:21: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> write mem

Expect: searching for 2 strs:  :# :>
 << 
c29s11.ra1422.cvm.wise#write mem
Building configuration...

Expect: matched string 1: #
 >> 
Expect: searching for 2 strs:  :# :>
 << [OK]
c29s11.ra1422.cvm.wise#
c29s11.ra1422.cvm.wise#
c29s11.ra1422.cvm.wise#
Expect: matched string 1: #
 >> sh run

Expect: searching for 2 strs:  :# :>
 << sh run
Building configuration...

 << 
Current configuration : 21279 bytes
!
version 12.2
no service pad
service timestamps debug datetime localtime
service timestamps log datetime localtime
service password-encryption
!
hostname c29s11.ra1422.cvm.wise
!
boot-start-marker
boot-end
 << -marker
!
enable secret 5 $1$w9U7$7qdGql4rsvh43RUwHsY6Q.
enable password 7 0227165E0A5B036B5B
!
username root privilege 15 secret 5 $1$6C/D$li73N7o.jAyFh5QCNDBGF/
!
!
no aaa new-model
clock timezone CST -6
clock summer-time CDT recurring
system
 <<  mtu routing 1500
authentication mac-move permit
!
!
ip dhcp snooping vlan 152
ip dhcp snooping
ip domain-name mgmt.msstate.edu
ip name-server 130.18.80.12
!
!
crypto pki trustpoint TP-self-signed-1228906752
 enrollment selfsigned
 subject-nam
 << e cn=IOS-Self-Signed-Certificate-1228906752
 revocation-check none
 rsakeypair TP-self-signed-1228906752
!
!
crypto pki certificate chain TP-self-signed-1228906752
 certificate self-signed 01
  3082024F 308201B8 A0030201 02020101 300D0609 2A864886 
 << F70D0101 04050030 
  31312F30 2D060355 04031326 494F532D 53656C66 2D536967 6E65642D 43657274 
  69666963 6174652D 31323238 39303637 3532301E 170D3933 30333031 30333333 
  34325A17 0D323030 31303130 30303030 305A3031 312F302D 06035504 03132649 
  4F532
 << D53 656C662D 5369676E 65642D43 65727469 66696361 74652D31 32323839 
  30363735 3230819F 300D0609 2A864886 F70D0101 01050003 818D0030 81890281 
  8100DED3 1055E26B 02D03C66 43B13094 045C766D 19456DDB DF0B0EB1 B2AE565A 
  C8E791EF 626A88EB 04A94634 BE3F7
 << 46D B6BA8385 16F235AB F100DDE8 2893BD82 
  5BF9E1F5 272F8227 20D45DC1 D6649764 2081D2DE 05816EFA FE184740 B1D50F10 
  1B9507F2 F95D86CF ECB5AA32 F74613A3 6D0D27BF 1631F6D3 E40FE508 A7C08433 
  4F4D0203 010001A3 77307530 0F060355 1D130101 FF040530 03010
 << 1FF 30220603 
  551D1104 1B301982 17537769 7463682E 6D676D74 2E6D7373 74617465 2E656475 
  301F0603 551D2304 18301680 145D4188 7D92E6BD 22DE6994 1310F187 FEA00987 
  CD301D06 03551D0E 04160414 5D41887D 92E6BD22 DE699413 10F187FE A00987CD 
  300D0609 2
 << A864886 F70D0101 04050003 81810038 A29C746A CC0AC2F4 C3A4374D 
  381AFD33 77D63A94 CDB49771 68E92A81 22B64217 AD3DE35C AFEAA97B AD68DF2E 
  4EBF7153 26C4B975 0878B427 A4E44E5B AE400D8E ABAC69BE FFD37F26 A7D58ADF 
  88E3E7C9 C9AD7D2E F1B2ED01 EAFDD3A4 3
 << C27141C B607349B 02077BEB 1F6242D5 
  A65D1C3A 2C62DE9C 72C4AEB5 1CF88FB9 6669EF
  quit
!
!
!
errdisable recovery cause udld
errdisable recovery cause bpduguard
errdisable recovery cause security-violation
errdisable recovery cause channel-miscon
 << fig (STP)
errdisable recovery cause pagp-flap
errdisable recovery cause dtp-flap
errdisable recovery cause link-flap
errdisable recovery cause sfp-config-mismatch
errdisable recovery cause gbic-invalid
errdisable recovery cause psecure-violation
er
 << rdisable recovery cause port-mode-failure
errdisable recovery cause dhcp-rate-limit
errdisable recovery cause pppoe-ia-rate-limit
errdisable recovery cause mac-limit
errdisable recovery cause vmps
errdisable recovery cause storm-control
errdisable r
 << ecovery cause inline-power
errdisable recovery cause arp-inspection
errdisable recovery cause loopback
errdisable recovery cause small-frame
errdisable recovery interval 1800
!
spanning-tree mode mst
spanning-tree portfast bpduguard default
spanni
 << ng-tree extend system-id
!
spanning-tree mst configuration
 name msstate
 revision 1
 instance 1 vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 63, 70
 instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 160
 instance 1 vlan 16
 << 2-163, 168, 189, 194, 202, 220, 222, 230, 232, 242, 246
 instance 1 vlan 256, 611-612, 654, 741, 996, 999
 instance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037, 2039-2040
 instance 2 vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096, 2104, 
 << 2110, 2126
 instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 2189, 2194, 2202
 instance 2 vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 2654, 2999
 instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176, 196
 instance 3 vlan 244, 
 << 248, 927
 instance 4 vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072, 2108, 2113, 2128
 instance 4 vlan 2144, 2176, 2196, 2244, 2248, 2927
 instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 228
 instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 
 << 2133-2134, 2216, 2228
 instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116, 124
 instance 7 vlan 172, 186, 192, 204-208, 210, 240-241, 251-252, 630, 928
 instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082, 2084
 instanc
 << e 8 vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208, 2210
 instance 8 vlan 2240-2241, 2251-2252, 2630, 2928
 instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102, 112
 instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 500, 5
 << 05, 510-511
 instance 9 vlan 522, 551-570, 603, 629, 633, 742, 802, 926, 929
 instance 10 vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 2057, 2062, 2068
 instance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148, 2158
 instance 10 vlan 2212, 
 << 2236, 2500, 2505, 2510-2511, 2522, 2603, 2629, 2633
 instance 10 vlan 2802, 2926, 2929
 instance 11 vlan 8, 43, 52, 146, 156-157, 180, 200, 218
 instance 12 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180, 2200, 2218
!
!
vlan internal allocation policy
 <<  ascending
!
!
!
interface FastEthernet0/1
 switchport access vlan 152
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 sw
 << itchport port-security aging type inactivity
 spanning-tree portfast
!
interface FastEthernet0/2
 switchport access vlan 152
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time
 <<  15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface FastEthernet0/3
 switchport access vlan 152
 switchport mode access
 switchport port-security maximum 2
 switchpor
 << t port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface FastEthernet0/4
 switchport access vlan 152
 switchport mode ac
 << cess
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface FastEthernet
 << 0/5
 switchport access vlan 152
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivit
 << y
 spanning-tree portfast
!
interface FastEthernet0/6
 switchport access vlan 152
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation pr
 << otect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface FastEthernet0/7
 switchport access vlan 152
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security 
 << aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface FastEthernet0/8
 switchport access vlan 152
 switchport mode access
 switchport port-security maximum 2

 <<  switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface FastEthernet0/9
 switchport access vlan 152
 switchpo
 << rt mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface Fa
 << stEthernet0/10
 switchport access vlan 152
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging typ
 << e inactivity
 spanning-tree portfast
!
interface FastEthernet0/11
 switchport access vlan 152
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security 
 << violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface FastEthernet0/12
 switchport access vlan 152
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport p
 << ort-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface FastEthernet0/13
 switchport access vlan 152
 switchport mode access
 switchport port-securi
 << ty maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface FastEthernet0/14
 switchport access vlan
 <<  152
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast

 << !
interface FastEthernet0/15
 switchport access vlan 152
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-sec
 << urity aging type inactivity
 spanning-tree portfast
!
interface FastEthernet0/16
 switchport access vlan 152
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport
 <<  port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface FastEthernet0/17
 switchport access vlan 152
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 << 
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface FastEthernet0/18
 switchport access vlan 152
 switchport mode access
 switchp
 << ort port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface FastEthernet0/19
 switchp
 << ort access vlan 152
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-
 << tree portfast
!
interface FastEthernet0/20
 switchport access vlan 152
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 swit
 << chport port-security aging type inactivity
 spanning-tree portfast
!
interface FastEthernet0/21
 switchport access vlan 152
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 
 << 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface FastEthernet0/22
 switchport access vlan 152
 switchport mode access
 switchport port-security maximum 2
 switchpor
 << t port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface FastEthernet0/23
 switchport access vlan 152
 switchport mode a
 << ccess
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface FastEtherne
 << t0/24
 switchport access vlan 152
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactiv
 << ity
 spanning-tree portfast
!
interface FastEthernet0/25
 switchport access vlan 152
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation
 <<  protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface FastEthernet0/26
 switchport access vlan 152
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-secur
 << ity aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface FastEthernet0/27
 switchport access vlan 152
 switchport mode access
 switchport port-security maximu
 << m 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface FastEthernet0/28
 switchport access vlan 152
 sw
 << itchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interf
 << ace FastEthernet0/29
 switchport access vlan 152
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security agi
 << ng type inactivity
 spanning-tree portfast
!
interface FastEthernet0/30
 switchport access vlan 152
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-sec
 << urity violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface FastEthernet0/31
 switchport access vlan 152
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switch
 << port port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface FastEthernet0/32
 switchport access vlan 152
 switchport mode access
 switchport port-
 << security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface FastEthernet0/33
 switchport acces
 << s vlan 152
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree port
 << fast
!
interface FastEthernet0/34
 switchport access vlan 152
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport po
 << rt-security aging type inactivity
 spanning-tree portfast
!
interface FastEthernet0/35
 switchport access vlan 152
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 swit
 << chport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface FastEthernet0/36
 switchport access vlan 152
 switchport mode access
 switchport port-security maximum 2
 switchport port-se
 << curity
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface FastEthernet0/37
 switchport access vlan 152
 switchport mode access
 s
 << witchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface FastEthernet0/38
 s
 << witchport access vlan 152
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spa
 << nning-tree portfast
!
interface FastEthernet0/39
 switchport access vlan 152
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 << 
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface FastEthernet0/40
 switchport access vlan 152
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging
 <<  time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface FastEthernet0/41
 switchport access vlan 152
 switchport mode access
 switchport port-security maximum 2
 swi
 << tchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface FastEthernet0/42
 switchport access vlan 152
 switchport 
 << mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface FastE
 << thernet0/43
 switchport access vlan 152
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type i
 << nactivity
 spanning-tree portfast
!
interface FastEthernet0/44
 switchport access vlan 152
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security vio
 << lation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface FastEthernet0/45
 switchport access vlan 152
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port
 << -security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface FastEthernet0/46
 switchport access vlan 152
 switchport mode access
 switchport port-security 
 << maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface FastEthernet0/47
 switchport access vlan 15
 << 2
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!

 << interface FastEthernet0/48
 switchport trunk native vlan 92
 switchport mode trunk
 no keepalive
 ip dhcp snooping trust
!
interface GigabitEthernet0/1
 switchport trunk native vlan 92
 switchport mode trunk
 ip dhcp snooping trust
!
interface 
 << GigabitEthernet0/2
 switchport trunk native vlan 92
 switchport mode trunk
 ip dhcp snooping trust
!
interface Vlan1
 no ip address
 no ip route-cache
 shutdown
!
interface Vlan92
 ip address 10.92.3.95 255.255.0.0
 ip broadcast-address 10.92.
 << 255.255
!
ip default-gateway 10.92.0.1
ip http server
ip http secure-server
ip sla enable reaction-alerts
logging facility local1
logging 130.18.8.12
snmp-server community sysnet RO 1
snmp-server community c2-b2=a2 RW 1
snmp-server enable traps 
 << snmp authentication linkdown linkup coldstart warmstart
snmp-server enable traps transceiver all
snmp-server enable traps tty
snmp-server enable traps cluster
snmp-server enable traps entity
snmp-server enable traps cpu threshold
snmp-server enable 
 << traps rep
snmp-server enable traps vtp
snmp-server enable traps vlancreate
snmp-server enable traps vlandelete
snmp-server enable traps flash insertion removal
snmp-server enable traps port-security
snmp-server enable traps dot1x auth-fail-vlan gues
 << t-vlan no-auth-fail-vlan no-guest-vlan
snmp-server enable traps envmon fan shutdown supply temperature status
snmp-server enable traps power-ethernet group 1
snmp-server enable traps power-ethernet police
snmp-server enable traps config-copy
snmp-ser
 << ver enable traps config
snmp-server enable traps config-ctid
snmp-server enable traps rtr
snmp-server enable traps bridge newroot topologychange
snmp-server enable traps stpx inconsistency root-inconsistency loop-inconsistency
snmp-server enable trap
 << s syslog
snmp-server enable traps mac-notification change move threshold
snmp-server enable traps vlan-membership
snmp-server enable traps errdisable
!
line con 0
line vty 0 4
 password 7 132405170A5108603C
 login
line vty 5 15
 password 7 15331
 << 9090577276E3F
 login
!
ntp server 10.92.0.5
end

c29s11.ra1422.cvm.wise#
Expect: matched string 1: #
 >> show interface status

Expect: searching for 2 strs:  :# :>
 << show interface status

Port      Name               Status       Vlan       Duplex  Speed Type
Fa0/1                        notconnect   152          auto   auto 10/100BaseTX
Fa0/2                        notconnect   152          auto   auto 10/100Bas
 << eTX
Fa0/3                        notconnect   152          auto   auto 10/100BaseTX
Fa0/4                        notconnect   152          auto   auto 10/100BaseTX
Fa0/5                        notconnect   152          auto   auto 10/100BaseTX
Fa0/6  
 <<                       notconnect   152          auto   auto 10/100BaseTX
Fa0/7                        notconnect   152          auto   auto 10/100BaseTX
Fa0/8                        notconnect   152          auto   auto 10/100BaseTX
Fa0/9              
 <<           notconnect   152          auto   auto 10/100BaseTX
Fa0/10                       notconnect   152          auto   auto 10/100BaseTX
Fa0/11                       notconnect   152          auto   auto 10/100BaseTX
Fa0/12                       no
 << tconnect   152          auto   auto 10/100BaseTX
Fa0/13                       notconnect   152          auto   auto 10/100BaseTX
Fa0/14                       notconnect   152          auto   auto 10/100BaseTX
Fa0/15                       notconnect   1
 << 52          auto   auto 10/100BaseTX
Fa0/16                       notconnect   152          auto   auto 10/100BaseTX
Fa0/17                       notconnect   152          auto   auto 10/100BaseTX
Fa0/18                       notconnect   152          
 << auto   auto 10/100BaseTX
Fa0/19                       notconnect   152          auto   auto 10/100BaseTX
Fa0/20                       notconnect   152          auto   auto 10/100BaseTX
Fa0/21                       notconnect   152          auto   auto 
 << 10/100BaseTX
Fa0/22                       notconnect   152          auto   auto 10/100BaseTX
Fa0/23                       notconnect   152          auto   auto 10/100BaseTX
Fa0/24                       notconnect   152          auto   auto 10/100BaseTX
 << 
Fa0/25                       notconnect   152          auto   auto 10/100BaseTX
Fa0/26                       notconnect   152          auto   auto 10/100BaseTX
Fa0/27                       notconnect   152          auto   auto 10/100BaseTX
Fa0/28    
 <<                    notconnect   152          auto   auto 10/100BaseTX
Fa0/29                       notconnect   152          auto   auto 10/100BaseTX
Fa0/30                       notconnect   152          auto   auto 10/100BaseTX
Fa0/31                
 <<        notconnect   152          auto   auto 10/100BaseTX
Fa0/32                       notconnect   152          auto   auto 10/100BaseTX
Fa0/33                       notconnect   152          auto   auto 10/100BaseTX
Fa0/34                       notco
 << nnect   152          auto   auto 10/100BaseTX
Fa0/35                       notconnect   152          auto   auto 10/100BaseTX
Fa0/36                       notconnect   152          auto   auto 10/100BaseTX
Fa0/37                       notconnect   152 
 <<          auto   auto 10/100BaseTX
Fa0/38                       notconnect   152          auto   auto 10/100BaseTX
Fa0/39                       notconnect   152          auto   auto 10/100BaseTX
Fa0/40                       notconnect   152          aut
 << o   auto 10/100BaseTX
Fa0/41                       notconnect   152          auto   auto 10/100BaseTX
Fa0/42                       notconnect   152          auto   auto 10/100BaseTX
Fa0/43                       notconnect   152          auto   auto 10/
 << 100BaseTX
Fa0/44                       notconnect   152          auto   auto 10/100BaseTX
Fa0/45                       notconnect   152          auto   auto 10/100BaseTX
Fa0/46                       notconnect   152          auto   auto 10/100BaseTX
F
 << a0/47                       notconnect   152          auto   auto 10/100BaseTX
Fa0/48                       notconnect   1            auto   auto 10/100BaseTX
Gi0/1                        notconnect   1            auto   auto Not Present
Gi0/2         
 <<                notconnect   1            auto   auto Not Present
c29s11.ra1422.cvm.wise#
Expect: matched string 1: #
