trying to use serial port: /dev/ttyUSB0
 >> 
 >> 

Expect: searching for 4 strs:  :[yes/no] :Press RETURN to get started. :# :Switch>
 << 
test>
test>
test>
test>
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

test>
test>
test>
test>
...

 >> 

Expect: searching for 2 strs:  :# :>
 << 
test>
test>
Expect: matched string 2: >
 >> term len 0

Expect: searching for 2 strs:  :# :>
 << term len 0
test>
Expect: matched string 2: >
 >> show version

Expect: searching for 2 strs:  :# :>
 << show version
Cisco IOS Software, C2960X Software (C2960X-UNIVERSALK9-M), Version 15.2(2)E3, RELEASE SOFTWARE (fc3)
Technical Support: http://www.cisco.com/techsupport
Copyright (c) 1986-2015 by Cisco Systems, Inc.
Compiled Wed 26-Aug-15 07:12 by prod_
 << rel_team

ROM: Bootstrap program is C2960X boot loader
BOOTLDR: C2960X Boot Loader (C2960X-HBOOT-M) Version 15.2(3r)E1, RELEASE SOFTWARE (fc1)

test uptime is 1 hour, 22 minutes
System returned to ROM by power-on
System restarted at 15:17:38 CDT Tu
 << e Jul 12 2016
System image file is "flash:/c2960x-universalk9-mz.152-2.E3/c2960x-universalk9-mz.152-2.E3.bin"
Last reload reason: Reload command



This product contains cryptographic features and is subject to United
States and local country laws 
 << governing import, export, transfer and
use. Delivery of Cisco cryptographic products does not imply
third-party authority to import, export, distribute or use encryption.
Importers, exporters, distributors and users are responsible for
compliance with
 <<  U.S. and local country laws. By using this product you
agree to comply with applicable laws and regulations. If you are unable
to comply with U.S. and local laws, return this product immediately.

A summary of U.S. laws governing Cisco cryptographic 
 << products may be found at:
http://www.cisco.com/wwl/export/crypto/tool/stqrg.html

If you require further assistance please contact us by sending email to
export@cisco.com.

cisco WS-C2960X-48FPD-L (APM86XXX) processor (revision M0) with 524288K byte
 << s of memory.
Processor board ID FCW2009A1QZ
Last reset from power-on
2 Virtual Ethernet interfaces
1 FastEthernet interface
50 Gigabit Ethernet interfaces
2 Ten Gigabit Ethernet interfaces
The password-recovery mechanism is enabled.

512K bytes o
 << f flash-simulated non-volatile configuration memory.
Base ethernet MAC Address       : 00:CA:E5:4D:1A:00
Motherboard assembly number     : 73-16686-04
Power supply part number        : 341-0527-01
Motherboard serial number       : FOC200872LF
Power s
 << upply serial number      : DCB2006600W
Model revision number           : M0
Motherboard revision number     : B0
Model number                    : WS-C2960X-48FPD-L
Daughterboard assembly number   : 73-14200-03
Daughterboard serial number     : FOC20
 << 09126K
System serial number            : FCW2009A1QZ
Top Assembly Part Number        : 68-100463-01
Top Assembly Revision Number    : B0
Version ID                      : V05
CLEI Code Number                : CMMLJ00ARD
Daughterboard revision number
 <<    : A0
Hardware Board Revision Number  : 0x18


Switch Ports Model                     SW Version            SW Image                 
------ ----- -----                     ----------            ----------               
*    1 52    WS-C2960X-48F
 << PD-L         15.2(2)E3             C2960X-UNIVERSALK9-M     


Configuration register is 0xF

test>
Expect: matched string 2: >
 >> enable

Expect: searching for 2 strs:  :Password: :#
 << enable
Password: 
Expect: matched string 1: Password:
 >> Area=l*w

Expect: searching for 1 strs:  :#
 << 
test#
Expect: matched string 1: #
 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
test(config)#
Expect: matched string 1: (config)#
 >> default interface gi1/0/2 

 >> end

Expect: searching for 1 strs:  :Configured
 << default interface gi1/0/2 
Interface GigabitEthernet1/0/2 set to default configuration
test(config)#end
test#
 << 
Jul 12 16:43:00: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
test#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
test(config)#
Expect: matched string 1: (config)#
 >> default interface gi1/0/2 

 >> interface gi1/0/2 

Expect: searching for 1 strs:  :(config-if)#
 << default interface gi1/0/2 
Interface GigabitEthernet1/0/2 set to default configuration
test(config)#interface gi1/0/2 
test(config-if)#
Expect: matched string 1: (config-if)#
 >> switchport trunk native vlan 2

 >> switchport trunk allowed vlan 200,2

 >> switchport mode trunk

 >> spanning-tree portfast

 >> switchport port-security maximum 5

 >> switchport port-security

 >> switchport port-security aging time 15

 >> switchport port-security violation protect

 >> switchport port-security aging type inactivity

 >> power inline consumption 15400

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport trunk native vlan 2
test(config-if)#switchport trunk allowed vlan 200,2
test(config-if)#switchport mode trunk
test(config-if)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting
 <<  hubs, concentrators, switches, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast has been configured on GigabitEthernet1/0/2 but will only
 have effect when the interface i
 << s in a non-trunking mode.
test(config-if)#switchport port-security maximum 5
test(config-if)#switchport port-security
test(config-if)#switchport port-security aging time 15
test(config-if)#switchport port-security violation protect
test(config-if)#sw
 << itchport port-security aging type inactivity
test(config-if)#power inline consumption 15400
%CAUTION: Interface Gi1/0/2: Misconfiguring the 'power inline
 consumption/allocation' command may cause damage to the switch and void
 your warranty. Take pre
 << caution not to oversubscribe the power supply.
 It is recommended to enable power policing if the switch supports it.
 Refer to documentation.

test(config-if)#end
test#
Jul 12 16:43:07: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
test#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
test(config)#
Expect: matched string 1: (config)#
 >> default interface gi1/0/3 

 >> end

Expect: searching for 1 strs:  :Configured
 << default interface gi1/0/3 
Interface GigabitEthernet1/0/3 set to default configuration
test(config)#end
test#
 << 
Jul 12 16:43:11: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
test#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
test(config)#
Expect: matched string 1: (config)#
 >> default interface gi1/0/3 

 >> interface gi1/0/3 

Expect: searching for 1 strs:  :(config-if)#
 << default interface gi1/0/3 
Interface GigabitEthernet1/0/3 set to default configuration
test(config)#interface gi1/0/3 
test(config-if)#
Expect: matched string 1: (config-if)#
 >> switchport access vlan 3

 >> switchport mode access

 >> spanning-tree portfast

 >> switchport port-security maximum 2

 >> switchport port-security

 >> switchport port-security aging time 15

 >> switchport port-security violation protect

 >> switchport port-security aging type inactivity

 >> power inline consumption 15400

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport access vlan 3
test(config-if)#switchport mode access
test(config-if)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, concentrators, switches, bridges, etc... to this
 
 << interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast has been configured on GigabitEthernet1/0/3 but will only
 have effect when the interface is in a non-trunking mode.
test(config-if)#switchport port
 << -security maximum 2
test(config-if)#switchport port-security
test(config-if)#switchport port-security aging time 15
test(config-if)#switchport port-security violation protect
test(config-if)#switchport port-security aging type inactivity
test(config-
 << if)#power inline consumption 15400
%CAUTION: Interface Gi1/0/3: Misconfiguring the 'power inline
 consumption/allocation' command may cause damage to the switch and void
 your warranty. Take precaution not to oversubscribe the power supply.
 It is rec
 << ommended to enable power policing if the switch supports it.
 Refer to documentation.

test(config-if)#end
test#
 << 
Jul 12 16:43:18: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
test#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
test(config)#
Expect: matched string 1: (config)#
 >> default interface gi1/0/4 

 >> end

Expect: searching for 1 strs:  :Configured
 << default interface gi1/0/4 
Interface GigabitEthernet1/0/4 set to default configuration
test(config)#end
test#
 << 
Jul 12 16:43:22: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
test#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
test(config)#
Expect: matched string 1: (config)#
 >> default interface gi1/0/4 

 >> interface gi1/0/4 

Expect: searching for 1 strs:  :(config-if)#
 << default interface gi1/0/4 
Interface GigabitEthernet1/0/4 set to default configuration
test(config)#interface gi1/0/4 
test(config-if)#
Expect: matched string 1: (config-if)#
 >> switchport trunk native vlan 4

 >> switchport trunk allowed vlan 400,4

 >> switchport mode trunk

 >> spanning-tree portfast

 >> switchport port-security maximum 5

 >> switchport port-security

 >> switchport port-security aging time 15

 >> switchport port-security violation protect

 >> switchport port-security aging type inactivity

 >> power inline never

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport trunk native vlan 4
test(config-if)#switchport trunk allowed vlan 400,4
test(config-if)#switchport mode trunk
test(config-if)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting
 <<  hubs, concentrators, switches, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast has been configured on GigabitEthernet1/0/4 but will only
 have effect when the interface i
 << s in a non-trunking mode.
test(config-if)#switchport port-security maximum 5
test(config-if)#switchport port-security
test(config-if)#switchport port-security aging time 15
test(config-if)#switchport port-security violation protect
test(config-if)#sw
 << itchport port-security aging type inactivity
test(config-if)#power inline never
test(config-if)#end
test#
Jul 12 16:43:30: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
test#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
test(config)#
Expect: matched string 1: (config)#
 >> default interface gi1/0/5 

 >> end

Expect: searching for 1 strs:  :Configured
 << default interface gi1/0/5 
Interface GigabitEthernet1/0/5 set to default configuration
test(config)#end
test#
 << 
Jul 12 16:43:33: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
test#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
test(config)#
Expect: matched string 1: (config)#
 >> default interface gi1/0/5 

 >> interface gi1/0/5 

Expect: searching for 1 strs:  :(config-if)#
 << default interface gi1/0/5 
Interface GigabitEthernet1/0/5 set to default configuration
test(config)#interface gi1/0/5 
test(config-if)#
Expect: matched string 1: (config-if)#
 >> switchport trunk native vlan 5

 >> switchport trunk allowed vlan 500,5

 >> switchport mode trunk

 >> spanning-tree portfast

 >> power inline consumption 15400

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport trunk native vlan 5
test(config-if)#switchport trunk allowed vlan 500,5
test(config-if)#switchport mode trunk
test(config-if)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting
 <<  hubs, concentrators, switches, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast has been configured on GigabitEthernet1/0/5 but will only
 have effect when the interface i
 << s in a non-trunking mode.
test(config-if)#power inline consumption 15400
%CAUTION: Interface Gi1/0/5: Misconfiguring the 'power inline
 consumption/allocation' command may cause damage to the switch and void
 your warranty. Take precaution not to over
 << subscribe the power supply.
 It is recommended to enable power policing if the switch supports it.
 Refer to documentation.

test(config-if)#end
test#
 << 
Jul 12 16:43:40: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
test#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
test(config)#
Expect: matched string 1: (config)#
 >> default interface gi1/0/6 

 >> end

Expect: searching for 1 strs:  :Configured
 << default interface gi1/0/6 
Interface GigabitEthernet1/0/6 set to default configuration
test(config)#end
test#
 << 
Jul 12 16:43:44: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
test#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
test(config)#
Expect: matched string 1: (config)#
 >> default interface gi1/0/6 

 >> interface gi1/0/6 

Expect: searching for 1 strs:  :(config-if)#
 << default interface gi1/0/6 
Interface GigabitEthernet1/0/6 set to default configuration
test(config)#interface gi1/0/6 
test(config-if)#
Expect: matched string 1: (config-if)#
 >> switchport access vlan 6

 >> switchport mode access

 >> spanning-tree portfast

 >> power inline never

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport access vlan 6
test(config-if)#switchport mode access
test(config-if)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, concentrators, switches, bridges, etc... to this
 
 << interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast has been configured on GigabitEthernet1/0/6 but will only
 have effect when the interface is in a non-trunking mode.
test(config-if)#power inline ne
 << ver
test(config-if)#end
test#
 << 
Jul 12 16:43:50: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
test#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
test(config)#
Expect: matched string 1: (config)#
 >> default interface range gi1/0/7 - 10 

 >> end

Expect: searching for 1 strs:  :Configured
 << default interface range gi1/0/7 - 10 
test(config)#end
test#
 << 
Jul 12 16:43:54: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
test#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
test(config)#
Expect: matched string 1: (config)#
 >> default interface range gi1/0/7 - 10 

 >> interface range gi1/0/7 - 10 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi1/0/7 - 10 
test(config)#interface range gi1/0/7 - 10 
test(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport trunk native vlan 70

 >> switchport trunk allowed vlan 700,70

 >> switchport mode trunk

 >> spanning-tree portfast

 >> switchport port-security maximum 5

 >> switchport port-security

 >> switchport port-security aging time 15

 >> switchport port-security violation protect

 >> switchport port-security aging type inactivity

 >> power inline consumption 15400

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport trunk native vlan 70
test(config-if-range)#switchport trunk allowed vlan 700,70
test(config-if-range)#switchport mode trunk
test(config-if-range)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a singl
 << e
 host. Connecting hubs, concentrators, switches, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast will be configured in 4 interfaces due to the range command 
 but will 
 << only have effect when the interfaces are in a non-trunking mode.
test(config-if-range)#switchport port-security maximum 5
test(config-if-range)#switchport port-security
test(config-if-range)#switchport port-security aging time 15
test(config-if-range)
 << #switchport port-security violation protect
test(config-if-range)#switchport port-security aging type inactivity
test(config-if-range)#power inline consumption 15400
%CAUTION: Interface Gi1/0/7: Misconfiguring the 'power inline
 consumption/allocation
 << ' command may cause damage to the switch and void
 your warranty. Take precaution not to oversubscribe the power supply.
 It is recommended to enable power policing if the switch supports it.
 Refer to documentation.

%CAUTION: Interface Gi1/0/8: Mis
 << configuring the 'power inline
 consumption/allocation' command may cause damage to the switch and void
 your warranty. Take precaution not to oversubscribe the power supply.
 It is recommended to enable power policing if the switch supports it.
 Refer
 <<  to documentation.

%CAUTION: Interface Gi1/0/9: Misconfiguring the 'power inline
 consumption/allocation' command may cause damage to the switch and void
 your warranty. Take precaution not to oversubscribe the power supply.
 It is recommended to en
 << able power policing if the switch supports it.
 Refer to documentation.

%CAUTION: Interface Gi1/0/10: Misconfiguring the 'power inline
 consumption/allocation' command may cause damage to the switch and void
 your warranty. Take precaution not to ov
 << ersubscribe the power supply.
 It is recommended to enable power policing if the switch supports it.
 Refer to documentation.

test(config-if-range)#end
test#
Jul 12 16:44:03: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
test#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
test(config)#
Expect: matched string 1: (config)#
 >> default interface range gi1/0/11 - 15 

 >> end

Expect: searching for 1 strs:  :Configured
 << default interface range gi1/0/11 - 15 
test(config)#end
test#
 << 
Jul 12 16:44:07: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
test#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
test(config)#
Expect: matched string 1: (config)#
 >> default interface range gi1/0/11 - 15 

 >> interface range gi1/0/11 - 15 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi1/0/11 - 15 
test(config)#interface range gi1/0/11 - 15 
test(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport access vlan 900

 >> switchport mode access

 >> spanning-tree portfast

 >> switchport port-security maximum 2

 >> switchport port-security

 >> switchport port-security aging time 15

 >> switchport port-security violation protect

 >> switchport port-security aging type inactivity

 >> power inline consumption 15400

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport access vlan 900
test(config-if-range)#switchport mode access
test(config-if-range)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, concentrators, switches, bridges, etc
 << ... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast will be configured in 5 interfaces due to the range command 
 but will only have effect when the interfaces are in a non-trunking mode.
 << 
test(config-if-range)#switchport port-security maximum 2
test(config-if-range)#switchport port-security
test(config-if-range)#switchport port-security aging time 15
test(config-if-range)#switchport port-security violation protect
test(config-if-rang
 << e)#switchport port-security aging type inactivity
test(config-if-range)#power inline consumption 15400
%CAUTION: Interface Gi1/0/11: Misconfiguring the 'power inline
 consumption/allocation' command may cause damage to the switch and void
 your warran
 << ty. Take precaution not to oversubscribe the power supply.
 It is recommended to enable power policing if the switch supports it.
 Refer to documentation.

%CAUTION: Interface Gi1/0/12: Misconfiguring the 'power inline
 consumption/allocation' comman
 << d may cause damage to the switch and void
 your warranty. Take precaution not to oversubscribe the power supply.
 It is recommended to enable power policing if the switch supports it.
 Refer to documentation.

%CAUTION: Interface Gi1/0/13: Misconfigu
 << ring the 'power inline
 consumption/allocation' command may cause damage to the switch and void
 your warranty. Take precaution not to oversubscribe the power supply.
 It is recommended to enable power policing if the switch supports it.
 Refer to doc
 << umentation.

%CAUTION: Interface Gi1/0/14: Misconfiguring the 'power inline
 consumption/allocation' command may cause damage to the switch and void
 your warranty. Take precaution not to oversubscribe the power supply.
 It is recommended to enable p
 << ower policing if the switch supports it.
 Refer to documentation.

%CAUTION: Interface Gi1/0/15: Misconfiguring the 'power inline
 consumption/allocation' command may cause damage to the switch and void
 your warranty. Take precaution not to oversubs
 << cribe the power supply.
 It is recommended to enable power policing if the switch supports it.
 Refer to documentation.

test(config-if-range)#end
test#
 << 
Jul 12 16:44:15: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
test#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
test(config)#
Expect: matched string 1: (config)#
 >> default interface range gi1/0/16 - 48 

 >> end

Expect: searching for 1 strs:  :Configured
 << default interface range gi1/0/16 - 48 
test(config)#end
test#
 << 
Jul 12 16:44:20: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
test#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
test(config)#
Expect: matched string 1: (config)#
 >> default interface range gi1/0/16 - 48 

 >> interface range gi1/0/16 - 48 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi1/0/16 - 48 
test(config)#interface range gi1/0/16 - 48 
test(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport access vlan 123

 >> switchport mode access

 >> spanning-tree portfast

 >> power inline never

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport access vlan 123
test(config-if-range)#switchport mode access
test(config-if-range)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, concentrators, switches, bridges, etc
 << ... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast will be configured in 33 interfaces due to the range command 
 but will only have effect when the interfaces are in a non-trunking mode
 << .
test(config-if-range)#power inline never
test(config-if-range)#end
test#
Jul 12 16:44:27: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
test#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
test(config)#
Expect: matched string 1: (config)#
 >> default interface 1 

 >> end

Expect: searching for 1 strs:  :Configured
 << default interface 1 
                               ^
% Invalid input detected at '^' marker.

test(config)#end
test#
 << 
Jul 12 16:44:31: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
test#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
test(config)#
Expect: matched string 1: (config)#
 >> default interface gi1/0/1 

 >> interface gi1/0/1 

Expect: searching for 1 strs:  :(config-if)#
 << default interface gi1/0/1 
Interface GigabitEthernet1/0/1 set to default configuration
test(config)#interface gi1/0/1 
test(config-if)#
Expect: matched string 1: (config-if)#
 >> switchport mode trunk

 >> switchport trunk native vlan 92

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport mode trunk
test(config-if)#switchport trunk native vlan 92
test(config-if)#end
test#
 << 
Jul 12 16:44:36: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> write mem

Expect: searching for 2 strs:  :# :>
 << 
test#write mem
Building configuration...

Expect: matched string 1: #
