trying to use serial port: /dev/ttyUSB0
 >> 
 >> 

Expect: searching for 4 strs:  :[yes/no] :Press RETURN to get started. :# :Switch>
 << 
test#
test#
test#
test#
Expect: matched string 3: #
 >> term len 0

Expect: searching for 2 strs:  :# :>
 << term len 0
test#
Expect: matched string 1: #
 >> show version

Expect: searching for 2 strs:  :# :>
 << show version
Cisco IOS Software, C2960X Software (C2960X-UNIVERSALK9-M), Version 15.2(2)E3, RELEASE SOFTWARE (fc3)
Technical Support: http://www.cisco.com/techsupport
Copyright (c) 1986-2015 by Cisco Systems, Inc.
Compiled Wed 26-Aug-15 07:12 by prod_
 << rel_team

ROM: Bootstrap program is C2960X boot loader
BOOTLDR: C2960X Boot Loader (C2960X-HBOOT-M) Version 15.2(3r)E1, RELEASE SOFTWARE (fc1)

test uptime is 1 hour, 5 minutes
System returned to ROM by power-on
System restarted at 15:17:38 CDT Tue
 <<  Jul 12 2016
System image file is "flash:/c2960x-universalk9-mz.152-2.E3/c2960x-universalk9-mz.152-2.E3.bin"
Last reload reason: Reload command



This product contains cryptographic features and is subject to United
States and local country laws g
 << overning import, export, transfer and
use. Delivery of Cisco cryptographic products does not imply
third-party authority to import, export, distribute or use encryption.
Importers, exporters, distributors and users are responsible for
compliance with 
 << U.S. and local country laws. By using this product you
agree to comply with applicable laws and regulations. If you are unable
to comply with U.S. and local laws, return this product immediately.

A summary of U.S. laws governing Cisco cryptographic p
 << roducts may be found at:
http://www.cisco.com/wwl/export/crypto/tool/stqrg.html

If you require further assistance please contact us by sending email to
export@cisco.com.

cisco WS-C2960X-48FPD-L (APM86XXX) processor (revision M0) with 524288K bytes
 <<  of memory.
Processor board ID FCW2009A1QZ
Last reset from power-on
2 Virtual Ethernet interfaces
1 FastEthernet interface
50 Gigabit Ethernet interfaces
2 Ten Gigabit Ethernet interfaces
The password-recovery mechanism is enabled.

512K bytes of
 <<  flash-simulated non-volatile configuration memory.
Base ethernet MAC Address       : 00:CA:E5:4D:1A:00
Motherboard assembly number     : 73-16686-04
Power supply part number        : 341-0527-01
Motherboard serial number       : FOC200872LF
Power su
 << pply serial number      : DCB2006600W
Model revision number           : M0
Motherboard revision number     : B0
Model number                    : WS-C2960X-48FPD-L
Daughterboard assembly number   : 73-14200-03
Daughterboard serial number     : FOC200
 << 9126K
System serial number            : FCW2009A1QZ
Top Assembly Part Number        : 68-100463-01
Top Assembly Revision Number    : B0
Version ID                      : V05
CLEI Code Number                : CMMLJ00ARD
Daughterboard revision number 
 <<   : A0
Hardware Board Revision Number  : 0x18


Switch Ports Model                     SW Version            SW Image                 
------ ----- -----                     ----------            ----------               
*    1 52    WS-C2960X-48FP
 << D-L         15.2(2)E3             C2960X-UNIVERSALK9-M     


Configuration register is 0xF

test#
Expect: matched string 1: #
 >> enable

Expect: searching for 2 strs:  :Password: :#
 << enable
test#
Expect: matched string 2: #
 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
test(config)#
Expect: matched string 1: (config)#
 >> default interface range gi1/0/1 - 10 

 >> end

Expect: searching for 1 strs:  :Configured
 << default interface range gi1/0/1 - 10 
test(config)#end
test#
 << 
Jul 12 16:23:41: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
test#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
test(config)#
Expect: matched string 1: (config)#
 >> default interface range gi1/0/1 - 10 

 >> interface range gi1/0/1 - 10 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi1/0/1 - 10 
test(config)#interface range gi1/0/1 - 10 
test(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport trunk native vlan 567

 >> switchport trunk allowed vlan 123,567

 >> switchport mode trunk

 >> spanning-tree portfast

 >> switchport port-security maximum 5

 >> switchport port-security

 >> switchport port-security aging time 15

 >> switchport port-security violation protect

 >> switchport port-security aging type inactivity

 >> power inline consumption 15400

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport trunk native vlan 567
test(config-if-range)#switchport trunk allowed vlan 123,567
test(config-if-range)#switchport mode trunk
test(config-if-range)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a sin
 << gle
 host. Connecting hubs, concentrators, switches, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast will be configured in 10 interfaces due to the range command 
 but wi
 << ll only have effect when the interfaces are in a non-trunking mode.
test(config-if-range)#switchport port-security maximum 5
test(config-if-range)#switchport port-security
test(config-if-range)#switchport port-security aging time 15
test(config-if-ran
 << ge)#switchport port-security violation protect
test(config-if-range)#switchport port-security aging type inactivity
test(config-if-range)#power inline consumption 15400
%CAUTION: Interface Gi1/0/1: Misconfiguring the 'power inline
 consumption/allocat
 << ion' command may cause damage to the switch and void
 your warranty. Take precaution not to oversubscribe the power supply.
 It is recommended to enable power policing if the switch supports it.
 Refer to documentation.

%CAUTION: Interface Gi1/0/2: 
 << Misconfiguring the 'power inline
 consumption/allocation' command may cause damage to the switch and void
 your warranty. Take precaution not to oversubscribe the power supply.
 It is recommended to enable power policing if the switch supports it.
 Re
 << fer to documentation.

%CAUTION: Interface Gi1/0/3: Misconfiguring the 'power inline
 consumption/allocation' command may cause damage to the switch and void
 your warranty. Take precaution not to oversubscribe the power supply.
 It is recommended to
 <<  enable power policing if the switch supports it.
 Refer to documentation.

%CAUTION: Interface Gi1/0/4: Misconfiguring the 'power inline
 consumption/allocation' command may cause damage to the switch and void
 your warranty. Take precaution not to 
 << oversubscribe the power supply.
 It is recommended to enable power policing if the switch supports it.
 Refer to documentation.

%CAUTION: Interface Gi1/0/5: Misconfiguring the 'power inline
 consumption/allocation' command may cause damage to the sw
 << itch and void
 your warranty. Take precaution not to oversubscribe the power supply.
 It is recommended to enable power policing if the switch supports it.
 Refer to documentation.

%CAUTION: Interface Gi1/0/6: Misconfiguring the 'power inline
 cons
 << umption/allocation' command may cause damage to the switch and void
 your warranty. Take precaution not to oversubscribe the power supply.
 It is recommended to enable power policing if the switch supports it.
 Refer to documentation.

%CAUTION: Inte
 << rface Gi1/0/7: Misconfiguring the 'power inline
 consumption/allocation' command may cause damage to the switch and void
 your warranty. Take precaution not to oversubscribe the power supply.
 It is recommended to enable power policing if the switch su
 << pports it.
 Refer to documentation.

%CAUTION: Interface Gi1/0/8: Misconfiguring the 'power inline
 consumption/allocation' command may cause damage to the switch and void
 your warranty. Take precaution not to oversubscribe the power supply.
 It is
 <<  recommended to enable power policing if the switch supports it.
 Refer to documentation.

%CAUTION: Interface Gi1/0/9: Misconfiguring the 'power inline
 consumption/allocation' command may cause damage to the switch and void
 your warranty. Take pre
 << caution not to oversubscribe the power supply.
 It is recommended to enable power policing if the switch supports it.
 Refer to documentation.

%CAUTION: Interface Gi1/0/10: Misconfiguring the 'power inline
 consumption/allocation' command may cause 
 << damage to the switch and void
 your warranty. Take precaution not to oversubscribe the power supply.
 It is recommended to enable power policing if the switch supports it.
 Refer to documentation.

test(config-if-range)#end
test#
 << 
Jul 12 16:23:52: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> write mem

Expect: searching for 2 strs:  :# :>
 << 
test#write mem
Building configuration...
[OK]
test#
Expect: matched string 1: #
