trying to use serial port: /dev/ttyUSB0
 >> 
 >> 

Expect: searching for 4 strs:  :[yes/no] :Press RETURN to get started. :# :Switch>
 << 
test>
test>
test>
test>
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

test>
test>
test>
test>
...

 >> 

Expect: searching for 2 strs:  :# :>
 << 
test>
test>
Expect: matched string 2: >
 >> term len 0

Expect: searching for 2 strs:  :# :>
 << term len 0
test>
Expect: matched string 2: >
 >> show version

Expect: searching for 2 strs:  :# :>
 << show version
Cisco IOS Software, C2960X Software (C2960X-UNIVERSALK9-M), Version 15.2(2)E3, RELEASE SOFTWARE (fc3)
Technical Support: http://www.cisco.com/techsupport
Copyright (c) 1986-2015 by Cisco Systems, Inc.
Compiled Wed 26-Aug-15 07:12 by prod_
 << rel_team

ROM: Bootstrap program is C2960X boot loader
BOOTLDR: C2960X Boot Loader (C2960X-HBOOT-M) Version 15.2(3r)E1, RELEASE SOFTWARE (fc1)

test uptime is 59 minutes
System returned to ROM by power-on
System restarted at 15:17:38 CDT Tue Jul 12
 <<  2016
System image file is "flash:/c2960x-universalk9-mz.152-2.E3/c2960x-universalk9-mz.152-2.E3.bin"
Last reload reason: Reload command



This product contains cryptographic features and is subject to United
States and local country laws governin
 << g import, export, transfer and
use. Delivery of Cisco cryptographic products does not imply
third-party authority to import, export, distribute or use encryption.
Importers, exporters, distributors and users are responsible for
compliance with U.S. an
 << d local country laws. By using this product you
agree to comply with applicable laws and regulations. If you are unable
to comply with U.S. and local laws, return this product immediately.

A summary of U.S. laws governing Cisco cryptographic products
 <<  may be found at:
http://www.cisco.com/wwl/export/crypto/tool/stqrg.html

If you require further assistance please contact us by sending email to
export@cisco.com.

cisco WS-C2960X-48FPD-L (APM86XXX) processor (revision M0) with 524288K bytes of mem
 << ory.
Processor board ID FCW2009A1QZ
Last reset from power-on
2 Virtual Ethernet interfaces
1 FastEthernet interface
50 Gigabit Ethernet interfaces
2 Ten Gigabit Ethernet interfaces
The password-recovery mechanism is enabled.

512K bytes of flash-
 << simulated non-volatile configuration memory.
Base ethernet MAC Address       : 00:CA:E5:4D:1A:00
Motherboard assembly number     : 73-16686-04
Power supply part number        : 341-0527-01
Motherboard serial number       : FOC200872LF
Power supply se
 << rial number      : DCB2006600W
Model revision number           : M0
Motherboard revision number     : B0
Model number                    : WS-C2960X-48FPD-L
Daughterboard assembly number   : 73-14200-03
Daughterboard serial number     : FOC2009126K

 << System serial number            : FCW2009A1QZ
Top Assembly Part Number        : 68-100463-01
Top Assembly Revision Number    : B0
Version ID                      : V05
CLEI Code Number                : CMMLJ00ARD
Daughterboard revision number   : A0
 << 
Hardware Board Revision Number  : 0x18


Switch Ports Model                     SW Version            SW Image                 
------ ----- -----                     ----------            ----------               
*    1 52    WS-C2960X-48FPD-L    
 <<      15.2(2)E3             C2960X-UNIVERSALK9-M     


Configuration register is 0xF

test>
Expect: matched string 2: >
 >> enable

Expect: searching for 2 strs:  :Password: :#
 << enable
Password: 
Expect: matched string 1: Password:
 >> Area=l*w

Expect: searching for 1 strs:  :#
 << 
test#
Expect: matched string 1: #
 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
test(config)#
Expect: matched string 1: (config)#
 >> default interface 48 

 >> end

Expect: searching for 1 strs:  :Configured
 << default interface 48 
                               ^
% Invalid input detected at '^' marker.

test(config)#end
test#
 << 
Jul 12 16:17:13: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
test#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
test(config)#
Expect: matched string 1: (config)#
 >> default interface gi1/0/48 

 >> interface gi1/0/48 

Expect: searching for 1 strs:  :(config-if)#
 << default interface gi1/0/48 
Interface GigabitEthernet1/0/48 set to default configuration
test(config)#interface gi1/0/48 
test(config-if)#
Expect: matched string 1: (config-if)#
 >> switchport mode trunk

 >> switchport trunk native vlan 92

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport mode trunk
test(config-if)#switchport trunk native vlan 92
test(config-if)#end
test#
 << 
Jul 12 16:17:19: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> write mem

Expect: searching for 2 strs:  :# :>
 << 
test#write mem
Building configuration...
[OK]
test#
Expect: matched string 1: #
