trying to use serial port: /dev/ttyUSB1
 >> 
 >> 

Expect: searching for 4 strs:  :[yes/no] :Press RETURN to get started. :# :Switch>
 << 
Switch>
Switch>
Switch>
Switch>
Expect: matched string 4: Switch>
 >> term len 0

Expect: searching for 2 strs:  :# :>
 << term len 0
Switch>
Expect: matched string 2: >
 >> show version

Expect: searching for 2 strs:  :# :>
 << show version
Cisco IOS Software, C2960X Software (C2960X-UNIVERSALK9-M), Version 15.2(2)E3, RELEASE SOFTWARE (fc3)
Technical Support: http://www.cisco.com/techsupport
Copyright (c) 1986-2015 by Cisco Systems, Inc.
Compiled Wed 26-Aug-15 07:12 by prod_
 << rel_team

ROM: Bootstrap program is C2960X boot loader
BOOTLDR: C2960X Boot Loader (C2960X-HBOOT-M) Version 15.2(2r)E2, RELEASE SOFTWARE (fc1)

Switch uptime is 21 minutes
System returned to ROM by power-on
System restarted at 13:46:52 UTC Wed Aug 
 << 3 2016
System image file is "flash:/c2960x-universalk9-mz.152-2.E3/c2960x-universalk9-mz.152-2.E3.bin"
Last reload reason: Unknown reason



This product contains cryptographic features and is subject to United
States and local country laws governi
 << ng import, export, transfer and
use. Delivery of Cisco cryptographic products does not imply
third-party authority to import, export, distribute or use encryption.
Importers, exporters, distributors and users are responsible for
compliance with U.S. a
 << nd local country laws. By using this product you
agree to comply with applicable laws and regulations. If you are unable
to comply with U.S. and local laws, return this product immediately.

A summary of U.S. laws governing Cisco cryptographic product
 << s may be found at:
http://www.cisco.com/wwl/export/crypto/tool/stqrg.html

If you require further assistance please contact us by sending email to
export@cisco.com.

cisco WS-C2960X-48TS-L (APM86XXX) processor (revision K0) with 524288K bytes of mem
 << ory.
Processor board ID FCW2019A46N
Last reset from power-on
1 Virtual Ethernet interface
1 FastEthernet interface
52 Gigabit Ethernet interfaces
The password-recovery mechanism is enabled.

512K bytes of flash-simulated non-volatile configuration
 <<  memory.
Base ethernet MAC Address       : 00:9E:1E:B1:6E:00
Motherboard assembly number     : 73-15971-02
Power supply part number        : 341-0537-02
Motherboard serial number       : FOC20192X40
Power supply serial number      : DCB201383P6
Mode
 << l revision number           : K0
Motherboard revision number     : C0
Model number                    : WS-C2960X-48TS-L
Daughterboard assembly number   : 73-14200-03
Daughterboard serial number     : FOC20181Z5E
System serial number            : FCW
 << 2019A46N
Top Assembly Part Number        : 800-41468-01
Top Assembly Revision Number    : F0
Version ID                      : V03
CLEI Code Number                : CMMNF00ARB
Daughterboard revision number   : A0
Hardware Board Revision Number  : 0x
 << 12


Switch Ports Model                     SW Version            SW Image                 
------ ----- -----                     ----------            ----------               
*    1 52    WS-C2960X-48TS-L          15.2(2)E3             C2960X-UNI
 << VERSALK9-M     


Configuration register is 0xF

Switch>
Expect: matched string 2: >
 >> enable

Expect: searching for 2 strs:  :Password: :#
 << enable
Switch#
Expect: matched string 2: #
 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
Expect: matched string 1: (config)#
 >> no service pad

 >> service timestamps debug datetime localtime

 >> service timestamps log datetime localtime

 >> service password-encryption

 >> boot-start-marker

 >> boot-end-marker

 >> enable secret Area=l*w

 >> enable password Area=l*w

 >> no aaa new-model

 >> clock timezone CST -6 0

 >> clock summer-time CDT recurring

 >> authentication mac-move permit

 >> ip domain-name mgmt.msstate.edu

 >> ip name-server 130.18.80.12

 >> vtp domain vtp01.mgmt.msstate.edu

 >> vtp mode client

 >> crypto pki trustpoint TP-self-signed-2494998912

 >>  enrollment selfsigned

 >>  subject-name cn=IOS-Self-Signed-Certificate-2494998912

 >>  revocation-check none

 >>  rsakeypair TP-self-signed-2494998912

 >> crypto pki certificate chain TP-self-signed-2494998912

 >>  certificate self-signed 01 nvram:IOS-Self-Sig#3232.cer

 >> spanning-tree portfast bpduguard default

 >> spanning-tree extend system-id

 >> vlan internal allocation policy ascending

 >> errdisable recovery cause all

 >> errdisable recovery interval 1800

 >> interface FastEthernet0

 >>  no ip address

 >>  shutdown

 >> interface Vlan1

 >>  no ip address

 >>  no ip route-cache

 >>  shutdown

 >> interface Vlan92

 >> no ip http server

 >> no ip http secure-server

 >> logging facility local1

 >> logging host 130.18.8.12

 >> access-list 1 permit 130.18.92.0 0.0.3.255

 >> access-list 1 permit 10.92.0.0 0.0.255.255

 >> access-list 1 permit 130.18.8.0 0.0.0.255

 >> snmp-server community sysnet RO 1

 >> snmp-server community c2-b2=a2 RW 1

 >> snmp-server enable traps snmp authentication linkdown linkup coldstart warmstart

 >> snmp-server enable traps transceiver all

 >> snmp-server enable traps tty

 >> snmp-server enable traps cluster

 >> snmp-server enable traps config-copy

 >> snmp-server enable traps config

 >> snmp-server enable traps config-ctid

 >> snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-auth-fail-vlan no-guest-vlan

 >> snmp-server enable traps entity

 >> snmp-server enable traps power-ethernet police

 >> snmp-server enable traps cpu threshold

 >> snmp-server enable traps rep

 >> snmp-server enable traps bridge newroot topologychange

 >> snmp-server enable traps stpx inconsistency root-inconsistency loop-inconsistency

 >> snmp-server enable traps syslog

 >> snmp-server enable traps vtp

 >> snmp-server enable traps vlancreate

 >> snmp-server enable traps vlandelete

 >> snmp-server enable traps flash insertion removal

 >> snmp-server enable traps port-security

 >> snmp-server enable traps envmon fan shutdown supply temperature status

 >> snmp-server enable traps errdisable

 >> snmp-server enable traps mac-notification change move threshold

 >> snmp-server enable traps vlan-membership

 >> snmp-server host 130.18.8.12 sysnet 

 >> line con 0

 >> line vty 0 4

 >>  password Area=l*w

 >>  login

 >> line vty 5 15

 >>  password Area=l*w

 >>  login

 >> ntp server 10.92.0.5

 >> username root privilege 15 secret Area=l*w

 >> end

Expect: searching for 1 strs:  :Configured
 << no service pad
Switch(config)#service timestamps debug datetime localtime
Switch(config)#service timestamps log datetime localtime
Switch(config)#service password-encryption
Switch(config)#boot-start-marker
Switch(config)#boot-end-marker
Switch(conf
 << ig)#enable secret Area=l*w
Switch(config)#enable password Area=l*w
The enable password you have chosen is the same as your enable secret.
This is not recommended.  Re-enter the enable password.

Switch(config)#no aaa new-model
Switch(config)#clock t
 << imezone CST -6 0
Switch(config)#clock summer-time CDT recurring
Switch(config)#authentication mac-move permit
Switch(config)#ip domain-name mgmt.msstate.edu
Switch(config)#ip name-server 130.18.80.12
Switch(config)#vtp domain vtp01.mgmt.msstate.edu

 << Changing VTP domain name from NULL to vtp01.mgmt.msstate.edu
Switch(config)#vtp mode client
Setting device to VTP Client mode for VLANS.
Switch(config)#
Aug  3 08:10:18: %SYS-6-CLOCKUPDATE: System clock has been updated from 14:10:18 UTC Wed Aug 3 201
 << 6 to 08:10:18 CST Wed Aug 3 2016, configured from console by console.
Aug  3 09:10:19: %SYS-6-CLOCKUPDATE: System clock has been updated from 08:10:19 CST Wed Aug 3 2016 to 09:10:19 CDT Wed Aug 3 2016, configured from console by console.crypto pki trustp
 << oint TP-self-signed-2494998912
Switch(ca-trustpoint)# enrollment selfsigned
Switch(ca-trustpoint)# subject-name cn=IOS-Self-Signed-Certificate-2494998912
Switch(ca-trustpoint)# revocation-check none
Switch(ca-trustpoint)#
Aug  3 09:10:19: %SW_VLAN-6-
 << VTP_DOMAIN_NAME_CHG: VTP domain name changed to vtp01.mgmt.msstate.edu. rsakeypair TP-self-signed-2494998912
Switch(ca-trustpoint)#crypto pki certificate chain TP-self-signed-2494998912
Switch(config-cert-chain)# certificate self-signed 01 nvram:IOS-Sel
 << f-Sig#3232$e self-signed 01 nvram:IOS-Self-Sig#3232.         cer
Switch(config-cert-chain)#spanning-tree portfast bpduguard default
Switch(config)#spanning-tree extend system-id
Switch(config)
 << #vlan internal allocation policy ascending
Switch(config)#errdisable recovery cause all
Switch(config)#errdisable recovery interval 1800
Switch(config)#interface FastEthernet0
Switch(config-if)# no ip address
Switch(config-if)# shutdown
Switch(confi
 << g-if)#interface Vlan1
Switch(config-if)# no ip address
Switch(config-if)# no ip route-cache
Switch(config-if)# shutdown
Switch(config-if)#interface Vlan92
Switch(config-if)#no ip http server
Switch(config)#no ip http secure-server
Switch(config)#lo
 << gging facility local1
Switch(config)#logging host 130.18.8.12
Switch(config)#access-list 1 permit 130.18.92.0 0.0.3.255
Switch(config)#access-list 1 permit 10.92.0.0 0.0.255.255
Switch(config)#access-list 1 permit 130.18.8.0 0.0.0.255
Switch(config)#
 << snmp-server community sysnet RO 1
Switch(config)#
Aug  3 09:10:25: %SYS-6-LOGGINGHOST_STARTSTOP: Logging to host 130.18.8.12 port 0 CLI Request Triggered
Aug  3 09:10:25: %SYS-6-LOGGINGHOST_STARTSTOP: Logging to host 130.18.8.12 port 514 started - CLI 
 << initiatedsnmp-server community c2-b2=a2 RW 1
Switch(config)#snmp-server enable traps snmp authentication linkdown linkup c$ enable traps snmp authentication linkdown linkup co         
 << ldstart waps snmp authentication linkdown linkup coldstart wa         rmstart
Switch(config)#snmp-server enable traps transceiver all
Switch(config)#snmp-server enable traps tty
Swi
 << tch(config)#
Aug  3 09:10:25: %LINK-5-CHANGED: Interface FastEthernet0, changed state to administratively down
Aug  3 09:10:26: %LINK-5-CHANGED: Interface Vlan1, changed state to administratively downsnmp-server enable traps cluster
Switch(config)#snmp
 << -server enable traps config-copy
Switch(config)#snmp-server enable traps config
Switch(config)#snmp-server enable traps config-ctid
Switch(config)#snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-au
 << $ enable traps dot1x auth-fail-vlan guest-vlan no-aut         h-fail-vlaps dot1x auth-fail-vlan guest-vlan no-auth-fail-vla         n no-gues
 << uth-fail-vlan guest-vlan no-auth-fail-vlan no-guest         -vlan
snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-auth-fail-vlan no-gu                         ^est-vlan

% Invalid input d
 << etected at '^' marker.

Switch(config)#snmp-server enable traps entity
Switch(config)#snmp-server enable traps power-ethernet police
Switch(config)#snmp-server enable traps cpu threshold
Switch(config)#snmp-server enable traps rep
                  
 <<                       ^
% Invalid input detected at '^' marker.

Switch(config)#snmp-server enable traps bridge newroot topologychange
Switch(config)#snmp-server enable traps stpx inconsistency root-inconsistency
 << $ enable traps stpx inconsistency root-inconsistency          loop-incoaps stpx inconsistency root-inconsistency loop-incon         sistency
Switch(conf
 << ig)#snmp-server enable traps syslog
Switch(config)#snmp-server enable traps vtp
Switch(config)#snmp-server enable traps vlancreate
Switch(config)#snmp-server enable traps vlandelete
Switch(config)#snmp-server enable traps flash insertion removal
Swit
 << ch(config)#snmp-server enable traps port-security
Switch(config)#snmp-server enable traps envmon fan shutdown supply temperatur$ enable traps envmon fan shutdown supply temperature         
 <<  status
Switch(config)#snmp-server enable traps errdisable
Switch(config)#snmp-server enable traps mac-notification change move threshol$ enable traps mac-notification change move thres
 << hold         
Switch(config)#snmp-server enable traps vlan-membership
Switch(config)#snmp-server host 130.18.8.12 sysnet 
Switch(config)#line con 0
Switch(config-line)#line vty 0 4
Switch(config-line)# password Area=l*w
Switch(config-line)#
 <<  login
Switch(config-line)#line vty 5 15
Switch(config-line)# password Area=l*w
Switch(config-line)# login
Switch(config-line)#ntp server 10.92.0.5
Switch(config)#username root privilege 15 secret Area=l*w
Switch(config)#end
Switch#
 << 
Aug  3 09:10:33: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
Switch#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
Expect: matched string 1: (config)#
 >> spanning-tree mode pvst

 >> no spanning-tree vlan 2-91,93-237,240-242,244,246,248,251-252,256,359,500,502

 >> no spanning-tree vlan 505,509,511-515,520,522,551-560,562-570,601-603,605-606

 >> no spanning-tree vlan 610,629-630,632-633,635-637,654,674-676,701,741-742,800

 >> no spanning-tree vlan 801-805,807,880,901-904,908,910-913,915-916,926-930,970

 >> no spanning-tree vlan 995-1000

 >> spanning-tree vlan 1-1000 priority 57344

 >> 

 >> end

Expect: searching for 1 strs:  :Configured
 << spanning-tree mode pvst
Switch(config)#no spanning-tree vlan 2-91,93-237,240-242,244,246,248,251-252,$-tree vlan 2-91,93-237,240-242,244,246,248,251-252,2         56,359,50
 <<  2-91,93-237,240-242,244,246,248,251-252,256,359,500         ,502
Switch(config)#no spanning-tree vlan 505,509,511-515,520,522,551-560,562-570,
 << $-tree vlan 505,509,511-515,520,522,551-560,562-570,6         01-603,60 505,509,511-515,520,522,551-560,562-570,601-603,605         -606
Switch(config)#no spanning-t
 << ree vlan 610,629-630,632-633,635-637,654,674-676,$-tree vlan 610,629-630,632-633,635-637,654,674-676,7         01,741-74 61
 << 0,629-630,632-633,635-637,654,674-676,701,741-742         ,800
Switch(config)#no spanning-tree vlan 801-805,807,880,901-904,908,910-913,915-$-tree vlan 801-805,807,880,901-904,908,910
 << -913,915-9         16,926-93 801-805,807,880,901-904,908,910-913,915-916,926-930         ,970
Switch(config)#no spanning-tree vlan 995-1000
Switch(config)#spanning-tree vlan 
 << 1-1000 priority 57344
Switch(config)#
Switch(config)#end
Switch#
 << 
Aug  3 09:10:41: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
Switch#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
Expect: matched string 1: (config)#
 >> hostname c29s2.m1.bot.mgccc 

Expect: searching for 2 strs:  :# :>
 << hostname c29s2.m1.bot.mgccc 
c29s2.m1.bot.mgccc(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s2.m1.bot.mgccc#
 << 
Aug  3 09:10:47: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s2.m1.bot.mgccc#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s2.m1.bot.mgccc(config)#
Expect: matched string 1: (config)#
 >> snmp-server contact  

Expect: searching for 1 strs:  :#
 << snmp-server contact  
% Incomplete command.

c29s2.m1.bot.mgccc(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s2.m1.bot.mgccc#
 << 
Aug  3 09:10:53: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s2.m1.bot.mgccc#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s2.m1.bot.mgccc(config)#
Expect: matched string 1: (config)#
 >> interface vlan 92

Expect: searching for 1 strs:  :(config-if)#
 << interface vlan 92
c29s2.m1.bot.mgccc(config-if)#
Expect: matched string 1: (config-if)#
 >> ip address 10.17.9.12 255.255.0.0

 >> ip broadcast-address 10.92.255.255

 >> end

Expect: searching for 1 strs:  :Configured
 << ip address 10.17.9.12 255.255.0.0
c29s2.m1.bot.mgccc(config-if)#ip broadcast-address 10.92.255.255
c29s2.m1.bot.mgccc(config-if)#end
c29s2.m1.bot.mgccc#
 << 
Aug  3 09:11:00: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s2.m1.bot.mgccc#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s2.m1.bot.mgccc(config)#
Expect: matched string 1: (config)#
 >> interface Vlan92

Expect: searching for 1 strs:  :(config-if)#
 << interface Vlan92
c29s2.m1.bot.mgccc(config-if)#
Expect: matched string 1: (config-if)#
 >> ip default-gateway 10.92.0.1

 >> end

Expect: searching for 1 strs:  :Configured
 << ip default-gateway 10.92.0.1
c29s2.m1.bot.mgccc(config)#end
c29s2.m1.bot.mgccc#
Aug  3 09:11:06: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s2.m1.bot.mgccc#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s2.m1.bot.mgccc(config)#
Expect: matched string 1: (config)#
 >> ip dhcp snooping

Expect: searching for 1 strs:  :#
 << ip dhcp snooping
c29s2.m1.bot.mgccc(config)#
Expect: matched string 1: #
 >> ip dhcp snooping vlan 122

Expect: searching for 1 strs:  :#
 << ip dhcp snooping vlan 122
c29s2.m1.bot.mgccc(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s2.m1.bot.mgccc#
Aug  3 09:11:13: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s2.m1.bot.mgccc#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s2.m1.bot.mgccc(config)#
Expect: matched string 1: (config)#
 >> default interface range gi1/0/1 - 48 

 >> interface range gi1/0/1 - 48 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi1/0/1 - 48 
c29s2.m1.bot.mgccc(config)#interface range gi1/0/1 - 48 
c29s2.m1.bot.mgccc(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport access vlan 122

 >> switchport mode access

 >> spanning-tree portfast

 >> switchport port-security maximum 2

 >> switchport port-security

 >> switchport port-security aging time 15

 >> switchport port-security violation protect

 >> switchport port-security aging type inactivity

 >> power inline never

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport access vlan 122
c29s2.m1.bot.mgccc(config-if-range)#switchport mode access
c29s2.m1.bot.mgccc(config-if-range)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, concentra
 << tors, switches, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast will be configured in 48 interfaces due to the range command 
 but will only have effect when the interface
 << s are in a non-trunking mode.
c29s2.m1.bot.mgccc(config-if-range)#switchport port-security maximum 2
c29s2.m1.bot.mgccc(config-if-range)#switchport port-security
c29s2.m1.bot.mgccc(config-if-range)#switchport port-security aging time 15
c29s2.m1.bot.m
 << gccc(config-if-range)#switchport port-security violation protec$port-security violation protect         
c29s2.m1.bot.mgccc(config-if-range)#switchport port-security aging type inact
 << $port-security aging type inacti         vity
c29s2.m1.bot.mgccc(config-if-range)#power inline never
                                          ^
% Invalid input detected at '^' marker.

c29s2.m1.bot.mgccc(config-if-range)#
 << end
c29s2.m1.bot.mgccc#
 << 
Aug  3 09:11:21: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s2.m1.bot.mgccc#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s2.m1.bot.mgccc(config)#
Expect: matched string 1: (config)#
 >> default interface gi1/0/1 

 >> interface gi1/0/1 

Expect: searching for 1 strs:  :(config-if)#
 << default interface gi1/0/1 
Interface GigabitEthernet1/0/1 set to default configuration
c29s2.m1.bot.mgccc(config)#interface gi1/0/1 
c29s2.m1.bot.mgccc(config-if)#
Expect: matched string 1: (config-if)#
 >> switchport mode trunk

 >> switchport trunk native vlan 92

 >> ip dhcp snooping trust

 >> no keepalive

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport mode trunk
c29s2.m1.bot.mgccc(config-if)#switchport trunk native vlan 92
c29s2.m1.bot.mgccc(config-if)#ip dhcp snooping trust
c29s2.m1.bot.mgccc(config-if)#no keepalive
c29s2.m1.bot.mgccc(config-if)#end
c29s2.m1.bot.mgccc#
 << 
Aug  3 09:11:28: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s2.m1.bot.mgccc#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s2.m1.bot.mgccc(config)#
Expect: matched string 1: (config)#
 >> default interface range gi1/0/49 - 52 

 >> interface range gi1/0/49 - 52 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi1/0/49 - 52 
c29s2.m1.bot.mgccc(config)#interface range gi1/0/49 - 52 
c29s2.m1.bot.mgccc(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport mode trunk

 >> switchport trunk native vlan 92

 >> ip dhcp snooping trust

 >> no keepalive

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport mode trunk
c29s2.m1.bot.mgccc(config-if-range)#switchport trunk native vlan 92
c29s2.m1.bot.mgccc(config-if-range)#ip dhcp snooping trust
c29s2.m1.bot.mgccc(config-if-range)#no keepalive
c29s2.m1.bot.mgccc(config-if-range)#end
c29s2.m1.bot
 << .mgccc#
 << 
Aug  3 09:11:34: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s2.m1.bot.mgccc#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s2.m1.bot.mgccc(config)#
Expect: matched string 1: (config)#
 >> default interface range gi1/0/49 - 52 

 >> interface range gi1/0/49 - 52 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi1/0/49 - 52 
c29s2.m1.bot.mgccc(config)#interface range gi1/0/49 - 52 
c29s2.m1.bot.mgccc(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport mode trunk

 >> switchport trunk native vlan 92

 >> ip dhcp snooping trust

 >> no keepalive

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport mode trunk
c29s2.m1.bot.mgccc(config-if-range)#switchport trunk native vlan 92
c29s2.m1.bot.mgccc(config-if-range)#ip dhcp snooping trust
c29s2.m1.bot.mgccc(config-if-range)#no keepalive
c29s2.m1.bot.mgccc(config-if-range)#end
c29s2.m1.bot
 << .mgccc#
 << 
Aug  3 09:11:40: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> write mem

Expect: searching for 2 strs:  :# :>
 << 
c29s2.m1.bot.mgccc#write mem
Building configuration...
[OK]
c29s2.m1.bot.mgccc#
Expect: matched string 1: #
 >> 
Expect: searching for 2 strs:  :# :>
 << 
c29s2.m1.bot.mgccc#
c29s2.m1.bot.mgccc#
Expect: matched string 1: #
 >> sh run

Expect: searching for 2 strs:  :# :>
 << sh run
Building configuration...

Current configuration : 19031 bytes
!
! Last configuration change at 09:11:40 CDT Wed Aug 3 2016
! NVRAM config last updated at 09:11:42 CDT Wed Aug 3 2016
!
version 15.2
no service pad
service timestamps debug 
 << datetime localtime
service timestamps log datetime localtime
service password-encryption
!
hostname c29s2.m1.bot.mgccc
!
boot-start-marker
boot-end-marker
!
enable secret 5 $1$rSvM$SJxnHqtOYZavE/wajsSZp1
enable password 7 052A140A201142430E
!

 << username root privilege 15 secret 5 $1$UnDJ$zZMRrs0u1JkycCRLgQblr0
no aaa new-model
clock timezone CST -6 0
clock summer-time CDT recurring
switch 1 provision ws-c2960x-48ts-l
!
!
ip dhcp snooping vlan 122
ip dhcp snooping
ip domain-name mgmt.mss
 << tate.edu
ip name-server 130.18.80.12
!
!
!
!
!
authentication mac-move permit
!
!
crypto pki trustpoint TP-self-signed-2494998912
 enrollment selfsigned
 subject-name cn=IOS-Self-Signed-Certificate-2494998912
 revocation-check none
 rsakeypa
 << ir TP-self-signed-2494998912
!
!
crypto pki certificate chain TP-self-signed-2494998912
 certificate self-signed 01
  	quit
!
spanning-tree mode pvst
spanning-tree portfast bpduguard default
spanning-tree extend system-id
no spanning-tree vlan 2
 << -91,93-237,240-242,244,246,248,251-252,256,359,500,502
no spanning-tree vlan 505,509,511-515,520,522,551-560,562-570,601-603,605-606
no spanning-tree vlan 610,629-630,632-633,635-637,654,674-676,701,741-742,800
no spanning-tree vlan 801-805,807,880,901
 << -904,908,910-913,915-916,926-930,970
no spanning-tree vlan 995-1000
spanning-tree vlan 1-1000 priority 57344
errdisable recovery cause udld
errdisable recovery cause bpduguard
errdisable recovery cause security-violation
errdisable recovery cause ch
 << annel-misconfig
errdisable recovery cause pagp-flap
errdisable recovery cause dtp-flap
errdisable recovery cause link-flap
errdisable recovery cause sfp-config-mismatch
errdisable recovery cause gbic-invalid
errdisable recovery cause psecure-violati
 << on
errdisable recovery cause port-mode-failure
errdisable recovery cause dhcp-rate-limit
errdisable recovery cause pppoe-ia-rate-limit
errdisable recovery cause mac-limit
errdisable recovery cause vmps
errdisable recovery cause storm-control
errdis
 << able recovery cause inline-power
errdisable recovery cause arp-inspection
errdisable recovery cause loopback
errdisable recovery cause small-frame
errdisable recovery cause psp
errdisable recovery interval 1800
!
!
!
!
vlan internal allocation p
 << olicy ascending
!
!
! 
!
!
!
!
!
!
!
!
interface FastEthernet0
 no ip address
 shutdown
!
interface GigabitEthernet1/0/1
 switchport trunk native vlan 92
 switchport mode trunk
 no keepalive
 ip dhcp snooping trust
!
interface Gigabi
 << tEthernet1/0/2
 switchport access vlan 122
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport 
 << port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/3
 switchport access vlan 122
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 s
 << witchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/4
 switchport access vlan 122
 switchport mode access
 switchport port-security maximum 2
 switchport port-security viol
 << ation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/5
 switchport access vlan 122
 switchport mode access
 switchp
 << ort port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/6
 sw
 << itchport access vlan 122
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spa
 << nning-tree portfast
!
interface GigabitEthernet1/0/7
 switchport access vlan 122
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-secu
 << rity aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/8
 switchport access vlan 122
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 sw
 << itchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/9
 switchport access vlan 122
 switchport mode access
 switchport port-security m
 << aximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/10
 switchport access vl
 << an 122
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfas
 << t
!
interface GigabitEthernet1/0/11
 switchport access vlan 122
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type i
 << nactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/12
 switchport access vlan 122
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-se
 << curity aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/13
 switchport access vlan 122
 switchport mode access
 switchport port-security maximum 2
 swit
 << chport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/14
 switchport access vlan 122
 switch
 << port mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface
 <<  GigabitEthernet1/0/15
 switchport access vlan 122
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 swi
 << tchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/16
 switchport access vlan 122
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging ti
 << me 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/17
 switchport access vlan 122
 switchport mode access
 switchport port-security maximum 2
 switchport port-sec
 << urity violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/18
 switchport access vlan 122
 switchport mode acces
 << s
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEtherne
 << t1/0/19
 switchport access vlan 122
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-se
 << curity
 spanning-tree portfast
!
interface GigabitEthernet1/0/20
 switchport access vlan 122
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchp
 << ort port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/21
 switchport access vlan 122
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation
 <<   protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/22
 switchport access vlan 122
 switchport mode access
 switchport 
 << port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/23
 switc
 << hport access vlan 122
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanni
 << ng-tree portfast
!
interface GigabitEthernet1/0/24
 switchport access vlan 122
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-securi
 << ty aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/25
 switchport access vlan 122
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 swi
 << tchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/26
 switchport access vlan 122
 switchport mode access
 switchport port-security m
 << aximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/27
 switchport access vl
 << an 122
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfas
 << t
!
interface GigabitEthernet1/0/28
 switchport access vlan 122
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type i
 << nactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/29
 switchport access vlan 122
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-se
 << curity aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/30
 switchport access vlan 122
 switchport mode access
 switchport port-security maximum 2
 swit
 << chport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/31
 switchport access vlan 122
 switch
 << port mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface
 <<  GigabitEthernet1/0/32
 switchport access vlan 122
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 swi
 << tchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/33
 switchport access vlan 122
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging ti
 << me 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/34
 switchport access vlan 122
 switchport mode access
 switchport port-security maximum 2
 switchport port-sec
 << urity violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/35
 switchport access vlan 122
 switchport mode acces
 << s
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEtherne
 << t1/0/36
 switchport access vlan 122
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-se
 << curity
 spanning-tree portfast
!
interface GigabitEthernet1/0/37
 switchport access vlan 122
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchp
 << ort port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/38
 switchport access vlan 122
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation
 <<   protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/39
 switchport access vlan 122
 switchport mode access
 switchport 
 << port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/40
 switc
 << hport access vlan 122
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanni
 << ng-tree portfast
!
interface GigabitEthernet1/0/41
 switchport access vlan 122
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-securi
 << ty aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/42
 switchport access vlan 122
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 swi
 << tchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/43
 switchport access vlan 122
 switchport mode access
 switchport port-security m
 << aximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/44
 switchport access vl
 << an 122
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfas
 << t
!
interface GigabitEthernet1/0/45
 switchport access vlan 122
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type i
 << nactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/46
 switchport access vlan 122
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-se
 << curity aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/47
 switchport access vlan 122
 switchport mode access
 switchport port-security maximum 2
 swit
 << chport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/48
 switchport access vlan 122
 switch
 << port mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface
 <<  GigabitEthernet1/0/49
 switchport trunk native vlan 92
 switchport mode trunk
 ip dhcp snooping trust
!
interface GigabitEthernet1/0/50
 switchport trunk native vlan 92
 switchport mode trunk
 ip dhcp snooping trust
!
interface GigabitEthernet1
 << /0/51
 switchport trunk native vlan 92
 switchport mode trunk
 ip dhcp snooping trust
!
interface GigabitEthernet1/0/52
 switchport trunk native vlan 92
 switchport mode trunk
 ip dhcp snooping trust
!
interface Vlan1
 no ip address
 no ip rou
 << te-cache
 shutdown
!
interface Vlan92
 ip address 10.17.9.12 255.255.0.0
 ip broadcast-address 10.92.255.255
!
ip default-gateway 10.92.0.1
no ip http server
no ip http secure-server
!
!
logging facility local1
logging host 130.18.8.12
acces
 << s-list 1 permit 130.18.92.0 0.0.3.255
access-list 1 permit 10.92.0.0 0.0.255.255
access-list 1 permit 130.18.8.0 0.0.0.255
!
snmp-server community sysnet RO 1
snmp-server community c2-b2=a2 RW 1
snmp-server enable traps snmp authentication linkdown 
 << linkup coldstart warmstart
snmp-server enable traps transceiver all
snmp-server enable traps tty
snmp-server enable traps cluster
snmp-server enable traps config-copy
snmp-server enable traps config
snmp-server enable traps config-ctid
snmp-server 
 << enable traps entity
snmp-server enable traps power-ethernet police
snmp-server enable traps cpu threshold
snmp-server enable traps bridge newroot topologychange
snmp-server enable traps stpx inconsistency root-inconsistency loop-inconsistency
snmp-se
 << rver enable traps syslog
snmp-server enable traps vtp
snmp-server enable traps vlancreate
snmp-server enable traps vlandelete
snmp-server enable traps flash insertion removal
snmp-server enable traps port-security
snmp-server enable traps envmon fan
 <<  shutdown supply temperature status
snmp-server enable traps errdisable
snmp-server enable traps mac-notification change move threshold
snmp-server enable traps vlan-membership
snmp-server host 130.18.8.12 sysnet 
!
!
line con 0
line vty 0 4
 pas
 << sword 7 047A19030E7C40041E
 login
line vty 5 15
 password 7 1436000E0D59266133
 login
!
ntp server 10.92.0.5
end

c29s2.m1.bot.mgccc#
Expect: matched string 1: #
 >> show interface status

Expect: searching for 2 strs:  :# :>
 << show interface status

Port      Name               Status       Vlan       Duplex  Speed Type 
Gi1/0/1                      notconnect   1            auto   auto 10/100/1000BaseTX
Gi1/0/2                      notconnect   122          auto   auto 10/
 << 100/1000BaseTX
Gi1/0/3                      notconnect   122          auto   auto 10/100/1000BaseTX
Gi1/0/4                      notconnect   122          auto   auto 10/100/1000BaseTX
Gi1/0/5                      notconnect   122          auto   auto 
 << 10/100/1000BaseTX
Gi1/0/6                      notconnect   122          auto   auto 10/100/1000BaseTX
Gi1/0/7                      notconnect   122          auto   auto 10/100/1000BaseTX
Gi1/0/8                      notconnect   122          auto   au
 << to 10/100/1000BaseTX
Gi1/0/9                      notconnect   122          auto   auto 10/100/1000BaseTX
Gi1/0/10                     notconnect   122          auto   auto 10/100/1000BaseTX
Gi1/0/11                     notconnect   122          auto  
 <<  auto 10/100/1000BaseTX
Gi1/0/12                     notconnect   122          auto   auto 10/100/1000BaseTX
Gi1/0/13                     notconnect   122          auto   auto 10/100/1000BaseTX
Gi1/0/14                     notconnect   122          aut
 << o   auto 10/100/1000BaseTX
Gi1/0/15                     notconnect   122          auto   auto 10/100/1000BaseTX
Gi1/0/16                     notconnect   122          auto   auto 10/100/1000BaseTX
Gi1/0/17                     notconnect   122          
 << auto   auto 10/100/1000BaseTX
Gi1/0/18                     notconnect   122          auto   auto 10/100/1000BaseTX
Gi1/0/19                     notconnect   122          auto   auto 10/100/1000BaseTX
Gi1/0/20                     notconnect   122       
 <<    auto   auto 10/100/1000BaseTX
Gi1/0/21                     notconnect   122          auto   auto 10/100/1000BaseTX
Gi1/0/22                     notconnect   122          auto   auto 10/100/1000BaseTX
Gi1/0/23                     notconnect   122    
 <<       auto   auto 10/100/1000BaseTX
Gi1/0/24                     notconnect   122          auto   auto 10/100/1000BaseTX
Gi1/0/25                     notconnect   122          auto   auto 10/100/1000BaseTX
Gi1/0/26                     notconnect   122 
 <<          auto   auto 10/100/1000BaseTX
Gi1/0/27                     notconnect   122          auto   auto 10/100/1000BaseTX
Gi1/0/28                     notconnect   122          auto   auto 10/100/1000BaseTX
Gi1/0/29                     notconnect   1
 << 22          auto   auto 10/100/1000BaseTX
Gi1/0/30                     notconnect   122          auto   auto 10/100/1000BaseTX
Gi1/0/31                     notconnect   122          auto   auto 10/100/1000BaseTX
Gi1/0/32                     notconnect 
 <<   122          auto   auto 10/100/1000BaseTX
Gi1/0/33                     notconnect   122          auto   auto 10/100/1000BaseTX
Gi1/0/34                     notconnect   122          auto   auto 10/100/1000BaseTX
Gi1/0/35                     notconne
 << ct   122          auto   auto 10/100/1000BaseTX
Gi1/0/36                     notconnect   122          auto   auto 10/100/1000BaseTX
Gi1/0/37                     notconnect   122          auto   auto 10/100/1000BaseTX
Gi1/0/38                     notco
 << nnect   122          auto   auto 10/100/1000BaseTX
Gi1/0/39                     notconnect   122          auto   auto 10/100/1000BaseTX
Gi1/0/40                     notconnect   122          auto   auto 10/100/1000BaseTX
Gi1/0/41                     no
 << tconnect   122          auto   auto 10/100/1000BaseTX
Gi1/0/42                     notconnect   122          auto   auto 10/100/1000BaseTX
Gi1/0/43                     notconnect   122          auto   auto 10/100/1000BaseTX
Gi1/0/44                    
 <<  notconnect   122          auto   auto 10/100/1000BaseTX
Gi1/0/45                     notconnect   122          auto   auto 10/100/1000BaseTX
Gi1/0/46                     notconnect   122          auto   auto 10/100/1000BaseTX
Gi1/0/47                 
 <<     notconnect   122          auto   auto 10/100/1000BaseTX
Gi1/0/48                     notconnect   122          auto   auto 10/100/1000BaseTX
Gi1/0/49                     notconnect   1            auto   auto Not Present
Gi1/0/50                    
 <<  notconnect   1            auto   auto Not Present
Gi1/0/51                     notconnect   1            auto   auto Not Present
Gi1/0/52                     notconnect   1            auto   auto Not Present
Fa0                          disabled     r
 << outed       auto   auto 10/100BaseTX
c29s2.m1.bot.mgccc#
Expect: matched string 1: #
