trying to use serial port: /dev/ttyUSB1
 >> 
 >> 

Expect: searching for 4 strs:  :[yes/no] :Press RETURN to get started. :# :Switch>
 << 
c29s1p.r122.cav#
c29s1p.r122.cav#
c29s1p.r122.cav#
c29s1p.r122.cav#
Expect: matched string 3: #
 >> term len 0

Expect: searching for 2 strs:  :# :>
 << term len 0
c29s1p.r122.cav#
Expect: matched string 1: #
 >> show version

Expect: searching for 2 strs:  :# :>
 << show version
Cisco IOS Software, C2960X Software (C2960X-UNIVERSALK9-M), Version 15.2(2)E3, RELEASE SOFTWARE (fc3)
Technical Support: http://www.cisco.com/techsupport
Copyright (c) 1986-2015 by Cisco Systems, Inc.
Compiled Wed 26-Aug-15 07:12 by prod_
 << rel_team

ROM: Bootstrap program is C2960X boot loader
BOOTLDR: C2960X Boot Loader (C2960X-HBOOT-M) Version 15.2(3r)E1, RELEASE SOFTWARE (fc1)

c29s1p.r122.cav uptime is 3 hours, 42 minutes
System returned to ROM by power-on
System restarted at 10:
 << 04:50 CDT Wed Aug 10 2016
System image file is "flash:/c2960x-universalk9-mz.152-2.E3/c2960x-universalk9-mz.152-2.E3.bin"
Last reload reason: Reload command



This product contains cryptographic features and is subject to United
States and local c
 << ountry laws governing import, export, transfer and
use. Delivery of Cisco cryptographic products does not imply
third-party authority to import, export, distribute or use encryption.
Importers, exporters, distributors and users are responsible for
com
 << pliance with U.S. and local country laws. By using this product you
agree to comply with applicable laws and regulations. If you are unable
to comply with U.S. and local laws, return this product immediately.

A summary of U.S. laws governing Cisco cr
 << yptographic products may be found at:
http://www.cisco.com/wwl/export/crypto/tool/stqrg.html

If you require further assistance please contact us by sending email to
export@cisco.com.

cisco WS-C2960X-48FPD-L (APM86XXX) processor (revision M0) with 
 << 524288K bytes of memory.
Processor board ID FCW2009A1QZ
Last reset from power-on
2 Virtual Ethernet interfaces
1 FastEthernet interface
50 Gigabit Ethernet interfaces
2 Ten Gigabit Ethernet interfaces
The password-recovery mechanism is enabled.


 << 512K bytes of flash-simulated non-volatile configuration memory.
Base ethernet MAC Address       : 00:CA:E5:4D:1A:00
Motherboard assembly number     : 73-16686-04
Power supply part number        : 341-0527-01
Motherboard serial number       : FOC20087
 << 2LF
Power supply serial number      : DCB2006600W
Model revision number           : M0
Motherboard revision number     : B0
Model number                    : WS-C2960X-48FPD-L
Daughterboard assembly number   : 73-14200-03
Daughterboard serial number
 <<      : FOC2009126K
System serial number            : FCW2009A1QZ
Top Assembly Part Number        : 68-100463-01
Top Assembly Revision Number    : B0
Version ID                      : V05
CLEI Code Number                : CMMLJ00ARD
Daughterboard rev
 << ision number   : A0
Hardware Board Revision Number  : 0x18


Switch Ports Model                     SW Version            SW Image                 
------ ----- -----                     ----------            ----------               
*    1 52    W
 << S-C2960X-48FPD-L         15.2(2)E3             C2960X-UNIVERSALK9-M     


Configuration register is 0xF

c29s1p.r122.cav#
Expect: matched string 1: #
 >> enable

Expect: searching for 2 strs:  :Password: :#
 << enable
c29s1p.r122.cav#
Expect: matched string 2: #
 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.r122.cav(config)#
Expect: matched string 1: (config)#
 >> no service pad

 >> service timestamps debug datetime localtime

 >> service timestamps log datetime localtime

 >> service password-encryption

 >> boot-start-marker

 >> boot-end-marker

 >> enable secret Area=l*w

 >> enable password Area=l*w

 >> no aaa new-model

 >> clock timezone CST -6 0

 >> clock summer-time CDT recurring

 >> authentication mac-move permit

 >> ip domain-name mgmt.msstate.edu

 >> ip name-server 130.18.80.12

 >> vtp domain vtp01.mgmt.msstate.edu

 >> vtp mode client

 >> crypto pki trustpoint TP-self-signed-2494998912

 >>  enrollment selfsigned

 >>  subject-name cn=IOS-Self-Signed-Certificate-2494998912

 >>  revocation-check none

 >>  rsakeypair TP-self-signed-2494998912

 >> crypto pki certificate chain TP-self-signed-2494998912

 >>  certificate self-signed 01 nvram:IOS-Self-Sig#3232.cer

 >> spanning-tree portfast bpduguard default

 >> spanning-tree extend system-id

 >> vlan internal allocation policy ascending

 >> errdisable recovery cause all

 >> errdisable recovery interval 1800

 >> interface FastEthernet0

 >>  no ip address

 >>  shutdown

 >> interface Vlan1

 >>  no ip address

 >>  no ip route-cache

 >>  shutdown

 >> interface Vlan92

 >> no ip http server

 >> no ip http secure-server

 >> logging facility local1

 >> logging host 130.18.8.12

 >> access-list 1 permit 130.18.92.0 0.0.3.255

 >> access-list 1 permit 10.92.0.0 0.0.255.255

 >> access-list 1 permit 130.18.8.0 0.0.0.255

 >> snmp-server community sysnet RO 1

 >> snmp-server community c2-b2=a2 RW 1

 >> snmp-server enable traps snmp authentication linkdown linkup coldstart warmstart

 >> snmp-server enable traps transceiver all

 >> snmp-server enable traps tty

 >> snmp-server enable traps cluster

 >> snmp-server enable traps config-copy

 >> snmp-server enable traps config

 >> snmp-server enable traps config-ctid

 >> snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-auth-fail-vlan no-guest-vlan

 >> snmp-server enable traps entity

 >> snmp-server enable traps power-ethernet police

 >> snmp-server enable traps cpu threshold

 >> snmp-server enable traps rep

 >> snmp-server enable traps bridge newroot topologychange

 >> snmp-server enable traps stpx inconsistency root-inconsistency loop-inconsistency

 >> snmp-server enable traps syslog

 >> snmp-server enable traps vtp

 >> snmp-server enable traps vlancreate

 >> snmp-server enable traps vlandelete

 >> snmp-server enable traps flash insertion removal

 >> snmp-server enable traps port-security

 >> snmp-server enable traps envmon fan shutdown supply temperature status

 >> snmp-server enable traps errdisable

 >> snmp-server enable traps mac-notification change move threshold

 >> snmp-server enable traps vlan-membership

 >> snmp-server host 130.18.8.12 sysnet 

 >> line con 0

 >> line vty 0 4

 >>  password Area=l*w

 >>  login

 >> line vty 5 15

 >>  password Area=l*w

 >>  login

 >> ntp server 10.92.0.5

 >> username root privilege 15 secret Area=l*w

 >> end

Expect: searching for 1 strs:  :Configured
 << no service pad
c29s1p.r122.cav(config)#service timestamps debug datetime localtime
c29s1p.r122.cav(config)#service timestamps log datetime localtime
c29s1p.r122.cav(config)#service password-encryption
c29s1p.r122.cav(config)#boot-start-marker
c29s1p.
 << r122.cav(config)#boot-end-marker
c29s1p.r122.cav(config)#enable secret Area=l*w
The enable secret you have chosen is the same as your enable password.
This is not recommended.  Re-enter the enable secret.

c29s1p.r122.cav(config)#enable password Area
 << =l*w
The enable password you have chosen is the same as your enable secret.
This is not recommended.  Re-enter the enable password.

c29s1p.r122.cav(config)#no aaa new-model
c29s1p.r122.cav(config)#clock timezone CST -6 0
c29s1p.r122.cav(config)#clo
 << ck summer-time CDT recurring
c29s1p.r122.cav(config)#authentication mac-move permit
c29s1p.r122.cav(config)#ip domain-name mgmt.msstate.edu
c29s1p.r122.cav(config)#ip name-server 130.18.80.12
c29s1p.r122.cav(config)#vtp domain vtp01.mgmt.msstate.edu

 << Domain name already set to vtp01.mgmt.msstate.edu.
c29s1p.r122.cav(config)#vtp mode client
Device mode already VTP Client for VLANS.
c29s1p.r122.cav(config)#crypto pki trustpoint TP-self-signed-2494998912
c29s1p.r122.cav(ca-trustpoint)# enrollment sel
 << fsigned
c29s1p.r122.cav(ca-trustpoint)# subject-name cn=IOS-Self-Signed-Certificate-2$me cn=IOS-Self-Signed-Certificate-24         94998912
c29s1p.r122.cav(ca-trustpoint)# revocation-check none
c29
 << s1p.r122.cav(ca-trustpoint)# rsakeypair TP-self-signed-2494998912
c29s1p.r122.cav(ca-trustpoint)#crypto pki certificate chain TP-self-signed-24$certificate chain TP-self-signed-249         4998912
c
 << 29s1p.r122.cav(config-cert-chain)# certificate self-signed 01 nvram:IOS-Self$e self-signed 01 nvram:IOS-Self-         Sig#3232.ned 01 nvram:IOS-Self-Sig#3232.c    
 <<      er
c29s1p.r122.cav(config-cert-chain)#spanning-tree portfast bpduguard default
c29s1p.r122.cav(config)#spanning-tree extend system-id
c29s1p.r122.cav(config)#vlan internal allocation policy ascending
c29s1p.r122.cav(config)#errdisable re
 << covery cause all
c29s1p.r122.cav(config)#errdisable recovery interval 1800
c29s1p.r122.cav(config)#
Aug 10 13:47:58: % Multiple self signed certificates in config
    certificate for trust point TP-self-signed-2494998912 ignored
interface FastEtherne
 << t0
c29s1p.r122.cav(config-if)# no ip address
c29s1p.r122.cav(config-if)# shutdown
c29s1p.r122.cav(config-if)#interface Vlan1
c29s1p.r122.cav(config-if)# no ip address
c29s1p.r122.cav(config-if)# no ip route-cache
c29s1p.r122.cav(config-if)# shutdown
 << 
c29s1p.r122.cav(config-if)#interface Vlan92
c29s1p.r122.cav(config-if)#no ip http server
c29s1p.r122.cav(config)#no ip http secure-server
c29s1p.r122.cav(config)#logging facility local1
c29s1p.r122.cav(config)#logging host 130.18.8.12
c29s1p.r122.c
 << av(config)#access-list 1 permit 130.18.92.0 0.0.3.255
c29s1p.r122.cav(config)#access-list 1 permit 10.92.0.0 0.0.255.255
c29s1p.r122.cav(config)#access-list 1 permit 130.18.8.0 0.0.0.255
c29s1p.r122.cav(config)#snmp-server community sysnet RO 1
c29s1p
 << .r122.cav(config)#snmp-server community c2-b2=a2 RW 1
c29s1p.r122.cav(config)#snmp-server enable traps snmp authentication linkdown$ enable traps snmp authentication linkdown          linkup c
 << oaps snmp authentication linkdown linkup col         dstart wauthentication linkdown linkup coldstart war         mstart
c29s1p.r122
 << .cav(config)#snmp-server enable traps transceiver all
c29s1p.r122.cav(config)#snmp-server enable traps tty
c29s1p.r122.cav(config)#snmp-server enable traps cluster
c29s1p.r122.cav(config)#snmp-server enable traps config-copy
c29s1p.r122.cav(config)#sn
 << mp-server enable traps config
c29s1p.r122.cav(config)#snmp-server enable traps config-ctid
c29s1p.r122.cav(config)#snmp-server enable traps dot1x auth-fail-vlan guest-v$ enable traps dot1x auth-fail-v
 << lan guest-vl         an no-autaps dot1x auth-fail-vlan guest-vlan no-auth         -fail-vlauth-fail-vlan guest-vlan no-auth-fail-vlan 
 <<          no-guestvlan guest-vlan no-auth-fail-vlan no-guest-         vlan
snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-auth-fail-vlan no-gu                         ^est-
 << vlan

% Invalid input detected at '^' marker.

c29s1p.r122.cav(config)#snmp-server enable traps entity
c29s1p.r122.cav(config)#snmp-server enable traps power-ethernet police
c29s1p.r122.cav(config)#snmp-server enable traps cpu threshold
c29s1p.r122
 << .cav(config)#snmp-server enable traps rep
                                                 ^
% Invalid input detected at '^' marker.

c29s1p.r122.cav(config)#snmp-server enable traps bridge newroot topologychang
 << $ enable traps bridge newroot topologychange         
c29s1p.r122.cav(config)#snmp-server enable traps stpx inconsistency root-inco$ enable traps stpx inconsistency root-incon    
 <<      sistency aps stpx inconsistency root-inconsistency l         oop-inconnconsistency root-inconsistency loop-incons         
 << istency
c29s1p.r122.cav(config)#snmp-server enable traps syslog
c29s1p.r122.cav(config)#snmp-server enable traps vtp
c29s1p.r122.cav(config)#snmp-server enable traps vlancreate
c29s1p.r122.cav(config)#snmp-server enable traps vlandelete
c29s1p.r12
 << 2.cav(config)#snmp-server enable traps flash insertion removal
c29s1p.r122.cav(config)#snmp-server enable traps port-security
c29s1p.r122.cav(config)#snmp-server enable traps envmon fan shutdown supply t
 << $ enable traps envmon fan shutdown supply te         mperatureaps envmon fan shutdown supply temperature          status
c29s1p.r122.cav(config)#snmp-server enable traps errdisable
 << 
c29s1p.r122.cav(config)#snmp-server enable traps mac-notification change move$ enable traps mac-notification change move          threshold
c29s1p.r122.cav(config)#snmp-server enable traps vl
 << an-membership
c29s1p.r122.cav(config)#snmp-server host 130.18.8.12 sysnet 
c29s1p.r122.cav(config)#line con 0
c29s1p.r122.cav(config-line)#line vty 0 4
c29s1p.r122.cav(config-line)# password Area=l*w
c29s1p.r122.cav(config-line)# login
c29s1p.r122.c
 << av(config-line)#line vty 5 15
c29s1p.r122.cav(config-line)# password Area=l*w
c29s1p.r122.cav(config-line)# login
c29s1p.r122.cav(config-line)#ntp server 10.92.0.5
c29s1p.r122.cav(config)#username root privilege 15 secret Area=l*w
c29s1p.r122.cav(con
 << fig)#end
c29s1p.r122.cav#
 << 
Aug 10 13:48:10: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.r122.cav#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.r122.cav(config)#
Expect: matched string 1: (config)#
 >> spanning-tree mode mst

 >> spanning-tree etherchannel guard misconfig

 >> spanning-tree mst configuration

 >>  name msstate

 >>  revision 1

 >>  instance 1 vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 63, 70

 >>  instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 160

 >>  instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 230, 232, 242, 246

 >>  instance 1 vlan 256, 611-612, 654, 741, 996, 999

 >>  instance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037, 2039-2040

 >>  instance 2 vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096, 2104, 2110, 2126

 >>  instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 2189, 2194, 2202

 >>  instance 2 vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 2654, 2999

 >>  instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176, 196

 >>  instance 3 vlan 244, 248, 927

 >>  instance 4 vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072, 2108, 2113, 2128

 >>  instance 4 vlan 2144, 2176, 2196, 2244, 2248, 2927

 >>  instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 228

 >>  instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216, 2228

 >>  instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116, 124

 >>  instance 7 vlan 172, 186, 192, 204-208, 210, 240-241, 251-252, 630, 928

 >>  instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082, 2084

 >>  instance 8 vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208, 2210

 >>  instance 8 vlan 2240-2241, 2251-2252, 2630, 2928

 >>  instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102, 112

 >>  instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 500, 505, 510-511

 >>  instance 9 vlan 522, 551-570, 603, 629, 633, 742, 802, 926, 929

 >>  instance 10 vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 2057, 2062, 2068

 >>  instance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148, 2158

 >>  instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522, 2603, 2629, 2633

 >>  instance 10 vlan 2802, 2926, 2929

 >>  instance 11 vlan 8, 43, 52, 146, 156-157, 180, 200, 218

 >>  instance 12 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180, 2200, 2218

 >> 

 >> end

Expect: searching for 1 strs:  :Configured
 << spanning-tree mode mst
c29s1p.r122.cav(config)#spanning-tree etherchannel guard misconfig
c29s1p.r122.cav(config)#spanning-tree mst configuration
c29s1p.r122.cav(config-mst)# name msstate
c29s1p.r122.cav(config-mst)# revision 1
c29s1p.r122.cav(config
 << -mst)# instance 1 vlan 2, 7, 11, 20, 22, 24, 31, 35, 37$ vlan 2, 7, 11, 20, 22, 24, 31, 35, 37,          39-40, 5, 11, 20, 22, 24, 31, 35, 37, 39-40,
 <<  50         , 60, 63,22, 24, 31, 35, 37, 39-40, 50, 60, 63,          70
c29s1p.r122.cav(config-mst)# instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 12
 << $ vlan 78, 80, 86, 91, 96, 104, 110, 126         , 136, 1480, 86, 91, 96, 104, 110, 126, 136, 140         , 152, 16, 96, 104, 110, 
 << 126, 136, 140, 152, 160         
c29s1p.r122.cav(config-mst)# instance 1 vlan 162-163, 168, 189, 194, 202, 220$ vlan 162-163, 168, 189, 194, 202, 220,          222, 230
 << 163, 168, 189, 194, 202, 220, 222, 230,          232, 24289, 194, 202, 220, 222, 230, 232, 242,          246
c29s1p.r122.cav(config-mst)# instance 1 vlan 256, 6
 << 11-612, 654, 741, 996, 999
c29s1p.r122.cav(config-mst)# instance 2 vlan 2002, 2007, 2011, 2020, 2022, 20$ vlan 2002, 2007, 2011, 2020, 2022, 202         4, 2031, 
 << , 2007, 2011, 2020, 2022, 2024, 2031, 2         035, 203711, 2020, 2022, 2024, 2031, 2035, 2037,          2039-2042022, 2024, 2
 << 031, 2035, 2037, 2039-2040         
c29s1p.r122.cav(config-mst)# instance 2 vlan 2050, 2060, 2063, 2070, 2080, 20$ vlan 2050, 2060, 2063, 2070, 2080, 208         6, 2096, 
 << , 2060, 2063, 2070, 2080, 2086, 2096, 2         104, 211063, 2070, 2080, 2086, 2096, 2104, 2110,          2126
c29s1p.r122.cav(config-mst)# instance 2 vlan 
 << 2136, 2140, 2152, 2160, 2162-216$ vlan 2136, 2140, 2152, 2160, 2162-2163         , 2168, 2, 2140, 2152, 2160, 2162-2163, 2168, 21         89
 << , 2194,52, 2160, 2162-2163, 2168, 2189, 2194,          2202
c29s1p.r122.cav(config-mst)# instance 2 vlan 2220, 2222, 2232, 2242, 2246, 26$ vlan 2220
 << , 2222, 2232, 2242, 2246, 261         1-2612, 2, 2222, 2232, 2242, 2246, 2611-2612, 26         54, 2999
c29s1p.r122.cav(config-mst)# instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108,
 << $ vlan 42, 51, 59, 64, 66, 69, 72, 108,          113, 128,51, 59, 64, 66, 69, 72, 108, 113, 128,          144, 176,
 << , 66, 69, 72, 108, 113, 128, 144, 176,          196
c29s1p.r122.cav(config-mst)# instance 3 vlan 244, 248, 927
c29s1p.r122.cav(config-mst)# instance 4 vlan 2042, 2051, 2059, 2064, 2066, 20
 << $ vlan 2042, 2051, 2059, 2064, 2066, 206         9, 2072, , 2051, 2059, 2064, 2066, 2069, 2072, 2         108, 211359, 2064, 2066, 2
 << 069, 2072, 2108, 2113,          2128
c29s1p.r122.cav(config-mst)# instance 4 vlan 2144, 2176, 2196, 2244, 2248, 29$ vlan 2144, 2176, 2196, 2244, 2248, 292         7
c29s1p.r122.cav(confi
 << g-mst)# instance 5 vlan 16, 48, 58, 88, 121, 131, 133-13$ vlan 16, 48, 58, 88, 121, 131, 133-134         , 216, 2248, 58, 88, 121, 131, 133-134, 216,
 <<  228         
c29s1p.r122.cav(config-mst)# instance 6 vlan 2016, 2048, 2058, 2088, 2121, 21$ vlan 2016, 2048, 2058, 2088, 2121, 213         1, 2133-2
 << , 2048, 2058, 2088, 2121, 2131, 2133-21         34, 2216,58, 2088, 2121, 2131, 2133-2134, 2216,          2228
c29s1p.r122.cav(config-mst)# instance 7 vlan 9, 33-34, 38, 54, 56, 7
 << 1, 75, 82$ vlan 9, 33-34, 38, 54, 56, 71, 75, 82,          84, 97, 3-34, 38, 54, 56, 71, 75, 82, 84, 97, 1         14, 116, 
 << 54, 56, 71, 75, 82, 84, 97, 114, 116, 1         24
c29s1p.r122.cav(config-mst)# instance 7 vlan 172, 186, 192, 204-208, 210, 240$ vlan 172, 186, 192, 204-208, 210, 
 << 240-         241, 251-186, 192, 204-208, 210, 240-241, 251-2         52, 630, 204-208, 210, 240-241, 251-252, 630, 9         28
c29s1
 << p.r122.cav(config-mst)# instance 8 vlan 2009, 2033-2034, 2038, 2054, 205$ vlan 2009, 2033-2034, 2038, 2054, 2056         , 2071, 2, 2033-2034, 2038, 
 << 2054, 2056, 2071, 20         75, 2082,4, 2038, 2054, 2056, 2071, 2075, 2082,          2084
c29s1p.r122.cav(config-mst)# instance 8 vlan 2097, 2114, 2116, 2124, 2172, 21
 << $ vlan 2097, 2114, 2116, 2124, 2172, 218         6, 2192, , 2114, 2116, 2124, 2172, 2186, 2192, 2         204-2208,
 << 16, 2124, 2172, 2186, 2192, 2204-2208,          2210
c29s1p.r122.cav(config-mst)# instance 8 vlan 2240-2241, 2251-2252, 2630, 2928
c29s1p.r122.cav(config-mst)# instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 
 << $ vlan 4-5, 12, 18-19, 32, 44, 57, 62, 6         8, 76, 9812, 18-19, 32, 44, 57, 62, 68, 76, 98-         99, 102, , 32, 44, 57
 << , 62, 68, 76, 98-99, 102, 1         12
c29s1p.r122.cav(config-mst)# instance 9 vlan 130, 132, 147-148, 158, 212, 226$ vlan 130, 132, 147-148, 158, 212, 226,          236, 500
 << 132, 147-148, 158, 212, 226, 236, 500,          505, 510148, 158, 212, 226, 236, 500, 505, 510-         511
c29s1p.r122.cav(config-mst)# instance 9 vlan 5
 << 22, 551-570, 603, 629, 633, 742$ vlan 522, 551-570, 603, 629, 633, 742,          802, 926551-570, 603, 629, 633, 742, 802, 926,          929
 << 
c29s1p.r122.cav(config-mst)# instance 10 vlan 2004-2005, 2012, 2018-2019, 203$0 vlan 2004-2005, 2012, 2018-2019, 2032         , 2044, 24-2005, 2012,
 <<  2018-2019, 2032, 2044, 20         57, 2062,12, 2018-2019, 2032, 2044, 2057, 2062,          2068
c29s1p.r122.cav(config-mst)# instance 10 vlan 2076, 2098-2099, 2102, 2112, 21
 << $0 vlan 2076, 2098-2099, 2102, 2112, 213         0, 2132, 6, 2098-2099, 2102, 2112, 2130, 2132, 2         147-2148,
 << 99, 2102, 2112, 2130, 2132, 2147-2148,          2158
c29s1p.r122.cav(config-mst)# instance 10 vlan 2212, 2236, 2500, 2505, 2510-25$0 vlan 2212, 2236, 2500, 2505, 2510-251         
 << 1, 2522, 2, 2236, 2500, 2505, 2510-2511, 2522, 2         603, 2629500, 2505, 2510-2511, 2522, 2603, 2629,          2633
c29s1p.r122.cav(con
 << fig-mst)# instance 10 vlan 2802, 2926, 2929
c29s1p.r122.cav(config-mst)# instance 11 vlan 8, 43, 52, 146, 156-157, 180, 2$1 vlan 8, 43, 52, 146, 156-157, 180, 20         0, 218
c29s1p.r122.cav(co
 << nfig-mst)# instance 12 vlan 2008, 2043, 2052, 2146, 2156-21$2 vlan 2008, 2043, 2052, 2146, 2156-215         7, 2180, 8, 2043, 2052, 2146, 2156-2157, 
 << 2180, 2         200, 2218
c29s1p.r122.cav(config-mst)#
c29s1p.r122.cav(config-mst)#end
c29s1p.r122.cav#
 << 
Aug 10 13:48:28: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.r122.cav#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.r122.cav(config)#
Expect: matched string 1: (config)#
 >> hostname c29s1p.r122.cav 

Expect: searching for 2 strs:  :# :>
 << hostname c29s1p.r122.cav 
c29s1p.r122.cav(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s1p.r122.cav#
 << 
Aug 10 13:48:35: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.r122.cav#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.r122.cav(config)#
Expect: matched string 1: (config)#
 >> snmp-server contact 6F-2096

Expect: searching for 1 strs:  :#
 << snmp-server contact 6F-2096
c29s1p.r122.cav(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s1p.r122.cav#
 << 
Aug 10 13:48:41: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.r122.cav#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.r122.cav(config)#
Expect: matched string 1: (config)#
 >> interface vlan 92

Expect: searching for 1 strs:  :(config-if)#
 << interface vlan 92
c29s1p.r122.cav(config-if)#
Expect: matched string 1: (config-if)#
 >> ip address 10.92.5.137 255.255.0.0

 >> ip broadcast-address 10.92.255.255

 >> end

Expect: searching for 1 strs:  :Configured
 << ip address 10.92.5.137 255.255.0.0
c29s1p.r122.cav(config-if)#ip broadcast-address 10.92.255.255
c29s1p.r122.cav(config-if)#end
c29s1p.r122.cav#
 << 
Aug 10 13:48:47: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.r122.cav#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.r122.cav(config)#
Expect: matched string 1: (config)#
 >> interface Vlan92

Expect: searching for 1 strs:  :(config-if)#
 << interface Vlan92
c29s1p.r122.cav(config-if)#
Expect: matched string 1: (config-if)#
 >> ip default-gateway 10.92.0.1

 >> end

Expect: searching for 1 strs:  :Configured
 << ip default-gateway 10.92.0.1
c29s1p.r122.cav(config)#end
c29s1p.r122.cav#
Aug 10 13:48:53: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.r122.cav#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.r122.cav(config)#
Expect: matched string 1: (config)#
 >> ip dhcp snooping

Expect: searching for 1 strs:  :#
 << ip dhcp snooping
c29s1p.r122.cav(config)#
Expect: matched string 1: #
 >> ip dhcp snooping vlan 159

Expect: searching for 1 strs:  :#
 << ip dhcp snooping vlan 159
c29s1p.r122.cav(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s1p.r122.cav#
Aug 10 13:49:00: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.r122.cav#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.r122.cav(config)#
Expect: matched string 1: (config)#
 >> default interface range gi1/0/1 - 48 

 >> interface range gi1/0/1 - 48 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi1/0/1 - 48 

 << c29s1p.r122.cav(config)#interface range gi1/0/1 - 48 
c29s1p.r122.cav(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport access vlan 159

 >> switchport mode access

 >> spanning-tree portfast

 >> switchport port-security maximum 2

 >> switchport port-security

 >> switchport port-security aging time 15

 >> switchport port-security violation protect

 >> switchport port-security aging type inactivity

 >> power inline never

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport access vlan 159
c29s1p.r122.cav(config-if-range)#switchport mode access
c29s1p.r122.cav(config-if-range)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, concentrators, 
 << switches, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast will be configured in 48 interfaces due to the range command 
 but will only have effect when the interfaces are 
 << in a non-trunking mode.
c29s1p.r122.cav(config-if-range)#switchport port-security maximum 2
c29s1p.r122.cav(config-if-range)#switchport port-security
c29s1p.r122.cav(config-if-range)#switchport port-security aging time 15
c29s1p.r122.cav(config-if-ran
 << ge)#switchport port-security violation protect
c29s1p.r122.cav(config-if-range)#switchport port-security aging type inactivi$port-security aging type inactivit         y
c29s1p.r122.cav(config-if-rang
 << e)#power inline never
c29s1p.r122.cav(config-if-range)#end
c29s1p.r122.cav#
Aug 10 13:49:09: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.r122.cav#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.r122.cav(config)#
Expect: matched string 1: (config)#
 >> default interface range gi1/0/1 - 10 

 >> interface range gi1/0/1 - 10 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi1/0/1 - 10 
c29s1p.r122.cav(config)#interface range gi1/0/1 - 10 
c29s1p.r122.cav(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport access vlan 554

 >> switchport mode access

 >> spanning-tree portfast

 >> power inline consumption 15400

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport access vlan 554
c29s1p.r122.cav(config-if-range)#switchport mode access
c29s1p.r122.cav(config-if-range)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, concentrators, 
 << switches, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast will be configured in 10 interfaces due to the range command 
 but will only have effect when the interfaces are 
 << in a non-trunking mode.
c29s1p.r122.cav(config-if-range)#power inline consumption 15400
%CAUTION: Interface Gi1/0/1: Misconfiguring the 'power inline
 consumption/allocation' command may cause damage to the switch and void
 your warranty. Take precaut
 << ion not to oversubscribe the power supply.
 It is recommended to enable power policing if the switch supports it.
 Refer to documentation.

%CAUTION: Interface Gi1/0/2: Misconfiguring the 'power inline
 consumption/allocation' command may cause damag
 << e to the switch and void
 your warranty. Take precaution not to oversubscribe the power supply.
 It is recommended to enable power policing if the switch supports it.
 Refer to documentation.

%CAUTION: Interface Gi1/0/3: Misconfiguring the 'power in
 << line
 consumption/allocation' command may cause damage to the switch and void
 your warranty. Take precaution not to oversubscribe the power supply.
 It is recommended to enable power policing if the switch supports it.
 Refer to documentation.

%CA
 << UTION: Interface Gi1/0/4: Misconfiguring the 'power inline
 consumption/allocation' command may cause damage to the switch and void
 your warranty. Take precaution not to oversubscribe the power supply.
 It is recommended to enable power policing if th
 << e switch supports it.
 Refer to documentation.

%CAUTION: Interface Gi1/0/5: Misconfiguring the 'power inline
 consumption/allocation' command may cause damage to the switch and void
 your warranty. Take precaution not to oversubscribe the power supp
 << ly.
 It is recommended to enable power policing if the switch supports it.
 Refer to documentation.

%CAUTION: Interface Gi1/0/6: Misconfiguring the 'power inline
 consumption/allocation' command may cause damage to the switch and void
 your warrant
 << y. Take precaution not to oversubscribe the power supply.
 It is recommended to enable power policing if the switch supports it.
 Refer to documentation.

%CAUTION: Interface Gi1/0/7: Misconfiguring the 'power inline
 consumption/allocation' command 
 << may cause damage to the switch and void
 your warranty. Take precaution not to oversubscribe the power supply.
 It is recommended to enable power policing if the switch supports it.
 Refer to documentation.

%CAUTION: Interface Gi1/0/8: Misconfigurin
 << g the 'power inline
 consumption/allocation' command may cause damage to the switch and void
 your warranty. Take precaution not to oversubscribe the power supply.
 It is recommended to enable power policing if the switch supports it.
 Refer to docume
 << ntation.

%CAUTION: Interface Gi1/0/9: Misconfiguring the 'power inline
 consumption/allocation' command may cause damage to the switch and void
 your warranty. Take precaution not to oversubscribe the power supply.
 It is recommended to enable power
 <<  policing if the switch supports it.
 Refer to documentation.

%CAUTION: Interface Gi1/0/10: Misconfiguring the 'power inline
 consumption/allocation' command may cause damage to the switch and void
 your warranty. Take precaution not to oversubscrib
 << e the power supply.
 It is recommended to enable power policing if the switch supports it.
 Refer to documentation.

c29s1p.r122.cav(config-if-range)#end
c29s1p.r122.cav#
 << 
Aug 10 13:49:18: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.r122.cav#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.r122.cav(config)#
Expect: matched string 1: (config)#
 >> default interface range gi1/0/46 - 48 

 >> interface range gi1/0/46 - 48 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi1/0/46 - 48 
c29s1p.r122.cav(config)#interface range gi1/0/46 - 48 
c29s1p.r122.cav(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport mode trunk

 >> switchport trunk native vlan 92

 >> ip dhcp snooping trust

 >> no keepalive

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport mode trunk
c29s1p.r122.cav(config-if-range)#switchport trunk native vlan 92
c29s1p.r122.cav(config-if-range)#ip dhcp snooping trust
c29s1p.r122.cav(config-if-range)#no keepalive
c29s1p.r122.cav(config-if-range)#end
c29s1p.r122.cav#
 << 
Aug 10 13:49:25: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.r122.cav#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.r122.cav(config)#
Expect: matched string 1: (config)#
 >> default interface range te1/0/1 - 2 

 >> interface range te1/0/1 - 2 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range te1/0/1 - 2 
c29s1p.r122.cav(config)#interface range te1/0/1 - 2 
c29s1p.r122.cav(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport mode trunk

 >> switchport trunk native vlan 92

 >> ip dhcp snooping trust

 >> no keepalive

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport mode trunk
c29s1p.r122.cav(config-if-range)#switchport trunk native vlan 92
c29s1p.r122.cav(config-if-range)#ip dhcp snooping trust
c29s1p.r122.cav(config-if-range)#no keepalive
c29s1p.r122.cav(config-if-range)#end
c29s1p.r122.cav#
 << 
Aug 10 13:49:31: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.r122.cav#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.r122.cav(config)#
Expect: matched string 1: (config)#
 >> default interface range gi1/0/49 - 50 

 >> interface range gi1/0/49 - 50 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi1/0/49 - 50 
c29s1p.r122.cav(config)#interface range gi1/0/49 - 50 
c29s1p.r122.cav(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport mode trunk

 >> switchport trunk native vlan 92

 >> ip dhcp snooping trust

 >> no keepalive

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport mode trunk
c29s1p.r122.cav(config-if-range)#switchport trunk native vlan 92
c29s1p.r122.cav(config-if-range)#ip dhcp snooping trust
c29s1p.r122.cav(config-if-range)#no keepalive
c29s1p.r122.cav(config-if-range)#end
c29s1p.r122.cav#
 << 
Aug 10 13:49:37: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> write mem

Expect: searching for 2 strs:  :# :>
 << 
c29s1p.r122.cav#write mem
Building configuration...
[OK]
c29s1p.r122.cav#
Expect: matched string 1: #
 >> 
Expect: searching for 2 strs:  :# :>
 << 
c29s1p.r122.cav#
c29s1p.r122.cav#
Expect: matched string 1: #
 >> sh run

Expect: searching for 2 strs:  :# :>
 << sh run
Building configuration...

Current configuration : 19342 bytes
!
! Last configuration change at 13:49:37 CDT Wed Aug 10 2016
! NVRAM config last updated at 13:49:39 CDT Wed Aug 10 2016
!
version 15.2
no service pad
service timestamps debu
 << g datetime localtime
service timestamps log datetime localtime
service password-encryption
!
hostname c29s1p.r122.cav
!
boot-start-marker
boot-end-marker
!
enable secret 5 $1$AJh0$qdJal6CusKxQuA695..iN0
enable password 7 047A19030E7C40041E
!
u
 << sername root privilege 15 secret 5 $1$oH.q$9UmfIsJ1HuO5xjQ5fSIFc0
no aaa new-model
clock timezone CST -6 0
clock summer-time CDT recurring
switch 1 provision ws-c2960x-48fpd-l
!
!
ip dhcp snooping vlan 159
ip dhcp snooping
ip domain-name mgmt.mss
 << tate.edu
ip name-server 130.18.80.12
!
!
!
!
!
authentication mac-move permit
!
!
crypto pki trustpoint TP-self-signed-2494998912
 enrollment selfsigned
 subject-name cn=IOS-Self-Signed-Certificate-2494998912
 revocation-check none
 rsakeypa
 << ir TP-self-signed-2494998912
!
!
crypto pki certificate chain TP-self-signed-2494998912
 certificate self-signed 01
  	quit
!
spanning-tree mode mst
spanning-tree portfast bpduguard default
spanning-tree extend system-id
!
spanning-tree mst con
 << figuration
 name msstate
 revision 1
 instance 1 vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 63, 70
 instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 160
 instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 230, 232, 242
 << , 246
 instance 1 vlan 256, 611-612, 654, 741, 996, 999
 instance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037, 2039-2040
 instance 2 vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096, 2104, 2110, 2126
 instance 2 vlan 2136, 2140, 2152, 216
 << 0, 2162-2163, 2168, 2189, 2194, 2202
 instance 2 vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 2654, 2999
 instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176, 196
 instance 3 vlan 244, 248, 927
 instance 4 vlan 2042, 2051, 2059, 2064,
 <<  2066, 2069, 2072, 2108, 2113, 2128
 instance 4 vlan 2144, 2176, 2196, 2244, 2248, 2927
 instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 228
 instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216, 2228
 instance 7 vlan 9, 33-34, 
 << 38, 54, 56, 71, 75, 82, 84, 97, 114, 116, 124
 instance 7 vlan 172, 186, 192, 204-208, 210, 240-241, 251-252, 630, 928
 instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082, 2084
 instance 8 vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192,
 <<  2204-2208, 2210
 instance 8 vlan 2240-2241, 2251-2252, 2630, 2928
 instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102, 112
 instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 500, 505, 510-511
 instance 9 vlan 522, 551-570, 603, 6
 << 29, 633, 742, 802, 926, 929
 instance 10 vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 2057, 2062, 2068
 instance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148, 2158
 instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522, 2603, 2629, 263
 << 3
 instance 10 vlan 2802, 2926, 2929
 instance 11 vlan 8, 43, 52, 146, 156-157, 180, 200, 218
 instance 12 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180, 2200, 2218
!
errdisable recovery cause udld
errdisable recovery cause bpduguard
errdisable reco
 << very cause security-violation
errdisable recovery cause channel-misconfig
errdisable recovery cause pagp-flap
errdisable recovery cause dtp-flap
errdisable recovery cause link-flap
errdisable recovery cause sfp-config-mismatch
errdisable recovery ca
 << use gbic-invalid
errdisable recovery cause psecure-violation
errdisable recovery cause port-mode-failure
errdisable recovery cause dhcp-rate-limit
errdisable recovery cause pppoe-ia-rate-limit
errdisable recovery cause mac-limit
errdisable recovery 
 << cause vmps
errdisable recovery cause storm-control
errdisable recovery cause inline-power
errdisable recovery cause arp-inspection
errdisable recovery cause loopback
errdisable recovery cause small-frame
errdisable recovery cause psp
errdisable rec
 << overy interval 1800
!
!
!
!
vlan internal allocation policy ascending
!
!
! 
!
!
!
!
!
!
!
!
interface FastEthernet0
 no ip address
 shutdown
!
interface GigabitEthernet1/0/1
 switchport access vlan 554
 switchport mode access
 pow
 << er inline consumption 15400
 spanning-tree portfast
!
interface GigabitEthernet1/0/2
 switchport access vlan 554
 switchport mode access
 power inline consumption 15400
 spanning-tree portfast
!
interface GigabitEthernet1/0/3
 switchport access 
 << vlan 554
 switchport mode access
 power inline consumption 15400
 spanning-tree portfast
!
interface GigabitEthernet1/0/4
 switchport access vlan 554
 switchport mode access
 power inline consumption 15400
 spanning-tree portfast
!
interface Gi
 << gabitEthernet1/0/5
 switchport access vlan 554
 switchport mode access
 power inline consumption 15400
 spanning-tree portfast
!
interface GigabitEthernet1/0/6
 switchport access vlan 554
 switchport mode access
 power inline consumption 15400
 
 << spanning-tree portfast
!
interface GigabitEthernet1/0/7
 switchport access vlan 554
 switchport mode access
 power inline consumption 15400
 spanning-tree portfast
!
interface GigabitEthernet1/0/8
 switchport access vlan 554
 switchport mode acc
 << ess
 power inline consumption 15400
 spanning-tree portfast
!
interface GigabitEthernet1/0/9
 switchport access vlan 554
 switchport mode access
 power inline consumption 15400
 spanning-tree portfast
!
interface GigabitEthernet1/0/10
 switchpo
 << rt access vlan 554
 switchport mode access
 power inline consumption 15400
 spanning-tree portfast
!
interface GigabitEthernet1/0/11
 switchport access vlan 159
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 <<  violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/12
 switchport access vlan 159
 switc
 << hport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree 
 << portfast
!
interface GigabitEthernet1/0/13
 switchport access vlan 159
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging
 <<  type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/14
 switchport access vlan 159
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  
 << protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/15
 switchport access vlan 159
 switchport mode a
 << ccess
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
 << 
interface GigabitEthernet1/0/16
 switchport access vlan 159
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inacti
 << vity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/17
 switchport access vlan 159
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 sw
 << itchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/18
 switchport access vlan 159
 switchport mode access
 swit
 << chport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface G
 << igabitEthernet1/0/19
 switchport access vlan 159
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switc
 << hport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/20
 switchport access vlan 159
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport por
 << t-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/21
 switchport access vlan 159
 switchport mode access
 switchport port-
 << security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthern
 << et1/0/22
 switchport access vlan 159
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-s
 << ecurity
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/23
 switchport access vlan 159
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security a
 << ging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/24
 switchport access vlan 159
 switchport mode access
 switchport port-security max
 << imum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/25
 s
 << witchport access vlan 159
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 po
 << wer inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/26
 switchport access vlan 159
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 << 
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/27
 switchport access vlan 159
 switchport mode access
 switchport port-security maximum 2
 swi
 << tchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/28
 switchport ac
 << cess vlan 159
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline n
 << ever
 spanning-tree portfast
!
interface GigabitEthernet1/0/29
 switchport access vlan 159
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchpor
 << t port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/30
 switchport access vlan 159
 switchport mode access
 switchport port-security maximum 2
 switchport port
 << -security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/31
 switchport access vlan 15
 << 9
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spann
 << ing-tree portfast
!
interface GigabitEthernet1/0/32
 switchport access vlan 159
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-secur
 << ity aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/33
 switchport access vlan 159
 switchport mode access
 switchport port-security maximum 2
 switchport port-security vi
 << olation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/34
 switchport access vlan 159
 switchpo
 << rt mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree por
 << tfast
!
interface GigabitEthernet1/0/35
 switchport access vlan 159
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging ty
 << pe inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/36
 switchport access vlan 159
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  pro
 << tect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/37
 switchport access vlan 159
 switchport mode acce
 << ss
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
in
 << terface GigabitEthernet1/0/38
 switchport access vlan 159
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivit
 << y
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/39
 switchport access vlan 159
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switc
 << hport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/40
 switchport access vlan 159
 switchport mode access
 switchp
 << ort port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface Giga
 << bitEthernet1/0/41
 switchport access vlan 159
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchpo
 << rt port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/42
 switchport access vlan 159
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-s
 << ecurity aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/43
 switchport access vlan 159
 switchport mode access
 switchport port-sec
 << urity maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1
 << /0/44
 switchport access vlan 159
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-secu
 << rity
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/45
 switchport access vlan 159
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security agin
 << g time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/46
 switchport trunk native vlan 92
 switchport mode trunk
 no keepalive
 ip dhcp snoo
 << ping trust
!
interface GigabitEthernet1/0/47
 switchport trunk native vlan 92
 switchport mode trunk
 no keepalive
 ip dhcp snooping trust
!
interface GigabitEthernet1/0/48
 switchport trunk native vlan 92
 switchport mode trunk
 no keepalive

 <<  ip dhcp snooping trust
!
interface GigabitEthernet1/0/49
 switchport trunk native vlan 92
 switchport mode trunk
 ip dhcp snooping trust
!
interface GigabitEthernet1/0/50
 switchport trunk native vlan 92
 switchport mode trunk
 ip dhcp snooping
 <<  trust
!
interface TenGigabitEthernet1/0/1
 switchport trunk native vlan 92
 switchport mode trunk
 ip dhcp snooping trust
!
interface TenGigabitEthernet1/0/2
 switchport trunk native vlan 92
 switchport mode trunk
 ip dhcp snooping trust
!
in
 << terface Vlan1
 no ip address
 no ip route-cache
 shutdown
!
interface Vlan92
 ip address 10.92.5.137 255.255.0.0
 ip broadcast-address 10.92.255.255
!
ip default-gateway 10.92.0.1
no ip http server
no ip http secure-server
!
!
logging facili
 << ty local1
logging host 130.18.8.12
access-list 1 permit 130.18.92.0 0.0.3.255
access-list 1 permit 10.92.0.0 0.0.255.255
access-list 1 permit 130.18.8.0 0.0.0.255
!
snmp-server community sysnet RO 1
snmp-server community c2-b2=a2 RW 1
snmp-server 
 << contact 6F-2096
snmp-server enable traps snmp authentication linkdown linkup coldstart warmstart
snmp-server enable traps transceiver all
snmp-server enable traps tty
snmp-server enable traps cluster
snmp-server enable traps config-copy
snmp-server 
 << enable traps config
snmp-server enable traps config-ctid
snmp-server enable traps entity
snmp-server enable traps power-ethernet police
snmp-server enable traps cpu threshold
snmp-server enable traps bridge newroot topologychange
snmp-server enable 
 << traps stpx inconsistency root-inconsistency loop-inconsistency
snmp-server enable traps syslog
snmp-server enable traps vtp
snmp-server enable traps vlancreate
snmp-server enable traps vlandelete
snmp-server enable traps flash insertion removal
snmp
 << -server enable traps port-security
snmp-server enable traps envmon fan shutdown supply temperature status
snmp-server enable traps errdisable
snmp-server enable traps mac-notification change move threshold
snmp-server enable traps vlan-membership
snm
 << p-server host 130.18.8.12 sysnet 
!
!
line con 0
line vty 0 4
 password 7 1436000E0D59266133
 login
line vty 5 15
 password 7 096D5C0C18581B581C
 login
!
ntp server 10.92.0.5
end

c29s1p.r122.cav#
Expect: matched string 1: #
 >> show interface status

Expect: searching for 2 strs:  :# :>
 << show interface status

Port      Name               Status       Vlan       Duplex  Speed Type 
Gi1/0/1                      notconnect   554          auto   auto 10/100/1000BaseTX
Gi1/0/2                      notconnect   554          auto   auto 10/
 << 100/1000BaseTX
Gi1/0/3                      notconnect   554          auto   auto 10/100/1000BaseTX
Gi1/0/4                      notconnect   554          auto   auto 10/100/1000BaseTX
Gi1/0/5                      notconnect   554          auto   auto 
 << 10/100/1000BaseTX
Gi1/0/6                      notconnect   554          auto   auto 10/100/1000BaseTX
Gi1/0/7                      notconnect   554          auto   auto 10/100/1000BaseTX
Gi1/0/8                      notconnect   554          auto   au
 << to 10/100/1000BaseTX
Gi1/0/9                      notconnect   554          auto   auto 10/100/1000BaseTX
Gi1/0/10                     notconnect   554          auto   auto 10/100/1000BaseTX
Gi1/0/11                     notconnect   159          auto  
 <<  auto 10/100/1000BaseTX
Gi1/0/12                     notconnect   159          auto   auto 10/100/1000BaseTX
Gi1/0/13                     notconnect   159          auto   auto 10/100/1000BaseTX
Gi1/0/14                     notconnect   159          aut
 << o   auto 10/100/1000BaseTX
Gi1/0/15                     notconnect   159          auto   auto 10/100/1000BaseTX
Gi1/0/16                     notconnect   159          auto   auto 10/100/1000BaseTX
Gi1/0/17                     notconnect   159          
 << auto   auto 10/100/1000BaseTX
Gi1/0/18                     notconnect   159          auto   auto 10/100/1000BaseTX
Gi1/0/19                     notconnect   159          auto   auto 10/100/1000BaseTX
Gi1/0/20                     notconnect   159       
 <<    auto   auto 10/100/1000BaseTX
Gi1/0/21                     notconnect   159          auto   auto 10/100/1000BaseTX
Gi1/0/22                     notconnect   159          auto   auto 10/100/1000BaseTX
Gi1/0/23                     notconnect   159    
 <<       auto   auto 10/100/1000BaseTX
Gi1/0/24                     notconnect   159          auto   auto 10/100/1000BaseTX
Gi1/0/25                     notconnect   159          auto   auto 10/100/1000BaseTX
Gi1/0/26                     notconnect   159 
 <<          auto   auto 10/100/1000BaseTX
Gi1/0/27                     notconnect   159          auto   auto 10/100/1000BaseTX
Gi1/0/28                     notconnect   159          auto   auto 10/100/1000BaseTX
Gi1/0/29                     notconnect   1
 << 59          auto   auto 10/100/1000BaseTX
Gi1/0/30                     notconnect   159          auto   auto 10/100/1000BaseTX
Gi1/0/31                     notconnect   159          auto   auto 10/100/1000BaseTX
Gi1/0/32                     notconnect 
 <<   159          auto   auto 10/100/1000BaseTX
Gi1/0/33                     notconnect   159          auto   auto 10/100/1000BaseTX
Gi1/0/34                     notconnect   159          auto   auto 10/100/1000BaseTX
Gi1/0/35                     notconne
 << ct   159          auto   auto 10/100/1000BaseTX
Gi1/0/36                     notconnect   159          auto   auto 10/100/1000BaseTX
Gi1/0/37                     notconnect   159          auto   auto 10/100/1000BaseTX
Gi1/0/38                     notco
 << nnect   159          auto   auto 10/100/1000BaseTX
Gi1/0/39                     notconnect   159          auto   auto 10/100/1000BaseTX
Gi1/0/40                     notconnect   159          auto   auto 10/100/1000BaseTX
Gi1/0/41                     no
 << tconnect   159          auto   auto 10/100/1000BaseTX
Gi1/0/42                     notconnect   159          auto   auto 10/100/1000BaseTX
Gi1/0/43                     notconnect   159          auto   auto 10/100/1000BaseTX
Gi1/0/44                    
 <<  notconnect   159          auto   auto 10/100/1000BaseTX
Gi1/0/45                     notconnect   159          auto   auto 10/100/1000BaseTX
Gi1/0/46                     notconnect   1            auto   auto 10/100/1000BaseTX
Gi1/0/47                 
 <<     notconnect   1            auto   auto 10/100/1000BaseTX
Gi1/0/48                     notconnect   1            auto   auto 10/100/1000BaseTX
Te1/0/1                      notconnect   1            full    10G Not Present
Te1/0/2                     
 <<  notconnect   1            full    10G Not Present
Fa0                          disabled     routed       auto   auto 10/100BaseTX
c29s1p.r122.cav#
Expect: matched string 1: #
