trying to use serial port: /dev/ttyUSB0
 >> 
 >> 

Expect: searching for 4 strs:  :[yes/no] :Press RETURN to get started. :# :Switch>
 << 


         --- System Configuration Dialog ---

Enable secret warning
----------------------------------
In order to access the device manager, an enable secret is required
If you enter the initial configuration dialog, you will be prompted for t
 << he enable secret
If you choose not to enter the intial configuration dialog, or if you exit setup without setting the enable secret,
please set an enable secret using the following CLI in configuration mode-
enable secret 0 <cleartext password>
------
 << ----------------------------
Would you like to enter the initial configuration dialog? [yes/no]: 
% Please answer 'yes' or 'no'.
Would you like to enter the initial configuration dialog? [yes/no]: 
% Please answer 'yes' or 'no'.
Would you like to ent
Expect: matched string 1: [yes/no]
 >> 

 >> no

 >> term len 0

Expect: searching for 2 strs:  :# :>
 << er the initial configuration dialog? [yes/no]: 
% Please answer 'yes' or 'no'.
Would you like to enter the initial configuration dialog? [yes/no]: 
% Please answer 'yes' or 'no'.
Would you like to enter the initial configuration dialog? [yes/no]: 
% 
 << Please answer 'yes' or 'no'.
Would you like to enter the initial configuration dialog? [yes/no]: no
Switch>term len 0
Switch>
Expect: matched string 2: >
 >> show version

Expect: searching for 2 strs:  :# :>
 << show version
Cisco IOS Software, C2960CX Software (C2960CX-UNIVERSALK9-M), Version 15.2(4)E1, RELEASE SOFTWARE (fc2)
Technical Support: http://www.cisco.com/techsupport
Copyright (c) 1986-2016 by Cisco Systems, Inc.
Compiled Thu 28-Jan-16 16:23 by pro
 << d_rel_team

ROM: Bootstrap program is C2960CX boot loader
BOOTLDR: C2960CX Boot Loader (C2960CX-HBOOT-M) Version 15.2(3r)E, RELEASE SOFTWARE (fc1)

Switch uptime is 19 minutes
System returned to ROM by power-on
System restarted at 15:18:37 UTC Tue 
 << Oct 18 2016
System image file is "flash:/c2960cx-universalk9-mz.152-4.E1/c2960cx-universalk9-mz.152-4.E1.bin"
Last reload reason: Unknown reason



This product contains cryptographic features and is subject to United
States and local country laws 
 << governing import, export, transfer and
use. Delivery of Cisco cryptographic products does not imply
third-party authority to import, export, distribute or use encryption.
Importers, exporters, distributors and users are responsible for
compliance with
 <<  U.S. and local country laws. By using this product you
agree to comply with applicable laws and regulations. If you are unable
to comply with U.S. and local laws, return this product immediately.

A summary of U.S. laws governing Cisco cryptographic 
 << products may be found at:
http://www.cisco.com/wwl/export/crypto/tool/stqrg.html

If you require further assistance please contact us by sending email to
export@cisco.com.

cisco WS-C2960CX-8PC-L (APM86XXX) processor (revision G0) with 524288K bytes
 <<  of memory.
Processor board ID FOC2026Z3V5
Last reset from power-on
1 Virtual Ethernet interface
12 Gigabit Ethernet interfaces
The password-recovery mechanism is enabled.

512K bytes of flash-simulated non-volatile configuration memory.
Base ethe
 << rnet MAC Address       : 00:A2:89:25:48:80
Motherboard assembly number     : 73-17484-02
Power supply part number        : 341-0675-02
Motherboard serial number       : FOC202454K4
Power supply serial number      : DCC2016521G
Model revision number  
 <<          : G0
Motherboard revision number     : A0
Model number                    : WS-C2960CX-8PC-L
System serial number            : FOC2026Z3V5
Top Assembly Part Number        : 68-100386-02
Top Assembly Revision Number    : E0
Version ID       
 <<                : V02
CLEI Code Number                : CMMT410BRA
Hardware Board Revision Number  : 0x02


Switch Ports Model                     SW Version            SW Image                 
------ ----- -----                     ----------      
 <<       ----------               
*    1 12    WS-C2960CX-8PC-L          15.2(4)E1             C2960CX-UNIVERSALK9-M    


Configuration register is 0xF

Switch>
Expect: matched string 2: >
 >> enable

Expect: searching for 2 strs:  :Password: :#
 << enable
Switch#
Expect: matched string 2: #
 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
Expect: matched string 1: (config)#
 >> no service pad

 >> service timestamps debug datetime localtime

 >> service timestamps log datetime localtime

 >> service password-encryption

 >> boot-start-marker

 >> boot-end-marker

 >> enable secret Area=l*w

 >> enable password Area=l*w

 >> no aaa new-model

 >> clock timezone CST -6 0

 >> clock summer-time CDT recurring

 >> authentication mac-move permit

 >> ip domain-name mgmt.msstate.edu

 >> ip name-server 130.18.80.12

 >> vtp domain vtp01.mgmt.msstate.edu

 >> vtp mode client

 >> crypto pki trustpoint TP-self-signed-2494998912

 >>  enrollment selfsigned

 >>  subject-name cn=IOS-Self-Signed-Certificate-2494998912

 >>  revocation-check none

 >>  rsakeypair TP-self-signed-2494998912

 >> crypto pki certificate chain TP-self-signed-2494998912

 >>  certificate self-signed 01 nvram:IOS-Self-Sig#3232.cer

 >> spanning-tree portfast bpduguard default

 >> spanning-tree extend system-id

 >> vlan internal allocation policy ascending

 >> errdisable recovery cause all

 >> errdisable recovery interval 1800

 >> interface FastEthernet0

 >>  no ip address

 >>  shutdown

 >> interface Vlan1

 >>  no ip address

 >>  no ip route-cache

 >>  shutdown

 >> interface Vlan92

 >> ip http server

 >> ip http secure-server

 >> logging facility local1

 >> logging host 130.18.8.12

 >> username root privilege 15 secret Area=l*w

 >> snmp-server community sysnet RO 1

 >> snmp-server community c2-b2=a2 RW 1

 >> snmp-server enable traps snmp authentication linkdown linkup coldstart warmstart

 >> snmp-server enable traps transceiver all

 >> snmp-server enable traps tty

 >> snmp-server enable traps cluster

 >> snmp-server enable traps config-copy

 >> snmp-server enable traps config

 >> snmp-server enable traps config-ctid

 >> snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-auth-fail-vlan no-guest-vlan

 >> snmp-server enable traps entity

 >> snmp-server enable traps power-ethernet police

 >> snmp-server enable traps cpu threshold

 >> snmp-server enable traps rep

 >> snmp-server enable traps bridge newroot topologychange

 >> snmp-server enable traps stpx inconsistency root-inconsistency loop-inconsistency

 >> snmp-server enable traps syslog

 >> snmp-server enable traps vtp

 >> snmp-server enable traps vlancreate

 >> snmp-server enable traps vlandelete

 >> snmp-server enable traps flash insertion removal

 >> snmp-server enable traps port-security

 >> snmp-server enable traps envmon fan shutdown supply temperature status

 >> snmp-server enable traps errdisable

 >> snmp-server enable traps mac-notification change move threshold

 >> snmp-server enable traps vlan-membership

 >> snmp-server host 130.18.8.12 

 >> line con 0

 >> line vty 0 4

 >>  password Area=l*w

 >>  login

 >> line vty 5 15

 >>  password Area=l*w

 >>  login

 >> ntp server 10.92.0.5

 >> end

Expect: searching for 1 strs:  :Configured
 << no service pad
Switch(config)#service timestamps debug datetime localtime
Switch(config)#service timestamps log datetime localtime
Switch(config)#service password-encryption
Switch(config)#boot-start-marker
Switch(config)#boot-end-marker
Switch(conf
 << ig)#enable secret Area=l*w
Switch(config)#enable password Area=l*w
The enable password you have chosen is the same as your enable secret.
This is not recommended.  Re-enter the enable password.

Switch(config)#no aaa new-model
Switch(config)#clock t
 << imezone CST -6 0
Switch(config)#clock summer-time CDT recurring
Switch(config)#authentication mac-move permit
Switch(config)#ip domain-name mgmt.msstate.edu
Switch(config)#ip name-server 130.18.80.12
Switch(config)#vtp domain vtp01.mgmt.msstate.edu

 << Changing VTP domain name from NULL to vtp01.mgmt.msstate.edu
Switch(config)#
Oct 18 09:39:37: %SYS-6-CLOCKUPDATE: System clock has been updated from 15:39:37 UTC Tue Oct 18 2016 to 09:39:37 CST Tue Oct 18 2016, configured from console by console.
Oct 1
 << 8 10:39:37: %SYS-6-CLOCKUPDATE: System clock has been updated from 09:39:37 CST Tue Oct 18 2016 to 10:39:37 CDT Tue Oct 18 2016, configured from console by console.vtp mode client
Setting device to VTP Client mode for VLANS.
Switch(config)#crypto pki tr
 << ustpoint TP-self-signed-2494998912
Switch(ca-trustpoint)# enrollment selfsigned
Switch(ca-trustpoint)# subject-name cn=IOS-Self-Signed-Certificate-2494998912
Switch(ca-trustpoint)# revocation-check none
Switch(ca-trustpoint)#
Oct 18 10:39:38: %SW_VLA
 << N-6-VTP_DOMAIN_NAME_CHG: VTP domain name changed to vtp01.mgmt.msstate.edu. rsakeypair TP-self-signed-2494998912
Switch(ca-trustpoint)#crypto pki certificate chain TP-self-signed-2494998912
Switch(config-cert-chain)# certificate self-signed 01 nvram:IOS
 << -Self-Sig#3232$e self-signed 01 nvram:IOS-Self-Sig#3232.         cer
Switch(config-cert-chain)#spanning-tree portfast bpduguard default
Switch(config)#spanning-tree extend system-id
Switch(con
 << fig)#vlan internal allocation policy ascending
Switch(config)#errdisable recovery cause all
Switch(config)#errdisable recovery interval 1800
Switch(config)#interface FastEthernet0
                          ^
% Invalid input detected at '^' marker.

 << 
Switch(config)# no ip address
% Incomplete command.

Switch(config)# shutdown
% Incomplete command.

Switch(config)#interface Vlan1
Switch(config-if)# no ip address
Switch(config-if)# no ip route-cache
Switch(config-if)# shutdown
Switch(config-
 << if)#interface Vlan92
Switch(config-if)#ip http server
Switch(config)#ip http secure-server
Switch(config)#logging facility local1
Switch(config)#logging host 130.18.8.12
Switch(config)#username root privilege 15 secret Area=l*w
Switch(config)#snmp-s
 << erver community sysnet RO 1
Switch(config)#snmp-server community c2-b2=a2 RW 1
Switch(config)#snmp-server enable traps snmp authentication linkdown linkup c$ enable traps snmp authentication 
 << linkdown linkup co         ldstart waps snmp authentication linkdown linkup coldstart wa         rmstart
Switch(config)#snmp-server enable traps transceiver all
Switch(config
 << )#snmp-server enable traps tty
Switch(config)#snmp-server enable traps cluster
Switch(config)#snmp-server enable traps config-copy
Switch(config)#
Oct 18 10:39:43: %SYS-6-LOGGINGHOST_STARTSTOP: Logging to host 130.18.8.12 port 0 CLI Request Triggered
 << 
Oct 18 10:39:43: %SYS-6-LOGGINGHOST_STARTSTOP: Logging to host 130.18.8.12 port 514 started - CLI initiatedsnmp-server enable traps config
Switch(config)#snmp-server enable traps config-ctid
Switch(config)#snmp-server enable traps dot1x auth-fail-vlan 
 << guest-vlan no-au$ enable traps dot1x auth-fail-vlan guest-vlan no-aut         h-fail-vlaps dot1x auth-fail-vlan guest-vlan 
 << no-auth-fail-vla         n no-guesuth-fail-vlan guest-vlan no-auth-fail-vlan no-guest         -vlan
snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-auth-fail-vlan n
 << o-gu                         ^est-vlan

Oct 18 10:39:44: %LINK-5-CHANGED: Interface Vlan1, changed state to administratively down
% Invalid input detected at '^' marker.

Switch(config)#snmp-server enable traps entity
Switch(config)#snmp-server enab
 << le traps power-ethernet police
Switch(config)#snmp-server enable traps cpu threshold
Switch(config)#snmp-server enable traps rep
                                        ^
% Invalid input detected at '^' marker.

Switch(config)#snmp-server enable tra
 << ps bridge newroot topologychange
Switch(config)#snmp-server enable traps stpx inconsistency root-inconsistency$ enable traps stpx inconsistency root-inconsistency          loop-inco
 << aps stpx inconsistency root-inconsistency loop-incon         sistency
Switch(config)#snmp-server enable traps syslog
Switch(config)#snmp-server enable traps vtp
Switch(config)#snmp-ser
 << ver enable traps vlancreate
Switch(config)#snmp-server enable traps vlandelete
Switch(config)#snmp-server enable traps flash insertion removal
Switch(config)#snmp-server enable traps port-security
Switch(config)#snmp-server enable traps envmon fan shu
 << tdown supply temperatur$ enable traps envmon fan shutdown supply temperature          status
Switch(config)#snmp-server enable traps errdisable
Switch(config)#snmp-server enable trap
 << s mac-notification change move threshol$ enable traps mac-notification change move threshold         
Switch(config)#snmp-server enable traps vlan-membership
Switch(config)#snmp-serv
 << er host 130.18.8.12 
% Incomplete command.

Switch(config)#line con 0
Switch(config-line)#line vty 0 4
Switch(config-line)# password Area=l*w
Switch(config-line)# login
Switch(config-line)#line vty 5 15
Switch(config-line)# password Area=l*w
Swit
 << ch(config-line)# login
Switch(config-line)#ntp server 10.92.0.5
Switch(config)#end
Switch#
 << 
Oct 18 10:39:51: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
Switch#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
Expect: matched string 1: (config)#
 >> spanning-tree mode mst

 >> spanning-tree etherchannel guard misconfig

 >> spanning-tree mst configuration

 >>  name msstate

 >>  revision 1

 >>  instance 1 vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 63, 70

 >>  instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 160

 >>  instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 230, 232, 242, 246

 >>  instance 1 vlan 256, 611-612, 654, 741, 996, 999

 >>  instance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037, 2039-2040

 >>  instance 2 vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096, 2104, 2110, 2126

 >>  instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 2189, 2194, 2202

 >>  instance 2 vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 2654, 2999

 >>  instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176, 196

 >>  instance 3 vlan 244, 248, 927

 >>  instance 4 vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072, 2108, 2113, 2128

 >>  instance 4 vlan 2144, 2176, 2196, 2244, 2248, 2927

 >>  instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 228

 >>  instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216, 2228

 >>  instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116, 124

 >>  instance 7 vlan 172, 186, 192, 204-208, 210, 240-241, 251-252, 630, 928

 >>  instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082, 2084

 >>  instance 8 vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208, 2210

 >>  instance 8 vlan 2240-2241, 2251-2252, 2630, 2928

 >>  instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102, 112

 >>  instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 500, 505, 510-511

 >>  instance 9 vlan 522, 551-570, 603, 629, 633, 742, 802, 926, 929

 >>  instance 10 vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 2057, 2062, 2068

 >>  instance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148, 2158

 >>  instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522, 2603, 2629, 2633

 >>  instance 10 vlan 2802, 2926, 2929

 >>  instance 11 vlan 8, 43, 52, 146, 156-157, 180, 200, 218

 >>  instance 12 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180, 2200, 2218

 >> 

 >> end

Expect: searching for 1 strs:  :Configured
 << spanning-tree mode mst
Switch(config)#spanning-tree etherchannel guard misconfig
Switch(config)#spanning-tree mst configuration
Switch(config-mst)# name msstate
Switch(config-mst)# revision 1
Switch(config-mst)# instance 1 vlan 2, 7, 11, 20, 22, 24, 
 << 31, 35, 37, 39-40, $ vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40, 5         0, 60, 63, 11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 
 << 63,          70
Switch(config-mst)# instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 1$ vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 14         0, 152, 1
 << 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 16         0
Switch(config-mst)# instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 23$ vlan 162-1
 << 63, 168, 189, 194, 202, 220, 222, 230         , 232, 24163, 168, 189, 194, 202, 220, 222, 230, 232, 242         , 246
Switch(config-mst)# instance 1 vlan 256, 611-612, 654, 741, 9
 << 96, 999
Switch(config-mst)# instance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031,$ vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031,          2035, 203
 << , 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037         , 2039-2011, 2020, 2022, 2024, 2031, 2035, 2037, 2039-204         0
Switch(config-mst)# instance 2 v
 << lan 2050, 2060, 2063, 2070, 2080, 2086, 2096,$ vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096,          2104, 211, 2060, 2063, 2070,
 <<  2080, 2086, 2096, 2104, 2110         , 2126
Switch(config-mst)# instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, $ vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 2         
 << 189, 2194, 2140, 2152, 2160, 2162-2163, 2168, 2189, 2194,          2202
Switch(config-mst)# instance 2 vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 
 << $ vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 2         654, 2999
Switch(config-mst)# instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128$ vlan 42, 51, 59, 64
 << , 66, 69, 72, 108, 113, 128,          144, 17651, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176,          196
Switch(config-mst)# instance 3 vlan 244, 248, 927
Switch(config-mst)# 
 << instance 4 vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072,$ vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072,          2108, 211, 2051,
 <<  2059, 2064, 2066, 2069, 2072, 2108, 2113         , 2128
Switch(config-mst)# instance 4 vlan 2144, 2176, 2196, 2244, 2248, 2927
Switch(config-mst)# instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 2
 << $ vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 22         8
Switch(config-mst)# instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-$ vlan 2016, 2048, 2058, 2088, 
 << 2121, 2131, 2133-2         134, 2216, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216,          2228
Switch(config-mst)# instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97,
 << $ vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97,          114, 116,3-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116,          1
 << 24
Switch(config-mst)# instance 7 vlan 172, 186, 192, 204-208, 210, 240-241, 251$ vlan 172, 186, 192, 204-208, 210, 240-241, 251-         252, 630,
 << 186, 192, 204-208, 210, 240-241, 251-252, 630,          928
Switch(config-mst)# instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, $ vlan 2009, 2033-2034, 2038, 2054
 << , 2056, 2071, 2         075, 2082, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082,          2084
Switch(config-mst)# instance 8 vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192,
 << $ vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192,          2204-2208, 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208,          221
 << 0
Switch(config-mst)# instance 8 vlan 2240-2241, 2251-2252, 2630, 2928
Switch(config-mst)# instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 9$ vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 
 << 98         -99, 102,12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102,          112
Switch(config-mst)# instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 50
 << $ vlan 130, 132, 147-148, 158, 212, 226, 236, 500         , 505, 51132, 147-148, 158, 212, 226, 236, 500, 505, 510         -511
Switch(config-mst
 << )# instance 9 vlan 522, 551-570, 603, 629, 633, 742, 802, 92$ vlan 522, 551-570, 603, 629, 633, 742, 802, 926         , 929
Switch(config-mst)# instance 10 vlan 2004-2005, 2012, 2018-2019
 << , 2032, 2044, $0 vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 2         057, 20624-2005, 2012, 2018-2019, 2032, 2044, 2057, 2062,  
 <<         2068
Switch(config-mst)# instance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132,$0 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132,          2147-2148
 << 6, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148,          2158
Switch(config-mst)# instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522,$0 vlan 221
 << 2, 2236, 2500, 2505, 2510-2511, 2522,          2603, 2622, 2236, 2500, 2505, 2510-2511, 2522, 2603, 2629         , 2633
Switch(config-mst)# instance 10 vlan 2802, 2926, 2929
Swit
 << ch(config-mst)# instance 11 vlan 8, 43, 52, 146, 156-157, 180, 200, 218
Switch(config-mst)# instance 12 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180,$2 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180
 << ,          2200, 2218, 2043, 2052, 2146, 2156-2157, 2180, 2200, 2218         
Switch(config-mst)#
Switch(config-mst)#end
Switch#
Oct 18 10:40:07: %SYS-5-CONFIG_I: Configured fr
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << om console by console
Switch#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
Expect: matched string 1: (config)#
 >> hostname c29s1c.lab.a.mcarthur 

Expect: searching for 2 strs:  :# :>
 << hostname c29s1c.lab.a.mcarthur 
c29s1c.lab.a.mcarthu(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s1c.lab.a.mcarthur#
 << 
Oct 18 10:40:12: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1c.lab.a.mcarthur#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1c.lab.a.mcarthu(config)#
Expect: matched string 1: (config)#
 >> snmp-server contact  

Expect: searching for 1 strs:  :#
 << snmp-server contact  
% Incomplete command.

c29s1c.lab.a.mcarthu(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s1c.lab.a.mcarthur#
 << 
Oct 18 10:40:18: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1c.lab.a.mcarthur#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1c.lab.a.mcarthu(config)#
Expect: matched string 1: (config)#
 >> interface vlan 92

Expect: searching for 1 strs:  :(config-if)#
 << interface vlan 92
c29s1c.lab.a.mcarthu(config-if)#
Expect: matched string 1: (config-if)#
 >> ip address 10.92.5.146 255.255.0.0

 >> ip broadcast-address 10.92.255.255

 >> end

Expect: searching for 1 strs:  :Configured
 << ip address 10.92.5.146 255.255.0.0
c29s1c.lab.a.mcarthu(config-if)#ip broadcast-address 10.92.255.255
c29s1c.lab.a.mcarthu(config-if)#end
c29s1c.lab.a.mcarthur#
 << 
Oct 18 10:40:24: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1c.lab.a.mcarthur#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1c.lab.a.mcarthu(config)#
Expect: matched string 1: (config)#
 >> interface Vlan92

Expect: searching for 1 strs:  :(config-if)#
 << interface Vlan92
c29s1c.lab.a.mcarthu(config-if)#
Expect: matched string 1: (config-if)#
 >> ip default-gateway 10.92.0.1

 >> end

Expect: searching for 1 strs:  :Configured
 << ip default-gateway 10.92.0.1
c29s1c.lab.a.mcarthu(config)#end
c29s1c.lab.a.mcarthur#
Oct 18 10:40:30: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1c.lab.a.mcarthur#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1c.lab.a.mcarthu(config)#
Expect: matched string 1: (config)#
 >> ip dhcp snooping

Expect: searching for 1 strs:  :#
 << ip dhcp snooping
c29s1c.lab.a.mcarthu(config)#
Expect: matched string 1: #
 >> ip dhcp snooping vlan 60

Expect: searching for 1 strs:  :#
 << ip dhcp snooping vlan 60
c29s1c.lab.a.mcarthu(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s1c.lab.a.mcarthur#
Oct 18 10:40:37: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1c.lab.a.mcarthur#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1c.lab.a.mcarthu(config)#
Expect: matched string 1: (config)#
 >> default interface range gi0/1 - 8 

 >> interface range gi0/1 - 8 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi0/1 - 8 
c29s1c.lab.a.mcarthu(config)#interface range gi0/1 - 8 
c29s1c.lab.a.mcarthu(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport access vlan 60

 >> switchport mode access

 >> spanning-tree portfast

 >> switchport port-security maximum 2

 >> switchport port-security

 >> switchport port-security aging time 15

 >> switchport port-security violation protect

 >> switchport port-security aging type inactivity

 >> power inline never

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport access vlan 60
c29s1c.lab.a.mcarthu(config-if-range)#switchport mode access
c29s1c.lab.a.mcarthu(config-if-range)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, concen
 << trators, switches, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast will be configured in 8 interfaces due to the range command 
 but will only have effect when the interfa
 << ces are in a non-trunking mode.
c29s1c.lab.a.mcarthu(config-if-range)#switchport port-security maximum 2
c29s1c.lab.a.mcarthu(config-if-range)#switchport port-security
c29s1c.lab.a.mcarthu(config-if-range)#switchport port-security aging time 15
c29s1c
 << .lab.a.mcarthu(config-if-range)#switchport port-security violation prot$port-security violation prote         ct
c29s1c.lab.a.mcarthu(config-if-range)#switchport port-security aging type ina
 << $port-security aging type inac         tivity
c29s1c.lab.a.mcarthu(config-if-range)#power inline never
c29s1c.lab.a.mcarthu(config-if-range)#end
c29s1c.lab.a.mcarthur#
 << 
Oct 18 10:40:45: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1c.lab.a.mcarthur#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1c.lab.a.mcarthu(config)#
Expect: matched string 1: (config)#
 >> default interface range gi0/1 - 4 

 >> interface range gi0/1 - 4 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi0/1 - 4 
c29s1c.lab.a.mcarthu(config)#interface range gi0/1 - 4 
c29s1c.lab.a.mcarthu(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport access vlan 673

 >> switchport mode access

 >> spanning-tree portfast

 >> power inline never

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport access vlan 673
c29s1c.lab.a.mcarthu(config-if-range)#switchport mode access
c29s1c.lab.a.mcarthu(config-if-range)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, conce
 << ntrators, switches, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast will be configured in 4 interfaces due to the range command 
 but will only have effect when the interf
 << aces are in a non-trunking mode.
c29s1c.lab.a.mcarthu(config-if-range)#power inline never
c29s1c.lab.a.mcarthu(config-if-range)#end
c29s1c.lab.a.mcarthur#
 << 
Oct 18 10:40:51: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1c.lab.a.mcarthur#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1c.lab.a.mcarthu(config)#
Expect: matched string 1: (config)#
 >> default interface gi0/5 

 >> interface gi0/5 

Expect: searching for 1 strs:  :(config-if)#
 << default interface gi0/5 
Interface GigabitEthernet0/5 set to default configuration
c29s1c.lab.a.mcarthu(config)#interface gi0/5 
c29s1c.lab.a.mcarthu(config-if)#
Expect: matched string 1: (config-if)#
 >> switchport access vlan 28

 >> switchport mode access

 >> spanning-tree portfast

 >> power inline never

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport access vlan 28
c29s1c.lab.a.mcarthu(config-if)#switchport mode access
c29s1c.lab.a.mcarthu(config-if)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, concentrators, swi
 << tches, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast has been configured on GigabitEthernet0/5 but will only
 have effect when the interface is in a non-trunking mode.

 << c29s1c.lab.a.mcarthu(config-if)#power inline never
c29s1c.lab.a.mcarthu(config-if)#end
c29s1c.lab.a.mcarthur#
 << 
Oct 18 10:40:57: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1c.lab.a.mcarthur#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1c.lab.a.mcarthu(config)#
Expect: matched string 1: (config)#
 >> default interface gi0/8 

 >> interface gi0/8 

Expect: searching for 1 strs:  :(config-if)#
 << default interface gi0/8 
Interface GigabitEthernet0/8 set to default configuration
c29s1c.lab.a.mcarthu(config)#interface gi0/8 
c29s1c.lab.a.mcarthu(config-if)#
Expect: matched string 1: (config-if)#
 >> switchport access vlan 91

 >> switchport mode access

 >> spanning-tree portfast

 >> power inline never

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport access vlan 91
c29s1c.lab.a.mcarthu(config-if)#switchport mode access
c29s1c.lab.a.mcarthu(config-if)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, concentrators, swi
 << tches, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast has been configured on GigabitEthernet0/8 but will only
 have effect when the interface is in a non-trunking mode.

 << c29s1c.lab.a.mcarthu(config-if)#power inline never
c29s1c.lab.a.mcarthu(config-if)#end
c29s1c.lab.a.mcarthur#
 << 
Oct 18 10:41:03: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1c.lab.a.mcarthur#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1c.lab.a.mcarthu(config)#
Expect: matched string 1: (config)#
 >> default interface range gi0/9 - 12 

 >> interface range gi0/9 - 12 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi0/9 - 12 
c29s1c.lab.a.mcarthu(config)#interface range gi0/9 - 12 
c29s1c.lab.a.mcarthu(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport mode trunk

 >> switchport trunk native vlan 92

 >> ip dhcp snooping trust

 >> no keepalive

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport mode trunk
c29s1c.lab.a.mcarthu(config-if-range)#switchport trunk native vlan 92
c29s1c.lab.a.mcarthu(config-if-range)#ip dhcp snooping trust
c29s1c.lab.a.mcarthu(config-if-range)#no keepalive
c29s1c.lab.a.mcarthu(config-if-range)#end
c29s
 << 1c.lab.a.mcarthur#
 << 
Oct 18 10:41:09: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> write mem

Expect: searching for 2 strs:  :# :>
 << 
c29s1c.lab.a.mcarthur#write mem
Building configuration...
[OK]
c29s1c.lab.a.mcarthur#
Expect: matched string 1: #
 >> 
Expect: searching for 2 strs:  :# :>
 << 
c29s1c.lab.a.mcarthur#
c29s1c.lab.a.mcarthur#
Expect: matched string 1: #
 >> sh run

Expect: searching for 2 strs:  :# :>
 << sh run
Building configuration...

Current configuration : 7407 bytes
!
! Last configuration change at 10:41:09 CDT Tue Oct 18 2016
! NVRAM config last updated at 10:41:12 CDT Tue Oct 18 2016
!
version 15.2
no service pad
service timestamps debug
 <<  datetime localtime
service timestamps log datetime localtime
service password-encryption
!
hostname c29s1c.lab.a.mcarthur
!
boot-start-marker
boot-end-marker
!
enable secret 5 $1$th0Q$h53Tcw6To4qVMEoLy/1sj1
enable password 7 047A19030E7C40041E
 << 
!
username root privilege 15 secret 5 $1$YEVT$8Ugyk.VgABGldV9Zi/RHF0
no aaa new-model
clock timezone CST -6 0
clock summer-time CDT recurring
system mtu routing 1500
!
!
!
!
!
!
ip dhcp snooping vlan 60
ip dhcp snooping
ip domain-name mgmt.
 << msstate.edu
ip name-server 130.18.80.12
!
!
!
!
!
authentication mac-move permit
!
!
crypto pki trustpoint TP-self-signed-2494998912
 enrollment selfsigned
 subject-name cn=IOS-Self-Signed-Certificate-2494998912
 revocation-check none
 rsake
 << ypair TP-self-signed-2494998912
!
!
crypto pki certificate chain TP-self-signed-2494998912
 certificate self-signed 01
  	quit
!
spanning-tree mode mst
spanning-tree portfast edge bpduguard default
spanning-tree extend system-id
!
spanning-tree
 <<  mst configuration
 name msstate
 revision 1
 instance 1 vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 63, 70
 instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 160
 instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 230, 
 << 232, 242, 246
 instance 1 vlan 256, 611-612, 654, 741, 996, 999
 instance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037, 2039-2040
 instance 2 vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096, 2104, 2110, 2126
 instance 2 vlan 2136, 2140, 2
 << 152, 2160, 2162-2163, 2168, 2189, 2194, 2202
 instance 2 vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 2654, 2999
 instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176, 196
 instance 3 vlan 244, 248, 927
 instance 4 vlan 2042, 2051, 205
 << 9, 2064, 2066, 2069, 2072, 2108, 2113, 2128
 instance 4 vlan 2144, 2176, 2196, 2244, 2248, 2927
 instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 228
 instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216, 2228
 instance 7 vlan 9,
 <<  33-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116, 124
 instance 7 vlan 172, 186, 192, 204-208, 210, 240-241, 251-252, 630, 928
 instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082, 2084
 instance 8 vlan 2097, 2114, 2116, 2124, 2172, 218
 << 6, 2192, 2204-2208, 2210
 instance 8 vlan 2240-2241, 2251-2252, 2630, 2928
 instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102, 112
 instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 500, 505, 510-511
 instance 9 vlan 522, 551-570
 << , 603, 629, 633, 742, 802, 926, 929
 instance 10 vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 2057, 2062, 2068
 instance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148, 2158
 instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522, 2603, 2
 << 629, 2633
 instance 10 vlan 2802, 2926, 2929
 instance 11 vlan 8, 43, 52, 146, 156-157, 180, 200, 218
 instance 12 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180, 2200, 2218
!
errdisable recovery cause udld
errdisable recovery cause bpduguard
errdisa
 << ble recovery cause security-violation
errdisable recovery cause channel-misconfig
errdisable recovery cause pagp-flap
errdisable recovery cause dtp-flap
errdisable recovery cause link-flap
errdisable recovery cause sfp-config-mismatch
errdisable rec
 << overy cause gbic-invalid
errdisable recovery cause psecure-violation
errdisable recovery cause port-mode-failure
errdisable recovery cause dhcp-rate-limit
errdisable recovery cause pppoe-ia-rate-limit
errdisable recovery cause mac-limit
errdisable r
 << ecovery cause vmps
errdisable recovery cause storm-control
errdisable recovery cause inline-power
errdisable recovery cause arp-inspection
errdisable recovery cause loopback
errdisable recovery cause small-frame
errdisable recovery cause psp
errdis
 << able recovery interval 1800
!
!
!
!
vlan internal allocation policy ascending
!
!
! 
!
!
!
!
!
!
!
!
!
interface GigabitEthernet0/1
 switchport access vlan 673
 switchport mode access
 power inline never
 spanning-tree portfast edge
 << 
!
interface GigabitEthernet0/2
 switchport access vlan 673
 switchport mode access
 power inline never
 spanning-tree portfast edge
!
interface GigabitEthernet0/3
 switchport access vlan 673
 switchport mode access
 power inline never
 spannin
 << g-tree portfast edge
!
interface GigabitEthernet0/4
 switchport access vlan 673
 switchport mode access
 power inline never
 spanning-tree portfast edge
!
interface GigabitEthernet0/5
 switchport access vlan 28
 switchport mode access
 power in
 << line never
 spanning-tree portfast edge
!
interface GigabitEthernet0/6
 switchport access vlan 60
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 swi
 << tchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast edge
!
interface GigabitEthernet0/7
 switchport access vlan 60
 switchport mode access
 switchport port-security maximum 2
 switchpo
 << rt port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast edge
!
interface GigabitEthernet0/8
 switchport access
 <<  vlan 91
 switchport mode access
 power inline never
 spanning-tree portfast edge
!
interface GigabitEthernet0/9
 switchport trunk native vlan 92
 switchport mode trunk
 no keepalive
 ip dhcp snooping trust
!
interface GigabitEthernet0/10
 swi
 << tchport trunk native vlan 92
 switchport mode trunk
 no keepalive
 ip dhcp snooping trust
!
interface GigabitEthernet0/11
 switchport trunk native vlan 92
 switchport mode trunk
 ip dhcp snooping trust
!
interface GigabitEthernet0/12
 switchpor
 << t trunk native vlan 92
 switchport mode trunk
 ip dhcp snooping trust
!
interface Vlan1
 no ip address
 no ip route-cache
 shutdown
!
interface Vlan92
 ip address 10.92.5.146 255.255.0.0
 ip broadcast-address 10.92.255.255
!
ip default-gatewa
 << y 10.92.0.1
ip forward-protocol nd
ip http server
ip http secure-server
!
!
!
logging facility local1
logging host 130.18.8.12
!
snmp-server community sysnet RO 1
snmp-server community c2-b2=a2 RW 1
snmp-server enable traps snmp authentication
 <<  linkdown linkup coldstart warmstart
snmp-server enable traps transceiver all
snmp-server enable traps tty
snmp-server enable traps cluster
snmp-server enable traps config-copy
snmp-server enable traps config
snmp-server enable traps config-ctid
sn
 << mp-server enable traps entity
snmp-server enable traps power-ethernet police
snmp-server enable traps cpu threshold
snmp-server enable traps bridge newroot topologychange
snmp-server enable traps stpx inconsistency root-inconsistency loop-inconsistenc
 << y
snmp-server enable traps syslog
snmp-server enable traps vtp
snmp-server enable traps vlancreate
snmp-server enable traps vlandelete
snmp-server enable traps flash insertion removal
snmp-server enable traps port-security
snmp-server enable traps 
 << envmon fan shutdown supply temperature status
snmp-server enable traps errdisable
snmp-server enable traps mac-notification change move threshold
snmp-server enable traps vlan-membership
!
line con 0
line vty 0 4
 password 7 0325490E07522D0659
 lo
 << gin
line vty 5 15
 password 7 123817121356004E3D
 login
!
ntp server 10.92.0.5
end

c29s1c.lab.a.mcarthur#
Expect: matched string 1: #
 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1c.lab.a.mcarthu(config)#
Expect: matched string 1: (config)#
 >> no service pad

 >> service timestamps debug datetime localtime

 >> service timestamps log datetime localtime

 >> service password-encryption

 >> boot-start-marker

 >> boot-end-marker

 >> enable secret Area=l*w

 >> enable password Area=l*w

 >> no aaa new-model

 >> clock timezone CST -6 0

 >> clock summer-time CDT recurring

 >> authentication mac-move permit

 >> ip domain-name mgmt.msstate.edu

 >> ip name-server 130.18.80.12

 >> vtp domain vtp01.mgmt.msstate.edu

 >> vtp mode client

 >> crypto pki trustpoint TP-self-signed-2494998912

 >>  enrollment selfsigned

 >>  subject-name cn=IOS-Self-Signed-Certificate-2494998912

 >>  revocation-check none

 >>  rsakeypair TP-self-signed-2494998912

 >> crypto pki certificate chain TP-self-signed-2494998912

 >>  certificate self-signed 01 nvram:IOS-Self-Sig#3232.cer

 >> spanning-tree portfast bpduguard default

 >> spanning-tree extend system-id

 >> vlan internal allocation policy ascending

 >> errdisable recovery cause all

 >> errdisable recovery interval 1800

 >> interface FastEthernet0

 >>  no ip address

 >>  shutdown

 >> interface Vlan1

 >>  no ip address

 >>  no ip route-cache

 >>  shutdown

 >> interface Vlan92

 >> ip http server

 >> ip http secure-server

 >> logging facility local1

 >> logging host 130.18.8.12

 >> username root privilege 15 secret Area=l*w

 >> snmp-server community sysnet RO 1

 >> snmp-server community c2-b2=a2 RW 1

 >> snmp-server enable traps snmp authentication linkdown linkup coldstart warmstart

 >> snmp-server enable traps transceiver all

 >> snmp-server enable traps tty

 >> snmp-server enable traps cluster

 >> snmp-server enable traps config-copy

 >> snmp-server enable traps config

 >> snmp-server enable traps config-ctid

 >> snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-auth-fail-vlan no-guest-vlan

 >> snmp-server enable traps entity

 >> snmp-server enable traps power-ethernet police

 >> snmp-server enable traps cpu threshold

 >> snmp-server enable traps rep

 >> snmp-server enable traps bridge newroot topologychange

 >> snmp-server enable traps stpx inconsistency root-inconsistency loop-inconsistency

 >> snmp-server enable traps syslog

 >> snmp-server enable traps vtp

 >> snmp-server enable traps vlancreate

 >> snmp-server enable traps vlandelete

 >> snmp-server enable traps flash insertion removal

 >> snmp-server enable traps port-security

 >> snmp-server enable traps envmon fan shutdown supply temperature status

 >> snmp-server enable traps errdisable

 >> snmp-server enable traps mac-notification change move threshold

 >> snmp-server enable traps vlan-membership

 >> snmp-server host 130.18.8.12 

 >> line con 0

 >> line vty 0 4

 >>  password Area=l*w

 >>  login

 >> line vty 5 15

 >>  password Area=l*w

 >>  login

 >> ntp server 10.92.0.5

 >> end

Expect: searching for 1 strs:  :Configured
 << no service pad
c29s1c.lab.a.mcarthu(config)#service timestamps debug datetime localtime
c29s1c.lab.a.mcarthu(config)#service timestamps log datetime localtime
c29s1c.lab.a.mcarthu(config)#service password-encryption
c29s1c.lab.a.mcarthu(config)#boot-s
 << tart-marker
c29s1c.lab.a.mcarthu(config)#boot-end-marker
c29s1c.lab.a.mcarthu(config)#enable secret Area=l*w
The enable secret you have chosen is the same as your enable password.
This is not recommended.  Re-enter the enable secret.

c29s1c.lab.a.m
 << carthu(config)#enable password Area=l*w
The enable password you have chosen is the same as your enable secret.
This is not recommended.  Re-enter the enable password.

c29s1c.lab.a.mcarthu(config)#no aaa new-model
c29s1c.lab.a.mcarthu(config)#clock t
 << imezone CST -6 0
c29s1c.lab.a.mcarthu(config)#clock summer-time CDT recurring
c29s1c.lab.a.mcarthu(config)#authentication mac-move permit
c29s1c.lab.a.mcarthu(config)#ip domain-name mgmt.msstate.edu
c29s1c.lab.a.mcarthu(config)#ip name-server 130.18.8
 << 0.12
c29s1c.lab.a.mcarthu(config)#vtp domain vtp01.mgmt.msstate.edu
Domain name already set to vtp01.mgmt.msstate.edu.
c29s1c.lab.a.mcarthu(config)#vtp mode client
Device mode already VTP Client for VLANS.
c29s1c.lab.a.mcarthu(config)#crypto pki trus
 << tpoint TP-self-signed-2494998912
c29s1c.lab.a.mcarthu(ca-trustpoint)# enrollment selfsigned
c29s1c.lab.a.mcarthu(ca-trustpoint)# subject-name cn=IOS-Self-Signed-Certific$me cn=IOS-Self-Signed-Certifica         
 << te-249499Self-Signed-Certificate-2494998         912
c29s1c.lab.a.mcarthu(ca-trustpoint)# revocation-check none
c29s1c.lab.a.mcarthu(ca-trustpoint)# rsakeypair TP-self-signed-2494998912
c29s1c.lab
 << .a.mcarthu(ca-trustpoint)#crypto pki certificate chain TP-self-sign$certificate chain TP-self-signe         d-2494998e chain TP-self-signed-24949989         
 << 12
c29s1c.lab.a.mcarthu(config-cert-chain)# certificate self-signed 01 nvram:IOS$e self-signed 01 nvram:IOS-         Self-Sig#ned 01 nvram:IOS-Self-Sig#3         
 << 232.cer
c29s1c.lab.a.mcarthu(config-cert-chain)#spanning-tree portfast bpduguard defa$ee portfast bpduguard defau         lt
c29s1c.lab.a.mcarthu(config)#spanning-tree extend system-id
c29s1c.lab.a.mcarthu(
 << config)#vlan internal allocation policy ascending
c29s1c.lab.a.mcarthu(config)#errdisable recovery cause all
c29s1c.lab.a.mcarthu(config)#errdisable recovery interval 1800
c29s1c.lab.a.mcarthu(config)#interface FastEthernet0
                          
 <<               ^
% Invalid input detected at '^' marker.

c29s1c.lab.a.mcarthu(config)# no ip address
% Incomplete command.

c29s1c.lab.a.mcarthu(config)#
Oct 18 10:42:10: % Multiple self signed certificates in config
    certificate for trust poin
 << t TP-self-signed-2494998912 ignored
 shutdown
% Incomplete command.

c29s1c.lab.a.mcarthu(config)#interface Vlan1
c29s1c.lab.a.mcarthu(config-if)# no ip address
c29s1c.lab.a.mcarthu(config-if)# no ip route-cache
c29s1c.lab.a.mcarthu(config-if)# shu
 << tdown
c29s1c.lab.a.mcarthu(config-if)#interface Vlan92
c29s1c.lab.a.mcarthu(config-if)#ip http server
c29s1c.lab.a.mcarthu(config)#ip http secure-server
c29s1c.lab.a.mcarthu(config)#logging facility local1
c29s1c.lab.a.mcarthu(config)#logging host 13
 << 0.18.8.12
c29s1c.lab.a.mcarthu(config)#username root privilege 15 secret Area=l*w
c29s1c.lab.a.mcarthu(config)#snmp-server community sysnet RO 1
c29s1c.lab.a.mcarthu(config)#snmp-server community c2-b2=a2 RW 1
c29s1c.lab.a.mcarthu(config)#snmp-server 
 << enable traps snmp authentication lin$ enable traps snmp authentication link         down linkaps snmp authentication linkdown linku         p 
 << coldstauthentication linkdown linkup coldstar         t warmstaion linkdown linkup coldstart warmstar         t
c29s1c.lab.a.mcarthu(config)#s
 << nmp-server enable traps transceiver all
c29s1c.lab.a.mcarthu(config)#snmp-server enable traps tty
c29s1c.lab.a.mcarthu(config)#snmp-server enable traps cluster
c29s1c.lab.a.mcarthu(config)#snmp-server enable traps config-copy
c29s1c.lab.a.mcarthu(conf
 << ig)#snmp-server enable traps config
c29s1c.lab.a.mcarthu(config)#snmp-server enable traps config-ctid
c29s1c.lab.a.mcarthu(config)#snmp-server enable traps dot1x auth-fail-vlan gu$ enable traps dot1x auth-
 << fail-vlan gue         st-vlan naps dot1x auth-fail-vlan guest-vlan no         -auth-faiuth-fail-vlan guest-vlan no-auth-fail         -v
 << lan no-vlan guest-vlan no-auth-fail-vlan no-g         uest-vlan
snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-auth-fail-vlan no-gu                         ^est-vlan

% Invalid input 
 << detected at '^' marker.

c29s1c.lab.a.mcarthu(config)#snmp-server enable traps entity
c29s1c.lab.a.mcarthu(config)#snmp-server enable traps power-ethernet police
c29s1c.lab.a.mcarthu(config)#snmp-server enable traps cpu threshold
c29s1c.lab.a.mcarthu
 << (config)#snmp-server enable traps rep
                                                      ^
% Invalid input detected at '^' marker.

c29s1c.lab.a.mcarthu(config)#snmp-server enable traps bridge newroot topology
 << $ enable traps bridge newroot topologyc         hange
c29s1c.lab.a.mcarthu(config)#snmp-server enable traps stpx inconsistency root$ enable traps stpx inconsistency root-         
 << inconsistaps stpx inconsistency root-inconsiste         ncy loop-nconsistency root-inconsistency loop-i         nconsiste
 << cy root-inconsistency loop-inconsisten         cy
c29s1c.lab.a.mcarthu(config)#snmp-server enable traps syslog
c29s1c.lab.a.mcarthu(config)#snmp-server enable traps vtp
c29s1c.lab.a.mcarthu(config)#snmp-server enable t
 << raps vlancreate
c29s1c.lab.a.mcarthu(config)#snmp-server enable traps vlandelete
c29s1c.lab.a.mcarthu(config)#snmp-server enable traps flash insertion removal
c29s1c.lab.a.mcarthu(config)#snmp-server enable traps port-security
c29s1c.lab.a.mcarthu(con
 << fig)#snmp-server enable traps envmon fan shutdown sup$ enable traps envmon fan shutdown supp         ly temperaps envmon fan shutdown supply tempera   
 <<       ture stat fan shutdown supply temperature statu         s
c29s1c.lab.a.mcarthu(config)#snmp-server enable traps errdisable
c29s1c.lab.a.mcarthu(config)#snmp-server enable traps mac-n
 << otification change$ enable traps mac-notification change          move threaps mac-notification change move thres         hold
c29s1c.lab.a.m
 << carthu(config)#snmp-server enable traps vlan-membership
c29s1c.lab.a.mcarthu(config)#snmp-server host 130.18.8.12 
% Incomplete command.

c29s1c.lab.a.mcarthu(config)#line con 0
c29s1c.lab.a.mcarthu(config-line)#line vty 0 4
c29s1c.lab.a.mcarthu(con
 << fig-line)# password Area=l*w
c29s1c.lab.a.mcarthu(config-line)# login
c29s1c.lab.a.mcarthu(config-line)#line vty 5 15
c29s1c.lab.a.mcarthu(config-line)# password Area=l*w
c29s1c.lab.a.mcarthu(config-line)# login
c29s1c.lab.a.mcarthu(config-line)#ntp 
 << server 10.92.0.5
c29s1c.lab.a.mcarthu(config)#end
c29s1c.lab.a.mcarthur#
Oct 18 10:42:21: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1c.lab.a.mcarthur#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1c.lab.a.mcarthu(config)#
Expect: matched string 1: (config)#
 >> spanning-tree mode mst

 >> spanning-tree etherchannel guard misconfig

 >> spanning-tree mst configuration

 >>  name msstate

 >>  revision 1

 >>  instance 1 vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 63, 70

 >>  instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 160

 >>  instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 230, 232, 242, 246

 >>  instance 1 vlan 256, 611-612, 654, 741, 996, 999

 >>  instance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037, 2039-2040

 >>  instance 2 vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096, 2104, 2110, 2126

 >>  instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 2189, 2194, 2202

 >>  instance 2 vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 2654, 2999

 >>  instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176, 196

 >>  instance 3 vlan 244, 248, 927

 >>  instance 4 vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072, 2108, 2113, 2128

 >>  instance 4 vlan 2144, 2176, 2196, 2244, 2248, 2927

 >>  instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 228

 >>  instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216, 2228

 >>  instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116, 124

 >>  instance 7 vlan 172, 186, 192, 204-208, 210, 240-241, 251-252, 630, 928

 >>  instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082, 2084

 >>  instance 8 vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208, 2210

 >>  instance 8 vlan 2240-2241, 2251-2252, 2630, 2928

 >>  instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102, 112

 >>  instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 500, 505, 510-511

 >>  instance 9 vlan 522, 551-570, 603, 629, 633, 742, 802, 926, 929

 >>  instance 10 vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 2057, 2062, 2068

 >>  instance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148, 2158

 >>  instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522, 2603, 2629, 2633

 >>  instance 10 vlan 2802, 2926, 2929

 >>  instance 11 vlan 8, 43, 52, 146, 156-157, 180, 200, 218

 >>  instance 12 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180, 2200, 2218

 >> 

 >> end

Expect: searching for 1 strs:  :Configured
 << spanning-tree mode mst
c29s1c.lab.a.mcarthu(config)#spanning-tree etherchannel guard misconfig
c29s1c.lab.a.mcarthu(config)#spanning-tree mst configuration
c29s1c.lab.a.mcarthu(config-mst)# name msstate
c29s1c.lab.a.mcarthu(config-mst)# revision 1
c2
 << 9s1c.lab.a.mcarthu(config-mst)# instance 1 vlan 2, 7, 11, 20, 22, 24, 31, 3$ vlan 2, 7, 11, 20, 22, 24, 31, 35         , 37, 39-, 11, 20, 22, 24, 31, 35, 37, 3
 << 9-4         0, 50, 6022, 24, 31, 35, 37, 39-40, 50, 60,          63, 70
c29s1c.lab.a.mcarthu(config-mst)# instance 1 vlan 78, 80, 86, 91, 96, 104, 11
 << $ vlan 78, 80, 86, 91, 96, 104, 110         , 126, 1380, 86, 91, 96, 104, 110, 126, 136         , 140, 15, 96, 104, 110, 126, 136, 140, 152         
 << , 160
c29s1c.lab.a.mcarthu(config-mst)# instance 1 vlan 162-163, 168, 189, 194, 202$ vlan 162-163, 168, 189, 194, 202,          220, 222163, 168, 189, 1
 << 94, 202, 220, 222,          230, 23289, 194, 202, 220, 222, 230, 232,          242, 246
c29s1c.lab.a.mcarthu(config-mst)# instance 1 vlan 256, 611-612, 654, 741, 996
 << $ vlan 256, 611-612, 654, 741, 996,          999
c29s1c.lab.a.mcarthu(config-mst)# instance 2 vlan 2002, 2007, 2011, 2020, 202$ vlan 2002, 2007, 2011, 2020, 2022         , 2024,
 <<  2, 2007, 2011, 2020, 2022, 2024, 20         31, 2035,11, 2020, 2022, 2024, 2031, 2035,          2037, 20320
 << 22, 2024, 2031, 2035, 2037, 2039         -2040
c29s1c.lab.a.mcarthu(config-mst)# instance 2 vlan 2050, 2060, 2063, 2070, 208$ vlan 2050, 2060, 2063, 2070, 2080         , 2086, 2
 << , 2060, 2063, 2070, 2080, 2086, 20         96, 2104,63, 2070, 2080, 2086, 2096, 2104,          2110, 2122080, 2086, 2096, 2
 << 104, 2110, 2126         
c29s1c.lab.a.mcarthu(config-mst)# instance 2 vlan 2136, 2140, 2152, 2160, 216$ vlan 2136, 2140, 2152, 2160, 2162         -2163, 21
 << , 2140, 2152, 2160, 2162-2163, 216         8, 2189, 52, 2160, 2162-2163, 2168, 2189, 2         194, 2202
c29s1c.lab.a.mcarthu(config-mst)# instance 2 vlan 2220, 2222, 2232, 2242, 224
 << $ vlan 2220, 2222, 2232, 2242, 2246         , 2611-26, 2222, 2232, 2242, 2246, 2611-261         2, 2654, 32, 224
 << 2, 2246, 2611-2612, 2654, 2         999
c29s1c.lab.a.mcarthu(config-mst)# instance 3 vlan 42, 51, 59, 64, 66, 69, 72,$ vlan 42, 51, 59, 64, 66, 69, 72,          108, 113,
 << 51, 59, 64, 66, 69, 72, 108, 113,          128, 144,, 66, 69, 72, 108, 113, 128, 144,          176, 196
c29s1c.lab.a.mcarthu(config-mst)# instance 3 vlan 244, 248, 927
c29
 << s1c.lab.a.mcarthu(config-mst)# instance 4 vlan 2042, 2051, 2059, 2064, 206$ vlan 2042, 2051, 2059, 2064, 2066         , 2069, 2, 2051, 2059, 2064, 2066, 2069, 
 << 20         72, 2108,59, 2064, 2066, 2069, 2072, 2108,          2113, 2122066, 2069, 2072, 2108, 2113, 2128         
c29s1c.lab.a.mcarthu(conf
 << ig-mst)# instance 4 vlan 2144, 2176, 2196, 2244, 224$ vlan 2144, 2176, 2196, 2244, 2248         , 2927
c29s1c.lab.a.mcarthu(config-mst)# instance 5 vlan 16, 48, 58, 88, 121, 131, 1
 << $ vlan 16, 48, 58, 88, 121, 131, 13         3-134, 2148, 58, 88, 121, 131, 133-134, 216         , 228
c29s1c.lab.a.mcarthu(config-mst)# instance 6 vlan 2016, 2048, 2058, 
 << 2088, 212$ vlan 2016, 2048, 2058, 2088, 2121         , 2131, 2, 2048, 2058, 2088, 2121, 2131, 21         33-2134, 
 << 58, 2088, 2121, 2131, 2133-2134, 2         216, 2228
c29s1c.lab.a.mcarthu(config-mst)# instance 7 vlan 9, 33-34, 38, 54, 56, 71, 7$ vlan 9, 33-34, 38, 54, 56, 71, 75         , 82, 84,
 << 3-34, 38, 54, 56, 71, 75, 82, 84,          97, 114, 54, 56, 71, 75, 82, 84, 97, 114, 1         16, 124
c29s1c.lab.a.mcarthu(config-mst)# instance 7 vlan
 <<  172, 186, 192, 204-208, 210$ vlan 172, 186, 192, 204-208, 210,          240-241,186, 192, 204-208, 210, 240-241,          251-252, 
 << 204-208, 210, 240-241, 251-252, 6         30, 928
c29s1c.lab.a.mcarthu(config-mst)# instance 8 vlan 2009, 2033-2034, 2038, 2054$ vlan 2009, 2033-2034, 2038, 2054,         
 <<  2056, 20, 2033-2034, 2038, 2054, 2056, 207         1, 2075, 4, 2038, 2054, 2056, 2071, 2075, 2         082, 2084
c29s1c.lab.a.mcarthu(config-mst)# 
 << instance 8 vlan 2097, 2114, 2116, 2124, 217$ vlan 2097, 2114, 2116, 2124, 2172         , 2186, 2, 2114, 2116, 2124, 2172, 2186, 21         92, 2204-
 << 16, 2124, 2172, 2186, 2192, 2204-2         208, 2210
c29s1c.lab.a.mcarthu(config-mst)# instance 8 vlan 2240-2241, 2251-2252, 2630,$ vlan 2240-2241, 2251-2252, 2
 << 630,          2928
c29s1c.lab.a.mcarthu(config-mst)# instance 9 vlan 4-5, 12, 18-19, 32, 44, 57,$ vlan 4-5, 12, 18-19, 32, 44, 57,          62, 68, 71
 << 2, 18-19, 32, 44, 57, 62, 68, 76         , 98-99, , 32, 44, 57, 62, 68, 76, 98-99, 1         02, 112
c29s1c.lab.a.mcarthu(config-mst)# instance 9 vlan 130, 132, 147-148, 158, 212
 << $ vlan 130, 132, 147-148, 158, 212,          226, 236132, 147-148, 158, 212, 226, 236,          500, 505148, 158, 212, 226,
 <<  236, 500, 505,          510-511
c29s1c.lab.a.mcarthu(config-mst)# instance 9 vlan 522, 551-570, 603, 629, 633$ vlan 522, 551-570, 603, 629, 633,          742, 802
 << 551-570, 603, 629, 633, 742, 802,          926, 929
c29s1c.lab.a.mcarthu(config-mst)# instance 10 vlan 2004-2005, 2012, 2018-2019$0 vlan 2004-2005, 2012, 2018-2019,          2032,
 <<  204-2005, 2012, 2018-2019, 2032, 204         4, 2057, 12, 2018-2019, 2032, 2044, 2057, 2         062, 2068
c29s1c.lab.a.mcarthu(config-mst)# instance
 <<  10 vlan 2076, 2098-2099, 2102, 211$0 vlan 2076, 2098-2099, 2102, 2112         , 2130, 26, 2098-2099, 2102, 2112, 2130, 21         32, 2147-
 << 99, 2102, 2112, 2130, 2132, 2147-2         148, 2158
c29s1c.lab.a.mcarthu(config-mst)# instance 10 vlan 2212, 2236, 2500, 2505, 25$0 vlan 2212, 2236, 2500, 2505, 251   
 <<       0-2511, 22, 2236, 2500, 2505, 2510-2511, 25         22, 2603,500, 2505, 2510-2511, 2522, 2603,          2629, 263
 <<  2510-2511, 2522, 2603, 2629, 2633         
c29s1c.lab.a.mcarthu(config-mst)# instance 10 vlan 2802, 2926, 2929
c29s1c.lab.a.mcarthu(config-mst)# instance 11 vlan 8, 43, 52, 146, 156-157, 1
 << $1 vlan 8, 43, 52, 146, 156-157, 18         0, 200, 243, 52, 146, 156-157, 180, 200, 21         8
c29s1c.lab.a.mcarthu(config-mst)# instance 12 vlan 2008, 2043, 2052, 2146, 21
 << $2 vlan 2008, 2043, 2052, 2146, 215         6-2157, 28, 2043, 2052, 2146, 2156-2157, 21         80, 2200,052, 2146, 
 << 2156-2157, 2180, 2200,          2218
c29s1c.lab.a.mcarthu(config-mst)#
c29s1c.lab.a.mcarthu(config-mst)#end
c29s1c.lab.a.mcarthur#
 << 
Oct 18 10:42:39: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1c.lab.a.mcarthur#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1c.lab.a.mcarthu(config)#
Expect: matched string 1: (config)#
 >> hostname c29s1c.lab.a.mcarthur 

Expect: searching for 2 strs:  :# :>
 << hostname c29s1c.lab.a.mcarthur 
c29s1c.lab.a.mcarthu(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s1c.lab.a.mcarthur#
 << 
Oct 18 10:42:45: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1c.lab.a.mcarthur#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1c.lab.a.mcarthu(config)#
Expect: matched string 1: (config)#
 >> snmp-server contact  

Expect: searching for 1 strs:  :#
 << snmp-server contact  
% Incomplete command.

c29s1c.lab.a.mcarthu(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s1c.lab.a.mcarthur#
 << 
Oct 18 10:42:51: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1c.lab.a.mcarthur#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1c.lab.a.mcarthu(config)#
Expect: matched string 1: (config)#
 >> interface vlan 92

Expect: searching for 1 strs:  :(config-if)#
 << interface vlan 92
c29s1c.lab.a.mcarthu(config-if)#
Expect: matched string 1: (config-if)#
 >> ip address 10.92.5.146 255.255.0.0

 >> ip broadcast-address 10.92.255.255

 >> end

Expect: searching for 1 strs:  :Configured
 << ip address 10.92.5.146 255.255.0.0
c29s1c.lab.a.mcarthu(config-if)#ip broadcast-address 10.92.255.255
c29s1c.lab.a.mcarthu(config-if)#end
c29s1c.lab.a.mcarthur#
 << 
Oct 18 10:42:58: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1c.lab.a.mcarthur#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1c.lab.a.mcarthu(config)#
Expect: matched string 1: (config)#
 >> interface Vlan92

Expect: searching for 1 strs:  :(config-if)#
 << interface Vlan92
c29s1c.lab.a.mcarthu(config-if)#
Expect: matched string 1: (config-if)#
 >> ip default-gateway 10.92.0.1

 >> end

Expect: searching for 1 strs:  :Configured
 << ip default-gateway 10.92.0.1
c29s1c.lab.a.mcarthu(config)#end
c29s1c.lab.a.mcarthur#
Oct 18 10:43:04: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1c.lab.a.mcarthur#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1c.lab.a.mcarthu(config)#
Expect: matched string 1: (config)#
 >> ip dhcp snooping

Expect: searching for 1 strs:  :#
 << ip dhcp snooping
c29s1c.lab.a.mcarthu(config)#
Expect: matched string 1: #
 >> ip dhcp snooping vlan 60

Expect: searching for 1 strs:  :#
 << ip dhcp snooping vlan 60
c29s1c.lab.a.mcarthu(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s1c.lab.a.mcarthur#
Oct 18 10:43:11: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1c.lab.a.mcarthur#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1c.lab.a.mcarthu(config)#
Expect: matched string 1: (config)#
 >> default interface range gi0/1 - 8 

 >> interface range gi0/1 - 8 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi0/1 - 8 
c29s1c.lab.a.mcarthu(config)#interface range gi0/1 - 8 
c29s1c.lab.a.mcarthu(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport access vlan 60

 >> switchport mode access

 >> spanning-tree portfast

 >> switchport port-security maximum 2

 >> switchport port-security

 >> switchport port-security aging time 15

 >> switchport port-security violation protect

 >> switchport port-security aging type inactivity

 >> power inline never

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport access vlan 60
c29s1c.lab.a.mcarthu(config-if-range)#switchport mode access
c29s1c.lab.a.mcarthu(config-if-range)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, concen
 << trators, switches, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast will be configured in 8 interfaces due to the range command 
 but will only have effect when the interfa
 << ces are in a non-trunking mode.
c29s1c.lab.a.mcarthu(config-if-range)#switchport port-security maximum 2
c29s1c.lab.a.mcarthu(config-if-range)#switchport port-security
c29s1c.lab.a.mcarthu(config-if-range)#switchport port-security aging time 15
c29s1c
 << .lab.a.mcarthu(config-if-range)#switchport port-security violation prot$port-security violation prote         ct
c29s1c.lab.a.mcarthu(config-if-range)#switchport port-security aging type ina
 << $port-security aging type inac         tivity
c29s1c.lab.a.mcarthu(config-if-range)#power inline never
c29s1c.lab.a.mcarthu(config-if-range)#end
c29s1c.lab.a.mcarthur#
 << 
Oct 18 10:43:18: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1c.lab.a.mcarthur#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1c.lab.a.mcarthu(config)#
Expect: matched string 1: (config)#
 >> default interface range gi0/1 - 4 

 >> interface range gi0/1 - 4 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi0/1 - 4 
c29s1c.lab.a.mcarthu(config)#interface range gi0/1 - 4 
c29s1c.lab.a.mcarthu(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport access vlan 673

 >> switchport mode access

 >> spanning-tree portfast

 >> power inline never

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport access vlan 673
c29s1c.lab.a.mcarthu(config-if-range)#switchport mode access
c29s1c.lab.a.mcarthu(config-if-range)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, conce
 << ntrators, switches, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast will be configured in 4 interfaces due to the range command 
 but will only have effect when the interf
 << aces are in a non-trunking mode.
c29s1c.lab.a.mcarthu(config-if-range)#power inline never
c29s1c.lab.a.mcarthu(config-if-range)#end
c29s1c.lab.a.mcarthur#
 << 
Oct 18 10:43:24: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1c.lab.a.mcarthur#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1c.lab.a.mcarthu(config)#
Expect: matched string 1: (config)#
 >> default interface gi0/5 

 >> interface gi0/5 

Expect: searching for 1 strs:  :(config-if)#
 << default interface gi0/5 
Interface GigabitEthernet0/5 set to default configuration
c29s1c.lab.a.mcarthu(config)#interface gi0/5 
c29s1c.lab.a.mcarthu(config-if)#
Expect: matched string 1: (config-if)#
 >> switchport access vlan 28

 >> switchport mode access

 >> spanning-tree portfast

 >> power inline never

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport access vlan 28
c29s1c.lab.a.mcarthu(config-if)#switchport mode access
c29s1c.lab.a.mcarthu(config-if)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, concentrators, swi
 << tches, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast has been configured on GigabitEthernet0/5 but will only
 have effect when the interface is in a non-trunking mode.

 << c29s1c.lab.a.mcarthu(config-if)#power inline never
c29s1c.lab.a.mcarthu(config-if)#end
c29s1c.lab.a.mcarthur#
 << 
Oct 18 10:43:30: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1c.lab.a.mcarthur#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1c.lab.a.mcarthu(config)#
Expect: matched string 1: (config)#
 >> default interface gi0/8 

 >> interface gi0/8 

Expect: searching for 1 strs:  :(config-if)#
 << default interface gi0/8 
Interface GigabitEthernet0/8 set to default configuration
c29s1c.lab.a.mcarthu(config)#interface gi0/8 
c29s1c.lab.a.mcarthu(config-if)#
Expect: matched string 1: (config-if)#
 >> switchport access vlan 91

 >> switchport mode access

 >> spanning-tree portfast

 >> power inline never

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport access vlan 91
c29s1c.lab.a.mcarthu(config-if)#switchport mode access
c29s1c.lab.a.mcarthu(config-if)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, concentrators, swi
 << tches, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast has been configured on GigabitEthernet0/8 but will only
 have effect when the interface is in a non-trunking mode.

 << c29s1c.lab.a.mcarthu(config-if)#power inline never
c29s1c.lab.a.mcarthu(config-if)#end
c29s1c.lab.a.mcarthur#
 << 
Oct 18 10:43:36: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1c.lab.a.mcarthur#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1c.lab.a.mcarthu(config)#
Expect: matched string 1: (config)#
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s1c.lab.a.mcarthur#
 << 
Oct 18 10:43:40: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> write mem

Expect: searching for 2 strs:  :# :>
 << 
c29s1c.lab.a.mcarthur#write mem
Building configuration...
[OK]
c29s1c.lab.a.mcarthur#
Expect: matched string 1: #
 >> 
Expect: searching for 2 strs:  :# :>
 << 
c29s1c.lab.a.mcarthur#
c29s1c.lab.a.mcarthur#
Expect: matched string 1: #
 >> sh run

Expect: searching for 2 strs:  :# :>
 << sh run
Building configuration...

Current configuration : 7407 bytes
!
! Last configuration change at 10:43:40 CDT Tue Oct 18 2016
! NVRAM config last updated at 10:43:43 CDT Tue Oct 18 2016
!
version 15.2
no service pad
service timestamps debug
 <<  datetime localtime
service timestamps log datetime localtime
service password-encryption
!
hostname c29s1c.lab.a.mcarthur
!
boot-start-marker
boot-end-marker
!
enable secret 5 $1$1OgG$82i55EgIpHzSU9aqUgSJs0
enable password 7 1436000E0D59266133
 << 
!
username root privilege 15 secret 5 $1$ML9r$nru6txc1JBvsNZiUO6JmU0
no aaa new-model
clock timezone CST -6 0
clock summer-time CDT recurring
system mtu routing 1500
!
!
!
!
!
!
ip dhcp snooping vlan 60
ip dhcp snooping
ip domain-name mgmt.
 << msstate.edu
ip name-server 130.18.80.12
!
!
!
!
!
authentication mac-move permit
!
!
crypto pki trustpoint TP-self-signed-2494998912
 enrollment selfsigned
 subject-name cn=IOS-Self-Signed-Certificate-2494998912
 revocation-check none
 rsake
 << ypair TP-self-signed-2494998912
!
!
crypto pki certificate chain TP-self-signed-2494998912
 certificate self-signed 01
  	quit
!
spanning-tree mode mst
spanning-tree portfast edge bpduguard default
spanning-tree extend system-id
!
spanning-tree
 <<  mst configuration
 name msstate
 revision 1
 instance 1 vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 63, 70
 instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 160
 instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 230, 
 << 232, 242, 246
 instance 1 vlan 256, 611-612, 654, 741, 996, 999
 instance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037, 2039-2040
 instance 2 vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096, 2104, 2110, 2126
 instance 2 vlan 2136, 2140, 2
 << 152, 2160, 2162-2163, 2168, 2189, 2194, 2202
 instance 2 vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 2654, 2999
 instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176, 196
 instance 3 vlan 244, 248, 927
 instance 4 vlan 2042, 2051, 205
 << 9, 2064, 2066, 2069, 2072, 2108, 2113, 2128
 instance 4 vlan 2144, 2176, 2196, 2244, 2248, 2927
 instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 228
 instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216, 2228
 instance 7 vlan 9,
 <<  33-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116, 124
 instance 7 vlan 172, 186, 192, 204-208, 210, 240-241, 251-252, 630, 928
 instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082, 2084
 instance 8 vlan 2097, 2114, 2116, 2124, 2172, 218
 << 6, 2192, 2204-2208, 2210
 instance 8 vlan 2240-2241, 2251-2252, 2630, 2928
 instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102, 112
 instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 500, 505, 510-511
 instance 9 vlan 522, 551-570
 << , 603, 629, 633, 742, 802, 926, 929
 instance 10 vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 2057, 2062, 2068
 instance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148, 2158
 instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522, 2603, 2
 << 629, 2633
 instance 10 vlan 2802, 2926, 2929
 instance 11 vlan 8, 43, 52, 146, 156-157, 180, 200, 218
 instance 12 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180, 2200, 2218
!
errdisable recovery cause udld
errdisable recovery cause bpduguard
errdisa
 << ble recovery cause security-violation
errdisable recovery cause channel-misconfig
errdisable recovery cause pagp-flap
errdisable recovery cause dtp-flap
errdisable recovery cause link-flap
errdisable recovery cause sfp-config-mismatch
errdisable rec
 << overy cause gbic-invalid
errdisable recovery cause psecure-violation
errdisable recovery cause port-mode-failure
errdisable recovery cause dhcp-rate-limit
errdisable recovery cause pppoe-ia-rate-limit
errdisable recovery cause mac-limit
errdisable r
 << ecovery cause vmps
errdisable recovery cause storm-control
errdisable recovery cause inline-power
errdisable recovery cause arp-inspection
errdisable recovery cause loopback
errdisable recovery cause small-frame
errdisable recovery cause psp
errdis
 << able recovery interval 1800
!
!
!
!
vlan internal allocation policy ascending
!
!
! 
!
!
!
!
!
!
!
!
!
interface GigabitEthernet0/1
 switchport access vlan 673
 switchport mode access
 power inline never
 spanning-tree portfast edge
 << 
!
interface GigabitEthernet0/2
 switchport access vlan 673
 switchport mode access
 power inline never
 spanning-tree portfast edge
!
interface GigabitEthernet0/3
 switchport access vlan 673
 switchport mode access
 power inline never
 spannin
 << g-tree portfast edge
!
interface GigabitEthernet0/4
 switchport access vlan 673
 switchport mode access
 power inline never
 spanning-tree portfast edge
!
interface GigabitEthernet0/5
 switchport access vlan 28
 switchport mode access
 power in
 << line never
 spanning-tree portfast edge
!
interface GigabitEthernet0/6
 switchport access vlan 60
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 swi
 << tchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast edge
!
interface GigabitEthernet0/7
 switchport access vlan 60
 switchport mode access
 switchport port-security maximum 2
 switchpo
 << rt port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast edge
!
interface GigabitEthernet0/8
 switchport access
 <<  vlan 91
 switchport mode access
 power inline never
 spanning-tree portfast edge
!
interface GigabitEthernet0/9
 switchport trunk native vlan 92
 switchport mode trunk
 no keepalive
 ip dhcp snooping trust
!
interface GigabitEthernet0/10
 swi
 << tchport trunk native vlan 92
 switchport mode trunk
 no keepalive
 ip dhcp snooping trust
!
interface GigabitEthernet0/11
 switchport trunk native vlan 92
 switchport mode trunk
 ip dhcp snooping trust
!
interface GigabitEthernet0/12
 switchpor
 << t trunk native vlan 92
 switchport mode trunk
 ip dhcp snooping trust
!
interface Vlan1
 no ip address
 no ip route-cache
 shutdown
!
interface Vlan92
 ip address 10.92.5.146 255.255.0.0
 ip broadcast-address 10.92.255.255
!
ip default-gatewa
 << y 10.92.0.1
ip forward-protocol nd
ip http server
ip http secure-server
!
!
!
logging facility local1
logging host 130.18.8.12
!
snmp-server community sysnet RO 1
snmp-server community c2-b2=a2 RW 1
snmp-server enable traps snmp authentication
 <<  linkdown linkup coldstart warmstart
snmp-server enable traps transceiver all
snmp-server enable traps tty
snmp-server enable traps cluster
snmp-server enable traps config-copy
snmp-server enable traps config
snmp-server enable traps config-ctid
sn
 << mp-server enable traps entity
snmp-server enable traps power-ethernet police
snmp-server enable traps cpu threshold
snmp-server enable traps bridge newroot topologychange
snmp-server enable traps stpx inconsistency root-inconsistency loop-inconsistenc
 << y
snmp-server enable traps syslog
snmp-server enable traps vtp
snmp-server enable traps vlancreate
snmp-server enable traps vlandelete
snmp-server enable traps flash insertion removal
snmp-server enable traps port-security
snmp-server enable traps 
 << envmon fan shutdown supply temperature status
snmp-server enable traps errdisable
snmp-server enable traps mac-notification change move threshold
snmp-server enable traps vlan-membership
!
line con 0
line vty 0 4
 password 7 052A140A201142430E
 lo
 << gin
line vty 5 15
 password 7 11280B00164F074613
 login
!
ntp server 10.92.0.5
end

c29s1c.lab.a.mcarthur#
Expect: matched string 1: #
 >> show interface status

Expect: searching for 2 strs:  :# :>
 << show interface status

Port      Name               Status       Vlan       Duplex  Speed Type 
Gi0/1                        notconnect   673          auto   auto 10/100/1000BaseTX
Gi0/2                        notconnect   673          auto   auto 10/
 << 100/1000BaseTX
Gi0/3                        notconnect   673          auto   auto 10/100/1000BaseTX
Gi0/4                        notconnect   673          auto   auto 10/100/1000BaseTX
Gi0/5                        notconnect   28           auto   auto 
 << 10/100/1000BaseTX
Gi0/6                        notconnect   60           auto   auto 10/100/1000BaseTX
Gi0/7                        notconnect   60           auto   auto 10/100/1000BaseTX
Gi0/8                        notconnect   91           auto   au
 << to 10/100/1000BaseTX
Gi0/9                        notconnect   1            auto   auto 10/100/1000BaseTX
Gi0/10                       notconnect   1            auto   auto 10/100/1000BaseTX
Gi0/11                       notconnect   1            auto  
 <<  auto Not Present
Gi0/12                       notconnect   1            auto   auto Not Present
c29s1c.lab.a.mcarthur#
Expect: matched string 1: #
