trying to use serial port: /dev/ttyUSB0
 >> 
 >> 

Expect: searching for 4 strs:  :[yes/no] :Press RETURN to get started. :# :Switch>
 << 
Switch>
Switch>
Switch>
Switch>
Expect: matched string 4: Switch>
 >> term len 0

Expect: searching for 2 strs:  :# :>
 << term len 0
Switch>
Expect: matched string 2: >
 >> show version

Expect: searching for 2 strs:  :# :>
 << show version
Cisco IOS Software, C2960X Software (C2960X-UNIVERSALK9-M), Version 15.2(2)E4, RELEASE SOFTWARE (fc2)
Technical Support: http://www.cisco.com/techsupport
Copyright (c) 1986-2016 by Cisco Systems, Inc.
Compiled Fri 12-Feb-16 22:57 by prod_
 << rel_team

ROM: Bootstrap program is C2960X boot loader
BOOTLDR: C2960X Boot Loader (C2960X-HBOOT-M) Version 15.2(3r)E1, RELEASE SOFTWARE (fc1)

Switch uptime is 8 minutes
System returned to ROM by power-on
System restarted at 15:02:00 UTC Tue Dec 6
 <<  2016
System image file is "flash:/c2960x-universalk9-mz.152-2.E4/c2960x-universalk9-mz.152-2.E4.bin"
Last reload reason: Reload command



This product contains cryptographic features and is subject to United
States and local country laws governin
 << g import, export, transfer and
use. Delivery of Cisco cryptographic products does not imply
third-party authority to import, export, distribute or use encryption.
Importers, exporters, distributors and users are responsible for
compliance with U.S. an
 << d local country laws. By using this product you
agree to comply with applicable laws and regulations. If you are unable
to comply with U.S. and local laws, return this product immediately.

A summary of U.S. laws governing Cisco cryptographic products
 <<  may be found at:
http://www.cisco.com/wwl/export/crypto/tool/stqrg.html

If you require further assistance please contact us by sending email to
export@cisco.com.

cisco WS-C2960X-48FPD-L (APM86XXX) processor (revision M0) with 524288K bytes of mem
 << ory.
Processor board ID FCW2027B1L1
Last reset from power-on
1 Virtual Ethernet interface
1 FastEthernet interface
50 Gigabit Ethernet interfaces
2 Ten Gigabit Ethernet interfaces
The password-recovery mechanism is enabled.

512K bytes of flash-s
 << imulated non-volatile configuration memory.
Base ethernet MAC Address       : 00:A2:89:89:88:80
Motherboard assembly number     : 73-16686-05
Power supply part number        : 341-0527-02
Motherboard serial number       : FOC20267PZL
Power supply ser
 << ial number      : DCB202361LE
Model revision number           : M0
Motherboard revision number     : A0
Model number                    : WS-C2960X-48FPD-L
Daughterboard assembly number   : 73-14200-03
Daughterboard serial number     : FOC20271QRZ
S
 << ystem serial number            : FCW2027B1L1
Top Assembly Part Number        : 68-100463-01
Top Assembly Revision Number    : C0
Version ID                      : V05
CLEI Code Number                : CMMLJ00ARD
Daughterboard revision number   : A0

 << Hardware Board Revision Number  : 0x18


Switch Ports Model                     SW Version            SW Image                 
------ ----- -----                     ----------            ----------               
*    1 52    WS-C2960X-48FPD-L     
 <<     15.2(2)E4             C2960X-UNIVERSALK9-M     


Configuration register is 0xF

Switch>
Expect: matched string 2: >
 >> enable

Expect: searching for 2 strs:  :Password: :#
 << enable
Switch#
Expect: matched string 2: #
 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
Expect: matched string 1: (config)#
 >> no service pad

 >> service timestamps debug datetime localtime

 >> service timestamps log datetime localtime

 >> service password-encryption

 >> boot-start-marker

 >> boot-end-marker

 >> enable secret Area=l*w

 >> enable password Area=l*w

 >> no aaa new-model

 >> clock timezone CST -6 0

 >> clock summer-time CDT recurring

 >> authentication mac-move permit

 >> ip domain-name mgmt.msstate.edu

 >> ip name-server 130.18.80.12

 >> vtp domain vtp01.mgmt.msstate.edu

 >> vtp mode client

 >> crypto pki trustpoint TP-self-signed-2494998912

 >>  enrollment selfsigned

 >>  subject-name cn=IOS-Self-Signed-Certificate-2494998912

 >>  revocation-check none

 >>  rsakeypair TP-self-signed-2494998912

 >> crypto pki certificate chain TP-self-signed-2494998912

 >>  certificate self-signed 01 nvram:IOS-Self-Sig#3232.cer

 >> spanning-tree portfast bpduguard default

 >> spanning-tree extend system-id

 >> vlan internal allocation policy ascending

 >> errdisable recovery cause all

 >> errdisable recovery interval 1800

 >> interface FastEthernet0

 >>  no ip address

 >>  shutdown

 >> interface Vlan1

 >>  no ip address

 >>  no ip route-cache

 >>  shutdown

 >> interface Vlan92

 >> no ip http server

 >> no ip http secure-server

 >> logging facility local1

 >> logging host 130.18.8.12

 >> access-list 1 permit 10.92.0.0 0.0.255.255

 >> access-list 1 permit 130.18.8.0 0.0.0.255

 >> access-list 1 permit 10.93.0.0 0.0.255.255

 >> access-list 1 permit 130.18.1.0 0.0.0.255

 >> snmp-server community sysnet RO 1

 >> snmp-server community c2-b2=a2 RW 1

 >> snmp-server enable traps snmp authentication linkdown linkup coldstart warmstart

 >> snmp-server enable traps transceiver all

 >> snmp-server enable traps tty

 >> snmp-server enable traps cluster

 >> snmp-server enable traps config-copy

 >> snmp-server enable traps config

 >> snmp-server enable traps config-ctid

 >> snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-auth-fail-vlan no-guest-vlan

 >> snmp-server enable traps entity

 >> snmp-server enable traps power-ethernet police

 >> snmp-server enable traps cpu threshold

 >> snmp-server enable traps rep

 >> snmp-server enable traps bridge newroot topologychange

 >> snmp-server enable traps stpx inconsistency root-inconsistency loop-inconsistency

 >> snmp-server enable traps syslog

 >> snmp-server enable traps vtp

 >> snmp-server enable traps vlancreate

 >> snmp-server enable traps vlandelete

 >> snmp-server enable traps flash insertion removal

 >> snmp-server enable traps port-security

 >> snmp-server enable traps envmon fan shutdown supply temperature status

 >> snmp-server enable traps errdisable

 >> snmp-server enable traps mac-notification change move threshold

 >> snmp-server enable traps vlan-membership

 >> snmp-server host 130.18.8.12 sysnet 

 >> line con 0

 >> line vty 0 15

 >>  access-class 1 in

 >>  password Area=l*w

 >>  login

 >>  transport input all

 >> ntp server 10.92.0.5

 >> username root privilege 15 secret Area=l*w

 >> 

 >> end

Expect: searching for 1 strs:  :Configured
 << no service pad
Switch(config)#service timestamps debug datetime localtime
Switch(config)#service timestamps log datetime localtime
Switch(config)#service password-encryption
Switch(config)#boot-start-marker
Switch(config)#boot-end-marker
Switch(conf
 << ig)#enable secret Area=l*w
Switch(config)#enable password Area=l*w
The enable password you have chosen is the same as your enable secret.
This is not recommended.  Re-enter the enable password.

Switch(config)#no aaa new-model
Switch(config)#clock t
 << imezone CST -6 0
Switch(config)#clock summer-time CDT recurring
Switch(config)#authentication mac-move permit
Switch(config)#ip domain-name mgmt.msstate.edu
Switch(config)#ip name-server 130.18.80.12
Switch(config)#vtp domain vtp01.mgmt.msstate.edu

 << Domain name already set to vtp01.mgmt.msstate.edu.
Switch(config)#vtp mode client
Device mode already VTP Client for VLANS.
Switch(config)#crypto pki trustpoint TP-self-signed-2494998912
Switch(ca-trustpoint)# enrollment selfsigned
Switch(ca-trustpoi
 << nt)# subject-name cn=IOS-Self-Signed-Certificate-2494998912
Switch(ca-trustpoint)#
Dec  6 09:13:39: %SYS-6-CLOCKUPDATE: System clock has been updated from 15:13:39 UTC Tue Dec 6 2016 to 09:13:39 CST Tue Dec 6 2016, configured from console by console.
D
 << ec  6 09:13:40: %SYS-6-CLOCKUPDATE: System clock has been updated from 09:13:40 CST Tue Dec 6 2016 to 09:13:40 CST Tue Dec 6 2016, configured from console by console. revocation-check none
Switch(ca-trustpoint)# rsakeypair TP-self-signed-2494998912
Swit
 << ch(ca-trustpoint)#crypto pki certificate chain TP-self-signed-2494998912
Switch(config-cert-chain)# certificate self-signed 01 nvram:IOS-Self-Sig#3232$e self-signed 01 nvram:IOS-Self-Sig#3232.         
 << cer
Switch(config-cert-chain)#spanning-tree portfast bpduguard default
Switch(config)#spanning-tree extend system-id
Switch(config)#vlan internal allocation policy ascending
Switch(config)#errdisable recovery cause all
Switch(config)#errdisabl
 << e recovery interval 1800
Switch(config)#interface FastEthernet0
Switch(config-if)# no ip address
Switch(config-if)# shutdown
Switch(config-if)#interface Vlan1
Switch(config-if)# no ip address
Switch(config-if)# no ip route-cache
Switch(config-if)# 
 << shutdown
Switch(config-if)#interface Vlan92
Switch(config-if)#no ip http server
Switch(config)#no ip http secure-server
Switch(config)#logging facility local1
Switch(config)#logging host 130.18.8.12
Switch(config)#access-list 1 permit 10.92.0.0 0.0.
 << 255.255
Switch(config)#access-list 1 permit 130.18.8.0 0.0.0.255
Switch(config)#
Dec  6 09:13:46: %SYS-6-LOGGINGHOST_STARTSTOP: Logging to host 130.18.8.12 port 0 CLI Request Triggered
Dec  6 09:13:46: %SYS-6-LOGGINGHOST_STARTSTOP: Logging to host 130
 << .18.8.12 port 514 started - CLI initiatedaccess-list 1 permit 10.93.0.0 0.0.255.255
Switch(config)#access-list 1 permit 130.18.1.0 0.0.0.255
Switch(config)#snmp-server community sysnet RO 1
Switch(config)#snmp-server community c2-b2=a2 RW 1
Switch(con
 << fig)#snmp-server enable traps snmp authentication linkdown linkup c$ enable traps snmp authentication linkdown linkup co         ldstart w
 << aps snmp authentication linkdown linkup coldstart wa         rmstart
Switch(config)#
Dec  6 09:13:46: %LINK-5-CHANGED: Interface FastEthernet0, changed state to administratively down
Dec  6 09:13:47: %LINK-5-CHANGED: Interface V
 << lan1, changed state to administratively downsnmp-server enable traps transceiver all
Switch(config)#snmp-server enable traps tty
Switch(config)#snmp-server enable traps cluster
Switch(config)#snmp-server enable traps config-copy
Switch(config)#snmp-se
 << rver enable traps config
Switch(config)#snmp-server enable traps config-ctid
Switch(config)#snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-au$ enable traps dot1x auth-fail-vlan g
 << uest-vlan no-aut         h-fail-vlaps dot1x auth-fail-vlan guest-vlan no-auth-fail-vla         n no-guesuth-fail-vla
 << n guest-vlan no-auth-fail-vlan no-guest         -vlan
snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-auth-fail-vlan no-gu                         ^est-vlan

% Invalid input detected at '^' marker.

Switch(config)#snmp-server ena
 << ble traps entity
Switch(config)#snmp-server enable traps power-ethernet police
Switch(config)#snmp-server enable traps cpu threshold
Switch(config)#snmp-server enable traps rep
                                        ^
% Invalid input detected at '^'
 <<  marker.

Switch(config)#snmp-server enable traps bridge newroot topologychange
Switch(config)#snmp-server enable traps stpx inconsistency root-inconsistency$ enable traps stpx inconsistency
 <<  root-inconsistency          loop-incoaps stpx inconsistency root-inconsistency loop-incon         sistency
Switch(config)#snmp-server enable traps syslog
Switch(config)#snmp
 << -server enable traps vtp
Switch(config)#snmp-server enable traps vlancreate
Switch(config)#snmp-server enable traps vlandelete
Switch(config)#snmp-server enable traps flash insertion removal
Switch(config)#snmp-server enable traps port-security
Switc
 << h(config)#snmp-server enable traps envmon fan shutdown supply temperatur$ enable traps envmon fan shutdown supply temperature          status
Switch(config)#snmp-server enable traps e
 << rrdisable
Switch(config)#snmp-server enable traps mac-notification change move threshol$ enable traps mac-notification change move threshold         
Switch(config)#snmp-server enabl
 << e traps vlan-membership
Switch(config)#snmp-server host 130.18.8.12 sysnet 
Switch(config)#line con 0
Switch(config-line)#line vty 0 15
Switch(config-line)# access-class 1 in
Switch(config-line)# password Area=l*w
Switch(config-line)# login
Switch(
 << config-line)# transport input all
Switch(config-line)#ntp server 10.92.0.5
Switch(config)#username root privilege 15 secret Area=l*w
Switch(config)#
Switch(config)#end
Switch#
 << 
Dec  6 09:13:55: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
Switch#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
Expect: matched string 1: (config)#
 >> spanning-tree mode mst

 >> spanning-tree etherchannel guard misconfig

 >> spanning-tree mst configuration

 >>  name msstate

 >>  revision 1

 >>  instance 1 vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 63, 70

 >>  instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 160

 >>  instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 230, 232, 242, 246

 >>  instance 1 vlan 256, 611-612, 654, 741, 996, 999

 >>  instance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037, 2039-2040

 >>  instance 2 vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096, 2104, 2110, 2126

 >>  instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 2189, 2194, 2202

 >>  instance 2 vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 2654, 2999

 >>  instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176, 196

 >>  instance 3 vlan 244, 248, 927

 >>  instance 4 vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072, 2108, 2113, 2128

 >>  instance 4 vlan 2144, 2176, 2196, 2244, 2248, 2927

 >>  instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 228

 >>  instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216, 2228

 >>  instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116, 124

 >>  instance 7 vlan 172, 186, 192, 204-208, 210, 240-241, 251-252, 630, 928

 >>  instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082, 2084

 >>  instance 8 vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208, 2210

 >>  instance 8 vlan 2240-2241, 2251-2252, 2630, 2928

 >>  instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102, 112

 >>  instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 500, 505, 510-511

 >>  instance 9 vlan 522, 551-570, 603, 629, 633, 742, 802, 926, 929

 >>  instance 10 vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 2057, 2062, 2068

 >>  instance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148, 2158

 >>  instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522, 2603, 2629, 2633

 >>  instance 10 vlan 2802, 2926, 2929

 >>  instance 11 vlan 8, 43, 52, 146, 156-157, 180, 200, 218

 >>  instance 12 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180, 2200, 2218

 >> 

 >> end

Expect: searching for 1 strs:  :Configured
 << spanning-tree mode mst
Switch(config)#spanning-tree etherchannel guard misconfig
Switch(config)#spanning-tree mst configuration
Switch(config-mst)# name msstate
Switch(config-mst)# revision 1
Switch(config-mst)# instance 1 vlan 2, 7, 11, 20, 22, 24, 
 << 31, 35, 37, 39-40, $ vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40, 5         0, 60, 63, 11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 
 << 63,          70
Switch(config-mst)# instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 1$ vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 14         0, 152, 1
 << 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 16         0
Switch(config-mst)# instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 23$ vlan 162-1
 << 63, 168, 189, 194, 202, 220, 222, 230         , 232, 24163, 168, 189, 194, 202, 220, 222, 230, 232, 242         , 246
Switch(config-mst)# instance 1 vlan 256, 611-612, 654, 741, 9
 << 96, 999
Switch(config-mst)# instance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031,$ vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031,          2035, 203
 << , 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037         , 2039-2011, 2020, 2022, 2024, 2031, 2035, 2037, 2039-204         0
Switch(config-mst)# instance 2 v
 << lan 2050, 2060, 2063, 2070, 2080, 2086, 2096,$ vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096,          2104, 211, 2060, 2063, 2070,
 <<  2080, 2086, 2096, 2104, 2110         , 2126
Switch(config-mst)# instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, $ vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 2         
 << 189, 2194, 2140, 2152, 2160, 2162-2163, 2168, 2189, 2194,          2202
Switch(config-mst)# instance 2 vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 
 << $ vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 2         654, 2999
Switch(config-mst)# instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128$ vlan 42, 51, 59, 64
 << , 66, 69, 72, 108, 113, 128,          144, 17651, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176,          196
Switch(config-mst)# instance 3 vlan 244, 248, 927
Switch(config-mst)# 
 << instance 4 vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072,$ vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072,          2108, 211, 2051,
 <<  2059, 2064, 2066, 2069, 2072, 2108, 2113         , 2128
Switch(config-mst)# instance 4 vlan 2144, 2176, 2196, 2244, 2248, 2927
Switch(config-mst)# instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 2
 << $ vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 22         8
Switch(config-mst)# instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-$ vlan 2016, 2048, 2058, 2088, 
 << 2121, 2131, 2133-2         134, 2216, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216,          2228
Switch(config-mst)# instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97,
 << $ vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97,          114, 116,3-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116,          1
 << 24
Switch(config-mst)# instance 7 vlan 172, 186, 192, 204-208, 210, 240-241, 251$ vlan 172, 186, 192, 204-208, 210, 240-241, 251-         252, 630,
 << 186, 192, 204-208, 210, 240-241, 251-252, 630,          928
Switch(config-mst)# instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, $ vlan 2009, 2033-2034, 2038, 2054
 << , 2056, 2071, 2         075, 2082, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082,          2084
Switch(config-mst)# instance 8 vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192,
 << $ vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192,          2204-2208, 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208,          221
 << 0
Switch(config-mst)# instance 8 vlan 2240-2241, 2251-2252, 2630, 2928
Switch(config-mst)# instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 9$ vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 
 << 98         -99, 102,12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102,          112
Switch(config-mst)# instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 50
 << $ vlan 130, 132, 147-148, 158, 212, 226, 236, 500         , 505, 51132, 147-148, 158, 212, 226, 236, 500, 505, 510         -511
Switch(config-mst
 << )# instance 9 vlan 522, 551-570, 603, 629, 633, 742, 802, 92$ vlan 522, 551-570, 603, 629, 633, 742, 802, 926         , 929
Switch(config-mst)# instance 10 vlan 2004-2005, 2012, 2018-2019
 << , 2032, 2044, $0 vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 2         057, 20624-2005, 2012, 2018-2019, 2032, 2044, 2057, 2062,  
 <<         2068
Switch(config-mst)# instance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132,$0 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132,          2147-2148
 << 6, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148,          2158
Switch(config-mst)# instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522,$0 vlan 221
 << 2, 2236, 2500, 2505, 2510-2511, 2522,          2603, 2622, 2236, 2500, 2505, 2510-2511, 2522, 2603, 2629         , 2633
Switch(config-mst)# instance 10 vlan 2802, 2926, 2929
Swit
 << ch(config-mst)# instance 11 vlan 8, 43, 52, 146, 156-157, 180, 200, 218
Switch(config-mst)# instance 12 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180,$2 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180
 << ,          2200, 2218, 2043, 2052, 2146, 2156-2157, 2180, 2200, 2218         
Switch(config-mst)#
Switch(config-mst)#end
Switch#
Dec  6 09:14:10: %SYS-5-CONFIG_I: Configured fr
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << om console by console
Switch#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
Expect: matched string 1: (config)#
 >> hostname c29s1p.rp203.newclassroom 

Expect: searching for 2 strs:  :# :>
 << hostname c29s1p.rp203.newclassroom 
c29s1p.rp203.newclas(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s1p.rp203.newclassroom#
 << 
Dec  6 09:14:15: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.rp203.newclassroom#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.rp203.newclas(config)#
Expect: matched string 1: (config)#
 >> snmp-server contact 6F-2143

Expect: searching for 1 strs:  :#
 << snmp-server contact 6F-2143
c29s1p.rp203.newclas(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s1p.rp203.newclassroom#
 << 
Dec  6 09:14:21: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.rp203.newclassroom#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.rp203.newclas(config)#
Expect: matched string 1: (config)#
 >> interface vlan 92

Expect: searching for 1 strs:  :(config-if)#
 << interface vlan 92
c29s1p.rp203.newclas(config-if)#
Expect: matched string 1: (config-if)#
 >> ip address 10.92.5.152 255.255.0.0

 >> ip broadcast-address 10.92.255.255

 >> end

Expect: searching for 1 strs:  :Configured
 << ip address 10.92.5.152 255.255.0.0
c29s1p.rp203.newclas(config-if)#ip broadcast-address 10.92.255.255
c29s1p.rp203.newclas(config-if)#end
c29s1p.rp203.newclassroom#
 << 
Dec  6 09:14:28: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.rp203.newclassroom#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.rp203.newclas(config)#
Expect: matched string 1: (config)#
 >> interface Vlan92

Expect: searching for 1 strs:  :(config-if)#
 << interface Vlan92
c29s1p.rp203.newclas(config-if)#
Expect: matched string 1: (config-if)#
 >> ip default-gateway 10.92.0.1

 >> end

Expect: searching for 1 strs:  :Configured
 << ip default-gateway 10.92.0.1
c29s1p.rp203.newclas(config)#end
c29s1p.rp203.newclassroom#
Dec  6 09:14:33: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.rp203.newclassroom#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.rp203.newclas(config)#
Expect: matched string 1: (config)#
 >> ip dhcp snooping

Expect: searching for 1 strs:  :#
 << ip dhcp snooping
c29s1p.rp203.newclas(config)#
Expect: matched string 1: #
 >> ip dhcp snooping vlan 177

Expect: searching for 1 strs:  :#
 << ip dhcp snooping vlan 177
c29s1p.rp203.newclas(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s1p.rp203.newclassroom#
Dec  6 09:14:41: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.rp203.newclassroom#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.rp203.newclas(config)#
Expect: matched string 1: (config)#
 >> default interface range gi1/0/1 - 48 

 >> interface range gi1/0/1 - 48 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi1/0/1 - 48 
c29s1p.rp203.newclas(config)#interface range gi1/0/1 - 48 
c29s1p.rp203.newclas(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport access vlan 177

 >> switchport mode access

 >> spanning-tree portfast

 >> switchport port-security maximum 2

 >> switchport port-security

 >> switchport port-security aging time 15

 >> switchport port-security violation protect

 >> switchport port-security aging type inactivity

 >> power inline never

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport access vlan 177
c29s1p.rp203.newclas(config-if-range)#switchport mode access
c29s1p.rp203.newclas(config-if-range)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, conce
 << ntrators, switches, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast will be configured in 48 interfaces due to the range command 
 but will only have effect when the inter
 << faces are in a non-trunking mode.
c29s1p.rp203.newclas(config-if-range)#switchport port-security maximum 2
c29s1p.rp203.newclas(config-if-range)#switchport port-security
c29s1p.rp203.newclas(config-if-range)#switchport port-security aging time 15
c29s
 << 1p.rp203.newclas(config-if-range)#switchport port-security violation prot$port-security violation prote         ct
c29s1p.rp203.newclas(config-if-range)#switchport port-security aging type ina
 << $port-security aging type inac         tivity
c29s1p.rp203.newclas(config-if-range)#power inline never
c29s1p.rp203.newclas(config-if-range)#end
c29s1p.rp203.newclassroom#
 << 
Dec  6 09:14:54: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.rp203.newclassroom#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.rp203.newclas(config)#
Expect: matched string 1: (config)#
 >> default interface range te1/0/1 - 2 

 >> interface range te1/0/1 - 2 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range te1/0/1 - 2 
c29s1p.rp203.newclas(config)#interface range te1/0/1 - 2 
c29s1p.rp203.newclas(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport mode trunk

 >> switchport trunk native vlan 92

 >> ip dhcp snooping trust

 >> no keepalive

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport mode trunk
c29s1p.rp203.newclas(config-if-range)#switchport trunk native vlan 92
c29s1p.rp203.newclas(config-if-range)#ip dhcp snooping trust
c29s1p.rp203.newclas(config-if-range)#no keepalive
c29s1p.rp203.newclas(config-if-range)#end
c29s
 << 1p.rp203.newclassroom#
 << 
Dec  6 09:15:05: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.rp203.newclassroom#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.rp203.newclas(config)#
Expect: matched string 1: (config)#
 >> default interface range gi1/0/49 - 50 

 >> interface range gi1/0/49 - 50 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi1/0/49 - 50 
c29s1p.rp203.newclas(config)#interface range gi1/0/49 - 50 
c29s1p.rp203.newclas(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport mode trunk

 >> switchport trunk native vlan 92

 >> ip dhcp snooping trust

 >> no keepalive

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport mode trunk
c29s1p.rp203.newclas(config-if-range)#switchport trunk native vlan 92
c29s1p.rp203.newclas(config-if-range)#ip dhcp snooping trust
c29s1p.rp203.newclas(config-if-range)#no keepalive
c29s1p.rp203.newclas(config-if-range)#end
c29s
 << 1p.rp203.newclassroom#
 << 
Dec  6 09:15:11: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.rp203.newclassroom#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.rp203.newclas(config)#
Expect: matched string 1: (config)#
 >> default interface range te1/0/1 - 2 

 >> interface range te1/0/1 - 2 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range te1/0/1 - 2 
c29s1p.rp203.newclas(config)#interface range te1/0/1 - 2 
c29s1p.rp203.newclas(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport mode trunk

 >> switchport trunk native vlan 92

 >> ip dhcp snooping trust

 >> no keepalive

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport mode trunk
c29s1p.rp203.newclas(config-if-range)#switchport trunk native vlan 92
c29s1p.rp203.newclas(config-if-range)#ip dhcp snooping trust
c29s1p.rp203.newclas(config-if-range)#no keepalive
c29s1p.rp203.newclas(config-if-range)#end
c29s
 << 1p.rp203.newclassroom#
 << 
Dec  6 09:15:18: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.rp203.newclassroom#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.rp203.newclas(config)#
Expect: matched string 1: (config)#
 >> default interface range gi1/0/49 - 50 

 >> interface range gi1/0/49 - 50 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi1/0/49 - 50 
c29s1p.rp203.newclas(config)#interface range gi1/0/49 - 50 
c29s1p.rp203.newclas(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport mode trunk

 >> switchport trunk native vlan 92

 >> ip dhcp snooping trust

 >> no keepalive

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport mode trunk
c29s1p.rp203.newclas(config-if-range)#switchport trunk native vlan 92
c29s1p.rp203.newclas(config-if-range)#ip dhcp snooping trust
c29s1p.rp203.newclas(config-if-range)#no keepalive
c29s1p.rp203.newclas(config-if-range)#end
c29s
 << 1p.rp203.newclassroom#
 << 
Dec  6 09:15:24: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> write mem

Expect: searching for 2 strs:  :# :>
 << 
c29s1p.rp203.newclassroom#write mem
Building configuration...
[OK]
c29s1p.rp203.newclassroom#
Expect: matched string 1: #
 >> 
Expect: searching for 2 strs:  :# :>
 << 
c29s1p.rp203.newclassroom#
c29s1p.rp203.newclassroom#
Expect: matched string 1: #
 >> sh run

Expect: searching for 2 strs:  :# :>
 << sh run
Building configuration...

Current configuration : 21893 bytes
!
! Last configuration change at 09:15:24 CST Tue Dec 6 2016
! NVRAM config last updated at 09:15:31 CST Tue Dec 6 2016
!
version 15.2
no service pad
service timestamps debug 
 << datetime localtime
service timestamps log datetime localtime
service password-encryption
!
hostname c29s1p.rp203.newclassroom
!
boot-start-marker
boot-end-marker
!
enable secret 5 $1$E51U$On0U31Z83yai4vMJ4LE7s0
enable password 7 096D5C0C18581B58
 << 1C
!
username root privilege 15 secret 5 $1$H6JR$bk/KNcuzMhuva0uOJWT.e/
no aaa new-model
clock timezone CST -6 0
clock summer-time CDT recurring
switch 1 provision ws-c2960x-48fpd-l
!
!
ip dhcp snooping vlan 177
ip dhcp snooping
ip domain-name 
 << mgmt.msstate.edu
ip name-server 130.18.80.12
!
!
!
!
!
authentication mac-move permit
!
!
crypto pki trustpoint TP-self-signed-2494998912
 enrollment selfsigned
 subject-name cn=IOS-Self-Signed-Certificate-2494998912
 revocation-check none
 
 << rsakeypair TP-self-signed-2494998912
!
!
crypto pki certificate chain TP-self-signed-2494998912
 certificate self-signed 01
  	quit
!
spanning-tree mode mst
spanning-tree portfast bpduguard default
spanning-tree extend system-id
!
spanning-tree
 <<  mst configuration
 name msstate
 revision 1
 instance 1 vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 63, 70
 instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 160
 instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 230, 
 << 232, 242, 246
 instance 1 vlan 256, 611-612, 654, 741, 996, 999
 instance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037, 2039-2040
 instance 2 vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096, 2104, 2110, 2126
 instance 2 vlan 2136, 2140, 2
 << 152, 2160, 2162-2163, 2168, 2189, 2194, 2202
 instance 2 vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 2654, 2999
 instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176, 196
 instance 3 vlan 244, 248, 927
 instance 4 vlan 2042, 2051, 205
 << 9, 2064, 2066, 2069, 2072, 2108, 2113, 2128
 instance 4 vlan 2144, 2176, 2196, 2244, 2248, 2927
 instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 228
 instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216, 2228
 instance 7 vlan 9,
 <<  33-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116, 124
 instance 7 vlan 172, 186, 192, 204-208, 210, 240-241, 251-252, 630, 928
 instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082, 2084
 instance 8 vlan 2097, 2114, 2116, 2124, 2172, 218
 << 6, 2192, 2204-2208, 2210
 instance 8 vlan 2240-2241, 2251-2252, 2630, 2928
 instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102, 112
 instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 500, 505, 510-511
 instance 9 vlan 522, 551-570
 << , 603, 629, 633, 742, 802, 926, 929
 instance 10 vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 2057, 2062, 2068
 instance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148, 2158
 instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522, 2603, 2
 << 629, 2633
 instance 10 vlan 2802, 2926, 2929
 instance 11 vlan 8, 43, 52, 146, 156-157, 180, 200, 218
 instance 12 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180, 2200, 2218
!
errdisable recovery cause udld
errdisable recovery cause bpduguard
errdisa
 << ble recovery cause security-violation
errdisable recovery cause channel-misconfig
errdisable recovery cause pagp-flap
errdisable recovery cause dtp-flap
errdisable recovery cause link-flap
errdisable recovery cause sfp-config-mismatch
errdisable rec
 << overy cause gbic-invalid
errdisable recovery cause psecure-violation
errdisable recovery cause port-mode-failure
errdisable recovery cause dhcp-rate-limit
errdisable recovery cause pppoe-ia-rate-limit
errdisable recovery cause mac-limit
errdisable r
 << ecovery cause vmps
errdisable recovery cause storm-control
errdisable recovery cause inline-power
errdisable recovery cause arp-inspection
errdisable recovery cause loopback
errdisable recovery cause small-frame
errdisable recovery cause psp
errdis
 << able recovery interval 1800
!
!
!
!
vlan internal allocation policy ascending
!
!
! 
!
!
!
!
!
!
!
!
interface FastEthernet0
 no ip address
 shutdown
!
interface GigabitEthernet1/0/1
 switchport access vlan 177
 switchport mode acce
 << ss
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
in
 << terface GigabitEthernet1/0/2
 switchport access vlan 177
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 << 
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/3
 switchport access vlan 177
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchp
 << ort port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/4
 switchport access vlan 177
 switchport mode access
 switchport
 <<  port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface Gigabit
 << Ethernet1/0/5
 switchport access vlan 177
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport p
 << ort-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/6
 switchport access vlan 177
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-securi
 << ty aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/7
 switchport access vlan 177
 switchport mode access
 switchport port-security 
 << maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/8

 <<  switchport access vlan 177
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 
 << power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/9
 switchport access vlan 177
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 1
 << 5
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/10
 switchport access vlan 177
 switchport mode access
 switchport port-security maximum 2
 sw
 << itchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/11
 switchport a
 << ccess vlan 177
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline 
 << never
 spanning-tree portfast
!
interface GigabitEthernet1/0/12
 switchport access vlan 177
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchpo
 << rt port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/13
 switchport access vlan 177
 switchport mode access
 switchport port-security maximum 2
 switchport por
 << t-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/14
 switchport access vlan 1
 << 77
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 span
 << ning-tree portfast
!
interface GigabitEthernet1/0/15
 switchport access vlan 177
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-secu
 << rity aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/16
 switchport access vlan 177
 switchport mode access
 switchport port-security maximum 2
 switchport port-security v
 << iolation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/17
 switchport access vlan 177
 switchp
 << ort mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree po
 << rtfast
!
interface GigabitEthernet1/0/18
 switchport access vlan 177
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging t
 << ype inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/19
 switchport access vlan 177
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  pr
 << otect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/20
 switchport access vlan 177
 switchport mode acc
 << ess
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
i
 << nterface GigabitEthernet1/0/21
 switchport access vlan 177
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivi
 << ty
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/22
 switchport access vlan 177
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 swit
 << chport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/23
 switchport access vlan 177
 switchport mode access
 switch
 << port port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface Gig
 << abitEthernet1/0/24
 switchport access vlan 177
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchp
 << ort port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/25
 switchport access vlan 177
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-
 << security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/26
 switchport access vlan 177
 switchport mode access
 switchport port-se
 << curity maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet
 << 1/0/27
 switchport access vlan 177
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-sec
 << urity
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/28
 switchport access vlan 177
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security agi
 << ng time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/29
 switchport access vlan 177
 switchport mode access
 switchport port-security maxim
 << um 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/30
 swi
 << tchport access vlan 177
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 powe
 << r inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/31
 switchport access vlan 177
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15

 <<  switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/32
 switchport access vlan 177
 switchport mode access
 switchport port-security maximum 2
 switc
 << hport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/33
 switchport acce
 << ss vlan 177
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline nev
 << er
 spanning-tree portfast
!
interface GigabitEthernet1/0/34
 switchport access vlan 177
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport 
 << port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/35
 switchport access vlan 177
 switchport mode access
 switchport port-security maximum 2
 switchport port-s
 << ecurity violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/36
 switchport access vlan 177
 << 
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spannin
 << g-tree portfast
!
interface GigabitEthernet1/0/37
 switchport access vlan 177
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-securit
 << y aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/38
 switchport access vlan 177
 switchport mode access
 switchport port-security maximum 2
 switchport port-security viol
 << ation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/39
 switchport access vlan 177
 switchport
 <<  mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portf
 << ast
!
interface GigabitEthernet1/0/40
 switchport access vlan 177
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type
 <<  inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/41
 switchport access vlan 177
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  prote
 << ct
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/42
 switchport access vlan 177
 switchport mode access
 << 
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
inte
 << rface GigabitEthernet1/0/43
 switchport access vlan 177
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 << 
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/44
 switchport access vlan 177
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchp
 << ort port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/45
 switchport access vlan 177
 switchport mode access
 switchpor
 << t port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface Gigabi
 << tEthernet1/0/46
 switchport access vlan 177
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport
 <<  port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/47
 switchport access vlan 177
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-sec
 << urity aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/48
 switchport access vlan 177
 switchport mode access
 switchport port-secur
 << ity maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0
 << /49
 switchport trunk native vlan 92
 switchport mode trunk
 ip dhcp snooping trust
!
interface GigabitEthernet1/0/50
 switchport trunk native vlan 92
 switchport mode trunk
 ip dhcp snooping trust
!
interface TenGigabitEthernet1/0/1
 switchpor
 << t trunk native vlan 92
 switchport mode trunk
 ip dhcp snooping trust
!
interface TenGigabitEthernet1/0/2
 switchport trunk native vlan 92
 switchport mode trunk
 ip dhcp snooping trust
!
interface Vlan1
 no ip address
 no ip route-cache
 shut
 << down
!
interface Vlan92
 ip address 10.92.5.152 255.255.0.0
 ip broadcast-address 10.92.255.255
!
ip default-gateway 10.92.0.1
no ip http server
no ip http secure-server
!
!
logging facility local1
logging host 130.18.8.12
access-list 1 permi
 << t 10.92.0.0 0.0.255.255
access-list 1 permit 130.18.8.0 0.0.0.255
access-list 1 permit 10.93.0.0 0.0.255.255
access-list 1 permit 130.18.1.0 0.0.0.255
!
snmp-server community sysnet RO 1
snmp-server community c2-b2=a2 RW 1
snmp-server contact 6F-21
 << 43
snmp-server enable traps snmp authentication linkdown linkup coldstart warmstart
snmp-server enable traps transceiver all
snmp-server enable traps tty
snmp-server enable traps cluster
snmp-server enable traps config-copy
snmp-server enable traps 
 << config
snmp-server enable traps config-ctid
snmp-server enable traps entity
snmp-server enable traps power-ethernet police
snmp-server enable traps cpu threshold
snmp-server enable traps bridge newroot topologychange
snmp-server enable traps stpx in
 << consistency root-inconsistency loop-inconsistency
snmp-server enable traps syslog
snmp-server enable traps vtp
snmp-server enable traps vlancreate
snmp-server enable traps vlandelete
snmp-server enable traps flash insertion removal
snmp-server enabl
 << e traps port-security
snmp-server enable traps envmon fan shutdown supply temperature status
snmp-server enable traps errdisable
snmp-server enable traps mac-notification change move threshold
snmp-server enable traps vlan-membership
snmp-server host
 <<  130.18.8.12 sysnet 
!
!
line con 0
line vty 0 4
 access-class 1 in
 password 7 047A19030E7C40041E
 login
 transport input all
line vty 5 15
 access-class 1 in
 password 7 047A19030E7C40041E
 login
 transport input all
!
ntp server 10.92.0.
 << 5
end

c29s1p.rp203.newclassroom#
Expect: matched string 1: #
 >> show interface status

Expect: searching for 2 strs:  :# :>
 << 
 << 
 << tmoecess
 s
 << hortt
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 <<   protect
 switchport port-securiy aging ti
 << 
 << hport
 << 
 << 
 << 
 << ecu
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << trt port-
 << 
 << 
 << 
 << 
 << 
 sp
 << nning-tree 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << G 
 << ess
 << van
 << 177
 sw
 << t
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << c
 << s
 << 
 << 
 <<  sitchp
 << r
 << 
 << 
 << 
 << 
 << 
 << 
 << ity
 << m 
 
 << wipcurityviolat
 << 
 << swt
 << 
 << -se
 << 
 << ri
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 s
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << c
 << 
 << ity
 p
 << we inlie nev
 << 
 << 
 spanning-tr
 << 
 << r!
inter
 << 
 << 
 << 
 << hernet1/0/26
 swport access vlan 17
 sw
 << t
 << 
 << o
 << t
 << 
 << d
 << 
 << cce
 << 
 << 
 << w
 << 
 << 
 << p 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << m
 << 
 << 
 << 
 << 
 << 
 swi
 << 
 << 
 << rt
 << 
 << 
 << r
 << 
 << 
 << 
 << urity violation  p
 << t
 << 
 << 
 << 
 <<  s
 << itchport pcu
 << g
 << 
 << ime 15
wtrt-
 << 
 << r
 << 
 << acp
 << 
 << 
 << 
 << ity
 pow
 << 
 << 
 << 
 << ne nev
 << r
 << 
 << 
 << pan
 << iportfast
!
 << i
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 0/
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << ces
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << p
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << or
 << 
 << 
 << 
 << ity ma
 << 
 << 
 << 
 << 
 << 
 << 
 
 << 
 << itc
 << 
 << 
 << 
 << t 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 <<  v
 << 
 << 
 << at
 << 
 << n
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 <<  
 << 
 << 
 << 
 << 
 << 
 << 
 << t-
 << 
 << 
 << 
 << 
 << 
 << 
 << a
 << 
 << 
 <<  
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << chp
 << 
 << 
 << 
 << 
 << 
 << r
 << 
 << 
 << 
 << 
 << 
 << 
 << i
 << 
 << 
 << 
 << 
 << 
 << t
 << p
 << 
 << 
 << 
 << 
 << ctivity
 s
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << po
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << face gai
 << 
 << t
 << 
 << r
 << 
 << 
 << 
 << swit
 << 
 << 
 << 
 << 
 << 
 << e
 << 
 <<  
 << 
 << 
 << n
 << 
 << 
 << w
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 <<  a
 << c
 << 
 << 
 <<  
 << 
 << 
 << 
 << 
 << 
 << t
 << 
 << r
 << -
 << 
 << 
 << 
 << r
 << 
 << 
 << 
 << 
 << 
 << i
 << 
 << 
 << 
 << 
 << 
 << 
 << i
 << 
 << p
 << 
 << 
 << 
 << 
 << or
 << 
 << 
 << r
 << 
 << y
 << 
 << 
 << 
 << l
 << 
 << 
 <<  pr
 << 
 << 
 << 
 << 
 << 
 << w
 << 
 << 
 << 
 << po
 << 
 << 
 << p
 << 
 << 
 << 
 << 
 << 
 << curi
 << 
 << 
 << 
 << 
 << 
 << 
 << wi
 << 
 << h
 << 
 <<  p
 << 
 << 
 << 
 << 
 << 
 << c
 << 
 << t
 << 
 << 
 << 
 << 
 << e
 << 
 << ac
 << 
 << 
 << 
 << 
 << y
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << wer inli
 <<  nev
 << 
 << 
 << 
 << 
 << 
 << ing-t
 << t
 << tt
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 <<  177
 switchport mode access
 
 << w
 << 
 << hp
 << 
 << ts
 << 
 << ity
 << 
 << 
 << 
 << 
 << mum 
 << 
 <<  switcorort-secuiolao
 << 
 << 
 << 
 << 
 << 
 << p
 << r
 << 
 << 
 << rity 
 << 
 << n
 << 
 << i
 << 
 << 
 << 
 <<  
 << itcho
 << 
 << 
 << 
 << 
 << g type inactivity
 swit
 << oort
 << 
 power aning-
 << 
 << 
 << !i
 << GibEt
 << 
 << 
 << 
 << 10/3
 << 
 << 
 << 
 << 
 << 
 << 
 <<  
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << po
 <<  mode access
 sw
 <<  pourity maxi
 << u
 << 
 << 
 << 
 << 
 << 
 << 
 << p
 << lat
 << titchp
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << me 15
 switc
 << 
 << 
 << 
 << 
 << 
 << -securi
 << 
 << 
 << 
 << 
 << vity
 
 << 
 << itchport p
 << 
 << t-
 << ecurity
 pow
 << r inline never spanning-tree portfas
 << 
!
i
 << 
 << f
 << 
 << 
 << 
 << 
 << 
 << ga
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 

 << 
 << 
 << 
 << hpor m
 << 
 <<  swi
 << chport por
 << 
 << 
 << 
 << cu
 << 
 << 
 << 
 << 
 << m
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << rt port-sec
 << t
 <<  
 << on protect
 
 << 
 << 
 << 
 << 
 << 
 <<  -security aging tim
 <<  
 << 
 << 
 << 
 << swi
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << i
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << t in
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << a
 << 
 << 
 << 
 << eert
 << 
 << 
nte
 << 
 << 
 << ig
 << t1/0/32
 switch
 << o
 << t accesvl
 << n
 << 
 << 
 <<  swi
 << chport 
 << 
 << 
 << 
 << wi
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << ecu
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 <<  
 << 
 << c
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << t-
 << 
 << 
 << r
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 switchpo
 << t
 << o
 << 
 << 
 << 
 << 
 << u
 << 
 << 
 << ny
 << eti
 << 
 << ct
 << 
 << p
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << r
 << 
 << 
 << 
 << panni- 
 << 
 << 
 << 
!
 << 
 << nterface 
 << ig
 << the
 << 
 << 
sw
 << tchport accessvla
 << 
 << 
 << 
 << 
 << 
 << t
 << 
 << 
 << 
 << it
 << 2
 << 
 <<  violatio  protect
 switchpor
 << 
 << 
 << tsee 15
 s
 << i
 << ty aging type inactivity
 << 
 <<  
 << 
 << 
 << tchpo
 << 
 << 
 << 
 << 
 << -
 << 
 << 
 << u
 << 
 << 
 << y
 << 
 << 
 << 
 << r nlin
 << 
 << 
 << 
 << 
 << 
 << 

 << 
 << a
 << nin
 << -t
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << s
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << t
 << 
 << rswit
 << hp
 << 
 << 
 << de acce
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << x
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << e
 << ty violatio
 <<  
 << pt
 << 
 << 
 << 
s
 << 
 << t
 << -srtagi
 << 
 << i
 << 
 << 
 << 
 << yactiirt-
 << u
 << ty
 power inline n
 << ng-t
 << e p
 << 
!
 << 
interface Gigabi
 << 
 << 
 << 
 << 
 << 
 << 3
 << 

 << 
 << w
 << t
 << 
 << r
 <<  e
 << 
 << l
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << sw
 << t
 << 
 << 
 << 
 << o
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << or
 << 
 << 
 << 
 << t
 << 
 << 
 << 
 << 
 << 
 << se
 << 
 << 
 << 
 << t
 << 
 << 
 << 
 << o
 << 
 << 
 << on  po
 << 
 << 
 << 
 << 
 << 
 << 
 << wi
 << 
 << 
 << p
 << 
 << t
 << or
 << 
 << 
 << 
 << 
 << y
 << aging time 
 << 
 << 
 << ec
 << 
 << iging ty
 << e
 << inactvity
 withport port-security
 po
 << r
 << 
 << 
 << 
 << 
 <<  sp
 << 
 << 
 << ig
 << t
 << 
 << 
 << 
 << tchport 
 << 
 << 
 << ess vla
 <<  i
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << i
 << 
 << 
 << viol
 << 
 << 
 << 
 << c
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << o
 << t
 << 
 << 
 << curit
 << g
 << 
 << 
 <<  
 << 
 << m
 << 
 << 1
 << 
 << 
 << 
 << 
 << itc
 << port
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 
 << 
 << 
 << 
 << 
 << 
 << 
 << r
 << 
 << 
 << 
 << 
 << 
 << 
 << r
 << 
 << 
 <<  p
 << we
 <<  
 << 
 << 
 << 
 <<  n
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << interface
 << GigabEternet/0/
 << 
 << 
 << 
 << 
 << 
 << 
 << cces ln7
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 <<  
 << 
 << 
 << 
 << 
 << 
 <<  2
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << o
 << t-
 << 
 << 
 << 
 << 
 << t
 << 
 << 
 << 
 << 
 << la
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << t
 << 
 << porort-securite
 <<  r 
 << 
 << 
 << 
 << 
 << ctiv
 << ty

 << -
 << nning-tree portfas
 << erface GigabitEthernet1/0/38
 switchport access vla s
 << 
 << 
 << 
 << 
 <<  moe
 << sc
 << 
 << 
 << t
 << p
 << r
 << -sec m
 << 
 << 
 << 
 << 
 << 
 << 
 switchpot
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << n
 << 
 << 
 << 
 << o
 << 
 << 
 << 
 << 
 << 
 <<  
 << 
 << i
 << chp
 << 
 << 
 <<  
 << 
 << r
 << -
 << 
 << 
 << i
 << 
 << gi
 << 
 <<  t
 << cor
 << u
 << ing typ
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << por
 << -
 << e
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << we
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << t
 << 
 << s
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << rtcessvn17 tc
 << 
 << 

 << tch
 << 
 << -se
 << utm
 << wicpr 
 << 
 << 
 << 

 << 
 << tchport por ag
 << hp
 << 
 << 
 << rt
 << 
 << 
 << 
 << 
 << 
 << in
 << t-
 << 
 << ri
 << i
 << e n
 << ver
 << spa
 << t
!
interfac
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << n
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << swi
 << h
 << 
 << 
 <<  a
 << c
 << s v
 << n 177
 swi
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << ess

 << 
 << 
 << 
 << 
 << cpo
 << 
 <<  po-
 << 
 << 
 << 
 << 
 << 
 << y
 << 
 << 
 << 
 << u
 << 
 << 
 << 
 << security v
 << ola
 << 
 << 
 << 
 << 
 << 
 << e
 << hport p
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << ur
 << 
 << 
 << y
 << 
 << 
 << 
 << nac
 << 
 << 
 << t
 << 
 << 
 <<  s
 << 
 << 
 << 
 << ort cu
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << in
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << i
 << -tree portfas
!
inter
 << 
 <<  
 << 
 << 
 << 
 << 
 << i
 << 
 << 
 << h
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 7
switchport
 << ode a
 << ess
 << s
 << 
 << ort-securit
 << 
 << 
 << xm
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 <<  p
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << lantct
 << ptpr-scrtyin tme 1
 << 
 << switc
 << p
 << 
 << ity
 << wi
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << nning-tre 
 << ortf
 << 
 << 
 << 
 << 
in
 << e
 << 
 << 
 << e GigbitE
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << t
 << access v
 << 
 << 
 << 
 << 
 << 
 << 
 << tchport po
 << 
 << 
 << olation  protect
 s
 << i
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << e 15
 s
 << r
 << 
 << sc
 << 
 << 
 << 
 <<  
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << a
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << p
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 <<  in
 << ie
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << n
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 

 << 
 << 
 << 
 << trt access vlan 7o
 << 
 << a
 << 
 << 
 << it
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << maxim
 << m
 << 2
 << 
 <<  
 << 
 << 
 << 
 << c
 << p
 << r
 << 
 << o
 << 
 << 
 << 
 << e
 << 
 << rity
 << 
 << 
 << 
 << 
 << ct
 switchport
 << p
 << 
 << 
 << e
 << 
 << 
 << 
 << 
 << 
 << i
 << 
 << 
 << ime 15
 swithor
 << 
 << c
 << it
 <<  a
 << ing t
 << pein
 <<  swi
 << 
 << ecuit
 << 
 poe
 << ortfast
!
i
 << e
 << itEthernet1/0/44
 switchpo
 << 
 <<  acce
 <<  
 << la
 <<  1
 << 
 << 
 << 
 << 
 << w
 << 
 << cp
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << s
 << 
 <<  s
 << 
 << 
 << 
 << 
 << por
 << ximm2
 switchport
 << 
 << 
 << 
 << 
 << 
 << 
 << swt
 << 
 << 
 << 
 << y agme
 << 
 << 5
 switchpot port-
 << 
 << curity aging type act
 << 
 << 
 << 
 << wic
 << 
 << 
 << port
 << cri
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << ever
 spane 
 << 
 << 
 << 
 << 
 << st
 << !
interface Gigaee
 << 
 << 4
 << 
 swit
 << ort a
 << ess vlan 177
 swipor
 << 
 << 
 << de
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << t p
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << aimu
 << 
 << 
 << 
 << 
 << cht
 << y vi
 << t
 << 
 << 
 << 
 << 
 << 
 << o
 << 
 << -sec
 << 
 << 
 << 
 << ag
 << 
 << 
 << 
 << 
 << 
 <<  
 << 
 << 
 << 
 << sc
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << hport port-security
 power inline neve
 <<  
 << 
 << 
 << 
 << 
 <<  p
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 

 << ta
 << 
 << it1
 << 0/46
 switchport acc
 << svan 
 << 
 << e sw
 << 
 << mu
 << 
 << ip
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << u
 << 
 << 
 << 
 <<  v
 << 
 << 
 << a
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << ec
 << 
 <<  s
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << t
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << g ti
 << 
 << 
 << 
 << 
 << 
 << 
 << s
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << c
 << 
 << 
 << 
 << 
 << 
 << a
 << 
 << 
 << g
 << 
 << y
 << 
 << 
 << 
 << c
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << p
 << 
 << 
 << 
 << y

 << 
 << o
 << 
 <<  
 << 
 << 
 << neer
 
 << a
 << 
 << 
 << 
 << 
 << 
 << 
 << e
 << 
 << 
 << 
 << 
 << 
 << s
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << ne
 << 
 << 
 << 
 << 
 << n 177
 switchport mode
 << 
 << security maximum 2 s
 << port por
 << lation  protect
 << 
 << 
 << 
 << 
 << 
 << 
 << hpo port-se
 << ecuri
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 <<  
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 <<  spane
 << 
 << 
 << 
 << 
 << 
 << as
 << 
 << 
 << !
 << 
 << nterface G
 << 
 << 
 << b
 << 
 << 
 << 
 << 
 << 7
 switcpor mode accs
 
 << 
 << chport p
 << 
 << 
 << securit
 <<  maximum 2
 s
 << 
 << 
 << ecurity violation  
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << i
 << 
 << 
 << hp
 << 
 << 
 << o
 << t
 << 
 << 
 << 
 << u
 << 
 << 
 << 
 << 
 << t
 << pe inactivi
 << 
 << 
 << 
 << 
 << itch
 << 
 << o
 << 
 << -secu
 << ity
 power inline never
 span
 << 
 << 
 << 
 << 
 << 
 << e
 << 
 << 
 << t1/0/49
 sw
 << v
 <<  vlan 92
 
 << w
 << tc
 <<  mod
 << 
 << trunk
ip dhcp snoo!r
 << ace GigabitE
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << or t
 << 
 << n
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << hpo
 << t mode runk

 << 
 << p
 << dcp snoop
 << ng 
 << 
 << ust
 << 
 << 
 << 
 << 
 << n
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << it
 << 
 << 
 << 
 << k
 << 
 << 
 << 
 << 
 << lan 92
 s
 << 
 << 
 << h
 << 
 << r
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << h
 << g
 << 
 << 
 << 
 << 
 << 
 << 
 << 
interE
 << e
 << 
 << 
 << 
 << 
 << 
 << runk
 ip 
 << 
 << cp
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << g iac
 <<  Vlan1
 no ip 
 << 
 << 
 << 
 << t
 << -
 << 
 << 
 << 
iterfac
 <<  Vlan92
 ip
 << 
 << 
 <<  
 << b
 << 
 << 
 << c
 << st-ad
 << 
 << 
 << 
 << 
!
ip defu
 << 
 << t
 << 
 << 
 << 
no
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << ver
!
!
loggi
 << 
 <<  13
 << .8.
 << 
 << 
 << acc
 << 
 << s-li
 << t 1 perm
 << t
 << 
 << 8. 0.0
 << 0.255
 << 
 <<  1 permit 10.93.0.0 0.0.2
 << 
 << 
 << 
 << -list
 << m
 << .0.0.255
!
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << ommun
 << 
 << 
 << 

 << 
 << 
 << 
 << 
 << 
 << 
 << o
 << 
 << 
 << 
 <<  c2-b
 << =
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << ps 
 << p entica
 << ion l
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 <<  
 << 
 << l
 << 
 << 
 << 
 << 
 << 
 << s
 << erve
 << 
 << 
 << 
 <<  s transc
 << iver a
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << enable traps
 << sn
 << 
 << 
 << 
 << e
 << 
 << 
 << 
 << 
 << a
 << 
 << 
 << t
 << 
 << 
 << 
 << psev
 << 
 << 
 << 
 <<  
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << ser
 << enable traps
 << 
 << onfig

 << nmp
 << 
 << 
 << rver 
 << nable traps confi-ctid
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << b
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << t
 << 
 << 
 << 
 <<  e
 << a
 << 
 <<  
 <<  p
 << p
 << 
 << 
 << ver en
 << b
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << o
 << 
 << 
 << p-s
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << le t
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << lo
 << 
 << 
 << 
 << 
 << 
 << g
 << 
 << 
 << 
 << nmp
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << a
 << 
 << xi
 << co
 << 
 << stency roncy loop-inconsitency
sn-
 << 
 << 
 << 
 << 
 <<  syslog
snmp-server enable traps vtp
snm
 << 
 << 
 << 
 << rl
 << 
 << 
 << te
 << 
 << 
 << mp-server
 << e
 << 
 <<  s lande
 << 
 << 
snp-se
 << 
 << e
 << 
 << e
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << as
 << 
 << 
 << 
 << 
 << n re
 << 
 << 
 << 
 << 

 << 
 << 
 << 
 << 
 << s
 << r
 << 
 << 
 << 
 << 
 << n
 << 
 << 
 << 
 << t
 << 
 << a
 << 
 <<  fan shu
 << 
 << own supply temperature 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << b
 << 
 << l
 << 
 << 
 << nmp-
 << rver enable trap
 <<  mac-not
 << fication change moe
 << rv
 << r enable t
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << e
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 8.8.12 sysne 
!


 << 
 << 
 << 
 << 
 << 
 <<  
 << 

 << ne vt
 <<  
 << 
 << 
 << 
 << 
 << acc
 << 
 << 
 <<  1 in
 password 7 047A10
 << 
 << E
 
 << ort 
 << nput all
lie vty 5 15
 access-c
 << ass 1
 << i
 << 
 << 
 << 
 << 
 << s
 << 
 << rd 7 04A19
 << 
 << E
 << 
 << 
 << 
 << 
 << 
 << 
 << E
 <<  
 << 
 << g
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << po i
 << 
 << 
 << ll!

 << 0.92.0.
 << 
 << n
 << 
c
 << .rp2
 << 
 << 
 << 
 << l
 << 
 << 
 << 
 << tus

P
 << 
 << 
 << 
 << 
 << 
 << 
 <<    
 <<   
 << 
 <<  
 <<   
 << 
 << 
 << 
 << 
 << 
 <<   Dup
 << pee
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << /
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << tcone
 << 
 << 
 << 
 << 
 << 
 <<  
 << 
 << 
 << 
 << 
 << o   
 << uto 10/100/1000B
 << seTX1/0
 << 2 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 <<   
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 <<           auto   auto 1
 << 
 << 1
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 3
 << 
 << 
 << 
 << 
 <<  
 <<   
 <<      auo o1/010BeG
 << 0
 << 4    
 <<      
 << ct   177   
 << 
 << 
 <<  
 << au
 << o   a
 << o
 << 10
 << 10
 << /1000Ba
 << e
 << 
 << 
 << i1
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 <<    
 << 
 << 
 << 
 << 
 << o
 << 
 << 
 << 
 << 
 << e
 << 
 <<  
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 <<   
 << 
 << 
 << 
 << t
 << 
 << 
 <<  a
 << 
 << 
 <<  
 << 
 << 
 << 
 << 0
 << 
 << 00B
 << 
 << X
G
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 <<  
 << /
 << 
 << B
 << 
 << e
 << 
 << 
 << G
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 <<     
 <<              notco
 << 
 <<  
 <<  
 <<       auto u 
 << 
 << 
 << 
 << 0
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 <<  
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << o
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << /1
 << 0/1000BaseTX
 << /
 << 
 << 
 <<                
 << 
 <<   notcon
 << 
 << 
 << 
 <<  
 << 
 <<  
 << 
 << 
 << 
 << 
 << auto 10/100/1000BaseTX
Gi1/0/10         
 <<       
 <<   
 <<  
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 <<   
 << 
 << a
 << o
 << 
 << to
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 <<                    notconnect   1
 << 7 
 << 
 << 
 << o   auto 10/100/1000Bas
 << 
 << 
 << 
 << 2    
 << 
 << 
 << 
 <<  
 << 
 << 
 << 
 << 
 << 
 << n
 << 
 << 
 <<  
 << 
 << uto   a
 << 
 <<  
 << 
 << 
 << 
 << 0
 << 
 << 00
 << BaseTX

 << i1/0/13        
 << 
 <<  
 << 
 << 
 << 
 <<  
 <<  10/100
 << 
 << 
 << a
 << X
 << 
 << 
 << i1/0/14         
 << 
 << 
 << 
 << 
 <<  
 <<  notconne
 << 
 << 
 << 
 << 7 
 << 
 << 
 << 
 << to 1/
 << 
 << 
 << 
 << 
 << 
 << G
 << 1/0
 << 
 << 5
 <<          
 <<      
 <<   
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << auto   a
 << 
 << 
 << 
 << 1
 << 
 << 0
 << 
 << 
 << 
 << T
 << 
 << 
 << Gi
 << 
 << 16 
 << 
 << 
 << 
 <<  
 << 
 << 
 << 
 << 
 <<    
 << 
 << 
 << n
 << t
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 7
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << uo  a
 << 10/101
 << 
 << B
 << s
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 <<  
 << 
 << 
 << 
 << 
 << Ba
 << 
 << 
 << 
 <<     notconnect  
 << uto 10/100/1000B
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 <<      
 <<  aut
 << 
 <<   auto 
 << 0/100/1000
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << t  177 
 << 
 << 
 << 
 <<    
 << 
 << 10/100/10
 << 
 << aeT
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 <<   
 << ot
 << 
 << 
 << 
 <<     u
 << o 10/
 << 00/1000BaseTX
Gi1/0/22               notconect  177          auto   auto 10/10
 << /1
 << 
 << 
 << i1
 << 
 <<  
 << 
 << 
 << 
 <<       oect   177          auto   auto 1
 << 
 << 100
 << 1000BaseTX
Gi1/0/24     
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << nect   
 << 
 << 
 <<  
 << 
 << 
 <<  
 << 
 << u
 << 
 << 
 <<  
 << 
 << 
 << 
 << 
 << 
 << 1
 << 
 << 
 << 
 << 0
 << 1
 << 
 << 
 << 
 << 
 << X/0
 <<  
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 <<  
 << 
 <<  
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 177     
 <<   
 << 
 << u
 << 
 << 
 << 0BaseTX
Gi1/0/26               
 << c        aututo
 << 
 << 
 << 
 << 
 << 
 << 
 << 0B
 << 
 << 
 << i1
 << 0/
 << 
 << 
 << 
 <<           notnct
 << 
 << 
 << 
 << 
 << 
 << 
 << o  
 << 
 << uto
 << 
 << 
 << 100/
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 <<                
 <<  
 << 
 << nnect   177
 <<  
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 <<  
 << 
 << 
 << 
 << 0
 << 
 << 
 << 
 << 
 << 
 << 
 << e
 << 
 << 
 << i1/0
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 <<          
 << tconnt   
 << 
 <<  
 << 
 << 
 << au
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << TX
Gi1/
 << /30 
 << 
 << 
 <<  
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 7
 <<       auto   au
 << 
 << 
 << 
 << 
 << 1
 << 0
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << /
 <<   
 << 
 <<         
 << otce
 << 
 << 
 << 
 << 
 <<    
 <<  a
 << 
 << 
 << n
 <<    177      
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 <<  10/100/100
 << B
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 3
 << 
 << 
 << 
 << 
 << 
 <<  
 << 
 <<     
 << tconn
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 <<  
 <<     au
 << 
 << 
 <<  aut
 <<  10/00/1000BaseTX
Gi1/0
 << 
 << 
 <<           
 <<     notconnect   1
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 

 << 03
 << 
 << 
 <<   
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << n
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << auto 10/100/1000BaseT
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 <<   
 << 
 << 
 << 
 << 
 <<    
 <<      auto   auto 10/
 << 
 << 0
 << 
 << 
 << 

 <<           
 << conet 17    a
 << 
 <<  
 << 
 << 
 << 
 << /100/100B
 << 
 << 
 << 
 << 18                    n          auto   
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 <<       notconnect   177    
 << 
 <<    
 << ut   aut
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 <<   
 << 
 << to  auto 10/10
 << 
 << 1000
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << /41    
 <<    
 << 
 <<   
 << 
 <<  
 << 
 << tconne
 << 
 << 
 << 
 << 
 << 
 << 000BaseTX
Gi
 << 0/42      
 << 
 << 
 << 
 << 
 <<           
 << 
 << 
 <<   
 << 
 << 
 << 
 << 
 << 
 << 
 << o
 <<   auto 10/101000BaseTX

 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 <<  
 << 
 << 
 << 
 << 
 << 
 << o
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 <<   
 << 
 << 
 << 
 << 
 <<    a
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 <<  
 <<            notconnect   177  
 <<  
 << 
 << 
 << to  
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 00/1000Base
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 5        
 << o 10/100/1000Bas
 << 
 << Gi1/0/4
 <<   
 << 
 << 
 <<  
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << c
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 <<  
 << 
 << 
 << 
 <<  a
 << /
 << 
 << 00B
 << seTG
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 <<   
 <<  
 <<  
 << 
 << 
 << 
 << 
 <<  
 << 
 <<  
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 <<  
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << /000BaeTX
Gi1/0/48               notconnect   177          aut
 <<  
 << to
 << 
 << 
 << 1
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 <<  
 << 
 << 
 << 
 <<   
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 <<      
 <<    
 << 
 << 
 << No Present
T
 << 1
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 <<  
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 <<      
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 <<          
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << outed
 << 
 << 
 << 
 << 
 << 
 << auto 10
 << 100BaseTX
 << 
r03.ew
 << assroom#
Expect: matched string 1: #
