trying to use serial port: /dev/ttyUSB0
 >> 
 >> 

Expect: searching for 4 strs:  :[yes/no] :Press RETURN to get started. :# :Switch>
 << 
c29s1p.rp203.newclassroom>
c29s1p.rp203.newclassroom>
c29s1p.rp203.newclassroom>
c29s1p.rp203.newclassroom>
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

c29s1p.rp203.newclassroom>
c29s1p.rp203.newclassroom>
c29s1p.rp203.newclassroom>
c29s1p.rp203.newclassroom>
...

 >> 

Expect: searching for 2 strs:  :# :>
 << 
c29s1p.rp203.newclassroom>
c29s1p.rp203.newclassroom>
Expect: matched string 2: >
 >> term len 0

Expect: searching for 2 strs:  :# :>
 << term len 0
c29s1p.rp203.newclassroom>
Expect: matched string 2: >
 >> show version

Expect: searching for 2 strs:  :# :>
 << show version
Cisco IOS Software, C2960X Software (C2960X-UNIVERSALK9-M), Version 15.2(2)E4, RELEASE SOFTWARE (fc2)
Technical Support: http://www.cisco.com/techsupport
Copyright (c) 1986-2016 by Cisco Systems, Inc.
Compiled Fri 12-Feb-16 22:57 by prod_
 << rel_team

ROM: Bootstrap program is C2960X boot loader
BOOTLDR: C2960X Boot Loader (C2960X-HBOOT-M) Version 15.2(3r)E1, RELEASE SOFTWARE (fc1)

c29s1p.rp203.newclassroom uptime is 4 minutes
System returned to ROM by power-on
System restarted at 08:
 << 45:23 CST Tue Dec 6 2016
System image file is "flash:/c2960x-universalk9-mz.152-2.E4/c2960x-universalk9-mz.152-2.E4.bin"
Last reload reason: power-on



This product contains cryptographic features and is subject to United
States and local country 
 << laws governing import, export, transfer and
use. Delivery of Cisco cryptographic products does not imply
third-party authority to import, export, distribute or use encryption.
Importers, exporters, distributors and users are responsible for
compliance
 <<  with U.S. and local country laws. By using this product you
agree to comply with applicable laws and regulations. If you are unable
to comply with U.S. and local laws, return this product immediately.

A summary of U.S. laws governing Cisco cryptogra
 << phic products may be found at:
http://www.cisco.com/wwl/export/crypto/tool/stqrg.html

If you require further assistance please contact us by sending email to
export@cisco.com.

cisco WS-C2960X-48FPD-L (APM86XXX) processor (revision M0) with 524288K
 <<  bytes of memory.
Processor board ID FCW2027B1L1
Last reset from power-on
2 Virtual Ethernet interfaces
1 FastEthernet interface
50 Gigabit Ethernet interfaces
2 Ten Gigabit Ethernet interfaces
The password-recovery mechanism is enabled.

512K by
 << tes of flash-simulated non-volatile configuration memory.
Base ethernet MAC Address       : 00:A2:89:89:88:80
Motherboard assembly number     : 73-16686-05
Power supply part number        : 341-0527-02
Motherboard serial number       : FOC20267PZL
Po
 << wer supply serial number      : DCB202361LE
Model revision number           : M0
Motherboard revision number     : A0
Model number                    : WS-C2960X-48FPD-L
Daughterboard assembly number   : 73-14200-03
Daughterboard serial number     : 
 << FOC20271QRZ
System serial number            : FCW2027B1L1
Top Assembly Part Number        : 68-100463-01
Top Assembly Revision Number    : C0
Version ID                      : V05
CLEI Code Number                : CMMLJ00ARD
Daughterboard revision n
 << umber   : A0
Hardware Board Revision Number  : 0x18


Switch Ports Model                     SW Version            SW Image                 
------ ----- -----                     ----------            ----------               
*    1 52    WS-C2960
 << X-48FPD-L         15.2(2)E4             C2960X-UNIVERSALK9-M     


Configuration register is 0xF

c29s1p.rp203.newclassroom>
Expect: matched string 2: >
 >> enable

Expect: searching for 2 strs:  :Password: :#
 << enable
Password: 
Expect: matched string 1: Password:
 >> Area=l*w

Expect: searching for 1 strs:  :#
 << 
c29s1p.rp203.newclassroom#
Expect: matched string 1: #
 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.rp203.newclas(config)#
Expect: matched string 1: (config)#
 >> no service pad

 >> service timestamps debug datetime localtime

 >> service timestamps log datetime localtime

 >> service password-encryption

 >> boot-start-marker

 >> boot-end-marker

 >> enable secret Area=l*w

 >> enable password Area=l*w

 >> no aaa new-model

 >> clock timezone CST -6 0

 >> clock summer-time CDT recurring

 >> authentication mac-move permit

 >> ip domain-name mgmt.msstate.edu

 >> ip name-server 130.18.80.12

 >> vtp domain vtp01.mgmt.msstate.edu

 >> vtp mode client

 >> crypto pki trustpoint TP-self-signed-2494998912

 >>  enrollment selfsigned

 >>  subject-name cn=IOS-Self-Signed-Certificate-2494998912

 >>  revocation-check none

 >>  rsakeypair TP-self-signed-2494998912

 >> crypto pki certificate chain TP-self-signed-2494998912

 >>  certificate self-signed 01 nvram:IOS-Self-Sig#3232.cer

 >> spanning-tree portfast bpduguard default

 >> spanning-tree extend system-id

 >> vlan internal allocation policy ascending

 >> errdisable recovery cause all

 >> errdisable recovery interval 1800

 >> interface FastEthernet0

 >>  no ip address

 >>  shutdown

 >> interface Vlan1

 >>  no ip address

 >>  no ip route-cache

 >>  shutdown

 >> interface Vlan92

 >> no ip http server

 >> no ip http secure-server

 >> logging facility local1

 >> logging host 130.18.8.12

 >> access-list 1 permit 10.92.0.0 0.0.255.255

 >> access-list 1 permit 130.18.8.0 0.0.0.255

 >> access-list 1 permit 10.93.0.0 0.0.255.255

 >> access-list 1 permit 130.18.1.0 0.0.0.255

 >> snmp-server community sysnet RO 1

 >> snmp-server community c2-b2=a2 RW 1

 >> snmp-server enable traps snmp authentication linkdown linkup coldstart warmstart

 >> snmp-server enable traps transceiver all

 >> snmp-server enable traps tty

 >> snmp-server enable traps cluster

 >> snmp-server enable traps config-copy

 >> snmp-server enable traps config

 >> snmp-server enable traps config-ctid

 >> snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-auth-fail-vlan no-guest-vlan

 >> snmp-server enable traps entity

 >> snmp-server enable traps power-ethernet police

 >> snmp-server enable traps cpu threshold

 >> snmp-server enable traps rep

 >> snmp-server enable traps bridge newroot topologychange

 >> snmp-server enable traps stpx inconsistency root-inconsistency loop-inconsistency

 >> snmp-server enable traps syslog

 >> snmp-server enable traps vtp

 >> snmp-server enable traps vlancreate

 >> snmp-server enable traps vlandelete

 >> snmp-server enable traps flash insertion removal

 >> snmp-server enable traps port-security

 >> snmp-server enable traps envmon fan shutdown supply temperature status

 >> snmp-server enable traps errdisable

 >> snmp-server enable traps mac-notification change move threshold

 >> snmp-server enable traps vlan-membership

 >> snmp-server host 130.18.8.12 sysnet 

 >> line con 0

 >> line vty 0 15

 >>  access-class 1 in

 >>  password Area=l*w

 >>  login

 >>  transport input all

 >> ntp server 10.92.0.5

 >> username root privilege 15 secret Area=l*w

 >> 

 >> end

Expect: searching for 1 strs:  :Configured
 << no service pad
c29s1p.rp203.newclas(config)#service timestamps debug datetime localtime
c29s1p.rp203.newclas(config)#service timestamps log datetime localtime
c29s1p.rp203.newclas(config)#service password-encryption
c29s1p.rp203.newclas(config)#boot-s
 << tart-marker
c29s1p.rp203.newclas(config)#boot-end-marker
c29s1p.rp203.newclas(config)#enable secret Area=l*w
The enable secret you have chosen is the same as your enable password.
This is not recommended.  Re-enter the enable secret.

c29s1p.rp203.n
 << ewclas(config)#enable password Area=l*w
The enable password you have chosen is the same as your enable secret.
This is not recommended.  Re-enter the enable password.

c29s1p.rp203.newclas(config)#no aaa new-model
c29s1p.rp203.newclas(config)#clock t
 << imezone CST -6 0
c29s1p.rp203.newclas(config)#clock summer-time CDT recurring
c29s1p.rp203.newclas(config)#authentication mac-move permit
c29s1p.rp203.newclas(config)#ip domain-name mgmt.msstate.edu
c29s1p.rp203.newclas(config)#ip name-server 130.18.8
 << 0.12
c29s1p.rp203.newclas(config)#vtp domain vtp01.mgmt.msstate.edu
Domain name already set to vtp01.mgmt.msstate.edu.
c29s1p.rp203.newclas(config)#vtp mode client
Device mode already VTP Client for VLANS.
c29s1p.rp203.newclas(config)#crypto pki trus
 << tpoint TP-self-signed-2494998912
c29s1p.rp203.newclas(ca-trustpoint)# enrollment selfsigned
c29s1p.rp203.newclas(ca-trustpoint)# subject-name cn=IOS-Self-Signed-Certific$me cn=IOS-Self-Signed-Certifica         
 << te-249499Self-Signed-Certificate-2494998         912
c29s1p.rp203.newclas(ca-trustpoint)# revocation-check none
c29s1p.rp203.newclas(ca-trustpoint)# rsakeypair TP-self-signed-2494998912
c29s1p.rp2
 << 03.newclas(ca-trustpoint)#crypto pki certificate chain TP-self-sign$certificate chain TP-self-signe         d-2494998e chain TP-self-signed-24949989         
 << 12
c29s1p.rp203.newclas(config-cert-chain)# certificate self-signed 01 nvram:IOS$e self-signed 01 nvram:IOS-         Self-Sig#ned 01 nvram:IOS-Self-Sig#3         
 << 232.cer
c29s1p.rp203.newclas(config-cert-chain)#spanning-tree portfast bpduguard defa$ee portfast bpduguard defau         lt
c29s1p.rp203.newclas(config)#spanning-tree extend system-id
c29s1p.rp203.newclas(
 << config)#vlan internal allocation policy ascending
c29s1p.rp203.newclas(config)#errdisable recovery cause all
c29s1p.rp203.newclas(config)#errdisable recovery interval 1800
c29s1p.rp203.newclas(config)#interface FastEthernet0
c29s1p.rp203.newclas(confi
 << g-if)# no ip address
c29s1p.rp203.newclas(config-if)# shutdown
c29s1p.rp203.newclas(config-if)#
Dec  6 08:52:48: % Multiple self signed certificates in config
    certificate for trust point TP-self-signed-2494998912 ignored
interface Vlan1
c29s1p.r
 << p203.newclas(config-if)# no ip address
c29s1p.rp203.newclas(config-if)# no ip route-cache
c29s1p.rp203.newclas(config-if)# shutdown
c29s1p.rp203.newclas(config-if)#interface Vlan92
c29s1p.rp203.newclas(config-if)#no ip http server
c29s1p.rp203.newcla
 << s(config)#no ip http secure-server
c29s1p.rp203.newclas(config)#logging facility local1
c29s1p.rp203.newclas(config)#logging host 130.18.8.12
c29s1p.rp203.newclas(config)#access-list 1 permit 10.92.0.0 0.0.255.255
c29s1p.rp203.newclas(config)#access-l
 << ist 1 permit 130.18.8.0 0.0.0.255
c29s1p.rp203.newclas(config)#access-list 1 permit 10.93.0.0 0.0.255.255
c29s1p.rp203.newclas(config)#access-list 1 permit 130.18.1.0 0.0.0.255
c29s1p.rp203.newclas(config)#snmp-server community sysnet RO 1
c29s1p.rp20
 << 3.newclas(config)#snmp-server community c2-b2=a2 RW 1
c29s1p.rp203.newclas(config)#snmp-server enable traps snmp authentication lin$ enable traps snmp authentication link         down link
 << aps snmp authentication linkdown linku         p coldstauthentication linkdown linkup coldstar         t warmsta
 << ion linkdown linkup coldstart warmstar         t
c29s1p.rp203.newclas(config)#snmp-server enable traps transceiver all
c29s1p.rp203.newclas(config)#snmp-server enable traps tty
c29s1p.rp203.newclas(config)#snmp-server enable traps clust
 << er
c29s1p.rp203.newclas(config)#snmp-server enable traps config-copy
c29s1p.rp203.newclas(config)#snmp-server enable traps config
c29s1p.rp203.newclas(config)#snmp-server enable traps config-ctid
c29s1p.rp203.newclas(config)#snmp-server enable traps d
 << ot1x auth-fail-vlan gu$ enable traps dot1x auth-fail-vlan gue         st-vlan naps dot1x auth-fail-vlan guest-vlan no         -auth-fai
 << uth-fail-vlan guest-vlan no-auth-fail         -vlan no-vlan guest-vlan no-auth-fail-vlan no-g         uest-vlan
snmp-server enable traps dot1x auth-fa
 << il-vlan guest-vlan no-auth-fail-vlan no-gu                         ^est-vlan

% Invalid input detected at '^' marker.

c29s1p.rp203.newclas(config)#snmp-server enable traps entity
c29s1p.rp203.newclas(config)#snmp-server enable traps power-ethernet p
 << olice
c29s1p.rp203.newclas(config)#snmp-server enable traps cpu threshold
c29s1p.rp203.newclas(config)#snmp-server enable traps rep
                                                      ^
% Invalid input detected at '^' marker.

c29s1p.rp203.newclas
 << (config)#snmp-server enable traps bridge newroot topology$ enable traps bridge newroot topologyc         hange
c29s1p.rp203.newclas(config)#snmp-server enable traps stpx inconsistency root
 << $ enable traps stpx inconsistency root-         inconsistaps stpx inconsistency root-inconsiste         ncy loop-
 << nconsistency root-inconsistency loop-i         nconsistecy root-inconsistency loop-inconsisten         cy
c29s1p.rp203.newclas(config)#snmp-server enable traps syslog
c29s1p.rp203
 << .newclas(config)#snmp-server enable traps vtp
c29s1p.rp203.newclas(config)#snmp-server enable traps vlancreate
c29s1p.rp203.newclas(config)#snmp-server enable traps vlandelete
c29s1p.rp203.newclas(config)#snmp-server enable traps flash insertion remova
 << l
c29s1p.rp203.newclas(config)#snmp-server enable traps port-security
c29s1p.rp203.newclas(config)#snmp-server enable traps envmon fan shutdown sup$ enable traps envmon fan shutdown supp         l
 << y temperaps envmon fan shutdown supply tempera         ture stat fan shutdown supply temperature statu         s
c29s1p.rp203.newclas(config)#
 << snmp-server enable traps errdisable
c29s1p.rp203.newclas(config)#snmp-server enable traps mac-notification change$ enable traps mac-notification change          move thre
 << aps mac-notification change move thres         hold
c29s1p.rp203.newclas(config)#snmp-server enable traps vlan-membership
c29s1p.rp203.newclas(config)#snmp-server host 130.18.8.12 sysnet 
c29s1p.rp203.newclas(config)#line c
 << on 0
c29s1p.rp203.newclas(config-line)#line vty 0 15
c29s1p.rp203.newclas(config-line)# access-class 1 in
c29s1p.rp203.newclas(config-line)# password Area=l*w
c29s1p.rp203.newclas(config-line)# login
c29s1p.rp203.newclas(config-line)# transport input
 <<  all
c29s1p.rp203.newclas(config-line)#ntp server 10.92.0.5
c29s1p.rp203.newclas(config)#username root privilege 15 secret Area=l*w
c29s1p.rp203.newclas(config)#
c29s1p.rp203.newclas(config)#end
c29s1p.rp203.newclassroom#
 << 
Dec  6 08:53:01: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.rp203.newclassroom#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.rp203.newclas(config)#
Expect: matched string 1: (config)#
 >> spanning-tree mode mst

 >> spanning-tree etherchannel guard misconfig

 >> spanning-tree mst configuration

 >>  name msstate

 >>  revision 1

 >>  instance 1 vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 63, 70

 >>  instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 160

 >>  instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 230, 232, 242, 246

 >>  instance 1 vlan 256, 611-612, 654, 741, 996, 999

 >>  instance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037, 2039-2040

 >>  instance 2 vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096, 2104, 2110, 2126

 >>  instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 2189, 2194, 2202

 >>  instance 2 vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 2654, 2999

 >>  instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176, 196

 >>  instance 3 vlan 244, 248, 927

 >>  instance 4 vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072, 2108, 2113, 2128

 >>  instance 4 vlan 2144, 2176, 2196, 2244, 2248, 2927

 >>  instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 228

 >>  instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216, 2228

 >>  instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116, 124

 >>  instance 7 vlan 172, 186, 192, 204-208, 210, 240-241, 251-252, 630, 928

 >>  instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082, 2084

 >>  instance 8 vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208, 2210

 >>  instance 8 vlan 2240-2241, 2251-2252, 2630, 2928

 >>  instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102, 112

 >>  instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 500, 505, 510-511

 >>  instance 9 vlan 522, 551-570, 603, 629, 633, 742, 802, 926, 929

 >>  instance 10 vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 2057, 2062, 2068

 >>  instance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148, 2158

 >>  instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522, 2603, 2629, 2633

 >>  instance 10 vlan 2802, 2926, 2929

 >>  instance 11 vlan 8, 43, 52, 146, 156-157, 180, 200, 218

 >>  instance 12 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180, 2200, 2218

 >> 

 >> end

Expect: searching for 1 strs:  :Configured
 << spanning-tree mode mst
c29s1p.rp203.newclas(config)#spanning-tree etherchannel guard misconfig
c29s1p.rp203.newclas(config)#spanning-tree mst configuration
c29s1p.rp203.newclas(config-mst)# name msstate
c29s1p.rp203.newclas(config-mst)# revision 1
c2
 << 9s1p.rp203.newclas(config-mst)# instance 1 vlan 2, 7, 11, 20, 22, 24, 31, 3$ vlan 2, 7, 11, 20, 22, 24, 31, 35         , 37, 39-, 11, 20, 22, 24, 31, 35, 37, 3
 << 9-4         0, 50, 6022, 24, 31, 35, 37, 39-40, 50, 60,          63, 70
c29s1p.rp203.newclas(config-mst)# instance 1 vlan 78, 80, 86, 91, 96, 104, 11
 << $ vlan 78, 80, 86, 91, 96, 104, 110         , 126, 1380, 86, 91, 96, 104, 110, 126, 136         , 140, 15, 96, 104, 110, 126, 136, 140, 152         
 << , 160
c29s1p.rp203.newclas(config-mst)# instance 1 vlan 162-163, 168, 189, 194, 202$ vlan 162-163, 168, 189, 194, 202,          220, 222163, 168, 189, 1
 << 94, 202, 220, 222,          230, 23289, 194, 202, 220, 222, 230, 232,          242, 246
c29s1p.rp203.newclas(config-mst)# instance 1 vlan 256, 611-612, 654, 741, 996
 << $ vlan 256, 611-612, 654, 741, 996,          999
c29s1p.rp203.newclas(config-mst)# instance 2 vlan 2002, 2007, 2011, 2020, 202$ vlan 2002, 2007, 2011, 2020, 2022         , 2024,
 <<  2, 2007, 2011, 2020, 2022, 2024, 20         31, 2035,11, 2020, 2022, 2024, 2031, 2035,          2037, 20320
 << 22, 2024, 2031, 2035, 2037, 2039         -2040
c29s1p.rp203.newclas(config-mst)# instance 2 vlan 2050, 2060, 2063, 2070, 208$ vlan 2050, 2060, 2063, 2070, 2080         , 2086, 2
 << , 2060, 2063, 2070, 2080, 2086, 20         96, 2104,63, 2070, 2080, 2086, 2096, 2104,          2110, 2122080, 2086, 2096, 2
 << 104, 2110, 2126         
c29s1p.rp203.newclas(config-mst)# instance 2 vlan 2136, 2140, 2152, 2160, 216$ vlan 2136, 2140, 2152, 2160, 2162         -2163, 21
 << , 2140, 2152, 2160, 2162-2163, 216         8, 2189, 52, 2160, 2162-2163, 2168, 2189, 2         194, 2202
c29s1p.rp203.newclas(config-mst)# instance 2 vlan 2220, 2222, 2232, 2242, 224
 << $ vlan 2220, 2222, 2232, 2242, 2246         , 2611-26, 2222, 2232, 2242, 2246, 2611-261         2, 2654, 32, 224
 << 2, 2246, 2611-2612, 2654, 2         999
c29s1p.rp203.newclas(config-mst)# instance 3 vlan 42, 51, 59, 64, 66, 69, 72,$ vlan 42, 51, 59, 64, 66, 69, 72,          108, 113,
 << 51, 59, 64, 66, 69, 72, 108, 113,          128, 144,, 66, 69, 72, 108, 113, 128, 144,          176, 196
c29s1p.rp203.newclas(config-mst)# instance 3 vlan 244, 248, 927
c29
 << s1p.rp203.newclas(config-mst)# instance 4 vlan 2042, 2051, 2059, 2064, 206$ vlan 2042, 2051, 2059, 2064, 2066         , 2069, 2, 2051, 2059, 2064, 2066, 2069, 
 << 20         72, 2108,59, 2064, 2066, 2069, 2072, 2108,          2113, 2122066, 2069, 2072, 2108, 2113, 2128         
c29s1p.rp203.newclas(conf
 << ig-mst)# instance 4 vlan 2144, 2176, 2196, 2244, 224$ vlan 2144, 2176, 2196, 2244, 2248         , 2927
c29s1p.rp203.newclas(config-mst)# instance 5 vlan 16, 48, 58, 88, 121, 131, 1
 << $ vlan 16, 48, 58, 88, 121, 131, 13         3-134, 2148, 58, 88, 121, 131, 133-134, 216         , 228
c29s1p.rp203.newclas(config-mst)# instance 6 vlan 2016, 2048, 2058, 
 << 2088, 212$ vlan 2016, 2048, 2058, 2088, 2121         , 2131, 2, 2048, 2058, 2088, 2121, 2131, 21         33-2134, 
 << 58, 2088, 2121, 2131, 2133-2134, 2         216, 2228
c29s1p.rp203.newclas(config-mst)# instance 7 vlan 9, 33-34, 38, 54, 56, 71, 7$ vlan 9, 33-34, 38, 54, 56, 71, 75         , 82, 84,
 << 3-34, 38, 54, 56, 71, 75, 82, 84,          97, 114, 54, 56, 71, 75, 82, 84, 97, 114, 1         16, 124
c29s1p.rp203.newclas(config-mst)# instance 7 vlan
 <<  172, 186, 192, 204-208, 210$ vlan 172, 186, 192, 204-208, 210,          240-241,186, 192, 204-208, 210, 240-241,          251-252, 
 << 204-208, 210, 240-241, 251-252, 6         30, 928
c29s1p.rp203.newclas(config-mst)# instance 8 vlan 2009, 2033-2034, 2038, 2054$ vlan 2009, 2033-2034, 2038, 2054,         
 <<  2056, 20, 2033-2034, 2038, 2054, 2056, 207         1, 2075, 4, 2038, 2054, 2056, 2071, 2075, 2         082, 2084
c29s1p.rp203.newclas(config-mst)# 
 << instance 8 vlan 2097, 2114, 2116, 2124, 217$ vlan 2097, 2114, 2116, 2124, 2172         , 2186, 2, 2114, 2116, 2124, 2172, 2186, 21         92, 2204-
 << 16, 2124, 2172, 2186, 2192, 2204-2         208, 2210
c29s1p.rp203.newclas(config-mst)# instance 8 vlan 2240-2241, 2251-2252, 2630,$ vlan 2240-2241, 2251-2252, 2
 << 630,          2928
c29s1p.rp203.newclas(config-mst)# instance 9 vlan 4-5, 12, 18-19, 32, 44, 57,$ vlan 4-5, 12, 18-19, 32, 44, 57,          62, 68, 71
 << 2, 18-19, 32, 44, 57, 62, 68, 76         , 98-99, , 32, 44, 57, 62, 68, 76, 98-99, 1         02, 112
c29s1p.rp203.newclas(config-mst)# instance 9 vlan 130, 132, 147-148, 158, 212
 << $ vlan 130, 132, 147-148, 158, 212,          226, 236132, 147-148, 158, 212, 226, 236,          500, 505148, 158, 212, 226,
 <<  236, 500, 505,          510-511
c29s1p.rp203.newclas(config-mst)# instance 9 vlan 522, 551-570, 603, 629, 633$ vlan 522, 551-570, 603, 629, 633,          742, 802
 << 551-570, 603, 629, 633, 742, 802,          926, 929
c29s1p.rp203.newclas(config-mst)# instance 10 vlan 2004-2005, 2012, 2018-2019$0 vlan 2004-2005, 2012, 2018-2019,          2032,
 <<  204-2005, 2012, 2018-2019, 2032, 204         4, 2057, 12, 2018-2019, 2032, 2044, 2057, 2         062, 2068
c29s1p.rp203.newclas(config-mst)# instance
 <<  10 vlan 2076, 2098-2099, 2102, 211$0 vlan 2076, 2098-2099, 2102, 2112         , 2130, 26, 2098-2099, 2102, 2112, 2130, 21         32, 2147-
 << 99, 2102, 2112, 2130, 2132, 2147-2         148, 2158
c29s1p.rp203.newclas(config-mst)# instance 10 vlan 2212, 2236, 2500, 2505, 25$0 vlan 2212, 2236, 2500, 2505, 251   
 <<       0-2511, 22, 2236, 2500, 2505, 2510-2511, 25         22, 2603,500, 2505, 2510-2511, 2522, 2603,          2629, 263
 <<  2510-2511, 2522, 2603, 2629, 2633         
c29s1p.rp203.newclas(config-mst)# instance 10 vlan 2802, 2926, 2929
c29s1p.rp203.newclas(config-mst)# instance 11 vlan 8, 43, 52, 146, 156-157, 1
 << $1 vlan 8, 43, 52, 146, 156-157, 18         0, 200, 243, 52, 146, 156-157, 180, 200, 21         8
c29s1p.rp203.newclas(config-mst)# instance 12 vlan 2008, 2043, 2052, 2146, 21
 << $2 vlan 2008, 2043, 2052, 2146, 215         6-2157, 28, 2043, 2052, 2146, 2156-2157, 21         80, 2200,052, 2146, 
 << 2156-2157, 2180, 2200,          2218
c29s1p.rp203.newclas(config-mst)#
c29s1p.rp203.newclas(config-mst)#end
c29s1p.rp203.newclassroom#
 << 
Dec  6 08:53:19: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.rp203.newclassroom#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.rp203.newclas(config)#
Expect: matched string 1: (config)#
 >> hostname c29s1p.rp203.newclassroom 

Expect: searching for 2 strs:  :# :>
 << hostname c29s1p.rp203.newclassroom 
c29s1p.rp203.newclas(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s1p.rp203.newclassroom#
 << 
Dec  6 08:53:25: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.rp203.newclassroom#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.rp203.newclas(config)#
Expect: matched string 1: (config)#
 >> snmp-server contact 6F-2143

Expect: searching for 1 strs:  :#
 << snmp-server contact 6F-2143
c29s1p.rp203.newclas(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s1p.rp203.newclassroom#
 << 
Dec  6 08:53:31: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.rp203.newclassroom#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.rp203.newclas(config)#
Expect: matched string 1: (config)#
 >> interface vlan 92

Expect: searching for 1 strs:  :(config-if)#
 << interface vlan 92
c29s1p.rp203.newclas(config-if)#
Expect: matched string 1: (config-if)#
 >> ip address 10.92.5.152 255.255.0.0

 >> ip broadcast-address 10.92.255.255

 >> end

Expect: searching for 1 strs:  :Configured
 << ip address 10.92.5.152 255.255.0.0
c29s1p.rp203.newclas(config-if)#ip broadcast-address 10.92.255.255
c29s1p.rp203.newclas(config-if)#end
c29s1p.rp203.newclassroom#
 << 
Dec  6 08:53:38: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.rp203.newclassroom#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.rp203.newclas(config)#
Expect: matched string 1: (config)#
 >> interface Vlan92

Expect: searching for 1 strs:  :(config-if)#
 << interface Vlan92
c29s1p.rp203.newclas(config-if)#
Expect: matched string 1: (config-if)#
 >> ip default-gateway 10.92.0.1

 >> end

Expect: searching for 1 strs:  :Configured
 << ip default-gateway 10.92.0.1
c29s1p.rp203.newclas(config)#end
c29s1p.rp203.newclassroom#
Dec  6 08:53:43: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.rp203.newclassroom#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.rp203.newclas(config)#
Expect: matched string 1: (config)#
 >> ip dhcp snooping

Expect: searching for 1 strs:  :#
 << ip dhcp snooping
c29s1p.rp203.newclas(config)#
Expect: matched string 1: #
 >> ip dhcp snooping vlan 177

Expect: searching for 1 strs:  :#
 << ip dhcp snooping vlan 177
c29s1p.rp203.newclas(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s1p.rp203.newclassroom#
Dec  6 08:53:50: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.rp203.newclassroom#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.rp203.newclas(config)#
Expect: matched string 1: (config)#
 >> default interface range gi1/0/1 - 48 

 >> interface range gi1/0/1 - 48 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi1/0/1 - 48 

 << c29s1p.rp203.newclas(config)#interface range gi1/0/1 - 48 
c29s1p.rp203.newclas(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport access vlan 177

 >> switchport mode access

 >> spanning-tree portfast

 >> switchport port-security maximum 2

 >> switchport port-security

 >> switchport port-security aging time 15

 >> switchport port-security violation protect

 >> switchport port-security aging type inactivity

 >> power inline never

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport access vlan 177
c29s1p.rp203.newclas(config-if-range)#switchport mode access
c29s1p.rp203.newclas(config-if-range)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, conce
 << ntrators, switches, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast will be configured in 48 interfaces due to the range command 
 but will only have effect when the inter
 << faces are in a non-trunking mode.
c29s1p.rp203.newclas(config-if-range)#switchport port-security maximum 2
c29s1p.rp203.newclas(config-if-range)#switchport port-security
c29s1p.rp203.newclas(config-if-range)#switchport port-security aging time 15
c29s
 << 1p.rp203.newclas(config-if-range)#switchport port-security violation prot$port-security violation prote         ct
c29s1p.rp203.newclas(config-if-range)#switchport port-security aging type ina
 << $port-security aging type inac         tivity
c29s1p.rp203.newclas(config-if-range)#power inline never
c29s1p.rp203.newclas(config-if-range)#end
c29s1p.rp203.newclassroom#
Dec  6 08:54:05: %SYS-5-CONFIG_I: Configured 
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << from console by console
c29s1p.rp203.newclassroom#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.rp203.newclas(config)#
Expect: matched string 1: (config)#
 >> default interface range te1/0/1 - 2 

 >> interface range te1/0/1 - 2 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range te1/0/1 - 2 
c29s1p.rp203.newclas(config)#interface range te1/0/1 - 2 
c29s1p.rp203.newclas(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport mode trunk

 >> switchport trunk native vlan 92

 >> ip dhcp snooping trust

 >> no keepalive

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport mode trunk
c29s1p.rp203.newclas(config-if-range)#switchport trunk native vlan 92
c29s1p.rp203.newclas(config-if-range)#ip dhcp snooping trust
c29s1p.rp203.newclas(config-if-range)#no keepalive
c29s1p.rp203.newclas(config-if-range)#end
c29s
 << 1p.rp203.newclassroom#
 << 
Dec  6 08:54:14: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.rp203.newclassroom#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.rp203.newclas(config)#
Expect: matched string 1: (config)#
 >> default interface range gi1/0/49 - 50 

 >> interface range gi1/0/49 - 50 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi1/0/49 - 50 
c29s1p.rp203.newclas(config)#interface range gi1/0/49 - 50 
c29s1p.rp203.newclas(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport mode trunk

 >> switchport trunk native vlan 92

 >> ip dhcp snooping trust

 >> no keepalive

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport mode trunk
c29s1p.rp203.newclas(config-if-range)#switchport trunk native vlan 92
c29s1p.rp203.newclas(config-if-range)#ip dhcp snooping trust
c29s1p.rp203.newclas(config-if-range)#no keepalive
c29s1p.rp203.newclas(config-if-range)#end
c29s
 << 1p.rp203.newclassroom#
 << 
Dec  6 08:54:20: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> write mem

Expect: searching for 2 strs:  :# :>
 << 
c29s1p.rp203.newclassroom#write mem
Building configuration...

Expect: matched string 1: #
 >> 
Expect: searching for 2 strs:  :# :>
 << [OK]
c29s1p.rp203.newclassroom#
c29s1p.rp203.newclassroom#
c29s1p.rp203.newclassroom#
Expect: matched string 1: #
 >> sh run

Expect: searching for 2 strs:  :# :>
 << sh run
Building configuration...

Current configuration : 21893 bytes
!
! Last configuration change at 08:54:20 CST Tue Dec 6 2016
! NVRAM config last updated at 08:54:28 CST Tue Dec 6 2016
!
version 15.2
no service pad
service timestamps debug 
 << datetime localtime
service timestamps log datetime localtime
service password-encryption
!
hostname c29s1p.rp203.newclassroom
!
boot-start-marker
boot-end-marker
!
enable secret 5 $1$OFt8$mkl8.JBEj74EPwglbKN0y/
enable password 7 047A19030E7C4004
 << 1E
!
username root privilege 15 secret 5 $1$etYp$fK9pU5dMFSlb7oaEqjJSU.
no aaa new-model
clock timezone CST -6 0
clock summer-time CDT recurring
switch 1 provision ws-c2960x-48fpd-l
!
!
ip dhcp snooping vlan 177
ip dhcp snooping
ip domain-name 
 << mgmt.msstate.edu
ip name-server 130.18.80.12
!
!
!
!
!
authentication mac-move permit
!
!
crypto pki trustpoint TP-self-signed-2494998912
 enrollment selfsigned
 subject-name cn=IOS-Self-Signed-Certificate-2494998912
 revocation-check none
 
 << rsakeypair TP-self-signed-2494998912
!
!
crypto pki certificate chain TP-self-signed-2494998912
 certificate self-signed 01
  	quit
!
spanning-tree mode mst
spanning-tree portfast bpduguard default
spanning-tree extend system-id
!
spanning-tree
 <<  mst configuration
 name msstate
 revision 1
 instance 1 vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 63, 70
 instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 160
 instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 230, 
 << 232, 242, 246
 instance 1 vlan 256, 611-612, 654, 741, 996, 999
 instance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037, 2039-2040
 instance 2 vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096, 2104, 2110, 2126
 instance 2 vlan 2136, 2140, 2
 << 152, 2160, 2162-2163, 2168, 2189, 2194, 2202
 instance 2 vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 2654, 2999
 instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176, 196
 instance 3 vlan 244, 248, 927
 instance 4 vlan 2042, 2051, 205
 << 9, 2064, 2066, 2069, 2072, 2108, 2113, 2128
 instance 4 vlan 2144, 2176, 2196, 2244, 2248, 2927
 instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 228
 instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216, 2228
 instance 7 vlan 9,
 <<  33-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116, 124
 instance 7 vlan 172, 186, 192, 204-208, 210, 240-241, 251-252, 630, 928
 instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082, 2084
 instance 8 vlan 2097, 2114, 2116, 2124, 2172, 218
 << 6, 2192, 2204-2208, 2210
 instance 8 vlan 2240-2241, 2251-2252, 2630, 2928
 instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102, 112
 instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 500, 505, 510-511
 instance 9 vlan 522, 551-570
 << , 603, 629, 633, 742, 802, 926, 929
 instance 10 vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 2057, 2062, 2068
 instance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148, 2158
 instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522, 2603, 2
 << 629, 2633
 instance 10 vlan 2802, 2926, 2929
 instance 11 vlan 8, 43, 52, 146, 156-157, 180, 200, 218
 instance 12 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180, 2200, 2218
!
errdisable recovery cause udld
errdisable recovery cause bpduguard
errdisa
 << ble recovery cause security-violation
errdisable recovery cause channel-misconfig
errdisable recovery cause pagp-flap
errdisable recovery cause dtp-flap
errdisable recovery cause link-flap
errdisable recovery cause sfp-config-mismatch
errdisable rec
 << overy cause gbic-invalid
errdisable recovery cause psecure-violation
errdisable recovery cause port-mode-failure
errdisable recovery cause dhcp-rate-limit
errdisable recovery cause pppoe-ia-rate-limit
errdisable recovery cause mac-limit
errdisable r
 << ecovery cause vmps
errdisable recovery cause storm-control
errdisable recovery cause inline-power
errdisable recovery cause arp-inspection
errdisable recovery cause loopback
errdisable recovery cause small-frame
errdisable recovery cause psp
errdis
 << able recovery interval 1800
!
!
!
!
vlan internal allocation policy ascending
!
!
! 
!
!
!
!
!
!
!
!
interface FastEthernet0
 no ip address
 shutdown
!
interface GigabitEthernet1/0/1
 switchport access vlan 177
 switchport mode acce
 << ss
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
in
 << terface GigabitEthernet1/0/2
 switchport access vlan 177
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 << 
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/3
 switchport access vlan 177
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchp
 << ort port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/4
 switchport access vlan 177
 switchport mode access
 switchport
 <<  port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface Gigabit
 << Ethernet1/0/5
 switchport access vlan 177
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport p
 << ort-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/6
 switchport access vlan 177
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-securi
 << ty aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/7
 switchport access vlan 177
 switchport mode access
 switchport port-security 
 << maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/8

 <<  switchport access vlan 177
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 
 << power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/9
 switchport access vlan 177
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 1
 << 5
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/10
 switchport access vlan 177
 switchport mode access
 switchport port-security maximum 2
 sw
 << itchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/11
 switchport a
 << ccess vlan 177
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline 
 << never
 spanning-tree portfast
!
interface GigabitEthernet1/0/12
 switchport access vlan 177
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchpo
 << rt port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/13
 switchport access vlan 177
 switchport mode access
 switchport port-security maximum 2
 switchport por
 << t-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/14
 switchport access vlan 1
 << 77
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 span
 << ning-tree portfast
!
interface GigabitEthernet1/0/15
 switchport access vlan 177
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-secu
 << rity aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/16
 switchport access vlan 177
 switchport mode access
 switchport port-security maximum 2
 switchport port-security v
 << iolation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/17
 switchport access vlan 177
 switchp
 << ort mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree po
 << rtfast
!
interface GigabitEthernet1/0/18
 switchport access vlan 177
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging t
 << ype inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/19
 switchport access vlan 177
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  pr
 << otect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/20
 switchport access vlan 177
 switchport mode acc
 << ess
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
i
 << nterface GigabitEthernet1/0/21
 switchport access vlan 177
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivi
 << ty
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/22
 switchport access vlan 177
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 swit
 << chport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/23
 switchport access vlan 177
 switchport mode access
 switch
 << port port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface Gig
 << abitEthernet1/0/24
 switchport access vlan 177
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchp
 << ort port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/25
 switchport access vlan 177
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-
 << security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/26
 switchport access vlan 177
 switchport mode access
 switchport port-se
 << curity maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet
 << 1/0/27
 switchport access vlan 177
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-sec
 << urity
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/28
 switchport access vlan 177
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security agi
 << ng time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/29
 switchport access vlan 177
 switchport mode access
 switchport port-security maxim
 << um 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/30
 swi
 << tchport access vlan 177
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 powe
 << r inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/31
 switchport access vlan 177
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15

 <<  switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/32
 switchport access vlan 177
 switchport mode access
 switchport port-security maximum 2
 switc
 << hport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/33
 switchport acce
 << ss vlan 177
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline nev
 << er
 spanning-tree portfast
!
interface GigabitEthernet1/0/34
 switchport access vlan 177
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport 
 << port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/35
 switchport access vlan 177
 switchport mode access
 switchport port-security maximum 2
 switchport port-s
 << ecurity violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/36
 switchport access vlan 177
 << 
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spannin
 << g-tree portfast
!
interface GigabitEthernet1/0/37
 switchport access vlan 177
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-securit
 << y aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/38
 switchport access vlan 177
 switchport mode access
 switchport port-security maximum 2
 switchport port-security viol
 << ation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/39
 switchport access vlan 177
 switchport
 <<  mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portf
 << ast
!
interface GigabitEthernet1/0/40
 switchport access vlan 177
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type
 <<  inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/41
 switchport access vlan 177
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  prote
 << ct
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/42
 switchport access vlan 177
 switchport mode access
 << 
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
inte
 << rface GigabitEthernet1/0/43
 switchport access vlan 177
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 << 
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/44
 switchport access vlan 177
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchp
 << ort port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/45
 switchport access vlan 177
 switchport mode access
 switchpor
 << t port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface Gigabi
 << tEthernet1/0/46
 switchport access vlan 177
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport
 <<  port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/47
 switchport access vlan 177
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-sec
 << urity aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/48
 switchport access vlan 177
 switchport mode access
 switchport port-secur
 << ity maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0
 << /49
 switchport trunk native vlan 92
 switchport mode trunk
 ip dhcp snooping trust
!
interface GigabitEthernet1/0/50
 switchport trunk native vlan 92
 switchport mode trunk
 ip dhcp snooping trust
!
interface TenGigabitEthernet1/0/1
 switchpor
 << t trunk native vlan 92
 switchport mode trunk
 ip dhcp snooping trust
!
interface TenGigabitEthernet1/0/2
 switchport trunk native vlan 92
 switchport mode trunk
 ip dhcp snooping trust
!
interface Vlan1
 no ip address
 no ip route-cache
 shut
 << down
!
interface Vlan92
 ip address 10.92.5.152 255.255.0.0
 ip broadcast-address 10.92.255.255
!
ip default-gateway 10.92.0.1
no ip http server
no ip http secure-server
!
!
logging facility local1
logging host 130.18.8.12
access-list 1 permi
 << t 10.92.0.0 0.0.255.255
access-list 1 permit 130.18.8.0 0.0.0.255
access-list 1 permit 10.93.0.0 0.0.255.255
access-list 1 permit 130.18.1.0 0.0.0.255
!
snmp-server community sysnet RO 1
snmp-server community c2-b2=a2 RW 1
snmp-server contact 6F-21
 << 43
snmp-server enable traps snmp authentication linkdown linkup coldstart warmstart
snmp-server enable traps transceiver all
snmp-server enable traps tty
snmp-server enable traps cluster
snmp-server enable traps config-copy
snmp-server enable traps 
 << config
snmp-server enable traps config-ctid
snmp-server enable traps entity
snmp-server enable traps power-ethernet police
snmp-server enable traps cpu threshold
snmp-server enable traps bridge newroot topologychange
snmp-server enable traps stpx in
 << consistency root-inconsistency loop-inconsistency
snmp-server enable traps syslog
snmp-server enable traps vtp
snmp-server enable traps vlancreate
snmp-server enable traps vlandelete
snmp-server enable traps flash insertion removal
snmp-server enabl
 << e traps port-security
snmp-server enable traps envmon fan shutdown supply temperature status
snmp-server enable traps errdisable
snmp-server enable traps mac-notification change move threshold
snmp-server enable traps vlan-membership
snmp-server host
 <<  130.18.8.12 sysnet 
!
!
line con 0
line vty 0 4
 access-class 1 in
 password 7 132405170A5108603C
 login
 transport input all
line vty 5 15
 access-class 1 in
 password 7 132405170A5108603C
 login
 transport input all
!
ntp server 10.92.0.
 << 5
end

c29s1p.rp203.newclassroom#
Expect: matched string 1: #
 >> show interface status

Expect: searching for 2 strs:  :# :>
 << show interface status

Port      Name               Status       Vlan       Duplex  Speed Type 
Gi1/0/1                      notconnect   177          auto   auto 10/100/1000BaseTX
Gi1/0/2                      notconnect   177          auto   auto 10/
 << 100/1000BaseTX
Gi1/0/3                      notconnect   177          auto   auto 10/100/1000BaseTX
Gi1/0/4                      notconnect   177          auto   auto 10/100/1000BaseTX
Gi1/0/5                      notconnect   177          auto   auto 
 << 10/100/1000BaseTX
Gi1/0/6                      notconnect   177          auto   auto 10/100/1000BaseTX
Gi1/0/7                      notconnect   177          auto   auto 10/100/1000BaseTX
Gi1/0/8                      notconnect   177          auto   au
 << to 10/100/1000BaseTX
Gi1/0/9                      notconnect   177          auto   auto 10/100/1000BaseTX
Gi1/0/10                     notconnect   177          auto   auto 10/100/1000BaseTX
Gi1/0/11                     notconnect   177          auto  
 <<  auto 10/100/1000BaseTX
Gi1/0/12                     notconnect   177          auto   auto 10/100/1000BaseTX
Gi1/0/13                     notconnect   177          auto   auto 10/100/1000BaseTX
Gi1/0/14                     notconnect   177          aut
 << o   auto 10/100/1000BaseTX
Gi1/0/15                     notconnect   177          auto   auto 10/100/1000BaseTX
Gi1/0/16                     notconnect   177          auto   auto 10/100/1000BaseTX
Gi1/0/17                     notconnect   177          
 << auto   auto 10/100/1000BaseTX
Gi1/0/18                     notconnect   177          auto   auto 10/100/1000BaseTX
Gi1/0/19                     notconnect   177          auto   auto 10/100/1000BaseTX
Gi1/0/20                     notconnect   177       
 <<    auto   auto 10/100/1000BaseTX
Gi1/0/21                     notconnect   177          auto   auto 10/100/1000BaseTX
Gi1/0/22                     notconnect   177          auto   auto 10/100/1000BaseTX
Gi1/0/23                     notconnect   177    
 <<       auto   auto 10/100/1000BaseTX
Gi1/0/24                     notconnect   177          auto   auto 10/100/1000BaseTX
Gi1/0/25                     notconnect   177          auto   auto 10/100/1000BaseTX
Gi1/0/26                     notconnect   177 
 <<          auto   auto 10/100/1000BaseTX
Gi1/0/27                     notconnect   177          auto   auto 10/100/1000BaseTX
Gi1/0/28                     notconnect   177          auto   auto 10/100/1000BaseTX
Gi1/0/29                     notconnect   1
 << 77          auto   auto 10/100/1000BaseTX
Gi1/0/30                     notconnect   177          auto   auto 10/100/1000BaseTX
Gi1/0/31                     notconnect   177          auto   auto 10/100/1000BaseTX
Gi1/0/32                     notconnect 
 <<   177          auto   auto 10/100/1000BaseTX
Gi1/0/33                     notconnect   177          auto   auto 10/100/1000BaseTX
Gi1/0/34                     notconnect   177          auto   auto 10/100/1000BaseTX
Gi1/0/35                     notconne
 << ct   177          auto   auto 10/100/1000BaseTX
Gi1/0/36                     notconnect   177          auto   auto 10/100/1000BaseTX
Gi1/0/37                     notconnect   177          auto   auto 10/100/1000BaseTX
Gi1/0/38                     notco
 << nnect   177          auto   auto 10/100/1000BaseTX
Gi1/0/39                     notconnect   177          auto   auto 10/100/1000BaseTX
Gi1/0/40                     notconnect   177          auto   auto 10/100/1000BaseTX
Gi1/0/41                     no
 << tconnect   177          auto   auto 10/100/1000BaseTX
Gi1/0/42                     notconnect   177          auto   auto 10/100/1000BaseTX
Gi1/0/43                     notconnect   177          auto   auto 10/100/1000BaseTX
Gi1/0/44                    
 <<  notconnect   177          auto   auto 10/100/1000BaseTX
Gi1/0/45                     notconnect   177          auto   auto 10/100/1000BaseTX
Gi1/0/46                     notconnect   177          auto   auto 10/100/1000BaseTX
Gi1/0/47                 
 <<     notconnect   177          auto   auto 10/100/1000BaseTX
Gi1/0/48                     notconnect   177          auto   auto 10/100/1000BaseTX
Te1/0/1                      notconnect   1            full    10G Not Present
Te1/0/2                     
 <<  notconnect   1            full    10G Not Present
Fa0                          disabled     routed       auto   auto 10/100BaseTX
c29s1p.rp203.newclassroom#
Expect: matched string 1: #
