trying to use serial port: /dev/ttyUSB0
 >> 
 >> 

Expect: searching for 4 strs:  :[yes/no] :Press RETURN to get started. :# :Switch>
 << 
Switch>
Switch>
Switch>
Switch>
Expect: matched string 4: Switch>
 >> term len 0

Expect: searching for 2 strs:  :# :>
 << term len 0
Switch>
Expect: matched string 2: >
 >> show version

Expect: searching for 2 strs:  :# :>
 << show version
Cisco IOS Software, C3560 Software (C3560-IPBASEK9-M), Version 12.2(55)SE7, RELEASE SOFTWARE (fc1)
Technical Support: http://www.cisco.com/techsupport
Copyright (c) 1986-2013 by Cisco Systems, Inc.
Compiled Mon 28-Jan-13 10:10 by prod_rel
 << _team
Image text-base: 0x01000000, data-base: 0x02D00000

ROM: Bootstrap program is C3560 boot loader
BOOTLDR: C3560 Boot Loader (C3560-HBOOT-M) Version 12.2(44)SE5, RELEASE SOFTWARE (fc1)

Switch uptime is 3 minutes
System returned to ROM by power
 << -on
System image file is "flash:c3560-ipbasek9-mz.122-55.SE7/c3560-ipbasek9-mz.122-55.SE7.bin"


This product contains cryptographic features and is subject to United
States and local country laws governing import, export, transfer and
use. Delivery
 <<  of Cisco cryptographic products does not imply
third-party authority to import, export, distribute or use encryption.
Importers, exporters, distributors and users are responsible for
compliance with U.S. and local country laws. By using this product y
 << ou
agree to comply with applicable laws and regulations. If you are unable
to comply with U.S. and local laws, return this product immediately.

A summary of U.S. laws governing Cisco cryptographic products may be found at:
http://www.cisco.com/wwl/e
 << xport/crypto/tool/stqrg.html

If you require further assistance please contact us by sending email to
export@cisco.com.

cisco WS-C3560-24PS (PowerPC405) processor (revision P0) with 131072K bytes of memory.
Processor board ID CAT1029RH4C
Last rese
 << t from power-on
1 Virtual Ethernet interface
24 FastEthernet interfaces
2 Gigabit Ethernet interfaces
The password-recovery mechanism is enabled.

512K bytes of flash-simulated non-volatile configuration memory.
Base ethernet MAC Address       : 00
 << :18:B9:EE:8F:00
Motherboard assembly number     : 73-9673-15
Power supply part number        : 341-0029-05
Motherboard serial number       : CAT10286W11
Power supply serial number      : DTH1026E269
Model revision number           : P0
Motherboard r
 << evision number     : C0
Model number                    : WS-C3560-24PS-S
System serial number            : CAT1029RH4C
Top Assembly Part Number        : 800-25861-09
Top Assembly Revision Number    : F0
Version ID                      : V11
CLEI Co
 << de Number                : COMAM10BRA
Hardware Board Revision Number  : 0x01


Switch Ports Model              SW Version            SW Image                 
------ ----- -----              ----------            ----------               
*    1 26 
 <<    WS-C3560-24PS      12.2(55)SE7           C3560-IPBASEK9-M         


Configuration register is 0xF

Switch>
Expect: matched string 2: >
 >> enable

Expect: searching for 2 strs:  :Password: :#
 << enable
Switch#
Expect: matched string 2: #
 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
Expect: matched string 1: (config)#
 >> no service pad

 >> service timestamps debug datetime localtime

 >> service timestamps log datetime localtime

 >> service password-encryption

 >> logging buffered informational

 >> enable secret Area=l*w

 >> enable password Area=l*w

 >> no aaa new-model

 >> clock timezone CST -6

 >> clock summer-time CDT recurring

 >> system mtu routing 1500

 >> ip subnet-zero

 >> ip domain-name mgmt.msstate.edu

 >> ip name-server 130.18.80.13

 >> ip name-server 130.18.80.12

 >> vtp domain vtp01.mgmt.msstate.edu

 >> vtp mode client

 >> spanning-tree portfast bpduguard default

 >> spanning-tree extend system-id

 >> errdisable recovery cause all

 >> errdisable recovery interval 1800

 >> interface Vlan1

 >>  no ip address

 >>  no ip route-cache

 >> interface Vlan92

 >> no ip http server

 >> logging facility local1

 >> logging 130.18.8.12

 >> access-list 1 permit 10.92.0.0 0.0.255.255

 >> snmp-server community sysnet RO 1

 >> snmp-server community c2-b2=a2 RW 1

 >> snmp-server enable traps snmp authentication linkdown linkup coldstart warmstart

 >> snmp-server enable traps tty

 >> snmp-server enable traps cluster

 >> snmp-server enable traps config-copy

 >> snmp-server enable traps config

 >> snmp-server enable traps entity

 >> snmp-server enable traps power-ethernet group 1

 >> snmp-server enable traps cpu threshold

 >> snmp-server enable traps rtr

 >> snmp-server enable traps bridge newroot topologychange

 >> snmp-server enable traps stpx inconsistency root-inconsistency loop-inconsistency

 >> snmp-server enable traps syslog

 >> snmp-server enable traps vtp

 >> snmp-server enable traps vlancreate

 >> snmp-server enable traps vlandelete

 >> snmp-server enable traps flash insertion removal

 >> snmp-server enable traps port-security

 >> snmp-server enable traps envmon fan shutdown supply temperature status

 >> snmp-server enable traps vlan-membership

 >> snmp-server host 130.18.8.12 

 >> line con 0

 >> line vty 0 4

 >>  password Area=l*w

 >>  login

 >> line vty 5 15

 >>  password Area=l*w

 >>  login

 >> ntp clock-period 36026023

 >> ntp server 10.92.0.5

 >> end

 >> end

Expect: searching for 1 strs:  :Configured
 << no service pad
Switch(config)#service timestamps debug datetime localtime
Switch(config)#service timestamps log datetime localtime
Switch(config)#service password-encryption
Switch(config)#logging buffered informational
Switch(config)#enable secret A
 << rea=l*w
Switch(config)#enable password Area=l*w
The enable password you have chosen is the same as your enable secret.
This is not recommended.  Re-enter the enable password.

Switch(config)#no aaa new-model
Switch(config)#clock timezone CST -6
Swi
 << tch(config)#clock summer-time CDT recurring
Switch(config)#system mtu routing 1500
Switch(config)#ip subnet-zero
Switch(config)#ip domain-name mgmt.msstate.edu
Switch(config)#ip name-server 130.18.80.13
Switch(config)#ip name-server 130.18.80.12
Swi
 << tch(config)#
*Feb 28 18:04:32: %SYS-6-CLOCKUPDATE: System clock has been updated from 00:04:32 UTC Mon Mar 1 1993 to 18:04:32 CST Sun Feb 28 1993, configured from console by console.
*Feb 28 18:04:33: %SYS-6-CLOCKUPDATE: System clock has been updated fr
 << om 18:04:33 CST Sun Feb 28 1993 to 18:04:33 CST Sun Feb 28 1993, configured from console by console.vtp domain vtp01.mgmt.msstate.edu
Changing VTP domain name from NULL to vtp01.mgmt.msstate.edu
Switch(config)#vtp mode client
Setting device to VTP Clie
 << nt mode for VLANS.
Switch(config)#spanning-tree portfast bpduguard default
Switch(config)#spanning-tree extend system-id
Switch(config)#errdisable recovery cause all
Switch(config)#errdisable recovery interval 1800
Switch(config)#interface Vlan1
Swi
 << tch(config-if)# no ip address
Switch(config-if)# no ip route-cache
Switch(config-if)#
*Feb 28 18:04:34: %SW_VLAN-6-VTP_DOMAIN_NAME_CHG: VTP domain name changed to vtp01.mgmt.msstate.edu.interface Vlan92
Switch(config-if)#no ip http server
Switch(conf
 << ig)#logging facility local1
Switch(config)#logging 130.18.8.12
Switch(config)#access-list 1 permit 10.92.0.0 0.0.255.255
Switch(config)#snmp-server community sysnet RO 1
Switch(config)#snmp-server community c2-b2=a2 RW 1
Switch(config)#snmp-server en
 << able traps snmp authentication linkdown linkup c$ enable traps snmp authentication linkdown linkup co         ldstart waps 
 << snmp authentication linkdown linkup coldstart wa         rmstart
Switch(config)#snmp-server enable traps tty
Switch(config)#snmp-server enable traps cluster
Switch(config)#
*Feb 28 18:04:36: %LINEPROTO-5-UPDOWN: Line protocol on Interface Vla
 << n92, changed state to downsnmp-server enable traps config-copy
Switch(config)#snmp-server enable traps config
Switch(config)#snmp-server enable traps entity
Switch(config)#snmp-server enable traps power-ethernet group 1
Switch(config)#
*Feb 28 18:04:
 << 37: %SYS-6-LOGGINGHOST_STARTSTOP: Logging to host 130.18.8.12 Port 514 started - CLI initiatedsnmp-server enable traps cpu threshold
Switch(config)#snmp-server enable traps rtr
Switch(config)#snmp-server enable traps bridge newroot topologychange
Switc
 << h(config)#snmp-server enable traps stpx inconsistency root-inconsistency$ enable traps stpx inconsistency root-inconsistency          loop-inco
 << aps stpx inconsistency root-inconsistency loop-incon         sistency
Switch(config)#snmp-server enable traps syslog
Switch(config)#snmp-server enable traps vtp
Switch(config)#snmp-server enable traps vlancreate
Switch(con
 << fig)#snmp-server enable traps vlandelete
Switch(config)#snmp-server enable traps flash insertion removal
Switch(config)#snmp-server enable traps port-security
Switch(config)#snmp-server enable traps envmon fan shutdown supply temperatur
 << $ enable traps envmon fan shutdown supply temperature          status
Switch(config)#snmp-server enable traps vlan-membership
Switch(config)#snmp-server host 130.18.8.12 
% Incomplete command.

S
 << witch(config)#line con 0
Switch(config-line)#line vty 0 4
Switch(config-line)# password Area=l*w
Switch(config-line)# login
Switch(config-line)#line vty 5 15
Switch(config-line)# password Area=l*w
Switch(config-line)# login
Switch(config-line)#ntp 
 << clock-period 36026023
Switch(config)#ntp server 10.92.0.5
Switch(config)#end
Switch#end
Translating "end"...domain server (130.18.80.13) (130.18.80.12)
% Unknown command or computer name, or unable to find computer address
Switch#
*Feb 28 18:04:44:
 <<  %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
Switch#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
Expect: matched string 1: (config)#
 >> spanning-tree mode pvst

 >> no spanning-tree vlan 2-90,102,104,108,110,112-114,116,121,124,126,128,130-134

 >> no spanning-tree vlan 136,138,140,144,146-148,152,156-158,160,162-163,168,172

 >> no spanning-tree vlan 176,180,182,184,186,189-190,192,194,196,200,202,204-210

 >> no spanning-tree vlan 216,218,220,222,226,228,230,232,236,238,240-242,244,246

 >> no spanning-tree vlan 248,250-252,256,300,359,500,502-520,522,551-560,562-570

 >> no spanning-tree vlan 600-607,610,612,617,627,629-630,632-637,645,649-652,654

 >> no spanning-tree vlan 675-679,690-693,698,701,741-742,800-805,807,901-913,915

 >> no spanning-tree vlan 916,926-930,970,994-1000

 >> spanning-tree vlan 1-1000 priority 57344
 >> end

Expect: searching for 1 strs:  :Configured
 << spanning-tree mode pvst
Switch(config)#no spanning-tree vlan 2-90,102,104,108,110,112-114,116,121,124$-tree vlan 2-90,102,104,108,110,112-114,116,121,124,         126,128,1
 <<  2-90,102,104,108,110,112-114,116,121,124,126,128,13         0-134
Switch(config)#no spanning-tree vlan 136,138,140,144,146-148,152,156-158,160,
 << $-tree vlan 136,138,140,144,146-148,152,156-158,160,1         62-163,16 136,138,140,144,146-148,152,156-158,160,162-163,168         ,172
Switch(config)#no spanning-
 << tree vlan 176,180,182,184,186,189-190,192,194,196,$-tree vlan 176,180,182,184,186,189-190,192,194,196,2         00,202,20 1
 << 76,180,182,184,186,189-190,192,194,196,200,202,204         -210
Switch(config)#no spanning-tree vlan 216,218,220,222,226,228,230,232,236,238,$-tree vlan 216,218,220,222,226,228,230,23
 << 2,236,238,2         40-242,24 216,218,220,222,226,228,230,232,236,238,240-242,244         ,246
Switch(config)#no spanning-tree vlan 248,250-252,256,300,359,500,502-520,522,
 << $-tree vlan 248,250-252,256,300,359,500,502-520,522,5         51-560,56 248,250-252,256,300,359,500,502-520,522,551-560,562   
 <<       -570
Switch(config)#no spanning-tree vlan 600-607,610,612,617,627,629-630,632-637,$-tree vlan 600-607,610,612,617,627,629-630,632-637,6         45,649-65
 <<  600-607,610,612,617,627,629-630,632-637,645,649-652         ,654
Switch(config)#no spanning-tree vlan 675-679,690-693,698,701,741-742,800-805,
 << $-tree vlan 675-679,690-693,698,701,741-742,800-805,8         07,901-91 675-679,690-693,698,701,741-742,800-805,807,901-913         ,915
Switch(config)#no spanning-tree 
 << vlan 916,926-930,970,994-1000
Switch(config)#spanning-tree vlan 1-1000 priority 57344end
                                                       ^
% Invalid input detected at '^' marker.

Switch(config)#
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...
spanning-tree mode pvst
Switch(config)#no spanning-tree vlan 2-90,102,104,108,110,112-114,116,121,124$-tree vlan 2-90,102,104,108,110,112-114,116,121,124,         126,128,1 2-90,102,104,108,110,112-114,116,121,124,126,128,13         0-134
Switch(config)#no spanning-tree vlan 136,138,140,144,146-148,152,156-158,160,$-tree vlan 136,138,140,144,146-148,152,156-158,160,1         62-163,16 136,138,140,144,146-148,152,156-158,160,162-163,168         ,172
Switch(config)#no spanning-tree vlan 176,180,182,184,186,189-190,192,194,196,$-tree vlan 176,180,182,184,186,189-190,192,194,196,2         00,202,20 176,180,182,184,186,189-190,192,194,196,200,202,204         -210
Switch(config)#no spanning-tree vlan 216,218,220,222,226,228,230,232,236,238,$-tree vlan 216,218,220,222,226,228,230,232,236,238,2         40-242,24 216,218,220,222,226,228,230,232,236,238,240-242,244         ,246
Switch(config)#no spanning-tree vlan 248,250-252,256,300,359,500,502-520,522,$-tree vlan 248,250-252,256,300,359,500,502-520,522,5         51-560,56 248,250-252,256,300,359,500,502-520,522,551-560,562         -570
Switch(config)#no spanning-tree vlan 600-607,610,612,617,627,629-630,632-637,$-tree vlan 600-607,610,612,617,627,629-630,632-637,6         45,649-65 600-607,610,612,617,627,629-630,632-637,645,649-652         ,654
Switch(config)#no spanning-tree vlan 675-679,690-693,698,701,741-742,800-805,$-tree vlan 675-679,690-693,698,701,741-742,800-805,8         07,901-91 675-679,690-693,698,701,741-742,800-805,807,901-913         ,915
Switch(config)#no spanning-tree vlan 916,926-930,970,994-1000
Switch(config)#spanning-tree vlan 1-1000 priority 57344end
                                                       ^
% Invalid input detected at '^' marker.

Switch(config)#
...

 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
Switch(config)#configure terminal
                       ^
% Invalid input detected at '^' marker.

Switch(config)#
Expect: matched string 1: (config)#
 >> hostname c3560s1p.f1.cshjackson 

Expect: searching for 2 strs:  :# :>
 << hostname c3560s1p.f1.cshjackson 
c3560s1p.f1.cshjacks(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c3560s1p.f1.cshjackson#
 << 
*Feb 28 18:05:07: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c3560s1p.f1.cshjackson#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c3560s1p.f1.cshjacks(config)#
Expect: matched string 1: (config)#
 >> snmp-server contact 6F-1121

Expect: searching for 1 strs:  :#
 << snmp-server contact 6F-1121
c3560s1p.f1.cshjacks(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c3560s1p.f1.cshjackson#
 << 
*Feb 28 18:05:13: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c3560s1p.f1.cshjackson#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c3560s1p.f1.cshjacks(config)#
Expect: matched string 1: (config)#
 >> interface vlan 92

Expect: searching for 1 strs:  :(config-if)#
 << interface vlan 92
c3560s1p.f1.cshjacks(config-if)#
Expect: matched string 1: (config-if)#
 >> ip address 10.92.5.168 255.255.0.0

 >> ip broadcast-address 10.92.255.255

 >> end

Expect: searching for 1 strs:  :Configured
 << ip address 10.92.5.168 255.255.0.0
c3560s1p.f1.cshjacks(config-if)#ip broadcast-address 10.92.255.255
c3560s1p.f1.cshjacks(config-if)#end
c3560s1p.f1.cshjackson#
 << 
*Feb 28 18:05:20: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c3560s1p.f1.cshjackson#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c3560s1p.f1.cshjacks(config)#
Expect: matched string 1: (config)#
 >> interface Vlan92

Expect: searching for 1 strs:  :(config-if)#
 << interface Vlan92
c3560s1p.f1.cshjacks(config-if)#
Expect: matched string 1: (config-if)#
 >> ip default-gateway 10.92.0.1

 >> end

Expect: searching for 1 strs:  :Configured
 << ip default-gateway 10.92.0.1
c3560s1p.f1.cshjacks(config)#end
c3560s1p.f1.cshjackson#
 << 
*Feb 28 18:05:25: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c3560s1p.f1.cshjackson#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c3560s1p.f1.cshjacks(config)#
Expect: matched string 1: (config)#
 >> ip dhcp snooping

Expect: searching for 1 strs:  :#
 << ip dhcp snooping
c3560s1p.f1.cshjacks(config)#
Expect: matched string 1: #
 >> ip dhcp snooping vlan 612

Expect: searching for 1 strs:  :#
 << ip dhcp snooping vlan 612
c3560s1p.f1.cshjacks(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c3560s1p.f1.cshjackson#
 << 
*Feb 28 18:05:33: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c3560s1p.f1.cshjackson#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c3560s1p.f1.cshjacks(config)#
Expect: matched string 1: (config)#
 >> default interface range fa0/1 - 24 

 >> interface range fa0/1 - 24 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range fa0/1 - 24 
c3560s1p.f1.cshjacks(config)#interface range fa0/1 - 24 
c3560s1p.f1.cshjacks(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport access vlan 612

 >> switchport mode access

 >> spanning-tree portfast

 >> switchport port-security maximum 2

 >> switchport port-security

 >> switchport port-security aging time 15

 >> switchport port-security violation protect

 >> switchport port-security aging type inactivity

 >> power inline never

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport access vlan 612
c3560s1p.f1.cshjacks(config-if-range)#switchport mode access
c3560s1p.f1.cshjacks(config-if-range)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, conce
 << ntrators, switches, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast will be configured in 24 interfaces due to the range command 
 but will only have effect when the inter
 << faces are in a non-trunking mode.
c3560s1p.f1.cshjacks(config-if-range)#switchport port-security maximum 2
c3560s1p.f1.cshjacks(config-if-range)#switchport port-security
c3560s1p.f1.cshjacks(config-if-range)#switchport port-security aging time 15
c356
 << 0s1p.f1.cshjacks(config-if-range)#switchport port-security violation prot$port-security violation prote         ct
c3560s1p.f1.cshjacks(config-if-range)#switchport port-security aging type ina
 << $port-security aging type inac         tivity
c3560s1p.f1.cshjacks(config-if-range)#power inline never
c3560s1p.f1.cshjacks(config-if-range)#end
c3560s1p.f1.cshjackson#
 << 
*Feb 28 18:05:44: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c3560s1p.f1.cshjackson#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c3560s1p.f1.cshjacks(config)#
Expect: matched string 1: (config)#
 >> default interface fa0/1 

 >> interface fa0/1 

Expect: searching for 1 strs:  :(config-if)#
 << default interface fa0/1 
Interface FastEthernet0/1 set to default configuration
c3560s1p.f1.cshjacks(config)#interface fa0/1 
c3560s1p.f1.cshjacks(config-if)#
Expect: matched string 1: (config-if)#
 >> switchport access vlan 561

 >> switchport mode access

 >> spanning-tree portfast

 >> power inline consumption 15400

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport access vlan 561
c3560s1p.f1.cshjacks(config-if)#switchport mode access
c3560s1p.f1.cshjacks(config-if)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, concentrators, sw
 << itches, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast has been configured on FastEthernet0/1 but will only
 have effect when the interface is in a non-trunking mode.
c3
 << 560s1p.f1.cshjacks(config-if)#power inline consumption 15400
%CAUTION: Interface Fa0/1: Misconfiguring the 'power inline
 consumption/allocation' command may cause damage to the switch and void
 your warranty. Take precaution not to oversubscribe the p
 << ower supply.
 It is recommended to enable power policing if the switch supports it.
 Refer to documentation.

c3560s1p.f1.cshjacks(config-if)#end
c3560s1p.f1.cshjackson#
 << 
*Feb 28 18:05:51: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c3560s1p.f1.cshjackson#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c3560s1p.f1.cshjacks(config)#
Expect: matched string 1: (config)#
 >> default interface fa0/24 

 >> interface fa0/24 

Expect: searching for 1 strs:  :(config-if)#
 << default interface fa0/24 
Interface FastEthernet0/24 set to default configuration
c3560s1p.f1.cshjacks(config)#interface fa0/24 
c3560s1p.f1.cshjacks(config-if)#
Expect: matched string 1: (config-if)#
 >> switchport mode trunk

 >> switchport trunk native vlan 92

 >> ip dhcp snooping trust

 >> no keepalive

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport mode trunk
Command rejected: An interface whose trunk encapsulation is "Auto" can not be configured to "trunk" mode.
c3560s1p.f1.cshjacks(config-if)#switchport trunk native vlan 92
c3560s1p.f1.cshjacks(config-if)#ip dhcp snooping trust
c356
 << 0s1p.f1.cshjacks(config-if)#no keepalive
c3560s1p.f1.cshjacks(config-if)#end
c3560s1p.f1.cshjackson#
 << 
*Feb 28 18:05:57: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c3560s1p.f1.cshjackson#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c3560s1p.f1.cshjacks(config)#
Expect: matched string 1: (config)#
 >> default interface range gi0/1 - 2 

 >> interface range gi0/1 - 2 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi0/1 - 2 
c3560s1p.f1.cshjacks(config)#interface range gi0/1 - 2 
c3560s1p.f1.cshjacks(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport mode trunk

 >> switchport trunk native vlan 92

 >> ip dhcp snooping trust

 >> no keepalive

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport mode trunk
Command rejected: An interface whose trunk encapsulation is "Auto" can not be configured to "trunk" mode.
% Range command terminated because it failed on GigabitEthernet0/1
c3560s1p.f1.cshjacks(config-if-range)#switchport trunk na
 << tive vlan 92
c3560s1p.f1.cshjacks(config-if-range)#ip dhcp snooping trust
c3560s1p.f1.cshjacks(config-if-range)#no keepalive
c3560s1p.f1.cshjacks(config-if-range)#end
c3560s1p.f1.cshjackson#
 << 
*Feb 28 18:06:03: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> write mem

Expect: searching for 2 strs:  :# :>
 << 
c3560s1p.f1.cshjackson#write mem
Building configuration...
[OK]
c3560s1p.f1.cshjackson#
Expect: matched string 1: #
 >> 
Expect: searching for 2 strs:  :# :>
 << 
c3560s1p.f1.cshjackson#
c3560s1p.f1.cshjackson#
Expect: matched string 1: #
 >> sh run

Expect: searching for 2 strs:  :# :>
 << sh run
Building configuration...

Current configuration : 11015 bytes
!
version 12.2
no service pad
service timestamps debug datetime localtime
service timestamps log datetime localtime
service password-encryption
!
hostname c3560s1p.f1.cshjack
 << son
!
boot-start-marker
boot-end-marker
!
logging buffered informational
enable secret 5 $1$B.2k$w/inePaAlfIcD2xZ2JVWx/
enable password 7 047A19030E7C40041E
!
!
!
no aaa new-model
clock timezone CST -6
clock summer-time CDT recurring
system 
 << mtu routing 1500
ip domain-name mgmt.msstate.edu
ip name-server 130.18.80.13
ip name-server 130.18.80.12
!
!
ip dhcp snooping vlan 612
ip dhcp snooping
!
!
!
!
!
!
errdisable recovery cause udld
errdisable recovery cause bpduguard
errdisab
 << le recovery cause security-violation
errdisable recovery cause channel-misconfig (STP)
errdisable recovery cause pagp-flap
errdisable recovery cause dtp-flap
errdisable recovery cause link-flap
errdisable recovery cause sfp-config-mismatch
errdisabl
 << e recovery cause gbic-invalid
errdisable recovery cause l2ptguard
errdisable recovery cause psecure-violation
errdisable recovery cause port-mode-failure
errdisable recovery cause dhcp-rate-limit
errdisable recovery cause pppoe-ia-rate-limit
errdisa
 << ble recovery cause mac-limit
errdisable recovery cause vmps
errdisable recovery cause storm-control
errdisable recovery cause inline-power
errdisable recovery cause arp-inspection
errdisable recovery cause loopback
errdisable recovery cause small-fr
 << ame
errdisable recovery interval 1800
!
spanning-tree mode pvst
spanning-tree portfast bpduguard default
spanning-tree extend system-id
no spanning-tree vlan 2-90,102,104,108,110,112-114,116,121,124,126,128,130-134
no spanning-tree vlan 136,138,140
 << ,144,146-148,152,156-158,160,162-163,168,172
no spanning-tree vlan 176,180,182,184,186,189-190,192,194,196,200,202,204-210
no spanning-tree vlan 216,218,220,222,226,228,230,232,236,238,240-242,244,246
no spanning-tree vlan 248,250-252,256,300,359,500,5
 << 02-520,522,551-560,562-570
no spanning-tree vlan 600-607,610,612,617,627,629-630,632-637,645,649-652,654
no spanning-tree vlan 675-679,690-693,698,701,741-742,800-805,807,901-913,915
no spanning-tree vlan 916,926-930,970,994-1000
!
vlan internal allo
 << cation policy ascending
!
!
!
interface FastEthernet0/1
 switchport access vlan 561
 switchport mode access
 spanning-tree portfast
!
interface FastEthernet0/2
 switchport access vlan 612
 switchport mode access
 switchport port-security maxim
 << um 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 power inline never
 spanning-tree portfast
!
interface FastEthernet0/3
 switchport
 <<  access vlan 612
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 power inline
 <<  never
 spanning-tree portfast
!
interface FastEthernet0/4
 switchport access vlan 612
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violati
 << on protect
 switchport port-security aging type inactivity
 power inline never
 spanning-tree portfast
!
interface FastEthernet0/5
 switchport access vlan 612
 switchport mode access
 switchport port-security maximum 2
 switchport port-security

 <<  switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 power inline never
 spanning-tree portfast
!
interface FastEthernet0/6
 switchport access vlan 612
 switchport mod
 << e access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 power inline never
 spanning-tree portfast

 << !
interface FastEthernet0/7
 switchport access vlan 612
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-secu
 << rity aging type inactivity
 power inline never
 spanning-tree portfast
!
interface FastEthernet0/8
 switchport access vlan 612
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging t
 << ime 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 power inline never
 spanning-tree portfast
!
interface FastEthernet0/9
 switchport access vlan 612
 switchport mode access
 switchport port-securi
 << ty maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 power inline never
 spanning-tree portfast
!
interface FastEthernet0/10
 s
 << witchport access vlan 612
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 pow
 << er inline never
 spanning-tree portfast
!
interface FastEthernet0/11
 switchport access vlan 612
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-securi
 << ty violation protect
 switchport port-security aging type inactivity
 power inline never
 spanning-tree portfast
!
interface FastEthernet0/12
 switchport access vlan 612
 switchport mode access
 switchport port-security maximum 2
 switchport port
 << -security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 power inline never
 spanning-tree portfast
!
interface FastEthernet0/13
 switchport access vlan 612
 sw
 << itchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 power inline never
 spanning-tre
 << e portfast
!
interface FastEthernet0/14
 switchport access vlan 612
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchp
 << ort port-security aging type inactivity
 power inline never
 spanning-tree portfast
!
interface FastEthernet0/15
 switchport access vlan 612
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-se
 << curity aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 power inline never
 spanning-tree portfast
!
interface FastEthernet0/16
 switchport access vlan 612
 switchport mode access
 switchp
 << ort port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 power inline never
 spanning-tree portfast
!
interface FastE
 << thernet0/17
 switchport access vlan 612
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type i
 << nactivity
 power inline never
 spanning-tree portfast
!
interface FastEthernet0/18
 switchport access vlan 612
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchp
 << ort port-security violation protect
 switchport port-security aging type inactivity
 power inline never
 spanning-tree portfast
!
interface FastEthernet0/19
 switchport access vlan 612
 switchport mode access
 switchport port-security maximum 2
 
 << switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 power inline never
 spanning-tree portfast
!
interface FastEthernet0/20
 switchport acces
 << s vlan 612
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 power inline never
 << 
 spanning-tree portfast
!
interface FastEthernet0/21
 switchport access vlan 612
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation pr
 << otect
 switchport port-security aging type inactivity
 power inline never
 spanning-tree portfast
!
interface FastEthernet0/22
 switchport access vlan 612
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 swi
 << tchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 power inline never
 spanning-tree portfast
!
interface FastEthernet0/23
 switchport access vlan 612
 switchport mode a
 << ccess
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 power inline never
 spanning-tree portfast
!

 << interface FastEthernet0/24
 switchport trunk native vlan 92
 no keepalive
 ip dhcp snooping trust
!
interface GigabitEthernet0/1
 switchport trunk native vlan 92
 ip dhcp snooping trust
!
interface GigabitEthernet0/2
 switchport trunk native vla
 << n 92
 ip dhcp snooping trust
!
interface Vlan1
 no ip address
 no ip route-cache
 no ip mroute-cache
 shutdown
!
interface Vlan92
 ip address 10.92.5.168 255.255.0.0
 ip broadcast-address 10.92.255.255
!
ip default-gateway 10.92.0.1
ip class
 << less
no ip http server
ip http secure-server
!
logging facility local1
logging 130.18.8.12
access-list 1 permit 10.92.0.0 0.0.255.255
snmp-server community sysnet RO 1
snmp-server community c2-b2=a2 RW 1
snmp-server contact 6F-1121
snmp-server e
 << nable traps snmp authentication linkdown linkup coldstart warmstart
snmp-server enable traps tty
snmp-server enable traps cluster
snmp-server enable traps entity
snmp-server enable traps cpu threshold
snmp-server enable traps power-ethernet group 1

 << snmp-server enable traps vtp
snmp-server enable traps vlancreate
snmp-server enable traps vlandelete
snmp-server enable traps flash insertion removal
snmp-server enable traps port-security
snmp-server enable traps envmon fan shutdown supply temperatu
 << re status
snmp-server enable traps config-copy
snmp-server enable traps config
snmp-server enable traps bridge newroot topologychange
snmp-server enable traps stpx inconsistency root-inconsistency loop-inconsistency
snmp-server enable traps syslog
s
 << nmp-server enable traps rtr
snmp-server enable traps vlan-membership
!
!
line con 0
line vty 0 4
 password 7 002501030506074C18
 login
line vty 5 15
 password 7 106F1B1C044A1E411B
 login
!
ntp clock-period 36026023
ntp server 10.92.0.5
end

 << 
c3560s1p.f1.cshjackson#
Expect: matched string 1: #
 >> show interface status

Expect: searching for 2 strs:  :# :>
 << show interface status

Port      Name               Status       Vlan       Duplex  Speed Type
Fa0/1                        notconnect   561          auto   auto 10/100BaseTX
Fa0/2                        notconnect   612          auto   auto 10/100Bas
 << eTX
Fa0/3                        notconnect   612          auto   auto 10/100BaseTX
Fa0/4                        notconnect   612          auto   auto 10/100BaseTX
Fa0/5                        notconnect   612          auto   auto 10/100BaseTX
Fa0/6  
 <<                       notconnect   612          auto   auto 10/100BaseTX
Fa0/7                        notconnect   612          auto   auto 10/100BaseTX
Fa0/8                        notconnect   612          auto   auto 10/100BaseTX
Fa0/9              
 <<           notconnect   612          auto   auto 10/100BaseTX
Fa0/10                       notconnect   612          auto   auto 10/100BaseTX
Fa0/11                       notconnect   612          auto   auto 10/100BaseTX
Fa0/12                       no
 << tconnect   612          auto   auto 10/100BaseTX
Fa0/13                       notconnect   612          auto   auto 10/100BaseTX
Fa0/14                       notconnect   612          auto   auto 10/100BaseTX
Fa0/15                       notconnect   6
 << 12          auto   auto 10/100BaseTX
Fa0/16                       notconnect   612          auto   auto 10/100BaseTX
Fa0/17                       notconnect   612          auto   auto 10/100BaseTX
Fa0/18                       notconnect   612          
 << auto   auto 10/100BaseTX
Fa0/19                       notconnect   612          auto   auto 10/100BaseTX
Fa0/20                       notconnect   612          auto   auto 10/100BaseTX
Fa0/21                       notconnect   612          auto   auto 
 << 10/100BaseTX
Fa0/22                       notconnect   612          auto   auto 10/100BaseTX
Fa0/23                       notconnect   612          auto   auto 10/100BaseTX
Fa0/24                       notconnect   1            auto   auto 10/100BaseTX
 << 
Gi0/1                        notconnect   1            auto   auto Not Present
Gi0/2                        notconnect   1            auto   auto Not Present
c3560s1p.f1.cshjackson#
Expect: matched string 1: #
