trying to use serial port: /dev/ttyUSB0
 >> 
 >> 

Expect: searching for 4 strs:  :[yes/no] :Press RETURN to get started. :# :Switch>
 << 
Switch#
Switch#
Switch#
Switch#
Expect: matched string 3: #
 >> term len 0

Expect: searching for 2 strs:  :# :>
 << term len 0
Switch#
Expect: matched string 1: #
 >> show version

Expect: searching for 2 strs:  :# :>
 << show version
Cisco IOS Software, C2960CX Software (C2960CX-UNIVERSALK9-M), Version 15.2(4)E1, RELEASE SOFTWARE (fc2)
Technical Support: http://www.cisco.com/techsupport
Copyright (c) 1986-2016 by Cisco Systems, Inc.
Compiled Thu 28-Jan-16 16:23 by pro
 << d_rel_team

ROM: Bootstrap program is C2960CX boot loader
BOOTLDR: C2960CX Boot Loader (C2960CX-HBOOT-M) Version 15.2(3r)E, RELEASE SOFTWARE (fc1)

Switch uptime is 8 minutes
System returned to ROM by power-on
System restarted at 16:21:53 UTC Mon D
 << ec 19 2016
System image file is "flash:/c2960cx-universalk9-mz.152-4.E1/c2960cx-universalk9-mz.152-4.E1.bin"
Last reload reason: power-on



This product contains cryptographic features and is subject to United
States and local country laws governi
 << ng import, export, transfer and
use. Delivery of Cisco cryptographic products does not imply
third-party authority to import, export, distribute or use encryption.
Importers, exporters, distributors and users are responsible for
compliance with U.S. a
 << nd local country laws. By using this product you
agree to comply with applicable laws and regulations. If you are unable
to comply with U.S. and local laws, return this product immediately.

A summary of U.S. laws governing Cisco cryptographic product
 << s may be found at:
http://www.cisco.com/wwl/export/crypto/tool/stqrg.html

If you require further assistance please contact us by sending email to
export@cisco.com.

cisco WS-C2960CX-8PC-L (APM86XXX) processor (revision G0) with 524288K bytes of mem
 << ory.
Processor board ID FOC2026Z3TT
Last reset from power-on
1 Virtual Ethernet interface
12 Gigabit Ethernet interfaces
The password-recovery mechanism is enabled.

512K bytes of flash-simulated non-volatile configuration memory.
Base ethernet MA
 << C Address       : 00:A2:89:25:42:80
Motherboard assembly number     : 73-17484-02
Power supply part number        : 341-0675-02
Motherboard serial number       : FOC202640UF
Power supply serial number      : DCC201651QB
Model revision number         
 <<   : G0
Motherboard revision number     : A0
Model number                    : WS-C2960CX-8PC-L
System serial number            : FOC2026Z3TT
Top Assembly Part Number        : 68-100386-02
Top Assembly Revision Number    : E0
Version ID              
 <<         : V02
CLEI Code Number                : CMMT410BRA
Hardware Board Revision Number  : 0x02


Switch Ports Model                     SW Version            SW Image                 
------ ----- -----                     ----------            -
 << ---------               
*    1 12    WS-C2960CX-8PC-L          15.2(4)E1             C2960CX-UNIVERSALK9-M    


Configuration register is 0xF

Switch#
Expect: matched string 1: #
 >> enable

Expect: searching for 2 strs:  :Password: :#
 << 





























































Switch con0 is now available





Press RETURN to get started.








 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...






























































Switch con0 is now available





Press RETURN to get started.








...

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

...

 >> no service pad

 >> service timestamps debug datetime localtime

 >> service timestamps log datetime localtime

 >> service password-encryption

 >> boot-start-marker

 >> boot-end-marker

 >> enable secret Area=l*w

 >> enable password Area=l*w

 >> no aaa new-model

 >> clock timezone CST -6 0

 >> clock summer-time CDT recurring

 >> authentication mac-move permit

 >> ip domain-name mgmt.msstate.edu

 >> ip name-server 130.18.80.12

 >> vtp domain vtp01.mgmt.msstate.edu

 >> vtp mode client

 >> crypto pki trustpoint TP-self-signed-2494998912

 >>  enrollment selfsigned

 >>  subject-name cn=IOS-Self-Signed-Certificate-2494998912

 >>  revocation-check none

 >>  rsakeypair TP-self-signed-2494998912

 >> crypto pki certificate chain TP-self-signed-2494998912

 >>  certificate self-signed 01 nvram:IOS-Self-Sig#3232.cer

 >> spanning-tree portfast bpduguard default

 >> spanning-tree extend system-id

 >> vlan internal allocation policy ascending

 >> errdisable recovery cause all

 >> errdisable recovery interval 1800

 >> interface FastEthernet0

 >>  no ip address

 >>  shutdown

 >> interface Vlan1

 >>  no ip address

 >>  no ip route-cache

 >>  shutdown

 >> interface Vlan92

 >> ip http server

 >> ip http secure-server

 >> logging facility local1

 >> logging host 130.18.8.12

 >> access-list 1 permit 10.92.0.0 0.0.255.255

 >> access-list 1 permit 130.18.8.0 0.0.0.255

 >> access-list 1 permit 10.93.0.0 0.0.255.255

 >> access-list 1 permit 130.18.1.0 0.0.0.255

 >> username root privilege 15 secret Area=l*w

 >> snmp-server community sysnet RO 1

 >> snmp-server community c2-b2=a2 RW 1

 >> snmp-server enable traps snmp authentication linkdown linkup coldstart warmstart

 >> snmp-server enable traps transceiver all

 >> snmp-server enable traps tty

 >> snmp-server enable traps cluster

 >> snmp-server enable traps config-copy

 >> snmp-server enable traps config

 >> snmp-server enable traps config-ctid

 >> snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-auth-fail-vlan no-guest-vlan

 >> snmp-server enable traps entity

 >> snmp-server enable traps power-ethernet police

 >> snmp-server enable traps cpu threshold

 >> snmp-server enable traps rep

 >> snmp-server enable traps bridge newroot topologychange

 >> snmp-server enable traps stpx inconsistency root-inconsistency loop-inconsistency

 >> snmp-server enable traps syslog

 >> snmp-server enable traps vtp

 >> snmp-server enable traps vlancreate

 >> snmp-server enable traps vlandelete

 >> snmp-server enable traps flash insertion removal

 >> snmp-server enable traps port-security

 >> snmp-server enable traps envmon fan shutdown supply temperature status

 >> snmp-server enable traps errdisable

 >> snmp-server enable traps mac-notification change move threshold

 >> snmp-server enable traps vlan-membership

 >> snmp-server host 130.18.8.12 

 >> line con 0

 >> line vty 0 15

 >>  access-class 1 in

 >>  password Area=l*w

 >>  login

 >>  transport input all

 >> ntp server 10.92.0.5

 >> username root privilege 15 secret Area=l*w

 >> 

 >> enable

Expect: searching for 2 strs:  :Password: :#
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

...

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

...

 >> spanning-tree mode mst

 >> spanning-tree etherchannel guard misconfig

 >> spanning-tree mst configuration

 >>  name msstate

 >>  revision 1

 >>  instance 1 vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 63, 70

 >>  instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 160

 >>  instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 230, 232, 242, 246

 >>  instance 1 vlan 256, 611-612, 654, 741, 996, 999

 >>  instance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037, 2039-2040

 >>  instance 2 vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096, 2104, 2110, 2126

 >>  instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 2189, 2194, 2202

 >>  instance 2 vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 2654, 2999

 >>  instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176, 196

 >>  instance 3 vlan 244, 248, 927

 >>  instance 4 vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072, 2108, 2113, 2128

 >>  instance 4 vlan 2144, 2176, 2196, 2244, 2248, 2927

 >>  instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 228

 >>  instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216, 2228

 >>  instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116, 124

 >>  instance 7 vlan 172, 186, 192, 204-208, 210, 240-241, 251-252, 630, 928

 >>  instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082, 2084

 >>  instance 8 vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208, 2210

 >>  instance 8 vlan 2240-2241, 2251-2252, 2630, 2928

 >>  instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102, 112

 >>  instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 500, 505, 510-511

 >>  instance 9 vlan 522, 551-570, 603, 629, 633, 742, 802, 926, 929

 >>  instance 10 vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 2057, 2062, 2068

 >>  instance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148, 2158

 >>  instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522, 2603, 2629, 2633

 >>  instance 10 vlan 2802, 2926, 2929

 >>  instance 11 vlan 8, 43, 52, 146, 156-157, 180, 200, 218

 >>  instance 12 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180, 2200, 2218

 >> 

 >> enable

Expect: searching for 2 strs:  :Password: :#
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

...

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

...

 >> hostname c29s1c.r008.meridian 

Expect: searching for 2 strs:  :# :>
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

...

 >> enable

Expect: searching for 2 strs:  :Password: :#
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

...

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

...

 >> snmp-server contact  

Expect: searching for 1 strs:  :#
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

...

 >> enable

Expect: searching for 2 strs:  :Password: :#
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

...

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

...

 >> interface vlan 92

Expect: searching for 1 strs:  :(config-if)#
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

...

 >> ip address 10.92.5.169 255.255.0.0

 >> ip broadcast-address 10.92.255.255

 >> enable

Expect: searching for 2 strs:  :Password: :#
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

...

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

...

 >> interface Vlan92

Expect: searching for 1 strs:  :(config-if)#
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

...

 >> ip default-gateway 10.92.0.1

 >> enable

Expect: searching for 2 strs:  :Password: :#
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

...

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

...

 >> ip dhcp snooping

Expect: searching for 1 strs:  :#
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

...

 >> ip dhcp snooping vlan 649

Expect: searching for 1 strs:  :#
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

...

 >> enable

Expect: searching for 2 strs:  :Password: :#
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

...

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

...

 >> default interface range gi0/1 - 8 

 >> interface range gi0/1 - 8 

Expect: searching for 1 strs:  :(config-if-range)#
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

...

 >> enable

Expect: searching for 2 strs:  :Password: :#
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

...

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

...

 >> default interface range gi0/1 - 4 

 >> interface range gi0/1 - 4 

Expect: searching for 1 strs:  :(config-if-range)#
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

...

 >> enable

Expect: searching for 2 strs:  :Password: :#
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

...

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

...

 >> default interface gi0/5 

 >> interface gi0/5 

Expect: searching for 1 strs:  :(config-if)#
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

...

 >> enable

Expect: searching for 2 strs:  :Password: :#
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

...

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

...

 >> default interface gi0/8 

 >> interface gi0/8 

Expect: searching for 1 strs:  :(config-if)#
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

...

 >> enable

Expect: searching for 2 strs:  :Password: :#
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

...

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

...

 >> default interface range gi0/9 - 12 

 >> interface range gi0/9 - 12 

Expect: searching for 1 strs:  :(config-if-range)#
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

...

 >> write mem

Expect: searching for 2 strs:  :# :>
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

...

 >> 
Expect: searching for 2 strs:  :# :>
 << 
Switch>
Switch>
Expect: matched string 2: >
 >> enable

Expect: searching for 2 strs:  :Password: :#
 << enable
Switch#
Expect: matched string 2: #
 >> sh run

Expect: searching for 2 strs:  :# :>
 << sh run
Building configuration...

Current configuration : 1012 bytes
!
! Last configuration change at 16:23:05 UTC Mon Dec 19 2016
!
version 15.2
no service pad
service timestamps debug datetime msec
service timestamps log datetime msec
no serv
 << ice password-encryption
!
hostname Switch
!
boot-start-marker
boot-end-marker
!
!
no aaa new-model
system mtu routing 1500
!
!
!
!
 --More-- 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...
sh run
Building configuration...

Current configuration : 1012 bytes
!
! Last configuration change at 16:23:05 UTC Mon Dec 19 2016
!
version 15.2
no service pad
service timestamps debug datetime msec
service timestamps log datetime msec
no service password-encryption
!
hostname Switch
!
boot-start-marker
boot-end-marker
!
!
no aaa new-model
system mtu routing 1500
!
!
!
!
 --More-- 
...

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 <<         
Switch#onfigure terminal
         ^
% Invalid input detected at '^' marker.

Switch#
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...
        
Switch#onfigure terminal
         ^
% Invalid input detected at '^' marker.

Switch#
...

 >> no service pad

 >> service timestamps debug datetime localtime

 >> service timestamps log datetime localtime

 >> service password-encryption

 >> boot-start-marker

 >> boot-end-marker

 >> enable secret Area=l*w

 >> enable password Area=l*w

 >> no aaa new-model

 >> clock timezone CST -6 0

 >> clock summer-time CDT recurring

 >> authentication mac-move permit

 >> ip domain-name mgmt.msstate.edu

 >> ip name-server 130.18.80.12

 >> vtp domain vtp01.mgmt.msstate.edu

 >> vtp mode client

 >> crypto pki trustpoint TP-self-signed-2494998912

 >>  enrollment selfsigned

 >>  subject-name cn=IOS-Self-Signed-Certificate-2494998912

 >>  revocation-check none

 >>  rsakeypair TP-self-signed-2494998912

 >> crypto pki certificate chain TP-self-signed-2494998912

 >>  certificate self-signed 01 nvram:IOS-Self-Sig#3232.cer

 >> spanning-tree portfast bpduguard default

 >> spanning-tree extend system-id

 >> vlan internal allocation policy ascending

 >> errdisable recovery cause all

 >> errdisable recovery interval 1800

 >> interface FastEthernet0

 >>  no ip address

 >>  shutdown

 >> interface Vlan1

 >>  no ip address

 >>  no ip route-cache

 >>  shutdown

 >> interface Vlan92

 >> ip http server

 >> ip http secure-server

 >> logging facility local1

 >> logging host 130.18.8.12

 >> access-list 1 permit 10.92.0.0 0.0.255.255

 >> access-list 1 permit 130.18.8.0 0.0.0.255

 >> access-list 1 permit 10.93.0.0 0.0.255.255

 >> access-list 1 permit 130.18.1.0 0.0.0.255

 >> username root privilege 15 secret Area=l*w

 >> snmp-server community sysnet RO 1

 >> snmp-server community c2-b2=a2 RW 1

 >> snmp-server enable traps snmp authentication linkdown linkup coldstart warmstart

 >> snmp-server enable traps transceiver all

 >> snmp-server enable traps tty

 >> snmp-server enable traps cluster

 >> snmp-server enable traps config-copy

 >> snmp-server enable traps config

 >> snmp-server enable traps config-ctid

 >> snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-auth-fail-vlan no-guest-vlan

 >> snmp-server enable traps entity

 >> snmp-server enable traps power-ethernet police

 >> snmp-server enable traps cpu threshold

 >> snmp-server enable traps rep

 >> snmp-server enable traps bridge newroot topologychange

 >> snmp-server enable traps stpx inconsistency root-inconsistency loop-inconsistency

 >> snmp-server enable traps syslog

 >> snmp-server enable traps vtp

 >> snmp-server enable traps vlancreate

 >> snmp-server enable traps vlandelete

 >> snmp-server enable traps flash insertion removal

 >> snmp-server enable traps port-security

 >> snmp-server enable traps envmon fan shutdown supply temperature status

 >> snmp-server enable traps errdisable

 >> snmp-server enable traps mac-notification change move threshold

 >> snmp-server enable traps vlan-membership

 >> snmp-server host 130.18.8.12 

 >> line con 0

 >> line vty 0 15

 >>  access-class 1 in

 >>  password Area=l*w

 >>  login

 >>  transport input all

 >> ntp server 10.92.0.5

 >> username root privilege 15 secret Area=l*w

 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << no service pad
          ^
% Invalid input detected at '^' marker.

Switch#service timestamps debug datetime localtime
         ^
% Invalid input detected at '^' marker.

Switch#service timestamps log datetime localtime
         ^
% Invalid inpu
 << t detected at '^' marker.

Switch#service password-encryption
         ^
% Invalid input detected at '^' marker.

Switch#boot-start-marker
% Unknown command or computer name, or unable to find computer address
Switch#boot-end-marker
Translating "
 << boot-end-marker"...domain server (255.255.255.255)
% Unknown command or computer name, or unable to find computer address
Switch#enable secret Area=l*w
              ^
% Invalid input detected at '^' marker.

Switch#enable password Area=l*w
       
 <<        ^
% Invalid input detected at '^' marker.

Switch#no aaa new-model
          ^
% Invalid input detected at '^' marker.

Switch#clock timezone CST -6 0
             ^
% Invalid input detected at '^' marker.

Switch#clock summer-time CDT r
 << ecurring
              ^
% Invalid input detected at '^' marker.

Switch#authentication mac-move permit
                      ^
% Invalid input detected at '^' marker.

Switch#ip domain-name mgmt.msstate.edu
           ^
% Invalid input detected
 <<  at '^' marker.

Switch#ip name-server 130.18.80.12
          ^
% Invalid input detected at '^' marker.

Switch#vtp domain vtp01.mgmt.msstate.edu
           ^
% Invalid input detected at '^' marker.

Switch#vtp mode client
           ^
% Inval
 << id input detected at '^' marker.

Switch#crypto pki trustpoint TP-self-signed-2494998912
                  ^
% Invalid input detected at '^' marker.

Switch# enrollment selfsigned
          ^
% Invalid input detected at '^' marker.

Switch# subj
 << ect-name cn=IOS-Self-Signed-Certificate-2494998912
         ^
% Invalid input detected at '^' marker.

Switch# revocation-check none
          ^
% Invalid input detected at '^' marker.

Switch# rsakeypair TP-self-signed-2494998912
          ^
% 
 << Invalid input detected at '^' marker.

Switch#crypto pki certificate chain TP-self-signed-2494998912
                   ^
% Invalid input detected at '^' marker.

Switch# certificate self-signed 01 nvram:IOS-Self-Sig#3232.cer
         ^
% Invalid 
 << input detected at '^' marker.

Switch#spanning-tree portfast bpduguard default
         ^
% Invalid input detected at '^' marker.

Switch#spanning-tree extend system-id
         ^
% Invalid input detected at '^' marker.

Switch#vlan internal all
 << ocation policy ascending
        ^
% Invalid input detected at '^' marker.

Switch#errdisable recovery cause all
         ^
% Invalid input detected at '^' marker.

Switch#errdisable recovery interval 1800
         ^
% Invalid input detected at 
 << '^' marker.

Switch#interface FastEthernet0
        ^
% Invalid input detected at '^' marker.

Switch# no ip address
              ^
% Invalid input detected at '^' marker.

Switch# shutdown
Translating "shutdown"...domain server (255.255.255.2
 << 55)
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
% Unknown command or computer name, or unable to find computer address
Switch#interface Vlan1
        ^
% Invalid input detected at '^' marker.

Switch# no ip address
              ^
% Invalid input detected at '^' marker.

Switch# no ip route-
Expect: did not match any strings!
...
no service pad
          ^
% Invalid input detected at '^' marker.

Switch#service timestamps debug datetime localtime
         ^
% Invalid input detected at '^' marker.

Switch#service timestamps log datetime localtime
         ^
% Invalid input detected at '^' marker.

Switch#service password-encryption
         ^
% Invalid input detected at '^' marker.

Switch#boot-start-marker
% Unknown command or computer name, or unable to find computer address
Switch#boot-end-marker
Translating "boot-end-marker"...domain server (255.255.255.255)
% Unknown command or computer name, or unable to find computer address
Switch#enable secret Area=l*w
              ^
% Invalid input detected at '^' marker.

Switch#enable password Area=l*w
              ^
% Invalid input detected at '^' marker.

Switch#no aaa new-model
          ^
% Invalid input detected at '^' marker.

Switch#clock timezone CST -6 0
             ^
% Invalid input detected at '^' marker.

Switch#clock summer-time CDT recurring
              ^
% Invalid input detected at '^' marker.

Switch#authentication mac-move permit
                      ^
% Invalid input detected at '^' marker.

Switch#ip domain-name mgmt.msstate.edu
           ^
% Invalid input detected at '^' marker.

Switch#ip name-server 130.18.80.12
          ^
% Invalid input detected at '^' marker.

Switch#vtp domain vtp01.mgmt.msstate.edu
           ^
% Invalid input detected at '^' marker.

Switch#vtp mode client
           ^
% Invalid input detected at '^' marker.

Switch#crypto pki trustpoint TP-self-signed-2494998912
                  ^
% Invalid input detected at '^' marker.

Switch# enrollment selfsigned
          ^
% Invalid input detected at '^' marker.

Switch# subject-name cn=IOS-Self-Signed-Certificate-2494998912
         ^
% Invalid input detected at '^' marker.

Switch# revocation-check none
          ^
% Invalid input detected at '^' marker.

Switch# rsakeypair TP-self-signed-2494998912
          ^
% Invalid input detected at '^' marker.

Switch#crypto pki certificate chain TP-self-signed-2494998912
                   ^
% Invalid input detected at '^' marker.

Switch# certificate self-signed 01 nvram:IOS-Self-Sig#3232.cer
         ^
% Invalid input detected at '^' marker.

Switch#spanning-tree portfast bpduguard default
         ^
% Invalid input detected at '^' marker.

Switch#spanning-tree extend system-id
         ^
% Invalid input detected at '^' marker.

Switch#vlan internal allocation policy ascending
        ^
% Invalid input detected at '^' marker.

Switch#errdisable recovery cause all
         ^
% Invalid input detected at '^' marker.

Switch#errdisable recovery interval 1800
         ^
% Invalid input detected at '^' marker.

Switch#interface FastEthernet0
        ^
% Invalid input detected at '^' marker.

Switch# no ip address
              ^
% Invalid input detected at '^' marker.

Switch# shutdown
Translating "shutdown"...domain server (255.255.255.255)
% Unknown command or computer name, or unable to find computer address
Switch#interface Vlan1
        ^
% Invalid input detected at '^' marker.

Switch# no ip address
              ^
% Invalid input detected at '^' marker.

Switch# no ip route-
...

 >> spanning-tree mode mst

 >> spanning-tree etherchannel guard misconfig

 >> spanning-tree mst configuration

 >>  name msstate

 >>  revision 1

 >>  instance 1 vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 63, 70

 >>  instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 160

 >>  instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 230, 232, 242, 246

 >>  instance 1 vlan 256, 611-612, 654, 741, 996, 999

 >>  instance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037, 2039-2040

 >>  instance 2 vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096, 2104, 2110, 2126

 >>  instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 2189, 2194, 2202

 >>  instance 2 vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 2654, 2999

 >>  instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176, 196

 >>  instance 3 vlan 244, 248, 927

 >>  instance 4 vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072, 2108, 2113, 2128

 >>  instance 4 vlan 2144, 2176, 2196, 2244, 2248, 2927

 >>  instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 228

 >>  instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216, 2228

 >>  instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116, 124

 >>  instance 7 vlan 172, 186, 192, 204-208, 210, 240-241, 251-252, 630, 928

 >>  instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082, 2084

 >>  instance 8 vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208, 2210

 >>  instance 8 vlan 2240-2241, 2251-2252, 2630, 2928

 >>  instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102, 112

 >>  instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 500, 505, 510-511

 >>  instance 9 vlan 522, 551-570, 603, 629, 633, 742, 802, 926, 929

 >>  instance 10 vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 2057, 2062, 2068

 >>  instance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148, 2158

 >>  instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522, 2603, 2629, 2633

 >>  instance 10 vlan 2802, 2926, 2929

 >>  instance 11 vlan 8, 43, 52, 146, 156-157, 180, 200, 218

 >>  instance 12 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180, 2200, 2218

 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << cache
              ^
% Invalid input detected at '^' marker.

Switch# shutdown
% Unknown command or computer name, or unable to find computer address
Switch#interface Vlan92
        ^
% Invalid input detected at '^' marker.

Switch#ip http serv
 << er
          ^
% Invalid input detected at '^' marker.

Switch#ip http secure-server
          ^
% Invalid input detected at '^' marker.

Switch#logging facility local1
               ^
% Invalid input detected at '^' marker.

Switch#logging h
 << ost 130.18.8.12
               ^
% Invalid input detected at '^' marker.

Switch#access-list 1 permit 10.92.0.0 0.0.255.255
              ^
% Invalid input detected at '^' marker.

Switch#access-list 1 permit 130.18.8.0 0.0.0.255
              ^
 << 
% Invalid input detected at '^' marker.

Switch#access-list 1 permit 10.93.0.0 0.0.255.255
              ^
% Invalid input detected at '^' marker.

Switch#access-list 1 permit 130.18.1.0 0.0.0.255
              ^
% Invalid input detected at '^' m
 << arker.

Switch#username root privilege 15 secret Area=l*w
        ^
% Invalid input detected at '^' marker.

Switch#snmp-server community sysnet RO 1
           ^
% Invalid input detected at '^' marker.

Switch#snmp-server community c2-b2=a2 RW 
 << 1
           ^
% Invalid input detected at '^' marker.

Switch#snmp-server enable traps snmp authentication linkdown linkup coldstart$ enable traps snmp authentication linkdown link
 << up coldstart          warmstart
snmp-server enable traps snmp authentication linkdown linkup coldstart warmstart    ^

% Invalid input detected at '^' marker.

Switch#snmp-server enable traps transceiver all
           ^
% Invalid input de
 << tected at '^' marker.

Switch#snmp-server enable traps tty
           ^
% Invalid input detected at '^' marker.

Switch#snmp-server enable traps cluster
           ^
% Invalid input detected at '^' marker.

Switch#snmp-server enable traps config
 << -copy
           ^
% Invalid input detected at '^' marker.

Switch#snmp-server enable traps config
           ^
% Invalid input detected at '^' marker.

Switch#snmp-server enable traps config-ctid
           ^
% Invalid input detected at '^' mar
 << ker.

Switch#snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-auth-fail-$ enable traps dot1x auth-fail-vlan guest-vlan no-auth-fail-v         lan no-gu
 << aps dot1x auth-fail-vlan guest-vlan no-auth-fail-vlan no-gue         st-vlan
snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-auth-fail-vlan no-gu    ^est-vlan

% Invalid inpu
 << t detected at '^' marker.

Switch#snmp-server enable traps entity
           ^
% Invalid input detected at '^' marker.

Switch#snmp-server enable traps power-ethernet police
           ^
% Invalid input detected at '^' marker.

Switch#snmp-serve
 << r enable traps cpu threshold
           ^
% Invalid input detected at '^' marker.

Switch#snmp-server enable traps rep
           ^
% Invalid input detected at '^' marker.

Switch#snmp-server enable traps bridge newroot topologychange
           
 << ^
% Invalid input detected at '^' marker.

Switch#snmp-server enable traps stpx inconsistency root-inconsistency loop-in$ enable traps stpx inconsistency root-inconsistency loop-inc 
 <<         onsistencaps stpx inconsistency root-inconsistency loop-inconsistency         
snmp-server enable traps stpx inconsistency root-inconsistency loop-inconsistenc
 <<     ^y

% Invalid input detected at '^' marker.

Switch#snmp-server enable traps syslog
           ^
% Invalid input detected at '^' marker.

Switch#snmp-server enable traps vtp
           ^
% Invalid input detected at '^' marker.

Switch#snmp
 << -server enable traps vlancreate
           ^
% Invalid input detected at '^' marker.

Switch#snmp-sconfigure terminal
           ^
% Invalid input detected at '^' marker.

Switch#spanning-tree mode mst
         ^
% Invalid input detected at '^' 
 << marker.

Switch#spanning-tree etherchannel guard misconfig
         ^
% Invalid input detected at '^' marker.

Switch#spanning-tree mst configuration
         ^
% Invalid input detected at '^' marker.

Switch# name msstate
             ^
% Inv
 << alid input detected at '^' marker.

Switch# revision 1
Translating "revision"...domain server (255.255.255.255)
 << 
 << 
 << 
 << 
 << 
% Unknown command or computer name, or unable to find computer address
Switch# instance 1 vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 63, $ vlan 2, 7, 11, 20, 22, 24, 31, 3
 << 5, 37, 39-40, 50, 60, 63, 7         0
         ^
% Invalid input detected at '^' marker.

Switch# instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 160
         ^
% Invalid input detected at '^' marker.

Switch# instance 1
 <<  vlan 162-163, 168, 189, 194, 202, 220, 222, 230, 232, 242,$ vlan 162-163, 168, 189, 194, 202, 220, 222, 230, 232, 242,          246
 instance 1 vlan 162-163, 168, 189, 194, 2
 << 02, 220, 222, 230, 232, 242, 246
  ^
% Invalid input detected at '^' marker.

Switch# instance 1 vlan 256, 611-612, 654, 741, 996, 999
         ^
% Invalid input detected at '^' marker.

Switch# instance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 
 << 2031, 2035, 2037,$ vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037,          2039-2040
 instance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037, 2039-20
 << 40  ^

% Invalid input detected at '^' marker.

Switch# instance 2 vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096, 2104, 2110,$ vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096, 2104, 2
 << 110,          2126
 instance 2 vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096, 2104, 2110, 2126
  ^
% Invalid input detected at '^' marker.

Switch# instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 2189, 2194, 
 << $ vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 2189, 2194, 2         202
 instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 2189, 2194, 2202
  ^
% Invalid input detected at '^' marker.

S
 << witch# instance 2 vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 2654, 2999
         ^
% Invalid input detected at '^' marker.

Switch# instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176, 
 << $ vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176, 1         96
 instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176, 196
  ^
% Invalid input detected at '^' marker.

Switch# instance 3 vlan 24
 << 4, 248, 927
         ^
% Invalid input detected at '^' marker.

Switch# instance 4 vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072, 2108, 2113,$ vlan 2042, 2051, 2059, 2064, 2066, 206
 << 9, 2072, 2108, 2113,          2128
 instance 4 vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072, 2108, 2113, 2128
  ^
% Invalid input detected at '^' marker.

Switch# instance 4 vlan 2144, 2176, 2196, 2244, 2248, 2927
         ^
% Invalid inp
 << ut detected at '^' marker.

Switch# instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 228
         ^
% Invalid input detected at '^' marker.

Switch# instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216, 
 << $ vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216, 2         228
 instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216, 2228
  ^
% Invalid input detected at '^' marker.

S
 << witch# instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116, 1$ vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116, 12         4
         ^
% Invalid input
 <<  detected at '^' marker.

Switch# instance 7 vlan 172, 186, 192, 204-208, 210, 240-241, 251-252, 630, 9$ vlan 172, 186, 192, 204-208, 210, 240-241, 251-252, 630, 92         8
 << 
         ^
% Invalid input detected at '^' marker.

Switch# instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082, $ vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, 207
 << 5, 2082, 2         084
 instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082, 2084
  ^
% Invalid input detected at '^' marker.

Switch# instance 8 vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208, 
 << $ vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208, 2         210
 instance 8 vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208, 2210
  ^
% Invalid input detected at '^' marker.

Expect: did not match any strings!
...
cache
              ^
% Invalid input detected at '^' marker.

Switch# shutdown
% Unknown command or computer name, or unable to find computer address
Switch#interface Vlan92
        ^
% Invalid input detected at '^' marker.

Switch#ip http server
          ^
% Invalid input detected at '^' marker.

Switch#ip http secure-server
          ^
% Invalid input detected at '^' marker.

Switch#logging facility local1
               ^
% Invalid input detected at '^' marker.

Switch#logging host 130.18.8.12
               ^
% Invalid input detected at '^' marker.

Switch#access-list 1 permit 10.92.0.0 0.0.255.255
              ^
% Invalid input detected at '^' marker.

Switch#access-list 1 permit 130.18.8.0 0.0.0.255
              ^
% Invalid input detected at '^' marker.

Switch#access-list 1 permit 10.93.0.0 0.0.255.255
              ^
% Invalid input detected at '^' marker.

Switch#access-list 1 permit 130.18.1.0 0.0.0.255
              ^
% Invalid input detected at '^' marker.

Switch#username root privilege 15 secret Area=l*w
        ^
% Invalid input detected at '^' marker.

Switch#snmp-server community sysnet RO 1
           ^
% Invalid input detected at '^' marker.

Switch#snmp-server community c2-b2=a2 RW 1
           ^
% Invalid input detected at '^' marker.

Switch#snmp-server enable traps snmp authentication linkdown linkup coldstart$ enable traps snmp authentication linkdown linkup coldstart          warmstart
snmp-server enable traps snmp authentication linkdown linkup coldstart warmstart    ^

% Invalid input detected at '^' marker.

Switch#snmp-server enable traps transceiver all
           ^
% Invalid input detected at '^' marker.

Switch#snmp-server enable traps tty
           ^
% Invalid input detected at '^' marker.

Switch#snmp-server enable traps cluster
           ^
% Invalid input detected at '^' marker.

Switch#snmp-server enable traps config-copy
           ^
% Invalid input detected at '^' marker.

Switch#snmp-server enable traps config
           ^
% Invalid input detected at '^' marker.

Switch#snmp-server enable traps config-ctid
           ^
% Invalid input detected at '^' marker.

Switch#snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-auth-fail-$ enable traps dot1x auth-fail-vlan guest-vlan no-auth-fail-v         lan no-guaps dot1x auth-fail-vlan guest-vlan no-auth-fail-vlan no-gue         st-vlan
snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-auth-fail-vlan no-gu    ^est-vlan

% Invalid input detected at '^' marker.

Switch#snmp-server enable traps entity
           ^
% Invalid input detected at '^' marker.

Switch#snmp-server enable traps power-ethernet police
           ^
% Invalid input detected at '^' marker.

Switch#snmp-server enable traps cpu threshold
           ^
% Invalid input detected at '^' marker.

Switch#snmp-server enable traps rep
           ^
% Invalid input detected at '^' marker.

Switch#snmp-server enable traps bridge newroot topologychange
           ^
% Invalid input detected at '^' marker.

Switch#snmp-server enable traps stpx inconsistency root-inconsistency loop-in$ enable traps stpx inconsistency root-inconsistency loop-inc         onsistencaps stpx inconsistency root-inconsistency loop-inconsistency         
snmp-server enable traps stpx inconsistency root-inconsistency loop-inconsistenc    ^y

% Invalid input detected at '^' marker.

Switch#snmp-server enable traps syslog
           ^
% Invalid input detected at '^' marker.

Switch#snmp-server enable traps vtp
           ^
% Invalid input detected at '^' marker.

Switch#snmp-server enable traps vlancreate
           ^
% Invalid input detected at '^' marker.

Switch#snmp-sconfigure terminal
           ^
% Invalid input detected at '^' marker.

Switch#spanning-tree mode mst
         ^
% Invalid input detected at '^' marker.

Switch#spanning-tree etherchannel guard misconfig
         ^
% Invalid input detected at '^' marker.

Switch#spanning-tree mst configuration
         ^
% Invalid input detected at '^' marker.

Switch# name msstate
             ^
% Invalid input detected at '^' marker.

Switch# revision 1
Translating "revision"...domain server (255.255.255.255)
% Unknown command or computer name, or unable to find computer address
Switch# instance 1 vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 63, $ vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 63, 7         0
         ^
% Invalid input detected at '^' marker.

Switch# instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 160
         ^
% Invalid input detected at '^' marker.

Switch# instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 230, 232, 242,$ vlan 162-163, 168, 189, 194, 202, 220, 222, 230, 232, 242,          246
 instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 230, 232, 242, 246
  ^
% Invalid input detected at '^' marker.

Switch# instance 1 vlan 256, 611-612, 654, 741, 996, 999
         ^
% Invalid input detected at '^' marker.

Switch# instance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037,$ vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037,          2039-2040
 instance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037, 2039-2040  ^

% Invalid input detected at '^' marker.

Switch# instance 2 vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096, 2104, 2110,$ vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096, 2104, 2110,          2126
 instance 2 vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096, 2104, 2110, 2126
  ^
% Invalid input detected at '^' marker.

Switch# instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 2189, 2194, $ vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 2189, 2194, 2         202
 instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 2189, 2194, 2202
  ^
% Invalid input detected at '^' marker.

Switch# instance 2 vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 2654, 2999
         ^
% Invalid input detected at '^' marker.

Switch# instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176, $ vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176, 1         96
 instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176, 196
  ^
% Invalid input detected at '^' marker.

Switch# instance 3 vlan 244, 248, 927
         ^
% Invalid input detected at '^' marker.

Switch# instance 4 vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072, 2108, 2113,$ vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072, 2108, 2113,          2128
 instance 4 vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072, 2108, 2113, 2128
  ^
% Invalid input detected at '^' marker.

Switch# instance 4 vlan 2144, 2176, 2196, 2244, 2248, 2927
         ^
% Invalid input detected at '^' marker.

Switch# instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 228
         ^
% Invalid input detected at '^' marker.

Switch# instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216, $ vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216, 2         228
 instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216, 2228
  ^
% Invalid input detected at '^' marker.

Switch# instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116, 1$ vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116, 12         4
         ^
% Invalid input detected at '^' marker.

Switch# instance 7 vlan 172, 186, 192, 204-208, 210, 240-241, 251-252, 630, 9$ vlan 172, 186, 192, 204-208, 210, 240-241, 251-252, 630, 92         8
         ^
% Invalid input detected at '^' marker.

Switch# instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082, $ vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082, 2         084
 instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082, 2084
  ^
% Invalid input detected at '^' marker.

Switch# instance 8 vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208, $ vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208, 2         210
 instance 8 vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208, 2210
  ^
% Invalid input detected at '^' marker.

...

 >> hostname c29s1c.r008.meridian 

Expect: searching for 2 strs:  :# :>
 << 
Switch# instance 8 vlan 2240-2241, 2251-2252, 2630, 2928
         ^
% Invalid input detected at '^' marker.

Switch# instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102, 1
Expect: matched string 1: #
 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << $ vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102, 11         2
         ^
% Invalid input detected at '^' marker.

Switch# instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 500, 505, 510-
 << $ vlan 130, 132, 147-148, 158, 212, 226, 236, 500, 505, 510-5         11
 instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 500, 505, 510-511
  ^
% Invalid input detected at '^' marker.

Switch# insta
 << nce 9 vlan 522, 551-570, 603, 629, 633, 742, 802, 926, 929
         ^
% Invalid input detected at '^' marker.

Switch# instance 10 vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 2057, 2062, 
 << $0 vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 2057, 2062, 2         068
 instance 10 vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 2057, 2062, 2068
  ^
% Invalid input detected at '^' marker.

Switch# instance 10 vlan 2076, 2098-2099
 << , 2102, 2112, 2130, 2132, 2147-2148, $0 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148, 2         158
 instance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132, 2147-
 << 2148, 2158
  ^
% Invalid input detected at '^' marker.

Switch# instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522, 2603, 2629,$0 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522,
 <<  2603, 2629,          2633
 instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522, 2603, 2629, 2633
  ^
% Invalid input detected at '^' marker.

Switch# instance 10 vlan 2802, 2926, 2929
         ^
% Invalid input detected at '^' marker
 << .

Switch# instance 11 vlan 8, 43, 52, 146, 156-157, 180, 200, 218
         ^
% Invalid input detected at '^' marker.

Switch# instance 12 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180, 2200, 2218
         ^
% Invalid input detected at '^' marker.
 << 

Switch#
Switch#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#hostname c29s1c.r008.meridian 
c29s1c.r008.meridian(config)#configure terminal
                                     ^
% Invalid input d
Expect: matched string 1: (config)#
 >> snmp-server contact  

Expect: searching for 1 strs:  :#
 << etected at '^' marker.

c29s1c.r008.meridian(config)#snmp-server contact  
% Incomplete command.

c29s1c.r008.meridian(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s1c.r008.meridian#
Dec 19 17:06:42.976: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1c.r008.meridian#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1c.r008.meridian(config)#
Expect: matched string 1: (config)#
 >> interface vlan 92

Expect: searching for 1 strs:  :(config-if)#
 << interface vlan 92
c29s1c.r008.meridian(config-if)#
Expect: matched string 1: (config-if)#
 >> ip address 10.92.5.169 255.255.0.0

 >> ip broadcast-address 10.92.255.255

 >> end

Expect: searching for 1 strs:  :Configured
 << ip address 10.92.5.169 255.255.0.0
c29s1c.r008.meridian(config-if)#ip broadcast-address 10.92.255.255
c29s1c.r008.meridian(config-if)#
Dec 19 17:06:47.600: %LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan92, changed state to downend
c29s1c.r008.me
 << ridian#
 << 
Dec 19 17:06:49.180: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1c.r008.meridian#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1c.r008.meridian(config)#
Expect: matched string 1: (config)#
 >> interface Vlan92

Expect: searching for 1 strs:  :(config-if)#
 << interface Vlan92
c29s1c.r008.meridian(config-if)#
Expect: matched string 1: (config-if)#
 >> ip default-gateway 10.92.0.1

 >> end

Expect: searching for 1 strs:  :Configured
 << ip default-gateway 10.92.0.1
c29s1c.r008.meridian(config)#end
c29s1c.r008.meridian#
Dec 19 17:06:54.992: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1c.r008.meridian#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1c.r008.meridian(config)#
Expect: matched string 1: (config)#
 >> ip dhcp snooping

Expect: searching for 1 strs:  :#
 << ip dhcp snooping
c29s1c.r008.meridian(config)#
Expect: matched string 1: #
 >> ip dhcp snooping vlan 649

Expect: searching for 1 strs:  :#
 << ip dhcp snooping vlan 649
c29s1c.r008.meridian(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s1c.r008.meridian#
Dec 19 17:07:02.007: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1c.r008.meridian#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1c.r008.meridian(config)#
Expect: matched string 1: (config)#
 >> default interface range gi0/1 - 8 

 >> interface range gi0/1 - 8 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi0/1 - 8 
c29s1c.r008.meridian(config)#interface range gi0/1 - 8 
c29s1c.r008.meridian(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport access vlan 649

 >> switchport mode access

 >> spanning-tree portfast

 >> switchport port-security maximum 2

 >> switchport port-security

 >> switchport port-security aging time 15

 >> switchport port-security violation protect

 >> switchport port-security aging type inactivity

 >> power inline never

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport access vlan 649
% Access VLAN does not exist. Creating vlan 649
c29s1c.r008.meridian(config-if-range)#switchport mode access
c29s1c.r008.meridian(config-if-range)#spanning-tree portfast
%Warning: portfast should only be enabled on ports con
 << nected to a single
 host. Connecting hubs, concentrators, switches, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast will be configured in 8 interfaces due to the range com
 << mand 
 but will only have effect when the interfaces are in a non-trunking mode.
c29s1c.r008.meridian(config-if-range)#switchport port-security maximum 2
c29s1c.r008.meridian(config-if-range)#switchport port-security
c29s1c.r008.meridian(config-if-ran
 << ge)#switchport port-security aging time 15
c29s1c.r008.meridian(config-if-range)#switchport port-security violation prot$port-security violation prote         ct
c29s1c.r008.meridian(config-if-range)#switc
 << hport port-security aging type ina$port-security aging type inac         tivity
c29s1c.r008.meridian(config-if-range)#power inline never
c29s1c.r008.meridian(config-if-range)#end
c29s1c.r008.meridian#
 << 
Dec 19 17:07:09.823: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1c.r008.meridian#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1c.r008.meridian(config)#
Expect: matched string 1: (config)#
 >> default interface range gi0/1 - 4 

 >> interface range gi0/1 - 4 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi0/1 - 4 
c29s1c.r008.meridian(config)#interface range gi0/1 - 4 
c29s1c.r008.meridian(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport access vlan 673

 >> switchport mode access

 >> spanning-tree portfast

 >> power inline consumption 15400

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport access vlan 673
% Access VLAN does not exist. Creating vlan 673
c29s1c.r008.meridian(config-if-range)#switchport mode access
c29s1c.r008.meridian(config-if-range)#spanning-tree portfast
%Warning: portfast should only be enabled on ports con
 << nected to a single
 host. Connecting hubs, concentrators, switches, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast will be configured in 4 interfaces due to the range com
 << mand 
 but will only have effect when the interfaces are in a non-trunking mode.
c29s1c.r008.meridian(config-if-range)#power inline consumption 15400
%CAUTION: Interface Gi0/1: Misconfiguring the 'power inline
 consumption/allocation' command may caus
 << e damage to the switch and void
 your warranty. Take precaution not to oversubscribe the power supply.
 It is recommended to enable power policing if the switch supports it.
 Refer to documentation.

%CAUTION: Interface Gi0/2: Misconfiguring the 'pow
 << er inline
 consumption/allocation' command may cause damage to the switch and void
 your warranty. Take precaution not to oversubscribe the power supply.
 It is recommended to enable power policing if the switch supports it.
 Refer to documentation.

 << 
%CAUTION: Interface Gi0/3: Misconfiguring the 'power inline
 consumption/allocation' command may cause damage to the switch and void
 your warranty. Take precaution not to oversubscribe the power supply.
 It is recommended to enable power policing if
 <<  the switch supports it.
 Refer to documentation.

%CAUTION: Interface Gi0/4: Misconfiguring the 'power inline
 consumption/allocation' command may cause damage to the switch and void
 your warranty. Take precaution not to oversubscribe the power sup
 << ply.
 It is recommended to enable power policing if the switch supports it.
 Refer to documentation.

c29s1c.r008.meridian(config-if-range)#end
c29s1c.r008.meridian#
 << 
Dec 19 17:07:17.439: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1c.r008.meridian#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1c.r008.meridian(config)#
Expect: matched string 1: (config)#
 >> default interface gi0/5 

 >> interface gi0/5 

Expect: searching for 1 strs:  :(config-if)#
 << default interface gi0/5 
Interface GigabitEthernet0/5 set to default configuration
c29s1c.r008.meridian(config)#interface gi0/5 
c29s1c.r008.meridian(config-if)#
Expect: matched string 1: (config-if)#
 >> switchport access vlan 28

 >> switchport mode access

 >> spanning-tree portfast

 >> power inline consumption 15400

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport access vlan 28
% Access VLAN does not exist. Creating vlan 28
c29s1c.r008.meridian(config-if)#switchport mode access
c29s1c.r008.meridian(config-if)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a si
 << ngle
 host. Connecting hubs, concentrators, switches, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast has been configured on GigabitEthernet0/5 but will only
 have effect
 <<  when the interface is in a non-trunking mode.
c29s1c.r008.meridian(config-if)#power inline consumption 15400
%CAUTION: Interface Gi0/5: Misconfiguring the 'power inline
 consumption/allocation' command may cause damage to the switch and void
 your wa
 << rranty. Take precaution not to oversubscribe the power supply.
 It is recommended to enable power policing if the switch supports it.
 Refer to documentation.

c29s1c.r008.meridian(config-if)#end
c29s1c.r008.meridian#
 << 
Dec 19 17:07:24.272: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1c.r008.meridian#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1c.r008.meridian(config)#
Expect: matched string 1: (config)#
 >> default interface gi0/8 

 >> interface gi0/8 

Expect: searching for 1 strs:  :(config-if)#
 << default interface gi0/8 
Interface GigabitEthernet0/8 set to default configuration
c29s1c.r008.meridian(config)#interface gi0/8 
c29s1c.r008.meridian(config-if)#
Expect: matched string 1: (config-if)#
 >> switchport access vlan 91

 >> switchport mode access

 >> spanning-tree portfast

 >> power inline consumption 15400

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport access vlan 91
% Access VLAN does not exist. Creating vlan 91
c29s1c.r008.meridian(config-if)#switchport mode access
c29s1c.r008.meridian(config-if)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a si
 << ngle
 host. Connecting hubs, concentrators, switches, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast has been configured on GigabitEthernet0/8 but will only
 have effect
 <<  when the interface is in a non-trunking mode.
c29s1c.r008.meridian(config-if)#power inline consumption 15400
%CAUTION: Interface Gi0/8: Misconfiguring the 'power inline
 consumption/allocation' command may cause damage to the switch and void
 your wa
 << rranty. Take precaution not to oversubscribe the power supply.
 It is recommended to enable power policing if the switch supports it.
 Refer to documentation.

c29s1c.r008.meridian(config-if)#end
c29s1c.r008.meridian#
 << 
Dec 19 17:07:31.290: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1c.r008.meridian#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1c.r008.meridian(config)#
Expect: matched string 1: (config)#
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s1c.r008.meridian#
 << 
Dec 19 17:07:35.684: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> write mem

Expect: searching for 2 strs:  :# :>
 << 
c29s1c.r008.meridian#write mem
Building configuration...
[OK]
c29s1c.r008.meridian#
Expect: matched string 1: #
 >> 
Expect: searching for 2 strs:  :# :>
 << 
c29s1c.r008.meridian#
c29s1c.r008.meridian#
Expect: matched string 1: #
 >> sh run

Expect: searching for 2 strs:  :# :>
 << sh run
Building configuration...

Current configuration : 2515 bytes
!
! Last configuration change at 17:07:35 UTC Mon Dec 19 2016
! NVRAM config last updated at 17:07:38 UTC Mon Dec 19 2016
!
version 15.2
no service pad
service timestamps debug
 <<  datetime msec
service timestamps log datetime msec
no service password-encryption
!
hostname c29s1c.r008.meridian
!
boot-start-marker
boot-end-marker
!
!
no aaa new-model
system mtu routing 1500
!
!
!
 --More-- 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...
sh run
Building configuration...

Current configuration : 2515 bytes
!
! Last configuration change at 17:07:35 UTC Mon Dec 19 2016
! NVRAM config last updated at 17:07:38 UTC Mon Dec 19 2016
!
version 15.2
no service pad
service timestamps debug datetime msec
service timestamps log datetime msec
no service password-encryption
!
hostname c29s1c.r008.meridian
!
boot-start-marker
boot-end-marker
!
!
no aaa new-model
system mtu routing 1500
!
!
!
 --More-- 
...

 >> show interface status

Expect: searching for 2 strs:  :# :>
 <<         
c29s1c.r008.meridian#how interface status
                      ^
% Invalid input detected at '^' marker.

c29s1c.r008.meridian#
Expect: matched string 1: #
