trying to use serial port: /dev/ttyUSB0
 >> 
 >> 

Expect: searching for 4 strs:  :[yes/no] :Press RETURN to get started. :# :Switch>
 << 


         --- System Configuration Dialog ---

Enable secret warning
----------------------------------
In order to access the device manager, an enable secret is required
If you enter the initial configuration dialog, you will be prompted for t
 << he enable secret
If you choose not to enter the intial configuration dialog, or if you exit setup without setting the enable secret,
please set an enable secret using the following CLI in configuration mode-
enable secret 0 <cleartext password>
------
 << ----------------------------
Would you like to enter the initial configuration dialog? [yes/no]: 
% Please answer 'yes' or 'no'.
Would you like to enter the initial configuration dialog? [yes/no]: 
% Please answer 'yes' or 'no'.
Would you like to ent
Expect: matched string 1: [yes/no]
 >> 

 >> no

 >> term len 0

Expect: searching for 2 strs:  :# :>
 << er the initial configuration dialog? [yes/no]: 
% Please answer 'yes' or 'no'.
Would you like to enter the initial configuration dialog? [yes/no]: 
% Please answer 'yes' or 'no'.
Would you like to enter the initial configuration dialog? [yes/no]: 
% 
 << Please answer 'yes' or 'no'.
Would you like to enter the initial configuration dialog? [yes/no]: no
Switch>term len 0
Switch>
Expect: matched string 2: >
 >> show version

Expect: searching for 2 strs:  :# :>
 << show version
Cisco IOS Software, C3560CX Software (C3560CX-UNIVERSALK9-M), Version 15.2(4)E1, RELEASE SOFTWARE (fc2)
Technical Support: http://www.cisco.com/techsupport
Copyright (c) 1986-2016 by Cisco Systems, Inc.
Compiled Thu 28-Jan-16 16:14 by pro
 << d_rel_team

ROM: Bootstrap program is C3560CX boot loader
BOOTLDR: C3560CX Boot Loader (C3560CX-HBOOT-M) Version 15.2(3r)E2, RELEASE SOFTWARE (fc2)

Switch uptime is 1 hour, 33 minutes
System returned to ROM by power-on
System restarted at 15:28:46
 <<  UTC Fri Apr 28 2017
System image file is "flash:/c3560cx-universalk9-mz.152-4.E1/c3560cx-universalk9-mz.152-4.E1.bin"
Last reload reason: Reload command



This product contains cryptographic features and is subject to United
States and local coun
 << try laws governing import, export, transfer and
use. Delivery of Cisco cryptographic products does not imply
third-party authority to import, export, distribute or use encryption.
Importers, exporters, distributors and users are responsible for
compli
 << ance with U.S. and local country laws. By using this product you
agree to comply with applicable laws and regulations. If you are unable
to comply with U.S. and local laws, return this product immediately.

A summary of U.S. laws governing Cisco crypt
 << ographic products may be found at:
http://www.cisco.com/wwl/export/crypto/tool/stqrg.html

If you require further assistance please contact us by sending email to
export@cisco.com.

License Level: ipbase
License Type: Default. No valid license foun
 << d.
Next reload license Level: ipbase

cisco WS-C3560CX-8PC-S (APM86XXX) processor (revision G0) with 524288K bytes of memory.
Processor board ID FOC2025Z7CQ
Last reset from reload command
1 Virtual Ethernet interface
12 Gigabit Ethernet interfaces
 << 
The password-recovery mechanism is enabled.

512K bytes of flash-simulated non-volatile configuration memory.
Base ethernet MAC Address       : 94:D4:69:C1:B3:80
Motherboard assembly number     : 73-16471-05
Power supply part number        : 341-067
 << 5-02
Motherboard serial number       : FOC202549HS
Power supply serial number      : DCC201850ME
Model revision number           : G0
Motherboard revision number     : A0
Model number                    : WS-C3560CX-8PC-S
System serial number       
 <<      : FOC2025Z7CQ
Top Assembly Part Number        : 68-5359-02
Top Assembly Revision Number    : E0
Version ID                      : V02
CLEI Code Number                : CMM1S10DRA
Hardware Board Revision Number  : 0x02


Switch Ports Model    
 <<                  SW Version            SW Image                 
------ ----- -----                     ----------            ----------               
*    1 12    WS-C3560CX-8PC-S          15.2(4)E1             C3560CX-UNIVERSALK9-M    


Configura
 << tion register is 0xF

Switch>
Expect: matched string 2: >
 >> enable

Expect: searching for 2 strs:  :Password: :#
 << enable
Switch#
Expect: matched string 2: #
 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
Expect: matched string 1: (config)#
 >> no service pad

 >> service timestamps debug datetime localtime

 >> service timestamps log datetime localtime

 >> service password-encryption

 >> logging buffered informational

 >> enable secret Area=l*w

 >> enable password Area=l*w

 >> username root privilege 15 secret Area=l*w

 >> no aaa new-model

 >> clock timezone CST -6.0

 >> clock summer-time CDT recurring

 >> system mtu routing 1500

 >> ip subnet-zero

 >> ip domain-name mgmt.msstate.edu

 >> ip name-server 130.18.80.13

 >> ip name-server 130.18.80.12

 >> vtp domain vtp01.mgmt.msstate.edu

 >> vtp mode client

 >> crypto pki trustpoint TP-self-signed-2494998912

 >>  enrollment selfsigned

 >>  subject-name cn=IOS-Self-Signed-Certificate-2494998912

 >>  revocation-check none

 >>  rsakeypair TP-self-signed-2494998912

 >> crypto pki certificate chain TP-self-signed-2494998912

 >>  certificate self-signed 01 nvram:IOS-Self-Sig#3232.cer

 >> spanning-tree portfast bpduguard default

 >> spanning-tree extend system-id

 >> vlan internal allocation policy ascending

 >> errdisable recovery cause all

 >> errdisable recovery interval 1800

 >> interface Vlan1

 >>  no ip address

 >>  no ip route-cache

 >> interface Vlan92

 >> no ip http server

 >> no ip http secure-server

 >> logging facility local1

 >> logging 130.18.8.12

 >> sccess-list 1 permit 10.92.0.0 0.0.255.255

 >> access-list 1 permit 130.18.8.0 0.0.0.255

 >> access-list 1 permit 10.93.0.0 0.0.255.255

 >> access-list 1 permit 130.18.1.0 0.0.0.255

 >> snmp-server community sysnet RO 1

 >> snmp-server community c2-b2=a2 RW 1

 >> snmp-server enable traps snmp authentication linkdown linkup coldstart warmstart

 >> snmp-server enable traps transceiver all

 >> snmp-server enable traps tty

 >> snmp-server enable traps cluster

 >> snmp-server enable traps config-copy

 >> snmp-server enable traps config

 >> snmp-server enable traps config-ctid

 >> snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-auth-fail-vlan no-guest-vlan

 >> snmp-server enable traps entity

 >> snmp-server enable traps power-ethernet police

 >> snmp-server enable traps cpu threshold

 >> snmp-server enable traps rep

 >> snmp-server enable traps bridge newroot topologychange

 >> snmp-server enable traps stpx inconsistency root-inconsistency loop-inconsistency

 >> snmp-server enable traps syslog

 >> snmp-server enable traps vtp

 >> snmp-server enable traps vlancreate

 >> snmp-server enable traps vlandelete

 >> snmp-server enable traps flash insertion removal

 >> snmp-server enable traps port-security

 >> snmp-server enable traps envmon fan shutdown supply temperature status

 >> snmp-server enable traps errdisable

 >> snmp-server enable traps mac-notification change move threshold

 >> snmp-server enable traps vlan-membership

 >> snmp-server host 130.18.8.12 sysnet

 >> line con 0

 >> line vty 0 15

 >>  access-class 1 in

 >>  password Area=l*w

 >>  login local

 >>  transport input ssh

 >> ntp server 10.92.0.5

 >> 

 >> end

Expect: searching for 1 strs:  :Configured
 << no service pad
Switch(config)#service timestamps debug datetime localtime
Switch(config)#service timestamps log datetime localtime
Switch(config)#service password-encryption
Switch(config)#logging buffered informational
Switch(config)#enable secret A
 << rea=l*w
Switch(config)#enable password Area=l*w
The enable password you have chosen is the same as your enable secret.
This is not recommended.  Re-enter the enable password.

Switch(config)#username root privilege 15 secret Area=l*w
Switch(config)#
 << no aaa new-model
Switch(config)#clock timezone CST -6.0
                                  ^
% Invalid input detected at '^' marker.

Switch(config)#clock summ
Apr 28 17:03:24: %SYS-5-LOG_CONFIG_CHANGE: Buffer logging: level informational, xml disabl
 << ed, filtering disabled, size (4096)er-time CDT recurring
Switch(config)#system mtu routing 1500
Switch(config)#ip subnet-zero
Switch(config)#ip domain-name mgmt.msstate.edu
Switch(config)#ip name-server 130.18.80.13
Switch(config)#ip name-server 130.
 << 18.80.12
Switch(config)#vtp domain vtp01.mgmt.msstate.edu
Domain name already set to vtp01.mgmt.msstate.edu.
Switch(config)#vtp mode client
Device mode already VTP Client for VLANS.
Switch(config)#crypto pki trustpoint TP-self-signed-2494998912
Swit
 << ch(ca-trustpoint)# enrollment selfsigned
Switch(ca-trustpoint)#
Apr 28 18:03:25: %SYS-6-CLOCKUPDATE: System clock has been updated from 17:03:25 UTC Fri Apr 28 2017 to 18:03:25 CDT Fri Apr 28 2017, configured from console by console. subject-name cn=IOS
 << -Self-Signed-Certificate-2494998912
Switch(ca-trustpoint)# revocation-check none
Switch(ca-trustpoint)# rsakeypair TP-self-signed-2494998912
Switch(ca-trustpoint)#crypto pki certificate chain TP-self-signed-2494998912
Switch(config-cert-chain)# certif
 << icate self-signed 01 nvram:IOS-Self-Sig#3232$e self-signed 01 nvram:IOS-Self-Sig#3232.         cer
Switch(config-cert-chain)#spanning-tree portfast bpduguard default
Switch(config)#spanning-tre
 << e extend system-id
Switch(config)#vlan internal allocation policy ascending
Switch(config)#errdisable recovery cause all
Switch(config)#errdisable recovery interval 1800
Switch(config)#interface Vlan1
Switch(config-if)# no ip address
Switch(config-i
 << f)# no ip route-cache
Switch(config-if)#interface Vlan92
Switch(config-if)#no ip http server
Switch(config)#no ip http secure-server
Switch(config)#logging facility local1
Switch(config)#logging 130.18.8.12
Switch(config)#sccess-list 1 permit 10.92.
 << 0.0 0.0.255.255
                 ^
% Invalid input detected at '^' marker.

Switch(config)#access-list 1 permit 130.18.8.0 0.0.0.255
Switch(config)#access-list 1 permit 10.93.0.0 0.0.255.255
Switch(config)#access-list 1 permit 130.18.1.0 0.0.0.255

 << Switch(config)#snmp-server community sysnet RO 1
Switch(config)#
Apr 28 18:03:31: %SYS-6-LOGGINGHOST_STARTSTOP: Logging to host 130.18.8.12 port 0 CLI Request Triggered
Apr 28 18:03:31: %SYS-6-LOGGINGHOST_STARTSTOP: Logging to host 130.18.8.12 port 514
 <<  started - CLI initiatedsnmp-server community c2-b2=a2 RW 1
Switch(config)#snmp-server enable traps snmp authentication linkdown linkup c$ enable traps snmp authentication linkdown linkup co  
 <<        ldstart waps snmp authentication linkdown linkup coldstart wa         rmstart
Switch(config)#snmp-server enable traps transceiver all
Switch(config)#snmp-server enable
 <<  traps tty
Switch(config)#snmp-server enable traps cluster
Switch(config)#snmp-server enable traps config-copy
Switch(config)#snmp-server enable traps config
Switch(config)#snmp-server enable traps config-ctid
Switch(config)#snmp-server enable traps 
 << dot1x auth-fail-vlan guest-vlan no-au$ enable traps dot1x auth-fail-vlan guest-vlan no-aut         h-fail-vlaps dot1x auth-
 << fail-vlan guest-vlan no-auth-fail-vla         n no-guesuth-fail-vlan guest-vlan no-auth-fail-vlan no-guest         -vlan
snmp-server enable traps dot1x auth-fail-vlan guest-vla
 << n no-auth-fail-vlan no-gu                         ^est-vlan

% Invalid input detected at '^' marker.

Switch(config)#snmp-server enable traps entity
Switch(config)#snmp-server enable traps power-ethernet police
Switch(config)#snmp-server enable trap
 << s cpu threshold
Switch(config)#snmp-server enable traps rep
Switch(config)#snmp-server enable traps bridge newroot topologychange
Switch(config)#snmp-server enable traps stpx inconsistency root-inconsistency
 << $ enable traps stpx inconsistency root-inconsistency          loop-incoaps stpx inconsistency root-inconsistency loop-incon         sistency
Switch(config)#sn
 << mp-server enable traps syslog
Switch(config)#snmp-server enable traps vtp
Switch(config)#snmp-server enable traps vlancreate
Switch(config)#snmp-server enable traps vlandelete
Switch(config)#snmp-server enable traps flash insertion removal
Switch(con
 << fig)#snmp-server enable traps port-security
Switch(config)#snmp-server enable traps envmon fan shutdown supply temperatur$ enable traps envmon fan shutdown supply temperature         
 <<  status
Switch(config)#snmp-server enable traps errdisable
Switch(config)#snmp-server enable traps mac-notification change move threshol$ enable traps mac-notification change move threshold  
 <<        
Switch(config)#snmp-server enable traps vlan-membership
Switch(config)#snmp-server host 130.18.8.12 sysnet
Switch(config)#line con 0
Switch(config-line)#line vty 0 15
Switch(config-line)# access-class 1 in
Switch(config-line)# passw
 << ord Area=l*w
Switch(config-line)# login local
Switch(config-line)# transport input ssh
Switch(config-line)#ntp server 10.92.0.5
Switch(config)#
Switch(config)#end
Switch#
 << 
Apr 28 18:03:40: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
Switch#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
Expect: matched string 1: (config)#
 >> spanning-tree mode mst

 >> spanning-tree etherchannel guard misconfig

 >> spanning-tree mst configuration

 >>  name msstate

 >>  revision 1

 >>  instance 1 vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 63, 70

 >>  instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 160

 >>  instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 230, 232, 242, 246

 >>  instance 1 vlan 256, 611-612, 654, 741, 996, 999

 >>  instance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037, 2039-2040

 >>  instance 2 vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096, 2104, 2110, 2126

 >>  instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 2189, 2194, 2202

 >>  instance 2 vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 2654, 2999

 >>  instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176, 196

 >>  instance 3 vlan 244, 248, 927

 >>  instance 4 vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072, 2108, 2113, 2128

 >>  instance 4 vlan 2144, 2176, 2196, 2244, 2248, 2927

 >>  instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 228

 >>  instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216, 2228

 >>  instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116, 124

 >>  instance 7 vlan 172, 186, 192, 204-208, 210, 240-241, 251-252, 630, 928

 >>  instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082, 2084

 >>  instance 8 vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208, 2210

 >>  instance 8 vlan 2240-2241, 2251-2252, 2630, 2928

 >>  instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102, 112

 >>  instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 500, 505, 510-511

 >>  instance 9 vlan 522, 551-570, 603, 629, 633, 742, 802, 926, 929

 >>  instance 10 vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 2057, 2062, 2068

 >>  instance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148, 2158

 >>  instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522, 2603, 2629, 2633

 >>  instance 10 vlan 2802, 2926, 2929

 >>  instance 11 vlan 8, 43, 52, 146, 156-157, 180, 200, 218

 >>  instance 12 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180, 2200, 2218

 >> 

 >> end

Expect: searching for 1 strs:  :Configured
 << spanning-tree mode mst
Switch(config)#spanning-tree etherchannel guard misconfig
Switch(config)#spanning-tree mst configuration
Switch(config-mst)# name msstate
Switch(config-mst)# revision 1
Switch(config-mst)# instance 1 vlan 2, 7, 11, 20, 22, 24, 
 << 31, 35, 37, 39-40, $ vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40, 5         0, 60, 63, 11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 
 << 63,          70
Switch(config-mst)# instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 1$ vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 14         0, 152, 1
 << 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 16         0
Switch(config-mst)# instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 23$ vlan 162-1
 << 63, 168, 189, 194, 202, 220, 222, 230         , 232, 24163, 168, 189, 194, 202, 220, 222, 230, 232, 242         , 246
Switch(config-mst)# instance 1 vlan 256, 611-612, 654, 741, 9
 << 96, 999
Switch(config-mst)# instance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031,$ vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031,          2035, 203
 << , 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037         , 2039-2011, 2020, 2022, 2024, 2031, 2035, 2037, 2039-204         0
Switch(config-mst)# instance 2 v
 << lan 2050, 2060, 2063, 2070, 2080, 2086, 2096,$ vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096,          2104, 211, 2060, 2063, 2070,
 <<  2080, 2086, 2096, 2104, 2110         , 2126
Switch(config-mst)# instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, $ vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 2         
 << 189, 2194, 2140, 2152, 2160, 2162-2163, 2168, 2189, 2194,          2202
Switch(config-mst)# instance 2 vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 
 << $ vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 2         654, 2999
Switch(config-mst)# instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128$ vlan 42, 51, 59, 64
 << , 66, 69, 72, 108, 113, 128,          144, 17651, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176,          196
Switch(config-mst)# instance 3 vlan 244, 248, 927
Switch(config-mst)# 
 << instance 4 vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072,$ vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072,          2108, 211, 2051,
 <<  2059, 2064, 2066, 2069, 2072, 2108, 2113         , 2128
Switch(config-mst)# instance 4 vlan 2144, 2176, 2196, 2244, 2248, 2927
Switch(config-mst)# instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 2
 << $ vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 22         8
Switch(config-mst)# instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-$ vlan 2016, 2048, 2058, 2088, 
 << 2121, 2131, 2133-2         134, 2216, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216,          2228
Switch(config-mst)# instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97,
 << $ vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97,          114, 116,3-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116,          1
 << 24
Switch(config-mst)# instance 7 vlan 172, 186, 192, 204-208, 210, 240-241, 251$ vlan 172, 186, 192, 204-208, 210, 240-241, 251-         252, 630,
 << 186, 192, 204-208, 210, 240-241, 251-252, 630,          928
Switch(config-mst)# instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, $ vlan 2009, 2033-2034, 2038, 2054
 << , 2056, 2071, 2         075, 2082, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082,          2084
Switch(config-mst)# instance 8 vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192,
 << $ vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192,          2204-2208, 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208,          221
 << 0
Switch(config-mst)# instance 8 vlan 2240-2241, 2251-2252, 2630, 2928
Switch(config-mst)# instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 9$ vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 
 << 98         -99, 102,12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102,          112
Switch(config-mst)# instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 50
 << $ vlan 130, 132, 147-148, 158, 212, 226, 236, 500         , 505, 51132, 147-148, 158, 212, 226, 236, 500, 505, 510         -511
Switch(config-mst
 << )# instance 9 vlan 522, 551-570, 603, 629, 633, 742, 802, 92$ vlan 522, 551-570, 603, 629, 633, 742, 802, 926         , 929
Switch(config-mst)# instance 10 vlan 2004-2005, 2012, 2018-2019
 << , 2032, 2044, $0 vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 2         057, 20624-2005, 2012, 2018-2019, 2032, 2044, 2057, 2062,  
 <<         2068
Switch(config-mst)# instance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132,$0 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132,          2147-2148
 << 6, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148,          2158
Switch(config-mst)# instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522,$0 vlan 221
 << 2, 2236, 2500, 2505, 2510-2511, 2522,          2603, 2622, 2236, 2500, 2505, 2510-2511, 2522, 2603, 2629         , 2633
Switch(config-mst)# instance 10 vlan 2802, 2926, 2929
Swit
 << ch(config-mst)# instance 11 vlan 8, 43, 52, 146, 156-157, 180, 200, 218
Switch(config-mst)# instance 12 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180,$2 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180
 << ,          2200, 2218, 2043, 2052, 2146, 2156-2157, 2180, 2200, 2218         
Switch(config-mst)#
Switch(config-mst)#end
Switch#
Apr 28 18:03:55: %SYS-5-CONFIG_I: Configured fr
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << om console by console
Switch#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
Expect: matched string 1: (config)#
 >> hostname c35s1c.r2220.omac 

Expect: searching for 2 strs:  :# :>
 << hostname c35s1c.r2220.omac 
c35s1c.r2220.omac(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c35s1c.r2220.omac#
 << 
Apr 28 18:04:00: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c35s1c.r2220.omac#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c35s1c.r2220.omac(config)#
Expect: matched string 1: (config)#
 >> snmp-server contact  

Expect: searching for 1 strs:  :#
 << snmp-server contact  
% Incomplete command.

c35s1c.r2220.omac(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c35s1c.r2220.omac#
 << 
Apr 28 18:04:06: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c35s1c.r2220.omac#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c35s1c.r2220.omac(config)#
Expect: matched string 1: (config)#
 >> interface vlan 92

Expect: searching for 1 strs:  :(config-if)#
 << interface vlan 92
c35s1c.r2220.omac(config-if)#
Expect: matched string 1: (config-if)#
 >> ip address 10.92.5.190 255.255.0.0

 >> ip broadcast-address 10.92.255.255

 >> end

Expect: searching for 1 strs:  :Configured
 << ip address 10.92.5.190 255.255.0.0
c35s1c.r2220.omac(config-if)#ip broadcast-address 10.92.255.255
c35s1c.r2220.omac(config-if)#end
c35s1c.r2220.omac#
 << 
Apr 28 18:04:12: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c35s1c.r2220.omac#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c35s1c.r2220.omac(config)#
Expect: matched string 1: (config)#
 >> interface Vlan92

Expect: searching for 1 strs:  :(config-if)#
 << interface Vlan92
c35s1c.r2220.omac(config-if)#
Expect: matched string 1: (config-if)#
 >> ip default-gateway 10.92.0.1

 >> end

Expect: searching for 1 strs:  :Configured
 << ip default-gateway 10.92.0.1
c35s1c.r2220.omac(config)#end
c35s1c.r2220.omac#
Apr 28 18:04:18: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c35s1c.r2220.omac#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c35s1c.r2220.omac(config)#
Expect: matched string 1: (config)#
 >> ip dhcp snooping

Expect: searching for 1 strs:  :#
 << ip dhcp snooping
c35s1c.r2220.omac(config)#
Expect: matched string 1: #
 >> ip dhcp snooping vlan 177

Expect: searching for 1 strs:  :#
 << ip dhcp snooping vlan 177
c35s1c.r2220.omac(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c35s1c.r2220.omac#
Apr 28 18:04:25: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c35s1c.r2220.omac#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c35s1c.r2220.omac(config)#
Expect: matched string 1: (config)#
 >> default interface range gi0/1 - 8 

 >> interface range gi0/1 - 8 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi0/1 - 8 
c35s1c.r2220.omac(config)#interface range gi0/1 - 8 
c35s1c.r2220.omac(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport access vlan 177

 >> switchport mode access

 >> spanning-tree portfast

 >> switchport port-security maximum 2

 >> switchport port-security

 >> switchport port-security aging time 15

 >> switchport port-security violation protect

 >> switchport port-security aging type inactivity

 >> power inline never

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport access vlan 177
c35s1c.r2220.omac(config-if-range)#switchport mode access
c35s1c.r2220.omac(config-if-range)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, concentrato
 << rs, switches, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast will be configured in 8 interfaces due to the range command 
 but will only have effect when the interfaces a
 << re in a non-trunking mode.
c35s1c.r2220.omac(config-if-range)#switchport port-security maximum 2
c35s1c.r2220.omac(config-if-range)#switchport port-security
c35s1c.r2220.omac(config-if-range)#switchport port-security aging time 15
c35s1c.r2220.omac(co
 << nfig-if-range)#switchport port-security violation protect
c35s1c.r2220.omac(config-if-range)#switchport port-security aging type inacti$port-security aging type inactiv         ity
c35s1c.r2220.omac(con
 << fig-if-range)#power inline never
c35s1c.r2220.omac(config-if-range)#end
c35s1c.r2220.omac#
 << 
Apr 28 18:04:38: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c35s1c.r2220.omac#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c35s1c.r2220.omac(config)#
Expect: matched string 1: (config)#
 >> default interface range gi0/1 - 4 

 >> interface range gi0/1 - 4 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi0/1 - 4 
c35s1c.r2220.omac(config)#interface range gi0/1 - 4 
c35s1c.r2220.omac(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport access vlan 673

 >> switchport mode access

 >> spanning-tree portfast

 >> power inline consumption 15400

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport access vlan 673
c35s1c.r2220.omac(config-if-range)#switchport mode access
c35s1c.r2220.omac(config-if-range)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, concentrato
 << rs, switches, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast will be configured in 4 interfaces due to the range command 
 but will only have effect when the interfaces a
 << re in a non-trunking mode.
c35s1c.r2220.omac(config-if-range)#power inline consumption 15400
%CAUTION: Interface Gi0/1: Misconfiguring the 'power inline
 consumption/allocation' command may cause damage to the switch and void
 your warranty. Take prec
 << aution not to oversubscribe the power supply.
 It is recommended to enable power policing if the switch supports it.
 Refer to documentation.

%CAUTION: Interface Gi0/2: Misconfiguring the 'power inline
 consumption/allocation' command may cause dama
 << ge to the switch and void
 your warranty. Take precaution not to oversubscribe the power supply.
 It is recommended to enable power policing if the switch supports it.
 Refer to documentation.

%CAUTION: Interface Gi0/3: Misconfiguring the 'power inl
 << ine
 consumption/allocation' command may cause damage to the switch and void
 your warranty. Take precaution not to oversubscribe the power supply.
 It is recommended to enable power policing if the switch supports it.
 Refer to documentation.

%CAU
 << TION: Interface Gi0/4: Misconfiguring the 'power inline
 consumption/allocation' command may cause damage to the switch and void
 your warranty. Take precaution not to oversubscribe the power supply.
 It is recommended to enable power policing if the s
 << witch supports it.
 Refer to documentation.

c35s1c.r2220.omac(config-if-range)#end
c35s1c.r2220.omac#
Apr 28 18:04:50: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c35s1c.r2220.omac#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c35s1c.r2220.omac(config)#
Expect: matched string 1: (config)#
 >> default interface gi0/5 

 >> interface gi0/5 

Expect: searching for 1 strs:  :(config-if)#
 << default interface gi0/5 
Interface GigabitEthernet0/5 set to default configuration
c35s1c.r2220.omac(config)#interface gi0/5 
c35s1c.r2220.omac(config-if)#
Expect: matched string 1: (config-if)#
 >> switchport access vlan 28

 >> switchport mode access

 >> spanning-tree portfast

 >> power inline consumption 15400

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport access vlan 28
c35s1c.r2220.omac(config-if)#switchport mode access
c35s1c.r2220.omac(config-if)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, concentrators, switches,
 <<  bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast has been configured on GigabitEthernet0/5 but will only
 have effect when the interface is in a non-trunking mode.
c35s1c
 << .r2220.omac(config-if)#power inline consumption 15400
%CAUTION: Interface Gi0/5: Misconfiguring the 'power inline
 consumption/allocation' command may cause damage to the switch and void
 your warranty. Take precaution not to oversubscribe the power su
 << pply.
 It is recommended to enable power policing if the switch supports it.
 Refer to documentation.

c35s1c.r2220.omac(config-if)#end
c35s1c.r2220.omac#
 << 
Apr 28 18:04:56: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c35s1c.r2220.omac#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c35s1c.r2220.omac(config)#
Expect: matched string 1: (config)#
 >> default interface gi0/8 

 >> interface gi0/8 

Expect: searching for 1 strs:  :(config-if)#
 << default interface gi0/8 
Interface GigabitEthernet0/8 set to default configuration
c35s1c.r2220.omac(config)#interface gi0/8 
c35s1c.r2220.omac(config-if)#
Expect: matched string 1: (config-if)#
 >> switchport access vlan 91

 >> switchport mode access

 >> spanning-tree portfast

 >> power inline consumption 15400

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport access vlan 91
c35s1c.r2220.omac(config-if)#switchport mode access
c35s1c.r2220.omac(config-if)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, concentrators, switches,
 <<  bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast has been configured on GigabitEthernet0/8 but will only
 have effect when the interface is in a non-trunking mode.
c35s1c
 << .r2220.omac(config-if)#power inline consumption 15400
%CAUTION: Interface Gi0/8: Misconfiguring the 'power inline
 consumption/allocation' command may cause damage to the switch and void
 your warranty. Take precaution not to oversubscribe the power su
 << pply.
 It is recommended to enable power policing if the switch supports it.
 Refer to documentation.

c35s1c.r2220.omac(config-if)#end
c35s1c.r2220.omac#
 << 
Apr 28 18:05:03: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c35s1c.r2220.omac#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c35s1c.r2220.omac(config)#
Expect: matched string 1: (config)#
 >> default interface range gi0/9 - 12 

 >> interface range gi0/9 - 12 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi0/9 - 12 
c35s1c.r2220.omac(config)#interface range gi0/9 - 12 
c35s1c.r2220.omac(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport mode trunk

 >> switchport trunk native vlan 92

 >> ip dhcp snooping trust

 >> no keepalive

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport mode trunk
c35s1c.r2220.omac(config-if-range)#switchport trunk native vlan 92
c35s1c.r2220.omac(config-if-range)#ip dhcp snooping trust
c35s1c.r2220.omac(config-if-range)#no keepalive
c35s1c.r2220.omac(config-if-range)#end
c35s1c.r2220.oma
 << c#
 << 
Apr 28 18:05:15: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c35s1c.r2220.omac#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c35s1c.r2220.omac(config)#
Expect: matched string 1: (config)#
 >> crypto key generate rsa

 >> no

 >> 2048

Expect: searching for 2 strs:  :OK :(config)#
 << crypto key generate rsa
The name for the keys will be: c35s1c.r2220.omac.mgmt.msstate.edu
Choose the size of the key modulus in the range of 360 to 4096 for your
  General Purpose Keys. Choosing a key modulus greater than 512 may take
  a few minutes.
 << 

How many bits in the modulus [512]: no
% A decimal number between 360 and 4096.
How many bits in the modulus [512]: 2048
% Generating 2048 bit RSA keys, keys will be non-exportable...
 << 
 << 
 << 
 << 
 << 
 << 
[OK] (elapsed time was 6 seconds)

c35s1c.r2220.omac(config)#
Apr 28 18:05:35: %SSH-5-ENABLED: SSH 1.99 has been enabled
Expect: matched string 1: OK
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c35s1c.r2220.omac#
 << 
Apr 28 18:05:38: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> write mem

Expect: searching for 2 strs:  :# :>
 << 
c35s1c.r2220.omac#write mem
Building configuration...
[OK]
c35s1c.r2220.omac#
Expect: matched string 1: #
 >> 
Expect: searching for 2 strs:  :# :>
 << 
c35s1c.r2220.omac#
c35s1c.r2220.omac#
Expect: matched string 1: #
 >> sh run

Expect: searching for 2 strs:  :# :>
 << sh run
Building configuration...

Current configuration : 7801 bytes
!
! Last configuration change at 18:05:38 CDT Fri Apr 28 2017
! NVRAM config last updated at 18:05:41 CDT Fri Apr 28 2017
!
version 15.2
no service pad
service timestamps debug
 <<  datetime localtime
service timestamps log datetime localtime
service password-encryption
!
hostname c35s1c.r2220.omac
!
boot-start-marker
boot-end-marker
!
logging buffered informational
enable secret 5 $1$ASPD$gSpzUVdj3RiJQR3SAOh2s0
enable pa
 << ssword 7 002501030506074C18
!
username root privilege 15 secret 5 $1$0P9E$9QGEgxg.ZvzaadvaB3x2C.
no aaa new-model
clock summer-time CDT recurring
system mtu routing 1500
!
!
!
!
!
!
ip dhcp snooping vlan 177
ip dhcp snooping
ip domain-name m
 << gmt.msstate.edu
ip name-server 130.18.80.13
ip name-server 130.18.80.12
!
!
!
!
!
!
!
crypto pki trustpoint TP-self-signed-2494998912
 enrollment selfsigned
 subject-name cn=IOS-Self-Signed-Certificate-2494998912
 revocation-check none
 rsak
 << eypair TP-self-signed-2494998912
!
!
crypto pki certificate chain TP-self-signed-2494998912
 certificate self-signed 01
  	quit
!
spanning-tree mode mst
spanning-tree portfast edge bpduguard default
spanning-tree extend system-id
!
spanning-tre
 << e mst configuration
 name msstate
 revision 1
 instance 1 vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 63, 70
 instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 160
 instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 230,
 <<  232, 242, 246
 instance 1 vlan 256, 611-612, 654, 741, 996, 999
 instance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037, 2039-2040
 instance 2 vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096, 2104, 2110, 2126
 instance 2 vlan 2136, 2140, 
 << 2152, 2160, 2162-2163, 2168, 2189, 2194, 2202
 instance 2 vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 2654, 2999
 instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176, 196
 instance 3 vlan 244, 248, 927
 instance 4 vlan 2042, 2051, 20
 << 59, 2064, 2066, 2069, 2072, 2108, 2113, 2128
 instance 4 vlan 2144, 2176, 2196, 2244, 2248, 2927
 instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 228
 instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216, 2228
 instance 7 vlan 9
 << , 33-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116, 124
 instance 7 vlan 172, 186, 192, 204-208, 210, 240-241, 251-252, 630, 928
 instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082, 2084
 instance 8 vlan 2097, 2114, 2116, 2124, 2172, 21
 << 86, 2192, 2204-2208, 2210
 instance 8 vlan 2240-2241, 2251-2252, 2630, 2928
 instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102, 112
 instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 500, 505, 510-511
 instance 9 vlan 522, 551-57
 << 0, 603, 629, 633, 742, 802, 926, 929
 instance 10 vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 2057, 2062, 2068
 instance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148, 2158
 instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522, 2603, 
 << 2629, 2633
 instance 10 vlan 2802, 2926, 2929
 instance 11 vlan 8, 43, 52, 146, 156-157, 180, 200, 218
 instance 12 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180, 2200, 2218
!
errdisable recovery cause udld
errdisable recovery cause bpduguard
errdis
 << able recovery cause security-violation
errdisable recovery cause channel-misconfig
errdisable recovery cause pagp-flap
errdisable recovery cause dtp-flap
errdisable recovery cause link-flap
errdisable recovery cause sfp-config-mismatch
errdisable re
 << covery cause gbic-invalid
errdisable recovery cause l2ptguard
errdisable recovery cause psecure-violation
errdisable recovery cause port-mode-failure
errdisable recovery cause dhcp-rate-limit
errdisable recovery cause pppoe-ia-rate-limit
errdisable 
 << recovery cause mac-limit
errdisable recovery cause vmps
errdisable recovery cause storm-control
errdisable recovery cause inline-power
errdisable recovery cause arp-inspection
errdisable recovery cause loopback
errdisable recovery cause small-frame
 << 
errdisable recovery cause psp
errdisable recovery interval 1800
!
!
!
!
vlan internal allocation policy ascending
!
!
! 
!
!
!
!
!
!
!
!
!
interface GigabitEthernet0/1
 switchport access vlan 673
 switchport mode access
 power inlin
 << e consumption 15400
 spanning-tree portfast edge
!
interface GigabitEthernet0/2
 switchport access vlan 673
 switchport mode access
 power inline consumption 15400
 spanning-tree portfast edge
!
interface GigabitEthernet0/3
 switchport access vl
 << an 673
 switchport mode access
 power inline consumption 15400
 spanning-tree portfast edge
!
interface GigabitEthernet0/4
 switchport access vlan 673
 switchport mode access
 power inline consumption 15400
 spanning-tree portfast edge
!
interf
 << ace GigabitEthernet0/5
 switchport access vlan 28
 switchport mode access
 power inline consumption 15400
 spanning-tree portfast edge
!
interface GigabitEthernet0/6
 switchport access vlan 177
 switchport mode access
 switchport port-security ma
 << ximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast edge
!
interface GigabitEthernet0/7

 <<  switchport access vlan 177
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 p
 << ower inline never
 spanning-tree portfast edge
!
interface GigabitEthernet0/8
 switchport access vlan 91
 switchport mode access
 power inline consumption 15400
 spanning-tree portfast edge
!
interface GigabitEthernet0/9
 switchport trunk native
 <<  vlan 92
 switchport mode trunk
 no keepalive
 ip dhcp snooping trust
!
interface GigabitEthernet0/10
 switchport trunk native vlan 92
 switchport mode trunk
 no keepalive
 ip dhcp snooping trust
!
interface GigabitEthernet0/11
 switchport tru
 << nk native vlan 92
 switchport mode trunk
 ip dhcp snooping trust
!
interface GigabitEthernet0/12
 switchport trunk native vlan 92
 switchport mode trunk
 ip dhcp snooping trust
!
interface Vlan1
 no ip address
 no ip route-cache
!
interface V
 << lan92
 ip address 10.92.5.190 255.255.0.0
 ip broadcast-address 10.92.255.255
!
ip default-gateway 10.92.0.1
ip forward-protocol nd
no ip http server
no ip http secure-server
!
!
!
logging facility local1
logging host 130.18.8.12
access-list 
 << 1 permit 130.18.8.0 0.0.0.255
access-list 1 permit 10.93.0.0 0.0.255.255
access-list 1 permit 130.18.1.0 0.0.0.255
!
snmp-server community sysnet RO 1
snmp-server community c2-b2=a2 RW 1
snmp-server enable traps snmp authentication linkdown linkup c
 << oldstart warmstart
snmp-server enable traps transceiver all
snmp-server enable traps tty
snmp-server enable traps cluster
snmp-server enable traps config-copy
snmp-server enable traps config
snmp-server enable traps config-ctid
snmp-server enable t
 << raps entity
snmp-server enable traps power-ethernet police
snmp-server enable traps cpu threshold
snmp-server enable traps rep
snmp-server enable traps bridge newroot topologychange
snmp-server enable traps stpx inconsistency root-inconsistency loop-
 << inconsistency
snmp-server enable traps syslog
snmp-server enable traps vtp
snmp-server enable traps vlancreate
snmp-server enable traps vlandelete
snmp-server enable traps flash insertion removal
snmp-server enable traps port-security
snmp-server e
 << nable traps envmon fan shutdown supply temperature status
snmp-server enable traps errdisable
snmp-server enable traps mac-notification change move threshold
snmp-server enable traps vlan-membership
snmp-server host 130.18.8.12 sysnet 
!
line con 0
 << 
line vty 0 4
 access-class 1 in
 password 7 106F1B1C044A1E411B
 login local
 transport input ssh
line vty 5 15
 access-class 1 in
 password 7 106F1B1C044A1E411B
 login local
 transport input ssh
!
ntp server 10.92.0.5
!
end

c35s1c.r2220.o
 << mac#
Expect: matched string 1: #
 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c35s1c.r2220.omac(config)#
Expect: matched string 1: (config)#
 >> no service pad

 >> service timestamps debug datetime localtime

 >> service timestamps log datetime localtime

 >> service password-encryption

 >> logging buffered informational

 >> enable secret Area=l*w

 >> enable password Area=l*w

 >> username root privilege 15 secret Area=l*w

 >> no aaa new-model

 >> clock timezone CST -6.0

 >> clock summer-time CDT recurring

 >> system mtu routing 1500

 >> ip subnet-zero

 >> ip domain-name mgmt.msstate.edu

 >> ip name-server 130.18.80.13

 >> ip name-server 130.18.80.12

 >> vtp domain vtp01.mgmt.msstate.edu

 >> vtp mode client

 >> crypto pki trustpoint TP-self-signed-2494998912

 >>  enrollment selfsigned

 >>  subject-name cn=IOS-Self-Signed-Certificate-2494998912

 >>  revocation-check none

 >>  rsakeypair TP-self-signed-2494998912

 >> crypto pki certificate chain TP-self-signed-2494998912

 >>  certificate self-signed 01 nvram:IOS-Self-Sig#3232.cer

 >> spanning-tree portfast bpduguard default

 >> spanning-tree extend system-id

 >> vlan internal allocation policy ascending

 >> errdisable recovery cause all

 >> errdisable recovery interval 1800

 >> interface Vlan1

 >>  no ip address

 >>  no ip route-cache

 >> interface Vlan92

 >> no ip http server

 >> no ip http secure-server

 >> logging facility local1

 >> logging 130.18.8.12

 >> sccess-list 1 permit 10.92.0.0 0.0.255.255

 >> access-list 1 permit 130.18.8.0 0.0.0.255

 >> access-list 1 permit 10.93.0.0 0.0.255.255

 >> access-list 1 permit 130.18.1.0 0.0.0.255

 >> snmp-server community sysnet RO 1

 >> snmp-server community c2-b2=a2 RW 1

 >> snmp-server enable traps snmp authentication linkdown linkup coldstart warmstart

 >> snmp-server enable traps transceiver all

 >> snmp-server enable traps tty

 >> snmp-server enable traps cluster

 >> snmp-server enable traps config-copy

 >> snmp-server enable traps config

 >> snmp-server enable traps config-ctid

 >> snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-auth-fail-vlan no-guest-vlan

 >> snmp-server enable traps entity

 >> snmp-server enable traps power-ethernet police

 >> snmp-server enable traps cpu threshold

 >> snmp-server enable traps rep

 >> snmp-server enable traps bridge newroot topologychange

 >> snmp-server enable traps stpx inconsistency root-inconsistency loop-inconsistency

 >> snmp-server enable traps syslog

 >> snmp-server enable traps vtp

 >> snmp-server enable traps vlancreate

 >> snmp-server enable traps vlandelete

 >> snmp-server enable traps flash insertion removal

 >> snmp-server enable traps port-security

 >> snmp-server enable traps envmon fan shutdown supply temperature status

 >> snmp-server enable traps errdisable

 >> snmp-server enable traps mac-notification change move threshold

 >> snmp-server enable traps vlan-membership

 >> snmp-server host 130.18.8.12 sysnet

 >> line con 0

 >> line vty 0 15

 >>  access-class 1 in

 >>  password Area=l*w

 >>  login local

 >>  transport input ssh

 >> ntp server 10.92.0.5

 >> 

 >> end

Expect: searching for 1 strs:  :Configured
 << no service pad
c35s1c.r2220.omac(config)#service timestamps debug datetime localtime
c35s1c.r2220.omac(config)#service timestamps log datetime localtime
c35s1c.r2220.omac(config)#service password-encryption
c35s1c.r2220.omac(config)#logging buffered i
 << nformational
c35s1c.r2220.omac(config)#enable secret Area=l*w
The enable secret you have chosen is the same as your enable password.
This is not recommended.  Re-enter the enable secret.

c35s1c.r2220.omac(config)#enable password Area=l*w
The enable
 <<  password you have chosen is the same as your enable secret.
This is not recommended.  Re-enter the enable password.

c35s1c.r2220.omac(config)#username root privilege 15 secret Area=l*w
c35s1c.r2220.omac(config)#no aaa new-model
c35s1c.r2220.omac(co
 << nfig)#clock timezone CST -6.0
                                             ^
% Invalid input detected at '^' marker.

c35s1c.r2220.omac(config)#clock summer-time CDT recurring
c35s1c.r2220.omac(config)#system mtu routing 1500
c35s1c.r2220.omac(confi
 << g)#ip subnet-zero
c35s1c.r2220.omac(config)#ip domain-name mgmt.msstate.edu
c35s1c.r2220.omac(config)#ip name-server 130.18.80.13
c35s1c.r2220.omac(config)#ip name-server 130.18.80.12
c35s1c.r2220.omac(config)#vtp domain vtp01.mgmt.msstate.edu
Domain
 <<  name already set to vtp01.mgmt.msstate.edu.
c35s1c.r2220.omac(config)#vtp mode client
Device mode already VTP Client for VLANS.
c35s1c.r2220.omac(config)#crypto pki trustpoint TP-self-signed-2494998912
c35s1c.r2220.omac(ca-trustpoint)# enrollment sel
 << fsigned
c35s1c.r2220.omac(ca-trustpoint)# subject-name cn=IOS-Self-Signed-Certificate$me cn=IOS-Self-Signed-Certificate-         249499891Self-Signed-Certific
 << ate-2494998912         
c35s1c.r2220.omac(ca-trustpoint)# revocation-check none
c35s1c.r2220.omac(ca-trustpoint)# rsakeypair TP-self-signed-2494998912
c35s1c.r2220.omac(ca-trustpoint)#crypto pki certificate chain TP-self-signed-
 << $certificate chain TP-self-signed-2         494998912
c35s1c.r2220.omac(config-cert-chain)# certificate self-signed 01 nvram:IOS-Se$e self-signed 01 nvram:IOS-Sel         
 << f-Sig#323ned 01 nvram:IOS-Self-Sig#3232         .cer
c35s1c.r2220.omac(config-cert-chain)#spanning-tree portfast bpduguard default
c35s1c.r2220.omac(config)#spanning-tree extend system-id
c35s1c.r2220
 << .omac(config)#vlan internal allocation policy ascending
c35s1c.r2220.omac(config)#errdisable recovery cause all
c35s1c.r2220.omac(config)#errdisable recovery interval 1800
c35s1c.r2220.omac(config)#
Apr 28 18:08:16: % Multiple self signed certificates
 <<  in config
    certificate for trust point TP-self-signed-2494998912 ignored
interface Vlan1
c35s1c.r2220.omac(config-if)# no ip address
c35s1c.r2220.omac(config-if)# no ip route-cache
c35s1c.r2220.omac(config-if)#interface Vlan92
c35s1c.r2220.omac(
 << config-if)#no ip http server
c35s1c.r2220.omac(config)#no ip http secure-server
c35s1c.r2220.omac(config)#logging facility local1
c35s1c.r2220.omac(config)#logging 130.18.8.12
c35s1c.r2220.omac(config)#sccess-list 1 permit 10.92.0.0 0.0.255.255
     
 <<                        ^
% Invalid input detected at '^' marker.

c35s1c.r2220.omac(config)#access-list 1 permit 130.18.8.0 0.0.0.255
c35s1c.r2220.omac(config)#access-list 1 permit 10.93.0.0 0.0.255.255
c35s1c.r2220.omac(config)#access-list 1 permit 
 << 130.18.1.0 0.0.0.255
c35s1c.r2220.omac(config)#snmp-server community sysnet RO 1
c35s1c.r2220.omac(config)#snmp-server community c2-b2=a2 RW 1
c35s1c.r2220.omac(config)#snmp-server enable traps snmp authentication linkdo
 << $ enable traps snmp authentication linkdow         n linkup aps snmp authentication linkdown linkup c         oldstart 
 << uthentication linkdown linkup coldstart w         armstart
c35s1c.r2220.omac(config)#snmp-server enable traps transceiver all
c35s1c.r2220.omac(config)#snmp-server enable traps tty
c35s1c.r2220.omac(config)#snmp-server enable traps cluster
c
 << 35s1c.r2220.omac(config)#snmp-server enable traps config-copy
c35s1c.r2220.omac(config)#snmp-server enable traps config
c35s1c.r2220.omac(config)#snmp-server enable traps config-ctid
c35s1c.r2220.omac(config)#snmp-server enable traps dot1x auth-fail-vl
 << an guest$ enable traps dot1x auth-fail-vlan guest-         vlan no-aaps dot1x auth-fail-vlan guest-vlan no-au         th-fail-v
 << uth-fail-vlan guest-vlan no-auth-fail-vl         an no-guevlan guest-vlan no-auth-fail-vlan no-gues         t-vlan
snmp-server enable traps dot1x 
 << auth-fail-vlan guest-vlan no-auth-fail-vlan no-gu                         ^est-vlan

% Invalid input detected at '^' marker.

c35s1c.r2220.omac(config)#snmp-server enable traps entity
c35s1c.r2220.omac(config)#snmp-server enable traps power-ethernet 
 << police
c35s1c.r2220.omac(config)#snmp-server enable traps cpu threshold
c35s1c.r2220.omac(config)#snmp-server enable traps rep
c35s1c.r2220.omac(config)#snmp-server enable traps bridge newroot topologycha
 << $ enable traps bridge newroot topologychan         ge
c35s1c.r2220.omac(config)#snmp-server enable traps stpx inconsistency root-in$ enable traps stpx inconsistency root-inc         
 << onsistencaps stpx inconsistency root-inconsistency          loop-incnconsistency root-inconsistency loop-inco         nsistency
c35s1c.r
 << 2220.omac(config)#snmp-server enable traps syslog
c35s1c.r2220.omac(config)#snmp-server enable traps vtp
c35s1c.r2220.omac(config)#snmp-server enable traps vlancreate
c35s1c.r2220.omac(config)#snmp-server enable traps vlandelete
c35s1c.r2220.omac(conf
 << ig)#snmp-server enable traps flash insertion removal
c35s1c.r2220.omac(config)#snmp-server enable traps port-security
c35s1c.r2220.omac(config)#snmp-server enable traps envmon fan shutdown supply$ enabl
 << e traps envmon fan shutdown supply          temperatuaps envmon fan shutdown supply temperatur         e status
c35s1c.r2220.omac(config)#snmp-server enable traps errdisable
c35s1c.r222
 << 0.omac(config)#snmp-server enable traps mac-notification change mo$ enable traps mac-notification change mov         e threshoaps mac-notificatio
 << n change move threshol         d
c35s1c.r2220.omac(config)#snmp-server enable traps vlan-membership
c35s1c.r2220.omac(config)#snmp-server host 130.18.8.12 sysnet
c35s1c.r2220.omac(config)#line con 0
c35s1c.r2220.omac(config-line)#line vty 0 1
 << 5
c35s1c.r2220.omac(config-line)# access-class 1 in
c35s1c.r2220.omac(config-line)# password Area=l*w
c35s1c.r2220.omac(config-line)# login local
c35s1c.r2220.omac(config-line)# transport input ssh
c35s1c.r2220.omac(config-line)#ntp server 10.92.0.5
 << 
c35s1c.r2220.omac(config)#
c35s1c.r2220.omac(config)#end
c35s1c.r2220.omac#
 << 
Apr 28 18:08:27: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c35s1c.r2220.omac#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c35s1c.r2220.omac(config)#
Expect: matched string 1: (config)#
 >> spanning-tree mode mst

 >> spanning-tree etherchannel guard misconfig

 >> spanning-tree mst configuration

 >>  name msstate

 >>  revision 1

 >>  instance 1 vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 63, 70

 >>  instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 160

 >>  instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 230, 232, 242, 246

 >>  instance 1 vlan 256, 611-612, 654, 741, 996, 999

 >>  instance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037, 2039-2040

 >>  instance 2 vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096, 2104, 2110, 2126

 >>  instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 2189, 2194, 2202

 >>  instance 2 vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 2654, 2999

 >>  instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176, 196

 >>  instance 3 vlan 244, 248, 927

 >>  instance 4 vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072, 2108, 2113, 2128

 >>  instance 4 vlan 2144, 2176, 2196, 2244, 2248, 2927

 >>  instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 228

 >>  instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216, 2228

 >>  instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116, 124

 >>  instance 7 vlan 172, 186, 192, 204-208, 210, 240-241, 251-252, 630, 928

 >>  instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082, 2084

 >>  instance 8 vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208, 2210

 >>  instance 8 vlan 2240-2241, 2251-2252, 2630, 2928

 >>  instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102, 112

 >>  instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 500, 505, 510-511

 >>  instance 9 vlan 522, 551-570, 603, 629, 633, 742, 802, 926, 929

 >>  instance 10 vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 2057, 2062, 2068

 >>  instance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148, 2158

 >>  instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522, 2603, 2629, 2633

 >>  instance 10 vlan 2802, 2926, 2929

 >>  instance 11 vlan 8, 43, 52, 146, 156-157, 180, 200, 218

 >>  instance 12 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180, 2200, 2218

 >> 

 >> end

Expect: searching for 1 strs:  :Configured
 << spanning-tree mode mst
c35s1c.r2220.omac(config)#spanning-tree etherchannel guard misconfig
c35s1c.r2220.omac(config)#spanning-tree mst configuration
c35s1c.r2220.omac(config-mst)# name msstate
c35s1c.r2220.omac(config-mst)# revision 1
c35s1c.r2220.o
 << mac(config-mst)# instance 1 vlan 2, 7, 11, 20, 22, 24, 31, 35, $ vlan 2, 7, 11, 20, 22, 24, 31, 35, 3         7, 39-40,, 11, 20, 22, 24, 31, 35, 37, 39-4
 << 0,          50, 60, 622, 24, 31, 35, 37, 39-40, 50, 60, 63         , 70
c35s1c.r2220.omac(config-mst)# instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 
 << $ vlan 78, 80, 86, 91, 96, 104, 110, 1         26, 136, 80, 86, 91, 96, 104, 110, 126, 136, 1         40, 152, , 96, 104, 110, 126, 136, 14
 << 0, 152, 1         60
c35s1c.r2220.omac(config-mst)# instance 1 vlan 162-163, 168, 189, 194, 202, 2$ vlan 162-163, 168, 189, 194, 202, 22         0, 222, 2
 << 163, 168, 189, 194, 202, 220, 222, 23         0, 232, 289, 194, 202, 220, 222, 230, 232, 24         2, 246
c35s1c.r2220.omac(config-mst)# instance 1 vlan 256, 611-612, 654, 741, 99
 << 6, 9$ vlan 256, 611-612, 654, 741, 996, 99         9
c35s1c.r2220.omac(config-mst)# instance 2 vlan 2002, 2007, 2011, 2020, 2022, $ vlan 2002, 2007, 20
 << 11, 2020, 2022, 2         024, 2031, 2007, 2011, 2020, 2022, 2024, 2031,          2035, 2011, 2020, 2022, 2024, 2031, 2035, 203         
 << 7, 2039-22022, 2024, 2031, 2035, 2037, 2039-20         40
c35s1c.r2220.omac(config-mst)# instance 2 vlan 2050, 2060, 2063, 2070, 2080, $ vlan 2050, 2060
 << , 2063, 2070, 2080, 2         086, 2096, 2060, 2063, 2070, 2080, 2086, 2096,          2104, 2163, 2070, 2080, 2086, 2096, 2104, 211         
 << 0, 2126
c35s1c.r2220.omac(config-mst)# instance 2 vlan 2136, 2140, 2152, 2160, 2162-2$ vlan 2136, 2140, 2152, 2160, 2162-21         63, 2168,, 2140,
 <<  2152, 2160, 2162-2163, 2168,          2189, 21952, 2160, 2162-2163, 2168, 2189, 2194         , 2202
c35s1c.r2220.omac(config-mst)# instance 2 vlan 2220, 2222, 2232, 2242, 2246, 
 << $ vlan 2220, 2222, 2232, 2242, 2246, 2         611-2612,, 2222, 2232, 2242, 2246, 2611-2612,          2654, 299
 << 32, 2242, 2246, 2611-2612, 2654, 2999         
c35s1c.r2220.omac(config-mst)# instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 10$ vlan 42, 51, 59, 64, 66, 69, 72, 108         , 113, 12
 << 51, 59, 64, 66, 69, 72, 108, 113, 128         , 144, 17, 66, 69, 72, 108, 113, 128, 144, 176         , 196
c35s1c.r2220.omac(config-mst)# instance 3 vla
 << n 244, 248, 927
c35s1c.r2220.omac(config-mst)# instance 4 vlan 2042, 2051, 2059, 2064, 2066, $ vlan 2042, 2051, 2059, 2064, 2066, 2         069, 2072, 2
 << 051, 2059, 2064, 2066, 2069, 2072,          2108, 2159, 2064, 2066, 2069, 2072, 2108, 211         3, 2128
c35s1c.r2220.omac(config-mst)# instance 4 vlan 2144, 2176, 2196, 2244, 2248, 
 << $ vlan 2144, 2176, 2196, 2244, 2248, 2         927
c35s1c.r2220.omac(config-mst)# instance 5 vlan 16, 48, 58, 88, 121, 131, 133-$ vlan 16, 48, 58, 88, 121, 13
 << 1, 133-1         34, 216, 48, 58, 88, 121, 131, 133-134, 216, 2         28
c35s1c.r2220.omac(config-mst)# instance 6 vlan 2016, 2048, 2058, 2088, 2121, 
 << $ vlan 2016, 2048, 2058, 2088, 2121, 2         131, 2133, 2048, 2058, 2088, 2121, 2131, 2133-         2134, 22158, 2088, 2121, 2131, 213
 << 3-2134, 2216         , 2228
c35s1c.r2220.omac(config-mst)# instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, $ vlan 9, 33-34, 38, 54, 56, 71, 75, 8         2, 84, 97
 << 3-34, 38, 54, 56, 71, 75, 82, 84, 97,          114, 11654, 56, 71, 75, 82, 84, 97, 114, 116,          124
c35s1c.r2220.omac(config-mst)# instance 7 vlan 172, 186, 192, 204-
 << 208, 210, 2$ vlan 172, 186, 192, 204-208, 210, 24         0-241, 25186, 192, 204-208, 210, 240-241, 251         -252, 630
 << 204-208, 210, 240-241, 251-252, 630,          928
c35s1c.r2220.omac(config-mst)# instance 8 vlan 2009, 2033-2034, 2038, 2054, 2$ vlan 2009, 2033-2034, 2038, 2054, 20         
 << 56, 2071,, 2033-2034, 2038, 2054, 2056, 2071,          2075, 2084, 2038, 2054, 2056, 2071, 2075, 2082         , 2084
c35s1c.r2220.omac(con
 << fig-mst)# instance 8 vlan 2097, 2114, 2116, 2124, 2172, $ vlan 2097, 2114, 2116, 2124, 2172, 2         186, 2192, 2114, 2116, 2124, 2172, 2186, 2192,    
 <<       2204-22016, 2124, 2172, 2186, 2192, 2204-2208         , 2210
c35s1c.r2220.omac(config-mst)# instance 8 vlan 2240-2241, 2251-2252, 2630, 29
 << $ vlan 2240-2241, 2251-2252, 2630, 292         8
c35s1c.r2220.omac(config-mst)# instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62$ vlan 4-5, 12, 18-19, 32, 44, 57, 62,          68, 76, 
 << 12, 18-19, 32, 44, 57, 62, 68, 76, 9         8-99, 102, 32, 44, 57, 62, 68, 76, 98-99, 102,          112
c35s1c.r2220.omac(config-mst)# instance 9 vlan
 <<  130, 132, 147-148, 158, 212, 2$ vlan 130, 132, 147-148, 158, 212, 22         6, 236, 5132, 147-148, 158, 212, 226, 236, 50         0, 505, 5
 << 148, 158, 212, 226, 236, 500, 505, 51         0-511
c35s1c.r2220.omac(config-mst)# instance 9 vlan 522, 551-570, 603, 629, 633, 7$ vlan 522, 551-570, 603, 6
 << 29, 633, 74         2, 802, 9551-570, 603, 629, 633, 742, 802, 92         6, 929
c35s1c.r2220.omac(config-mst)# instance 10 vlan 2004-2005, 2012, 2018-2019, 2
 << $0 vlan 2004-2005, 2012, 2018-2019, 20         32, 2044,4-2005, 2012, 2018-2019, 2032, 2044,          2057, 20612, 2018-2019, 2032,
 <<  2044, 2057, 2062         , 2068
c35s1c.r2220.omac(config-mst)# instance 10 vlan 2076, 2098-2099, 2102, 2112, $0 vlan 2076, 2098-2099, 2102, 2112, 2         130, 2132
 << 6, 2098-2099, 2102, 2112, 2130, 2132,          2147-21499, 2102, 2112, 2130, 2132, 2147-2148         , 2158
c35s1c.r2220.omac(config-mst)# instance 10 vlan 2212, 2236,
 <<  2500, 2505, 2510-$0 vlan 2212, 2236, 2500, 2505, 2510-2         511, 25222, 2236, 2500, 2505, 2510-2511, 2522,          2603, 26
 << 500, 2505, 2510-2511, 2522, 2603, 262         9, 2633
c35s1c.r2220.omac(config-mst)# instance 10 vlan 2802, 2926, 2929
c35s1c.r2220.omac(config-mst)# instance 11 vlan 8, 43, 52, 146, 156-157, 180,
 << $1 vlan 8, 43, 52, 146, 156-157, 180,          200, 218
c35s1c.r2220.omac(config-mst)# instance 12 vlan 2008, 2043, 2052, 2146, 2156-$2 vlan 2008, 2043, 2052, 2146, 215
 << 6-2         157, 21808, 2043, 2052, 2146, 2156-2157, 2180,          2200, 22052, 2146, 2156-2157, 2180, 2200, 221         8
c35s1c.r222
 << 0.omac(config-mst)#
c35s1c.r2220.omac(config-mst)#end
c35s1c.r2220.omac#
 << 
Apr 28 18:08:45: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c35s1c.r2220.omac#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c35s1c.r2220.omac(config)#
Expect: matched string 1: (config)#
 >> hostname c35s1c.r2220.omac 

Expect: searching for 2 strs:  :# :>
 << hostname c35s1c.r2220.omac 
c35s1c.r2220.omac(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c35s1c.r2220.omac#
 << 
Apr 28 18:08:52: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c35s1c.r2220.omac#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c35s1c.r2220.omac(config)#
Expect: matched string 1: (config)#
 >> snmp-server contact  

Expect: searching for 1 strs:  :#
 << snmp-server contact  
% Incomplete command.

c35s1c.r2220.omac(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c35s1c.r2220.omac#
 << 
Apr 28 18:08:58: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c35s1c.r2220.omac#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c35s1c.r2220.omac(config)#
Expect: matched string 1: (config)#
 >> interface vlan 92

Expect: searching for 1 strs:  :(config-if)#
 << interface vlan 92
c35s1c.r2220.omac(config-if)#
Expect: matched string 1: (config-if)#
 >> ip address 10.92.5.190 255.255.0.0

 >> ip broadcast-address 10.92.255.255

 >> end

Expect: searching for 1 strs:  :Configured
 << ip address 10.92.5.190 255.255.0.0
c35s1c.r2220.omac(config-if)#ip broadcast-address 10.92.255.255
c35s1c.r2220.omac(config-if)#end
c35s1c.r2220.omac#
 << 
Apr 28 18:09:04: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c35s1c.r2220.omac#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c35s1c.r2220.omac(config)#
Expect: matched string 1: (config)#
 >> interface Vlan92

Expect: searching for 1 strs:  :(config-if)#
 << interface Vlan92
c35s1c.r2220.omac(config-if)#
Expect: matched string 1: (config-if)#
 >> ip default-gateway 10.92.0.1

 >> end

Expect: searching for 1 strs:  :Configured
 << ip default-gateway 10.92.0.1
c35s1c.r2220.omac(config)#end
c35s1c.r2220.omac#
Apr 28 18:09:10: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c35s1c.r2220.omac#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c35s1c.r2220.omac(config)#
Expect: matched string 1: (config)#
 >> ip dhcp snooping

Expect: searching for 1 strs:  :#
 << ip dhcp snooping
c35s1c.r2220.omac(config)#
Expect: matched string 1: #
 >> ip dhcp snooping vlan 177

Expect: searching for 1 strs:  :#
 << ip dhcp snooping vlan 177
c35s1c.r2220.omac(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c35s1c.r2220.omac#
Apr 28 18:09:17: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c35s1c.r2220.omac#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c35s1c.r2220.omac(config)#
Expect: matched string 1: (config)#
 >> default interface range gi0/1 - 8 

 >> interface range gi0/1 - 8 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi0/1 - 8 
c35s1c.r2220.omac(config)#interface range gi0/1 - 8 
c35s1c.r2220.omac(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport access vlan 177

 >> switchport mode access

 >> spanning-tree portfast

 >> switchport port-security maximum 2

 >> switchport port-security

 >> switchport port-security aging time 15

 >> switchport port-security violation protect

 >> switchport port-security aging type inactivity

 >> power inline never

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport access vlan 177
c35s1c.r2220.omac(config-if-range)#switchport mode access
c35s1c.r2220.omac(config-if-range)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, concentrato
 << rs, switches, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast will be configured in 8 interfaces due to the range command 
 but will only have effect when the interfaces a
 << re in a non-trunking mode.
c35s1c.r2220.omac(config-if-range)#switchport port-security maximum 2
c35s1c.r2220.omac(config-if-range)#switchport port-security
c35s1c.r2220.omac(config-if-range)#switchport port-security aging time 15
c35s1c.r2220.omac(co
 << nfig-if-range)#switchport port-security violation protect
c35s1c.r2220.omac(config-if-range)#switchport port-security aging type inacti$port-security aging type inactiv         ity
c35s1c.r2220.omac(con
 << fig-if-range)#power inline never
c35s1c.r2220.omac(config-if-range)#end
c35s1c.r2220.omac#
 << 
Apr 28 18:09:30: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c35s1c.r2220.omac#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c35s1c.r2220.omac(config)#
Expect: matched string 1: (config)#
 >> default interface range gi0/1 - 4 

 >> interface range gi0/1 - 4 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi0/1 - 4 
c35s1c.r2220.omac(config)#interface range gi0/1 - 4 
c35s1c.r2220.omac(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport access vlan 673

 >> switchport mode access

 >> spanning-tree portfast

 >> power inline consumption 15400

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport access vlan 673
c35s1c.r2220.omac(config-if-range)#switchport mode access
c35s1c.r2220.omac(config-if-range)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, concentrato
 << rs, switches, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast will be configured in 4 interfaces due to the range command 
 but will only have effect when the interfaces a
 << re in a non-trunking mode.
c35s1c.r2220.omac(config-if-range)#power inline consumption 15400
%CAUTION: Interface Gi0/1: Misconfiguring the 'power inline
 consumption/allocation' command may cause damage to the switch and void
 your warranty. Take prec
 << aution not to oversubscribe the power supply.
 It is recommended to enable power policing if the switch supports it.
 Refer to documentation.

%CAUTION: Interface Gi0/2: Misconfiguring the 'power inline
 consumption/allocation' command may cause dama
 << ge to the switch and void
 your warranty. Take precaution not to oversubscribe the power supply.
 It is recommended to enable power policing if the switch supports it.
 Refer to documentation.

%CAUTION: Interface Gi0/3: Misconfiguring the 'power inl
 << ine
 consumption/allocation' command may cause damage to the switch and void
 your warranty. Take precaution not to oversubscribe the power supply.
 It is recommended to enable power policing if the switch supports it.
 Refer to documentation.

%CAU
 << TION: Interface Gi0/4: Misconfiguring the 'power inline
 consumption/allocation' command may cause damage to the switch and void
 your warranty. Take precaution not to oversubscribe the power supply.
 It is recommended to enable power policing if the s
 << witch supports it.
 Refer to documentation.

c35s1c.r2220.omac(config-if-range)#end
c35s1c.r2220.omac#
 << 
Apr 28 18:09:42: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c35s1c.r2220.omac#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c35s1c.r2220.omac(config)#
Expect: matched string 1: (config)#
 >> default interface gi0/5 

 >> interface gi0/5 

Expect: searching for 1 strs:  :(config-if)#
 << default interface gi0/5 
Interface GigabitEthernet0/5 set to default configuration
c35s1c.r2220.omac(config)#interface gi0/5 
c35s1c.r2220.omac(config-if)#
Expect: matched string 1: (config-if)#
 >> switchport access vlan 28

 >> switchport mode access

 >> spanning-tree portfast

 >> power inline consumption 15400

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport access vlan 28
c35s1c.r2220.omac(config-if)#switchport mode access
c35s1c.r2220.omac(config-if)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, concentrators, switches,
 <<  bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast has been configured on GigabitEthernet0/5 but will only
 have effect when the interface is in a non-trunking mode.
c35s1c
 << .r2220.omac(config-if)#power inline consumption 15400
%CAUTION: Interface Gi0/5: Misconfiguring the 'power inline
 consumption/allocation' command may cause damage to the switch and void
 your warranty. Take precaution not to oversubscribe the power su
 << pply.
 It is recommended to enable power policing if the switch supports it.
 Refer to documentation.

c35s1c.r2220.omac(config-if)#end
c35s1c.r2220.omac#
 << 
Apr 28 18:09:49: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c35s1c.r2220.omac#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c35s1c.r2220.omac(config)#
Expect: matched string 1: (config)#
 >> default interface gi0/8 

 >> interface gi0/8 

Expect: searching for 1 strs:  :(config-if)#
 << default interface gi0/8 
Interface GigabitEthernet0/8 set to default configuration
c35s1c.r2220.omac(config)#interface gi0/8 
c35s1c.r2220.omac(config-if)#
Expect: matched string 1: (config-if)#
 >> switchport access vlan 91

 >> switchport mode access

 >> spanning-tree portfast

 >> power inline consumption 15400

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport access vlan 91
c35s1c.r2220.omac(config-if)#switchport mode access
c35s1c.r2220.omac(config-if)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, concentrators, switches,
 <<  bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast has been configured on GigabitEthernet0/8 but will only
 have effect when the interface is in a non-trunking mode.
c35s1c
 << .r2220.omac(config-if)#power inline consumption 15400
%CAUTION: Interface Gi0/8: Misconfiguring the 'power inline
 consumption/allocation' command may cause damage to the switch and void
 your warranty. Take precaution not to oversubscribe the power su
 << pply.
 It is recommended to enable power policing if the switch supports it.
 Refer to documentation.

c35s1c.r2220.omac(config-if)#end
c35s1c.r2220.omac#
 << 
Apr 28 18:09:56: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c35s1c.r2220.omac#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c35s1c.r2220.omac(config)#
Expect: matched string 1: (config)#
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c35s1c.r2220.omac#
 << 
Apr 28 18:10:06: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c35s1c.r2220.omac#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c35s1c.r2220.omac(config)#
Expect: matched string 1: (config)#
 >> crypto key generate rsa

 >> no

 >> 2048

Expect: searching for 2 strs:  :OK :(config)#
 << crypto key generate rsa
% You already have RSA keys defined named c35s1c.r2220.omac.mgmt.msstate.edu.
% Do you really want to replace them? [yes/no]: no
c35s1c.r2220.omac(config)#2048
                          ^
% Invalid input detected at '^' marker
Expect: matched string 2: (config)#
 >> end

Expect: searching for 1 strs:  :Configured
 << .

c35s1c.r2220.omac(config)#end
c35s1c.r2220.omac#
 << 
Apr 28 18:10:20: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> write mem

Expect: searching for 2 strs:  :# :>
 << 
c35s1c.r2220.omac#write mem
Building configuration...
[OK]
c35s1c.r2220.omac#
Expect: matched string 1: #
 >> 
Expect: searching for 2 strs:  :# :>
 << 
c35s1c.r2220.omac#
c35s1c.r2220.omac#
Expect: matched string 1: #
 >> sh run

Expect: searching for 2 strs:  :# :>
 << sh run
Building configuration...

Current configuration : 7801 bytes
!
! Last configuration change at 18:10:20 CDT Fri Apr 28 2017
! NVRAM config last updated at 18:10:23 CDT Fri Apr 28 2017
!
version 15.2
no service pad
service timestamps debug
 <<  datetime localtime
service timestamps log datetime localtime
service password-encryption
!
hostname c35s1c.r2220.omac
!
boot-start-marker
boot-end-marker
!
logging buffered informational
enable secret 5 $1$XoOy$e.1CHjmX/wzZPQnVbUTPo.
enable pa
 << ssword 7 08005E4B0844095D05
!
username root privilege 15 secret 5 $1$sXkn$w1I64gpEoAkCfacmnZwmy.
no aaa new-model
clock summer-time CDT recurring
system mtu routing 1500
!
!
!
!
!
!
ip dhcp snooping vlan 177
ip dhcp snooping
ip domain-name m
 << gmt.msstate.edu
ip name-server 130.18.80.13
ip name-server 130.18.80.12
!
!
!
!
!
!
!
crypto pki trustpoint TP-self-signed-2494998912
 enrollment selfsigned
 subject-name cn=IOS-Self-Signed-Certificate-2494998912
 revocation-check none
 rsak
 << eypair TP-self-signed-2494998912
!
!
crypto pki certificate chain TP-self-signed-2494998912
 certificate self-signed 01
  	quit
!
spanning-tree mode mst
spanning-tree portfast edge bpduguard default
spanning-tree extend system-id
!
spanning-tre
 << e mst configuration
 name msstate
 revision 1
 instance 1 vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 63, 70
 instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 160
 instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 230,
 <<  232, 242, 246
 instance 1 vlan 256, 611-612, 654, 741, 996, 999
 instance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037, 2039-2040
 instance 2 vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096, 2104, 2110, 2126
 instance 2 vlan 2136, 2140, 
 << 2152, 2160, 2162-2163, 2168, 2189, 2194, 2202
 instance 2 vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 2654, 2999
 instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176, 196
 instance 3 vlan 244, 248, 927
 instance 4 vlan 2042, 2051, 20
 << 59, 2064, 2066, 2069, 2072, 2108, 2113, 2128
 instance 4 vlan 2144, 2176, 2196, 2244, 2248, 2927
 instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 228
 instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216, 2228
 instance 7 vlan 9
 << , 33-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116, 124
 instance 7 vlan 172, 186, 192, 204-208, 210, 240-241, 251-252, 630, 928
 instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082, 2084
 instance 8 vlan 2097, 2114, 2116, 2124, 2172, 21
 << 86, 2192, 2204-2208, 2210
 instance 8 vlan 2240-2241, 2251-2252, 2630, 2928
 instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102, 112
 instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 500, 505, 510-511
 instance 9 vlan 522, 551-57
 << 0, 603, 629, 633, 742, 802, 926, 929
 instance 10 vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 2057, 2062, 2068
 instance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148, 2158
 instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522, 2603, 
 << 2629, 2633
 instance 10 vlan 2802, 2926, 2929
 instance 11 vlan 8, 43, 52, 146, 156-157, 180, 200, 218
 instance 12 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180, 2200, 2218
!
errdisable recovery cause udld
errdisable recovery cause bpduguard
errdis
 << able recovery cause security-violation
errdisable recovery cause channel-misconfig
errdisable recovery cause pagp-flap
errdisable recovery cause dtp-flap
errdisable recovery cause link-flap
errdisable recovery cause sfp-config-mismatch
errdisable re
 << covery cause gbic-invalid
errdisable recovery cause l2ptguard
errdisable recovery cause psecure-violation
errdisable recovery cause port-mode-failure
errdisable recovery cause dhcp-rate-limit
errdisable recovery cause pppoe-ia-rate-limit
errdisable 
 << recovery cause mac-limit
errdisable recovery cause vmps
errdisable recovery cause storm-control
errdisable recovery cause inline-power
errdisable recovery cause arp-inspection
errdisable recovery cause loopback
errdisable recovery cause small-frame
 << 
errdisable recovery cause psp
errdisable recovery interval 1800
!
!
!
!
vlan internal allocation policy ascending
!
!
! 
!
!
!
!
!
!
!
!
!
interface GigabitEthernet0/1
 switchport access vlan 673
 switchport mode access
 power inlin
 << e consumption 15400
 spanning-tree portfast edge
!
interface GigabitEthernet0/2
 switchport access vlan 673
 switchport mode access
 power inline consumption 15400
 spanning-tree portfast edge
!
interface GigabitEthernet0/3
 switchport access vl
 << an 673
 switchport mode access
 power inline consumption 15400
 spanning-tree portfast edge
!
interface GigabitEthernet0/4
 switchport access vlan 673
 switchport mode access
 power inline consumption 15400
 spanning-tree portfast edge
!
interf
 << ace GigabitEthernet0/5
 switchport access vlan 28
 switchport mode access
 power inline consumption 15400
 spanning-tree portfast edge
!
interface GigabitEthernet0/6
 switchport access vlan 177
 switchport mode access
 switchport port-security ma
 << ximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast edge
!
interface GigabitEthernet0/7

 <<  switchport access vlan 177
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 p
 << ower inline never
 spanning-tree portfast edge
!
interface GigabitEthernet0/8
 switchport access vlan 91
 switchport mode access
 power inline consumption 15400
 spanning-tree portfast edge
!
interface GigabitEthernet0/9
 switchport trunk native
 <<  vlan 92
 switchport mode trunk
 no keepalive
 ip dhcp snooping trust
!
interface GigabitEthernet0/10
 switchport trunk native vlan 92
 switchport mode trunk
 no keepalive
 ip dhcp snooping trust
!
interface GigabitEthernet0/11
 switchport tru
 << nk native vlan 92
 switchport mode trunk
 ip dhcp snooping trust
!
interface GigabitEthernet0/12
 switchport trunk native vlan 92
 switchport mode trunk
 ip dhcp snooping trust
!
interface Vlan1
 no ip address
 no ip route-cache
!
interface V
 << lan92
 ip address 10.92.5.190 255.255.0.0
 ip broadcast-address 10.92.255.255
!
ip default-gateway 10.92.0.1
ip forward-protocol nd
no ip http server
no ip http secure-server
!
!
!
logging facility local1
logging host 130.18.8.12
access-list 
 << 1 permit 130.18.8.0 0.0.0.255
access-list 1 permit 10.93.0.0 0.0.255.255
access-list 1 permit 130.18.1.0 0.0.0.255
!
snmp-server community sysnet RO 1
snmp-server community c2-b2=a2 RW 1
snmp-server enable traps snmp authentication linkdown linkup c
 << oldstart warmstart
snmp-server enable traps transceiver all
snmp-server enable traps tty
snmp-server enable traps cluster
snmp-server enable traps config-copy
snmp-server enable traps config
snmp-server enable traps config-ctid
snmp-server enable t
 << raps entity
snmp-server enable traps power-ethernet police
snmp-server enable traps cpu threshold
snmp-server enable traps rep
snmp-server enable traps bridge newroot topologychange
snmp-server enable traps stpx inconsistency root-inconsistency loop-
 << inconsistency
snmp-server enable traps syslog
snmp-server enable traps vtp
snmp-server enable traps vlancreate
snmp-server enable traps vlandelete
snmp-server enable traps flash insertion removal
snmp-server enable traps port-security
snmp-server e
 << nable traps envmon fan shutdown supply temperature status
snmp-server enable traps errdisable
snmp-server enable traps mac-notification change move threshold
snmp-server enable traps vlan-membership
snmp-server host 130.18.8.12 sysnet 
!
line con 0
 << 
line vty 0 4
 access-class 1 in
 password 7 153319090577276E3F
 login local
 transport input ssh
line vty 5 15
 access-class 1 in
 password 7 153319090577276E3F
 login local
 transport input ssh
!
ntp server 10.92.0.5
!
end

c35s1c.r2220.o
 << mac#
Expect: matched string 1: #
 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c35s1c.r2220.omac(config)#
Expect: matched string 1: (config)#
 >> no service pad

 >> service timestamps debug datetime localtime

 >> service timestamps log datetime localtime

 >> service password-encryption

 >> logging buffered informational

 >> enable secret Area=l*w

 >> enable password Area=l*w

 >> username root privilege 15 secret Area=l*w

 >> no aaa new-model

 >> clock timezone CST -6.0

 >> clock summer-time CDT recurring

 >> system mtu routing 1500

 >> ip subnet-zero

 >> ip domain-name mgmt.msstate.edu

 >> ip name-server 130.18.80.13

 >> ip name-server 130.18.80.12

 >> vtp domain vtp01.mgmt.msstate.edu

 >> vtp mode client

 >> crypto pki trustpoint TP-self-signed-2494998912

 >>  enrollment selfsigned

 >>  subject-name cn=IOS-Self-Signed-Certificate-2494998912

 >>  revocation-check none

 >>  rsakeypair TP-self-signed-2494998912

 >> crypto pki certificate chain TP-self-signed-2494998912

 >>  certificate self-signed 01 nvram:IOS-Self-Sig#3232.cer

 >> spanning-tree portfast bpduguard default

 >> spanning-tree extend system-id

 >> vlan internal allocation policy ascending

 >> errdisable recovery cause all

 >> errdisable recovery interval 1800

 >> interface Vlan1

 >>  no ip address

 >>  no ip route-cache

 >> interface Vlan92

 >> no ip http server

 >> no ip http secure-server

 >> logging facility local1

 >> logging 130.18.8.12

 >> access-list 1 permit 10.92.0.0 0.0.255.255

 >> access-list 1 permit 130.18.8.0 0.0.0.255

 >> access-list 1 permit 10.93.0.0 0.0.255.255

 >> access-list 1 permit 130.18.1.0 0.0.0.255

 >> snmp-server community sysnet RO 1

 >> snmp-server community c2-b2=a2 RW 1

 >> snmp-server enable traps snmp authentication linkdown linkup coldstart warmstart

 >> snmp-server enable traps transceiver all

 >> snmp-server enable traps tty

 >> snmp-server enable traps cluster

 >> snmp-server enable traps config-copy

 >> snmp-server enable traps config

 >> snmp-server enable traps config-ctid

 >> snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-auth-fail-vlan no-guest-vlan

 >> snmp-server enable traps entity

 >> snmp-server enable traps power-ethernet police

 >> snmp-server enable traps cpu threshold

 >> snmp-server enable traps rep

 >> snmp-server enable traps bridge newroot topologychange

 >> snmp-server enable traps stpx inconsistency root-inconsistency loop-inconsistency

 >> snmp-server enable traps syslog

 >> snmp-server enable traps vtp

 >> snmp-server enable traps vlancreate

 >> snmp-server enable traps vlandelete

 >> snmp-server enable traps flash insertion removal

 >> snmp-server enable traps port-security

 >> snmp-server enable traps envmon fan shutdown supply temperature status

 >> snmp-server enable traps errdisable

 >> snmp-server enable traps mac-notification change move threshold

 >> snmp-server enable traps vlan-membership

 >> snmp-server host 130.18.8.12 sysnet

 >> line con 0

 >> line vty 0 15

 >>  access-class 1 in

 >>  password Area=l*w

 >>  login local

 >>  transport input ssh

 >> ntp server 10.92.0.5

 >> 

 >> end

Expect: searching for 1 strs:  :Configured
 << no service pad
c35s1c.r2220.omac(config)#service timestamps debug datetime localtime
c35s1c.r2220.omac(config)#service timestamps log datetime localtime
c35s1c.r2220.omac(config)#service password-encryption
c35s1c.r2220.omac(config)#logging buffered i
 << nformational
c35s1c.r2220.omac(config)#enable secret Area=l*w
The enable secret you have chosen is the same as your enable password.
This is not recommended.  Re-enter the enable secret.

c35s1c.r2220.omac(config)#enable password Area=l*w
The enable
 <<  password you have chosen is the same as your enable secret.
This is not recommended.  Re-enter the enable password.

c35s1c.r2220.omac(config)#username root privilege 15 secret Area=l*w
c35s1c.r2220.omac(config)#no aaa new-model
c35s1c.r2220.omac(co
 << nfig)#clock timezone CST -6.0
                                             ^
% Invalid input detected at '^' marker.

c35s1c.r2220.omac(config)#clock summer-time CDT recurring
c35s1c.r2220.omac(config)#system mtu routing 1500
c35s1c.r2220.omac(confi
 << g)#ip subnet-zero
c35s1c.r2220.omac(config)#ip domain-name mgmt.msstate.edu
c35s1c.r2220.omac(config)#ip name-server 130.18.80.13
c35s1c.r2220.omac(config)#ip name-server 130.18.80.12
c35s1c.r2220.omac(config)#vtp domain vtp01.mgmt.msstate.edu
Domain
 <<  name already set to vtp01.mgmt.msstate.edu.
c35s1c.r2220.omac(config)#vtp mode client
Device mode already VTP Client for VLANS.
c35s1c.r2220.omac(config)#crypto pki trustpoint TP-self-signed-2494998912
c35s1c.r2220.omac(ca-trustpoint)# enrollment sel
 << fsigned
c35s1c.r2220.omac(ca-trustpoint)# subject-name cn=IOS-Self-Signed-Certificate$me cn=IOS-Self-Signed-Certificate-         249499891Self-Signed-Certific
 << ate-2494998912         
c35s1c.r2220.omac(ca-trustpoint)# revocation-check none
c35s1c.r2220.omac(ca-trustpoint)# rsakeypair TP-self-signed-2494998912
c35s1c.r2220.omac(ca-trustpoint)#crypto pki certificate chain TP-self-signed-
 << $certificate chain TP-self-signed-2         494998912
c35s1c.r2220.omac(config-cert-chain)# certificate self-signed 01 nvram:IOS-Se$e self-signed 01 nvram:IOS-Sel         
 << f-Sig#323ned 01 nvram:IOS-Self-Sig#3232         .cer
c35s1c.r2220.omac(config-cert-chain)#spanning-tree portfast bpduguard default
c35s1c.r2220.omac(config)#spanning-tree extend system-id
c35s1c.r2220
 << .omac(config)#vlan internal allocation policy ascending
c35s1c.r2220.omac(config)#errdisable recovery cause all
c35s1c.r2220.omac(config)#errdisable recovery interval 1800
c35s1c.r2220.omac(config)#interface Vlan1
c35s1c.r2220.omac(config-if)# no ip a
 << ddress
c35s1c.r2220.omac(config-if)# no ip route-cache
c35s1c.r2220.omac(config-if)#interface Vlan92
c35s1c.r2220.omac(config-if)#
Apr 28 18:12:28: % Multiple self signed certificates in config
    certificate for trust point TP-self-signed-249499891
 << 2 ignored
no ip http server
c35s1c.r2220.omac(config)#no ip http secure-server
c35s1c.r2220.omac(config)#logging facility local1
c35s1c.r2220.omac(config)#logging 130.18.8.12
c35s1c.r2220.omac(config)#access-list 1 permit 10.92.0.0 0.0.255.255
c35s1
 << c.r2220.omac(config)#access-list 1 permit 130.18.8.0 0.0.0.255
c35s1c.r2220.omac(config)#access-list 1 permit 10.93.0.0 0.0.255.255
c35s1c.r2220.omac(config)#access-list 1 permit 130.18.1.0 0.0.0.255
c35s1c.r2220.omac(config)#snmp-server community sysn
 << et RO 1
c35s1c.r2220.omac(config)#snmp-server community c2-b2=a2 RW 1
c35s1c.r2220.omac(config)#snmp-server enable traps snmp authentication linkdo$ enable traps snmp authentication linkdow         
 << n linkup aps snmp authentication linkdown linkup c         oldstart uthentication linkdown linkup coldstart w         armstart
c35s
 << 1c.r2220.omac(config)#snmp-server enable traps transceiver all
c35s1c.r2220.omac(config)#snmp-server enable traps tty
c35s1c.r2220.omac(config)#snmp-server enable traps cluster
c35s1c.r2220.omac(config)#snmp-server enable traps config-copy
c35s1c.r222
 << 0.omac(config)#snmp-server enable traps config
c35s1c.r2220.omac(config)#snmp-server enable traps config-ctid
c35s1c.r2220.omac(config)#snmp-server enable traps dot1x auth-fail-vlan guest$ enable traps 
 << dot1x auth-fail-vlan guest-         vlan no-aaps dot1x auth-fail-vlan guest-vlan no-au         th-fail-vuth-fail-vlan guest-vlan no-auth-f
 << ail-vl         an no-guevlan guest-vlan no-auth-fail-vlan no-gues         t-vlan
snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-auth-fail-vlan no-gu                         
 << ^est-vlan

% Invalid input detected at '^' marker.

c35s1c.r2220.omac(config)#snmp-server enable traps entity
c35s1c.r2220.omac(config)#snmp-server enable traps power-ethernet police
c35s1c.r2220.omac(config)#snmp-server enable traps cpu threshold

 << c35s1c.r2220.omac(config)#snmp-server enable traps rep
c35s1c.r2220.omac(config)#snmp-server enable traps bridge newroot topologycha$ enable traps bridge newroot topologychan         ge
c35s1c.
 << r2220.omac(config)#snmp-server enable traps stpx inconsistency root-in$ enable traps stpx inconsistency root-inc         onsistencaps stpx incons
 << istency root-inconsistency          loop-incnconsistency root-inconsistency loop-inco         nsistency
c35s1c.r2220.omac(config)#snmp-server enable traps syslog
c35s1c.r2220.omac(confi
 << g)#snmp-server enable traps vtp
c35s1c.r2220.omac(config)#snmp-server enable traps vlancreate
c35s1c.r2220.omac(config)#snmp-server enable traps vlandelete
c35s1c.r2220.omac(config)#snmp-server enable traps flash insertion removal
c35s1c.r2220.omac(co
 << nfig)#snmp-server enable traps port-security
c35s1c.r2220.omac(config)#snmp-server enable traps envmon fan shutdown supply$ enable traps envmon fan shutdown supply          temperatu
 << aps envmon fan shutdown supply temperatur         e status
c35s1c.r2220.omac(config)#snmp-server enable traps errdisable
c35s1c.r2220.omac(config)#snmp-server enable traps mac-notification change mo
 << $ enable traps mac-notification change mov         e threshoaps mac-notification change move threshol         d
c35s1c.r2220.omac(config)#snmp-
 << server enable traps vlan-membership
c35s1c.r2220.omac(config)#snmp-server host 130.18.8.12 sysnet
c35s1c.r2220.omac(config)#line con 0
c35s1c.r2220.omac(config-line)#line vty 0 15
c35s1c.r2220.omac(config-line)# access-class 1 in
c35s1c.r2220.omac(co
 << nfig-line)# password Area=l*w
c35s1c.r2220.omac(config-line)# login local
c35s1c.r2220.omac(config-line)# transport input ssh
c35s1c.r2220.omac(config-line)#ntp server 10.92.0.5
c35s1c.r2220.omac(config)#
c35s1c.r2220.omac(config)#end
c35s1c.r2220.o
 << mac#
 << 
Apr 28 18:12:40: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c35s1c.r2220.omac#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c35s1c.r2220.omac(config)#
Expect: matched string 1: (config)#
 >> spanning-tree mode mst

 >> spanning-tree etherchannel guard misconfig

 >> spanning-tree mst configuration

 >>  name msstate

 >>  revision 1

 >>  instance 1 vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 63, 70

 >>  instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 160

 >>  instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 230, 232, 242, 246

 >>  instance 1 vlan 256, 611-612, 654, 741, 996, 999

 >>  instance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037, 2039-2040

 >>  instance 2 vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096, 2104, 2110, 2126

 >>  instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 2189, 2194, 2202

 >>  instance 2 vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 2654, 2999

 >>  instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176, 196

 >>  instance 3 vlan 244, 248, 927

 >>  instance 4 vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072, 2108, 2113, 2128

 >>  instance 4 vlan 2144, 2176, 2196, 2244, 2248, 2927

 >>  instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 228

 >>  instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216, 2228

 >>  instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116, 124

 >>  instance 7 vlan 172, 186, 192, 204-208, 210, 240-241, 251-252, 630, 928

 >>  instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082, 2084

 >>  instance 8 vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208, 2210

 >>  instance 8 vlan 2240-2241, 2251-2252, 2630, 2928

 >>  instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102, 112

 >>  instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 500, 505, 510-511

 >>  instance 9 vlan 522, 551-570, 603, 629, 633, 742, 802, 926, 929

 >>  instance 10 vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 2057, 2062, 2068

 >>  instance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148, 2158

 >>  instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522, 2603, 2629, 2633

 >>  instance 10 vlan 2802, 2926, 2929

 >>  instance 11 vlan 8, 43, 52, 146, 156-157, 180, 200, 218

 >>  instance 12 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180, 2200, 2218

 >> 

 >> end

Expect: searching for 1 strs:  :Configured
 << spanning-tree mode mst
c35s1c.r2220.omac(config)#spanning-tree etherchannel guard misconfig
c35s1c.r2220.omac(config)#spanning-tree mst configuration
c35s1c.r2220.omac(config-mst)# name msstate
c35s1c.r2220.omac(config-mst)# revision 1
c35s1c.r2220.o
 << mac(config-mst)# instance 1 vlan 2, 7, 11, 20, 22, 24, 31, 35, $ vlan 2, 7, 11, 20, 22, 24, 31, 35, 3         7, 39-40,, 11, 20, 22, 24, 31, 35, 37, 39-4
 << 0,          50, 60, 622, 24, 31, 35, 37, 39-40, 50, 60, 63         , 70
c35s1c.r2220.omac(config-mst)# instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 
 << $ vlan 78, 80, 86, 91, 96, 104, 110, 1         26, 136, 80, 86, 91, 96, 104, 110, 126, 136, 1         40, 152, , 96, 104, 110, 126, 136, 14
 << 0, 152, 1         60
c35s1c.r2220.omac(config-mst)# instance 1 vlan 162-163, 168, 189, 194, 202, 2$ vlan 162-163, 168, 189, 194, 202, 22         0, 222, 2
 << 163, 168, 189, 194, 202, 220, 222, 23         0, 232, 289, 194, 202, 220, 222, 230, 232, 24         2, 246
c35s1c.r2220.omac(config-mst)# instance 1 vlan 256, 611-612, 654, 741, 99
 << 6, 9$ vlan 256, 611-612, 654, 741, 996, 99         9
c35s1c.r2220.omac(config-mst)# instance 2 vlan 2002, 2007, 2011, 2020, 2022, $ vlan 2002, 2007, 20
 << 11, 2020, 2022, 2         024, 2031, 2007, 2011, 2020, 2022, 2024, 2031,          2035, 2011, 2020, 2022, 2024, 2031, 2035, 203         
 << 7, 2039-22022, 2024, 2031, 2035, 2037, 2039-20         40
c35s1c.r2220.omac(config-mst)# instance 2 vlan 2050, 2060, 2063, 2070, 2080, $ vlan 2050, 2060
 << , 2063, 2070, 2080, 2         086, 2096, 2060, 2063, 2070, 2080, 2086, 2096,          2104, 2163, 2070, 2080, 2086, 2096, 2104, 211         
 << 0, 2126
c35s1c.r2220.omac(config-mst)# instance 2 vlan 2136, 2140, 2152, 2160, 2162-2$ vlan 2136, 2140, 2152, 2160, 2162-21         63, 2168,, 2140,
 <<  2152, 2160, 2162-2163, 2168,          2189, 21952, 2160, 2162-2163, 2168, 2189, 2194         , 2202
c35s1c.r2220.omac(config-mst)# instance 2 vlan 2220, 2222, 2232, 2242, 2246, 
 << $ vlan 2220, 2222, 2232, 2242, 2246, 2         611-2612,, 2222, 2232, 2242, 2246, 2611-2612,          2654, 299
 << 32, 2242, 2246, 2611-2612, 2654, 2999         
c35s1c.r2220.omac(config-mst)# instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 10$ vlan 42, 51, 59, 64, 66, 69, 72, 108         , 113, 12
 << 51, 59, 64, 66, 69, 72, 108, 113, 128         , 144, 17, 66, 69, 72, 108, 113, 128, 144, 176         , 196
c35s1c.r2220.omac(config-mst)# instance 3 vla
 << n 244, 248, 927
c35s1c.r2220.omac(config-mst)# instance 4 vlan 2042, 2051, 2059, 2064, 2066, $ vlan 2042, 2051, 2059, 2064, 2066, 2         069, 2072, 2
 << 051, 2059, 2064, 2066, 2069, 2072,          2108, 2159, 2064, 2066, 2069, 2072, 2108, 211         3, 2128
c35s1c.r2220.omac(config-mst)# instance 4 vlan 2144, 2176, 2196, 2244, 2248, 
 << $ vlan 2144, 2176, 2196, 2244, 2248, 2         927
c35s1c.r2220.omac(config-mst)# instance 5 vlan 16, 48, 58, 88, 121, 131, 133-$ vlan 16, 48, 58, 88, 121, 13
 << 1, 133-1         34, 216, 48, 58, 88, 121, 131, 133-134, 216, 2         28
c35s1c.r2220.omac(config-mst)# instance 6 vlan 2016, 2048, 2058, 2088, 2121, 
 << $ vlan 2016, 2048, 2058, 2088, 2121, 2         131, 2133, 2048, 2058, 2088, 2121, 2131, 2133-         2134, 22158, 2088, 2121, 2131, 213
 << 3-2134, 2216         , 2228
c35s1c.r2220.omac(config-mst)# instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, $ vlan 9, 33-34, 38, 54, 56, 71, 75, 8         2, 84, 97
 << 3-34, 38, 54, 56, 71, 75, 82, 84, 97,          114, 11654, 56, 71, 75, 82, 84, 97, 114, 116,          124
c35s1c.r2220.omac(config-mst)# instance 7 vlan 172, 186, 192, 204-
 << 208, 210, 2$ vlan 172, 186, 192, 204-208, 210, 24         0-241, 25186, 192, 204-208, 210, 240-241, 251         -252, 630
 << 204-208, 210, 240-241, 251-252, 630,          928
c35s1c.r2220.omac(config-mst)# instance 8 vlan 2009, 2033-2034, 2038, 2054, 2$ vlan 2009, 2033-2034, 2038, 2054, 20         
 << 56, 2071,, 2033-2034, 2038, 2054, 2056, 2071,          2075, 2084, 2038, 2054, 2056, 2071, 2075, 2082         , 2084
c35s1c.r2220.omac(con
 << fig-mst)# instance 8 vlan 2097, 2114, 2116, 2124, 2172, $ vlan 2097, 2114, 2116, 2124, 2172, 2         186, 2192, 2114, 2116, 2124, 2172, 2186, 2192,    
 <<       2204-22016, 2124, 2172, 2186, 2192, 2204-2208         , 2210
c35s1c.r2220.omac(config-mst)# instance 8 vlan 2240-2241, 2251-2252, 2630, 29
 << $ vlan 2240-2241, 2251-2252, 2630, 292         8
c35s1c.r2220.omac(config-mst)# instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62$ vlan 4-5, 12, 18-19, 32, 44, 57, 62,          68, 76, 
 << 12, 18-19, 32, 44, 57, 62, 68, 76, 9         8-99, 102, 32, 44, 57, 62, 68, 76, 98-99, 102,          112
c35s1c.r2220.omac(config-mst)# instance 9 vlan
 <<  130, 132, 147-148, 158, 212, 2$ vlan 130, 132, 147-148, 158, 212, 22         6, 236, 5132, 147-148, 158, 212, 226, 236, 50         0, 505, 5
 << 148, 158, 212, 226, 236, 500, 505, 51         0-511
c35s1c.r2220.omac(config-mst)# instance 9 vlan 522, 551-570, 603, 629, 633, 7$ vlan 522, 551-570, 603, 6
 << 29, 633, 74         2, 802, 9551-570, 603, 629, 633, 742, 802, 92         6, 929
c35s1c.r2220.omac(config-mst)# instance 10 vlan 2004-2005, 2012, 2018-2019, 2
 << $0 vlan 2004-2005, 2012, 2018-2019, 20         32, 2044,4-2005, 2012, 2018-2019, 2032, 2044,          2057, 20612, 2018-2019, 2032,
 <<  2044, 2057, 2062         , 2068
c35s1c.r2220.omac(config-mst)# instance 10 vlan 2076, 2098-2099, 2102, 2112, $0 vlan 2076, 2098-2099, 2102, 2112, 2         130, 2132
 << 6, 2098-2099, 2102, 2112, 2130, 2132,          2147-21499, 2102, 2112, 2130, 2132, 2147-2148         , 2158
c35s1c.r2220.omac(config-mst)# instance 10 vlan 2212, 2236,
 <<  2500, 2505, 2510-$0 vlan 2212, 2236, 2500, 2505, 2510-2         511, 25222, 2236, 2500, 2505, 2510-2511, 2522,          2603, 26
 << 500, 2505, 2510-2511, 2522, 2603, 262         9, 2633
c35s1c.r2220.omac(config-mst)# instance 10 vlan 2802, 2926, 2929
c35s1c.r2220.omac(config-mst)# instance 11 vlan 8, 43, 52, 146, 156-157, 180,
 << $1 vlan 8, 43, 52, 146, 156-157, 180,          200, 218
c35s1c.r2220.omac(config-mst)# instance 12 vlan 2008, 2043, 2052, 2146, 2156-$2 vlan 2008, 2043, 2052, 2146, 215
 << 6-2         157, 21808, 2043, 2052, 2146, 2156-2157, 2180,          2200, 22052, 2146, 2156-2157, 2180, 2200, 221         8
c35s1c.r222
 << 0.omac(config-mst)#
c35s1c.r2220.omac(config-mst)#end
c35s1c.r2220.omac#
 << 
Apr 28 18:12:58: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c35s1c.r2220.omac#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c35s1c.r2220.omac(config)#
Expect: matched string 1: (config)#
 >> hostname c35s1c.r2220.omac 

Expect: searching for 2 strs:  :# :>
 << hostname c35s1c.r2220.omac 
c35s1c.r2220.omac(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c35s1c.r2220.omac#
 << 
Apr 28 18:13:04: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c35s1c.r2220.omac#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c35s1c.r2220.omac(config)#
Expect: matched string 1: (config)#
 >> snmp-server contact  

Expect: searching for 1 strs:  :#
 << snmp-server contact  
% Incomplete command.

c35s1c.r2220.omac(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c35s1c.r2220.omac#
 << 
Apr 28 18:13:10: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c35s1c.r2220.omac#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c35s1c.r2220.omac(config)#
Expect: matched string 1: (config)#
 >> interface vlan 92

Expect: searching for 1 strs:  :(config-if)#
 << interface vlan 92
c35s1c.r2220.omac(config-if)#
Expect: matched string 1: (config-if)#
 >> ip address 10.92.5.190 255.255.0.0

 >> ip broadcast-address 10.92.255.255

 >> end

Expect: searching for 1 strs:  :Configured
 << ip address 10.92.5.190 255.255.0.0
c35s1c.r2220.omac(config-if)#ip broadcast-address 10.92.255.255
c35s1c.r2220.omac(config-if)#end
c35s1c.r2220.omac#
 << 
Apr 28 18:13:17: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c35s1c.r2220.omac#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c35s1c.r2220.omac(config)#
Expect: matched string 1: (config)#
 >> interface Vlan92

Expect: searching for 1 strs:  :(config-if)#
 << interface Vlan92
c35s1c.r2220.omac(config-if)#
Expect: matched string 1: (config-if)#
 >> ip default-gateway 10.92.0.1

 >> end

Expect: searching for 1 strs:  :Configured
 << ip default-gateway 10.92.0.1
c35s1c.r2220.omac(config)#end
c35s1c.r2220.omac#
Apr 28 18:13:22: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c35s1c.r2220.omac#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c35s1c.r2220.omac(config)#
Expect: matched string 1: (config)#
 >> ip dhcp snooping

Expect: searching for 1 strs:  :#
 << ip dhcp snooping
c35s1c.r2220.omac(config)#
Expect: matched string 1: #
 >> ip dhcp snooping vlan 177

Expect: searching for 1 strs:  :#
 << ip dhcp snooping vlan 177
c35s1c.r2220.omac(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c35s1c.r2220.omac#
Apr 28 18:13:29: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c35s1c.r2220.omac#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c35s1c.r2220.omac(config)#
Expect: matched string 1: (config)#
 >> default interface range gi0/1 - 8 

 >> interface range gi0/1 - 8 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi0/1 - 8 
c35s1c.r2220.omac(config)#interface range gi0/1 - 8 
c35s1c.r2220.omac(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport access vlan 177

 >> switchport mode access

 >> spanning-tree portfast

 >> switchport port-security maximum 2

 >> switchport port-security

 >> switchport port-security aging time 15

 >> switchport port-security violation protect

 >> switchport port-security aging type inactivity

 >> power inline never

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport access vlan 177
c35s1c.r2220.omac(config-if-range)#switchport mode access
c35s1c.r2220.omac(config-if-range)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, concentrato
 << rs, switches, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast will be configured in 8 interfaces due to the range command 
 but will only have effect when the interfaces a
 << re in a non-trunking mode.
c35s1c.r2220.omac(config-if-range)#switchport port-security maximum 2
c35s1c.r2220.omac(config-if-range)#switchport port-security
c35s1c.r2220.omac(config-if-range)#switchport port-security aging time 15
c35s1c.r2220.omac(co
 << nfig-if-range)#switchport port-security violation protect
c35s1c.r2220.omac(config-if-range)#switchport port-security aging type inacti$port-security aging type inactiv         ity
c35s1c.r2220.omac(con
 << fig-if-range)#power inline never
c35s1c.r2220.omac(config-if-range)#end
c35s1c.r2220.omac#
 << 
Apr 28 18:13:42: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c35s1c.r2220.omac#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c35s1c.r2220.omac(config)#
Expect: matched string 1: (config)#
 >> default interface range gi0/1 - 4 

 >> interface range gi0/1 - 4 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi0/1 - 4 
c35s1c.r2220.omac(config)#interface range gi0/1 - 4 
c35s1c.r2220.omac(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport access vlan 673

 >> switchport mode access

 >> spanning-tree portfast

 >> power inline consumption 15400

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport access vlan 673
c35s1c.r2220.omac(config-if-range)#switchport mode access
c35s1c.r2220.omac(config-if-range)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, concentrato
 << rs, switches, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast will be configured in 4 interfaces due to the range command 
 but will only have effect when the interfaces a
 << re in a non-trunking mode.
c35s1c.r2220.omac(config-if-range)#power inline consumption 15400
%CAUTION: Interface Gi0/1: Misconfiguring the 'power inline
 consumption/allocation' command may cause damage to the switch and void
 your warranty. Take prec
 << aution not to oversubscribe the power supply.
 It is recommended to enable power policing if the switch supports it.
 Refer to documentation.

%CAUTION: Interface Gi0/2: Misconfiguring the 'power inline
 consumption/allocation' command may cause dama
 << ge to the switch and void
 your warranty. Take precaution not to oversubscribe the power supply.
 It is recommended to enable power policing if the switch supports it.
 Refer to documentation.

%CAUTION: Interface Gi0/3: Misconfiguring the 'power inl
 << ine
 consumption/allocation' command may cause damage to the switch and void
 your warranty. Take precaution not to oversubscribe the power supply.
 It is recommended to enable power policing if the switch supports it.
 Refer to documentation.

%CAU
 << TION: Interface Gi0/4: Misconfiguring the 'power inline
 consumption/allocation' command may cause damage to the switch and void
 your warranty. Take precaution not to oversubscribe the power supply.
 It is recommended to enable power policing if the s
 << witch supports it.
 Refer to documentation.

c35s1c.r2220.omac(config-if-range)#end
c35s1c.r2220.omac#
 << 
Apr 28 18:13:55: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c35s1c.r2220.omac#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c35s1c.r2220.omac(config)#
Expect: matched string 1: (config)#
 >> default interface gi0/5 

 >> interface gi0/5 

Expect: searching for 1 strs:  :(config-if)#
 << default interface gi0/5 
Interface GigabitEthernet0/5 set to default configuration
c35s1c.r2220.omac(config)#interface gi0/5 
c35s1c.r2220.omac(config-if)#
Expect: matched string 1: (config-if)#
 >> switchport access vlan 28

 >> switchport mode access

 >> spanning-tree portfast

 >> power inline consumption 15400

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport access vlan 28
c35s1c.r2220.omac(config-if)#switchport mode access
c35s1c.r2220.omac(config-if)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, concentrators, switches,
 <<  bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast has been configured on GigabitEthernet0/5 but will only
 have effect when the interface is in a non-trunking mode.
c35s1c
 << .r2220.omac(config-if)#power inline consumption 15400
%CAUTION: Interface Gi0/5: Misconfiguring the 'power inline
 consumption/allocation' command may cause damage to the switch and void
 your warranty. Take precaution not to oversubscribe the power su
 << pply.
 It is recommended to enable power policing if the switch supports it.
 Refer to documentation.

c35s1c.r2220.omac(config-if)#end
c35s1c.r2220.omac#
 << 
Apr 28 18:14:02: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c35s1c.r2220.omac#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c35s1c.r2220.omac(config)#
Expect: matched string 1: (config)#
 >> default interface gi0/8 

 >> interface gi0/8 

Expect: searching for 1 strs:  :(config-if)#
 << default interface gi0/8 
Interface GigabitEthernet0/8 set to default configuration
c35s1c.r2220.omac(config)#interface gi0/8 
c35s1c.r2220.omac(config-if)#
Expect: matched string 1: (config-if)#
 >> switchport access vlan 91

 >> switchport mode access

 >> spanning-tree portfast

 >> power inline consumption 15400

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport access vlan 91
c35s1c.r2220.omac(config-if)#switchport mode access
c35s1c.r2220.omac(config-if)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, concentrators, switches,
 <<  bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast has been configured on GigabitEthernet0/8 but will only
 have effect when the interface is in a non-trunking mode.
c35s1c
 << .r2220.omac(config-if)#power inline consumption 15400
%CAUTION: Interface Gi0/8: Misconfiguring the 'power inline
 consumption/allocation' command may cause damage to the switch and void
 your warranty. Take precaution not to oversubscribe the power su
 << pply.
 It is recommended to enable power policing if the switch supports it.
 Refer to documentation.

c35s1c.r2220.omac(config-if)#end
c35s1c.r2220.omac#
 << 
Apr 28 18:14:09: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c35s1c.r2220.omac#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c35s1c.r2220.omac(config)#
Expect: matched string 1: (config)#
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c35s1c.r2220.omac#
 << 
Apr 28 18:14:18: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c35s1c.r2220.omac#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c35s1c.r2220.omac(config)#
Expect: matched string 1: (config)#
 >> crypto key generate rsa

 >> no

 >> 2048

Expect: searching for 2 strs:  :OK :(config)#
 << crypto key generate rsa
% You already have RSA keys defined named c35s1c.r2220.omac.mgmt.msstate.edu.
% Do you really want to replace them? [yes/no]: no
c35s1c.r2220.omac(config)#2048
                          ^
% Invalid input detected at '^' marker
Expect: matched string 2: (config)#
 >> end

Expect: searching for 1 strs:  :Configured
 << .

c35s1c.r2220.omac(config)#end
c35s1c.r2220.omac#
 << 
Apr 28 18:14:33: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> write mem

Expect: searching for 2 strs:  :# :>
 << 
c35s1c.r2220.omac#write mem
Building configuration...
[OK]
c35s1c.r2220.omac#
Expect: matched string 1: #
 >> 
Expect: searching for 2 strs:  :# :>
 << 
c35s1c.r2220.omac#
c35s1c.r2220.omac#
Expect: matched string 1: #
 >> sh run

Expect: searching for 2 strs:  :# :>
 << sh run
Building configuration...

Current configuration : 7844 bytes
!
! Last configuration change at 18:14:33 CDT Fri Apr 28 2017
! NVRAM config last updated at 18:14:36 CDT Fri Apr 28 2017
!
version 15.2
no service pad
service timestamps debug
 <<  datetime localtime
service timestamps log datetime localtime
service password-encryption
!
hostname c35s1c.r2220.omac
!
boot-start-marker
boot-end-marker
!
logging buffered informational
enable secret 5 $1$S8G2$8u09YoPJSIinCUHKjJXn0/
enable pa
 << ssword 7 1436000E0D59266133
!
username root privilege 15 secret 5 $1$w/QU$jN3UkOMcQtWQiVmQgFwVr.
no aaa new-model
clock summer-time CDT recurring
system mtu routing 1500
!
!
!
!
!
!
ip dhcp snooping vlan 177
ip dhcp snooping
ip domain-name m
 << gmt.msstate.edu
ip name-server 130.18.80.13
ip name-server 130.18.80.12
!
!
!
!
!
!
!
crypto pki trustpoint TP-self-signed-2494998912
 enrollment selfsigned
 subject-name cn=IOS-Self-Signed-Certificate-2494998912
 revocation-check none
 rsak
 << eypair TP-self-signed-2494998912
!
!
crypto pki certificate chain TP-self-signed-2494998912
 certificate self-signed 01
  	quit
!
spanning-tree mode mst
spanning-tree portfast edge bpduguard default
spanning-tree extend system-id
!
spanning-tre
 << e mst configuration
 name msstate
 revision 1
 instance 1 vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 63, 70
 instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 160
 instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 230,
 <<  232, 242, 246
 instance 1 vlan 256, 611-612, 654, 741, 996, 999
 instance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037, 2039-2040
 instance 2 vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096, 2104, 2110, 2126
 instance 2 vlan 2136, 2140, 
 << 2152, 2160, 2162-2163, 2168, 2189, 2194, 2202
 instance 2 vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 2654, 2999
 instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176, 196
 instance 3 vlan 244, 248, 927
 instance 4 vlan 2042, 2051, 20
 << 59, 2064, 2066, 2069, 2072, 2108, 2113, 2128
 instance 4 vlan 2144, 2176, 2196, 2244, 2248, 2927
 instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 228
 instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216, 2228
 instance 7 vlan 9
 << , 33-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116, 124
 instance 7 vlan 172, 186, 192, 204-208, 210, 240-241, 251-252, 630, 928
 instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082, 2084
 instance 8 vlan 2097, 2114, 2116, 2124, 2172, 21
 << 86, 2192, 2204-2208, 2210
 instance 8 vlan 2240-2241, 2251-2252, 2630, 2928
 instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102, 112
 instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 500, 505, 510-511
 instance 9 vlan 522, 551-57
 << 0, 603, 629, 633, 742, 802, 926, 929
 instance 10 vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 2057, 2062, 2068
 instance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148, 2158
 instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522, 2603, 
 << 2629, 2633
 instance 10 vlan 2802, 2926, 2929
 instance 11 vlan 8, 43, 52, 146, 156-157, 180, 200, 218
 instance 12 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180, 2200, 2218
!
errdisable recovery cause udld
errdisable recovery cause bpduguard
errdis
 << able recovery cause security-violation
errdisable recovery cause channel-misconfig
errdisable recovery cause pagp-flap
errdisable recovery cause dtp-flap
errdisable recovery cause link-flap
errdisable recovery cause sfp-config-mismatch
errdisable re
 << covery cause gbic-invalid
errdisable recovery cause l2ptguard
errdisable recovery cause psecure-violation
errdisable recovery cause port-mode-failure
errdisable recovery cause dhcp-rate-limit
errdisable recovery cause pppoe-ia-rate-limit
errdisable 
 << recovery cause mac-limit
errdisable recovery cause vmps
errdisable recovery cause storm-control
errdisable recovery cause inline-power
errdisable recovery cause arp-inspection
errdisable recovery cause loopback
errdisable recovery cause small-frame
 << 
errdisable recovery cause psp
errdisable recovery interval 1800
!
!
!
!
vlan internal allocation policy ascending
!
!
! 
!
!
!
!
!
!
!
!
!
interface GigabitEthernet0/1
 switchport access vlan 673
 switchport mode access
 power inlin
 << e consumption 15400
 spanning-tree portfast edge
!
interface GigabitEthernet0/2
 switchport access vlan 673
 switchport mode access
 power inline consumption 15400
 spanning-tree portfast edge
!
interface GigabitEthernet0/3
 switchport access vl
 << an 673
 switchport mode access
 power inline consumption 15400
 spanning-tree portfast edge
!
interface GigabitEthernet0/4
 switchport access vlan 673
 switchport mode access
 power inline consumption 15400
 spanning-tree portfast edge
!
interf
 << ace GigabitEthernet0/5
 switchport access vlan 28
 switchport mode access
 power inline consumption 15400
 spanning-tree portfast edge
!
interface GigabitEthernet0/6
 switchport access vlan 177
 switchport mode access
 switchport port-security ma
 << ximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast edge
!
interface GigabitEthernet0/7

 <<  switchport access vlan 177
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 p
 << ower inline never
 spanning-tree portfast edge
!
interface GigabitEthernet0/8
 switchport access vlan 91
 switchport mode access
 power inline consumption 15400
 spanning-tree portfast edge
!
interface GigabitEthernet0/9
 switchport trunk native
 <<  vlan 92
 switchport mode trunk
 no keepalive
 ip dhcp snooping trust
!
interface GigabitEthernet0/10
 switchport trunk native vlan 92
 switchport mode trunk
 no keepalive
 ip dhcp snooping trust
!
interface GigabitEthernet0/11
 switchport tru
 << nk native vlan 92
 switchport mode trunk
 ip dhcp snooping trust
!
interface GigabitEthernet0/12
 switchport trunk native vlan 92
 switchport mode trunk
 ip dhcp snooping trust
!
interface Vlan1
 no ip address
 no ip route-cache
!
interface V
 << lan92
 ip address 10.92.5.190 255.255.0.0
 ip broadcast-address 10.92.255.255
!
ip default-gateway 10.92.0.1
ip forward-protocol nd
no ip http server
no ip http secure-server
!
!
!
logging facility local1
logging host 130.18.8.12
access-list 
 << 1 permit 130.18.8.0 0.0.0.255
access-list 1 permit 10.93.0.0 0.0.255.255
access-list 1 permit 130.18.1.0 0.0.0.255
access-list 1 permit 10.92.0.0 0.0.255.255
!
snmp-server community sysnet RO 1
snmp-server community c2-b2=a2 RW 1
snmp-server enable
 <<  traps snmp authentication linkdown linkup coldstart warmstart
snmp-server enable traps transceiver all
snmp-server enable traps tty
snmp-server enable traps cluster
snmp-server enable traps config-copy
snmp-server enable traps config
snmp-server en
 << able traps config-ctid
snmp-server enable traps entity
snmp-server enable traps power-ethernet police
snmp-server enable traps cpu threshold
snmp-server enable traps rep
snmp-server enable traps bridge newroot topologychange
snmp-server enable traps
 <<  stpx inconsistency root-inconsistency loop-inconsistency
snmp-server enable traps syslog
snmp-server enable traps vtp
snmp-server enable traps vlancreate
snmp-server enable traps vlandelete
snmp-server enable traps flash insertion removal
snmp-serv
 << er enable traps port-security
snmp-server enable traps envmon fan shutdown supply temperature status
snmp-server enable traps errdisable
snmp-server enable traps mac-notification change move threshold
snmp-server enable traps vlan-membership
snmp-ser
 << ver host 130.18.8.12 sysnet 
!
line con 0
line vty 0 4
 access-class 1 in
 password 7 013214015A560A4536
 login local
 transport input ssh
line vty 5 15
 access-class 1 in
 password 7 013214015A560A4536
 login local
 transport input ssh
!
nt
 << p server 10.92.0.5
!
end

c35s1c.r2220.omac#
Expect: matched string 1: #
