trying to use serial port: /dev/ttyUSB0
 >> 
 >> 

Expect: searching for 4 strs:  :[yes/no] :Press RETURN to get started. :# :Switch>
 << 
c29s1p.r1052.omac#
c29s1p.r1052.omac#
c29s1p.r1052.omac#
c29s1p.r1052.omac#
Expect: matched string 3: #
 >> term len 0

Expect: searching for 2 strs:  :# :>
 << term len 0
c29s1p.r1052.omac#
Expect: matched string 1: #
 >> show version

Expect: searching for 2 strs:  :# :>
 << show version
Cisco IOS Software, C2960X Software (C2960X-UNIVERSALK9-M), Version 15.2(2)E5, RELEASE SOFTWARE (fc2)
Technical Support: http://www.cisco.com/techsupport
Copyright (c) 1986-2016 by Cisco Systems, Inc.
Compiled Thu 02-Jun-16 01:31 by prod_
 << rel_team

ROM: Bootstrap program is C2960X boot loader
BOOTLDR: C2960X Boot Loader (C2960X-HBOOT-M) Version 15.2(3r)E1, RELEASE SOFTWARE (fc1)

c29s1p.r1052.omac uptime is 3 minutes
System returned to ROM by power-on
System restarted at 12:16:51 CD
 << T Mon Jun 26 2017
System image file is "flash:/c2960x-universalk9-mz.152-2.E5/c2960x-universalk9-mz.152-2.E5.bin"
Last reload reason: power-on



This product contains cryptographic features and is subject to United
States and local country laws go
 << verning import, export, transfer and
use. Delivery of Cisco cryptographic products does not imply
third-party authority to import, export, distribute or use encryption.
Importers, exporters, distributors and users are responsible for
compliance with U
 << .S. and local country laws. By using this product you
agree to comply with applicable laws and regulations. If you are unable
to comply with U.S. and local laws, return this product immediately.

A summary of U.S. laws governing Cisco cryptographic pr
 << oducts may be found at:
http://www.cisco.com/wwl/export/crypto/tool/stqrg.html

If you require further assistance please contact us by sending email to
export@cisco.com.

cisco WS-C2960X-24PS-L (APM86XXX) processor (revision L0) with 524288K bytes o
 << f memory.
Processor board ID FOC2030W2TF
Last reset from power-on
2 Virtual Ethernet interfaces
1 FastEthernet interface
28 Gigabit Ethernet interfaces
The password-recovery mechanism is enabled.

512K bytes of flash-simulated non-volatile configu
 << ration memory.
Base ethernet MAC Address       : 00:87:31:65:A8:80
Motherboard assembly number     : 73-16694-05
Power supply part number        : 341-0528-02
Motherboard serial number       : FOC20302DXN
Power supply serial number      : LIT20240Q5Q
 << 
Model revision number           : L0
Motherboard revision number     : A0
Model number                    : WS-C2960X-24PS-L
Daughterboard assembly number   : 73-14200-03
Daughterboard serial number     : FOC2028C9PH
System serial number           
 <<  : FOC2030W2TF
Top Assembly Part Number        : 68-100472-02
Top Assembly Revision Number    : B0
Version ID                      : V04
CLEI Code Number                : CMMLR00ARD
Daughterboard revision number   : A0
Hardware Board Revision Number
 <<   : 0x18


Switch Ports Model                     SW Version            SW Image                 
------ ----- -----                     ----------            ----------               
*    1 28    WS-C2960X-24PS-L          15.2(2)E5             C296
 << 0X-UNIVERSALK9-M     


Configuration register is 0xF

c29s1p.r1052.omac#
Expect: matched string 1: #
 >> enable

Expect: searching for 2 strs:  :Password: :#
 << enable
c29s1p.r1052.omac#
Expect: matched string 2: #
 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.r1052.omac(config)#
Expect: matched string 1: (config)#
 >> default interface range gi1/0/1 - 23 

 >> end

Expect: searching for 1 strs:  :Configured
 << default interface range gi1/0/1 - 23 
c29s1p.r1052.omac(config)#end
c29s1p.r1052.omac#
 << 
Jun 26 12:20:41: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.r1052.omac#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.r1052.omac(config)#
Expect: matched string 1: (config)#
 >> default interface range gi1/0/1 - 23 

 >> interface range gi1/0/1 - 23 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi1/0/1 - 23 
c29s1p.r1052.omac(config)#interface range gi1/0/1 - 23 
c29s1p.r1052.omac(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport access vlan 673

 >> switchport mode access

 >> spanning-tree portfast

 >> no power inline consumption

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport access vlan 673
c29s1p.r1052.omac(config-if-range)#switchport mode access
c29s1p.r1052.omac(config-if-range)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, concentrato
 << rs, switches, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast will be configured in 23 interfaces due to the range command 
 but will only have effect when the interfaces 
 << are in a non-trunking mode.
c29s1p.r1052.omac(config-if-range)#no power inline consumption
c29s1p.r1052.omac(config-if-range)#end
c29s1p.r1052.omac#
 << 
Jun 26 12:20:47: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.r1052.omac#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.r1052.omac(config)#
Expect: matched string 1: (config)#
 >> default interface 24 

 >> end

Expect: searching for 1 strs:  :Configured
 << default interface 24 
                                            ^
% Invalid input detected at '^' marker.

c29s1p.r1052.omac(config)#end
c29s1p.r1052.omac#
 << 
Jun 26 12:20:51: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.r1052.omac#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.r1052.omac(config)#
Expect: matched string 1: (config)#
 >> default interface gi1/0/24 

 >> interface gi1/0/24 

Expect: searching for 1 strs:  :(config-if)#
 << default interface gi1/0/24 
Interface GigabitEthernet1/0/24 set to default configuration
c29s1p.r1052.omac(config)#interface gi1/0/24 
c29s1p.r1052.omac(config-if)#
Expect: matched string 1: (config-if)#
 >> switchport mode trunk

 >> switchport trunk native vlan 92

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport mode trunk
c29s1p.r1052.omac(config-if)#switchport trunk native vlan 92
c29s1p.r1052.omac(config-if)#end
c29s1p.r1052.omac#
 << 
Jun 26 12:20:56: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> write mem

Expect: searching for 2 strs:  :# :>
 << 
c29s1p.r1052.omac#write mem
Building configuration...
[OK]
c29s1p.r1052.omac#
Expect: matched string 1: #
