trying to use serial port: /dev/ttyUSB0
 >> 
 >> 

Expect: searching for 4 strs:  :[yes/no] :Press RETURN to get started. :# :Switch>
 << 
Switch#
Switch#
Switch#
Switch#
Expect: matched string 3: #
 >> term len 0

Expect: searching for 2 strs:  :# :>
 << term len 0
Switch#
Expect: matched string 1: #
 >> show version

Expect: searching for 2 strs:  :# :>
 << show version
Cisco IOS Software, C2960X Software (C2960X-UNIVERSALK9-M), Version 15.0(2)EX5, RELEASE SOFTWARE (fc1)
Technical Support: http://www.cisco.com/techsupport
Copyright (c) 1986-2014 by Cisco Systems, Inc.
Compiled Fri 21-Feb-14 05:54 by prod
 << _rel_team

ROM: Bootstrap program is C2960X boot loader
BOOTLDR: C2960X Boot Loader (C2960X-HBOOT-M) Version 15.2(2r)E1, RELEASE SOFTWARE (fc1)

Switch uptime is 1 week, 3 days, 10 minutes
System returned to ROM by power-on
System restarted at 20:2
 << 5:59 UTC Tue Jun 27 2017
System image file is "flash:/c2960x-universalk9-mz.150-2.EX5/c2960x-universalk9-mz.150-2.EX5.bin"


This product contains cryptographic features and is subject to United
States and local country laws governing import, export,
 <<  transfer and
use. Delivery of Cisco cryptographic products does not imply
third-party authority to import, export, distribute or use encryption.
Importers, exporters, distributors and users are responsible for
compliance with U.S. and local country l
 << aws. By using this product you
agree to comply with applicable laws and regulations. If you are unable
to comply with U.S. and local laws, return this product immediately.

A summary of U.S. laws governing Cisco cryptographic products may be found at:
 << 
http://www.cisco.com/wwl/export/crypto/tool/stqrg.html

If you require further assistance please contact us by sending email to
export@cisco.com.

cisco WS-C2960X-48FPD-L (APM86XXX) processor (revision F0) with 524288K bytes of memory.
Processor b
 << oard ID FCW1905A5S6
Last reset from power-on
1 Virtual Ethernet interface
1 FastEthernet interface
50 Gigabit Ethernet interfaces
2 Ten Gigabit Ethernet interfaces
The password-recovery mechanism is enabled.

512K bytes of flash-simulated non-vola
 << tile configuration memory.
Base ethernet MAC Address       : BC:F1:F2:9E:F7:80
Motherboard assembly number     : 73-15964-02
Power supply part number        : 341-0527-01
Motherboard serial number       : FOC19052XFU
Power supply serial number      :
 <<  DCB1903640P
Model revision number           : F0
Motherboard revision number     : C0
Model number                    : WS-C2960X-48FPD-L
Daughterboard assembly number   : 73-14200-03
Daughterboard serial number     : FOC190575AL
System serial numb
 << er            : FCW1905A5S6
Top Assembly Part Number        : 800-41461-01
Top Assembly Revision Number    : C0
Version ID                      : V02
CLEI Code Number                : CMMLJ00ARB
Daughterboard revision number   : A0
Hardware Board Re
 << vision Number  : 0x12


Switch Ports Model              SW Version            SW Image                 
------ ----- -----              ----------            ----------               
*    1 52    WS-C2960X-48FPD-L  15.0(2)EX5            C2960X-UNIVE
 << RSALK9-M     


Configuration register is 0xF

Switch#
Expect: matched string 1: #
 >> enable

Expect: searching for 2 strs:  :Password: :#
 << enable
Switch#
Expect: matched string 2: #
 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
Expect: matched string 1: (config)#
 >> no service pad

 >> service timestamps debug datetime localtime

 >> service timestamps log datetime localtime

 >> service password-encryption

 >> boot-start-marker

 >> boot-end-marker

 >> enable secret Area=l*w

 >> enable password Area=l*w

 >> username root privilege 15 secret Area=l*w

 >> no aaa new-model

 >> clock timezone CST -6 0

 >> clock summer-time CDT recurring

 >> authentication mac-move permit

 >> ip domain-name mgmt.msstate.edu

 >> ip name-server 130.18.80.12

 >> vtp domain vtp01.mgmt.msstate.edu

 >> vtp mode client

 >> crypto pki trustpoint TP-self-signed-2494998912

 >>  enrollment selfsigned

 >>  subject-name cn=IOS-Self-Signed-Certificate-2494998912

 >>  revocation-check none

 >>  rsakeypair TP-self-signed-2494998912

 >> crypto pki certificate chain TP-self-signed-2494998912

 >>  certificate self-signed 01 nvram:IOS-Self-Sig#3232.cer

 >> spanning-tree portfast bpduguard default

 >> spanning-tree extend system-id

 >> vlan internal allocation policy ascending

 >> errdisable recovery cause all

 >> errdisable recovery interval 1800

 >> interface FastEthernet0

 >>  no ip address

 >>  shutdown

 >> interface Vlan1

 >>  no ip address

 >>  no ip route-cache

 >>  shutdown

 >> interface Vlan92

 >> no ip http server

 >> no ip http secure-server

 >> logging facility local1

 >> logging host 130.18.8.12

 >> access-list 1 permit 10.92.0.0 0.0.255.255

 >> access-list 1 permit 130.18.8.0 0.0.0.255

 >> access-list 1 permit 10.93.0.0 0.0.255.255

 >> access-list 1 permit 130.18.1.0 0.0.0.255

 >> snmp-server community sysnet RO 1

 >> snmp-server community c2-b2=a2 RW 1

 >> snmp-server enable traps snmp authentication linkdown linkup coldstart warmstart

 >> snmp-server enable traps transceiver all

 >> snmp-server enable traps tty

 >> snmp-server enable traps cluster

 >> snmp-server enable traps config-copy

 >> snmp-server enable traps config

 >> snmp-server enable traps config-ctid

 >> snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-auth-fail-vlan no-guest-vlan

 >> snmp-server enable traps entity

 >> snmp-server enable traps power-ethernet police

 >> snmp-server enable traps cpu threshold

 >> snmp-server enable traps rep

 >> snmp-server enable traps bridge newroot topologychange

 >> snmp-server enable traps stpx inconsistency root-inconsistency loop-inconsistency

 >> snmp-server enable traps syslog

 >> snmp-server enable traps vtp

 >> snmp-server enable traps vlancreate

 >> snmp-server enable traps vlandelete

 >> snmp-server enable traps flash insertion removal

 >> snmp-server enable traps port-security

 >> snmp-server enable traps envmon fan shutdown supply temperature status

 >> snmp-server enable traps errdisable

 >> snmp-server enable traps mac-notification change move threshold

 >> snmp-server enable traps vlan-membership

 >> snmp-server host 130.18.8.12 sysnet 

 >> line con 0

 >> line vty 0 15

 >>  access-class 1 in

 >>  password Area=l*w

 >>  login local

 >>  transport input ssh

 >> ntp server 10.92.0.5

 >> 

 >> end

Expect: searching for 1 strs:  :Configured
 << no service pad
Switch(config)#service timestamps debug datetime localtime
Switch(config)#service timestamps log datetime localtime
Switch(config)#service password-encryption
Switch(config)#boot-start-marker
Switch(config)#boot-end-marker
Switch(conf
 << ig)#enable secret Area=l*w
Switch(config)#enable password Area=l*w
The enable password you have chosen is the same as your enable secret.
This is not recommended.  Re-enter the enable password.

Switch(config)#username root privilege 15 secret Area=l
 << *w
Switch(config)#no aaa new-model
Switch(config)#clock timezone CST -6 0
Switch(config)#clock summer-time CDT recurring

Jul  7 14:40:20: %SYS-6-CLOCKUPDATE: System clock has been updated from 20:40:18 UTC Fri Jul 7 2017 to 14:40:20 CST Fri Jul 7 201
 << 7, configured from console by console.
Switch(config)#authentication mac-move permit
Switch(config)#ip domain-name mgmt.msstate.edu
Switch(config)#ip name-server 130.18.80.12
Switch(config)#vtp domain vtp01.mgmt.msstate.edu
Changing VTP domain name f
 << rom NULL to vtp01.mgmt.msstate.edu
Switch(config)#vtp mode client
Setting device to VTP Client mode for VLANS.
Switch(config)#crypto pki trustpoint TP-self-signed-2494998912
Switch(ca-trustpoint)# enrollment selfsigned
Switch(ca-trustpoint)# subject-
 << name cn=IOS-Self-Signed-Certificate-2494998912
Switch(ca-trustpoint)# revocation-check none
Switch(ca-trustpoint)# rsakeypair TP-self-signed-2494998912
Switch(ca-trustpoint)#crypto pki certificate chain TP-self-signed-2494998912
Switch(config-cert-cha
 << in)# certificate self-signed 01 nvram:IOS-Self-Sig#3232$e self-signed 01 nvram:IOS-Self-Sig#3232.         cer
Switch(config-cert-chain)#spanning-tree portfast bpduguard default
Switch(config)#s
 << panning-tree extend system-id
Switch(config)#vlan internal allocation policy ascending
Switch(config)#errdisable recovery cause all
Switch(config)#errdisable recovery interv
Jul  7 15:40:22: %SYS-6-CLOCKUPDATE: System clock has been updated from 14:40
 << :20 CST Fri Jul 7 2017 to 15:40:22 CDT Fri Jul 7 2017, configured from console by console.
Jul  7 15:40:22: %SW_VLAN-6-VTP_DOMAIN_NAME_CHG: VTP domain name changed to vtp01.mgmt.msstate.edu.al 1800
Switch(config)#interface FastEthernet0
Switch(config-i
 << f)# no ip address
Switch(config-if)# shutdown
Switch(config-if)#interface Vlan1
Switch(config-if)# no ip address
Switch(config-if)# no ip route-cache
Switch(config-if)# shutdown
Switch(config-if)#interface Vlan92
Switch(config-if)#no ip http server
 << 
Switch(config)#no ip http secure-server
Switch(config)#logging facility local1
Switch(config)#logging host 130.18.8.12
Switch(config)#access-list 1 permit 10.92.0.0 0.0.255.255
Switch(config)#access-list 1 permit 130.18.8.0 0.0.0.255
Switch(config)
 << #access-list 1 permit 10.93.0.0 0.0.255.255
Switch(config)#access-list 1 permit 130.18.1.0 0.0.0.255
Switch(config)#snmp-server community sysnet RO 1
Switch(config)#
Jul  7 15:40:24: %LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan92, changed stat
 << e to downsnmp-server community c2-b2=a2 RW 1
Switch(config)#snmp-server enable traps snmp authentication linkdown linkup c$ enable traps snmp authentication linkdown linkup co         
 << ldstart waps snmp authentication linkdown linkup coldstart wa         rmstart
Switch(config)#snmp-server enable traps transceiver all
Switch(config)#snmp-server enable traps tty
Swi
 << tch(config)#snmp-server enable traps cluster
Switch(config)#
Jul  7 15:40:25: %SYS-6-LOGGINGHOST_STARTSTOP: Logging to host 130.18.8.12 port 514 started - CLI initiatedsnmp-server enable traps config-copy
Switch(config)#snmp-server enable traps config
 << 
Switch(config)#snmp-server enable traps config-ctid
Switch(config)#snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-au$ enable traps dot1x auth-fail-vlan guest-vlan no-aut         
 << h-fail-vlaps dot1x auth-fail-vlan guest-vlan no-auth-fail-vla         n no-guesuth-fail-vlan guest-vlan no-auth-fail
 << -vlan no-guest         -vlan
Switch(config)#snmp-server enable traps entity
Switch(config)#snmp-server enable traps power-ethernet police
Switch(config)#snmp-server enable traps cpu threshold
Switch(config)#snmp-server enable traps rep
Switc
 << h(config)#snmp-server enable traps bridge newroot topologychange
Switch(config)#snmp-server enable traps stpx inconsistency root-inconsistency$ enable traps stpx inconsistency root-inconsisten
 << cy          loop-incoaps stpx inconsistency root-inconsistency loop-incon         sistency
Switch(config)#snmp-server enable traps syslog
Switch(config)#snmp-server enable tr
 << aps vtp
Switch(config)#snmp-server enable traps vlancreate
Switch(config)#snmp-server enable traps vlandelete
Switch(config)#snmp-server enable traps flash insertion removal
Switch(config)#snmp-server enable traps port-security
Switch(config)#snmp-se
 << rver enable traps envmon fan shutdown supply temperatur$ enable traps envmon fan shutdown supply temperature          status
Switch(config)#snmp-server enable traps errdisable
Switch
 << (config)#snmp-server enable traps mac-notification change move threshol$ enable traps mac-notification change move threshold         
Switch(config)#snmp-server enable traps vlan-memb
 << ership
Switch(config)#snmp-server host 130.18.8.12 sysnet 
Switch(config)#line con 0
Switch(config-line)#line vty 0 15
Switch(config-line)# access-class 1 in
Switch(config-line)# password Area=l*w
Switch(config-line)# login local
Switch(config-line
 << )# transport input ssh
Switch(config-line)#ntp server 10.92.0.5
Switch(config)#
Switch(config)#end
Switch#
 << 
Jul  7 15:40:33: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
Switch#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
Expect: matched string 1: (config)#
 >> spanning-tree mode mst

 >> spanning-tree etherchannel guard misconfig

 >> spanning-tree mst configuration

 >>  name msstate

 >>  revision 1

 >>  instance 1 vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 63, 70

 >>  instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 160

 >>  instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 230, 232, 242, 246

 >>  instance 1 vlan 256, 611-612, 654, 741, 996, 999

 >>  instance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037, 2039-2040

 >>  instance 2 vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096, 2104, 2110, 2126

 >>  instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 2189, 2194, 2202

 >>  instance 2 vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 2654, 2999

 >>  instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176, 196

 >>  instance 3 vlan 244, 248, 927

 >>  instance 4 vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072, 2108, 2113, 2128

 >>  instance 4 vlan 2144, 2176, 2196, 2244, 2248, 2927

 >>  instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 228

 >>  instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216, 2228

 >>  instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116, 124

 >>  instance 7 vlan 172, 186, 192, 204-208, 210, 240-241, 251-252, 630, 928

 >>  instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082, 2084

 >>  instance 8 vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208, 2210

 >>  instance 8 vlan 2240-2241, 2251-2252, 2630, 2928

 >>  instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102, 112

 >>  instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 500, 505, 510-511

 >>  instance 9 vlan 522, 551-570, 603, 629, 633, 742, 802, 926, 929

 >>  instance 10 vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 2057, 2062, 2068

 >>  instance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148, 2158

 >>  instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522, 2603, 2629, 2633

 >>  instance 10 vlan 2802, 2926, 2929

 >>  instance 11 vlan 8, 43, 52, 146, 156-157, 180, 200, 218

 >>  instance 12 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180, 2200, 2218

 >> 

 >> end

Expect: searching for 1 strs:  :Configured
 << spanning-tree mode mst
Switch(config)#spanning-tree etherchannel guard misconfig
Switch(config)#spanning-tree mst configuration
Switch(config-mst)# name msstate
Switch(config-mst)# revision 1
Switch(config-mst)# instance 1 vlan 2, 7, 11, 20, 22, 24, 
 << 31, 35, 37, 39-40, $ vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40, 5         0, 60, 63, 11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 
 << 63,          70
Switch(config-mst)# instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 1$ vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 14         0, 152, 1
 << 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 16         0
Switch(config-mst)# instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 23$ vlan 162-1
 << 63, 168, 189, 194, 202, 220, 222, 230         , 232, 24163, 168, 189, 194, 202, 220, 222, 230, 232, 242         , 246
Switch(config-mst)# instance 1 vlan 256, 611-612, 654, 741, 9
 << 96, 999
Switch(config-mst)# instance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031,$ vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031,          2035, 203
 << , 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037         , 2039-2011, 2020, 2022, 2024, 2031, 2035, 2037, 2039-204         0
Switch(config-mst)# instance 2 v
 << lan 2050, 2060, 2063, 2070, 2080, 2086, 2096,$ vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096,          2104, 211, 2060, 2063, 2070,
 <<  2080, 2086, 2096, 2104, 2110         , 2126
Switch(config-mst)# instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, $ vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 2         
 << 189, 2194, 2140, 2152, 2160, 2162-2163, 2168, 2189, 2194,          2202
Switch(config-mst)# instance 2 vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 
 << $ vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 2         654, 2999
Switch(config-mst)# instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128$ vlan 42, 51, 59, 64
 << , 66, 69, 72, 108, 113, 128,          144, 17651, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176,          196
Switch(config-mst)# instance 3 vlan 244, 248, 927
Switch(config-mst)# 
 << instance 4 vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072,$ vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072,          2108, 211, 2051,
 <<  2059, 2064, 2066, 2069, 2072, 2108, 2113         , 2128
Switch(config-mst)# instance 4 vlan 2144, 2176, 2196, 2244, 2248, 2927
Switch(config-mst)# instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 2
 << $ vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 22         8
Switch(config-mst)# instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-$ vlan 2016, 2048, 2058, 2088, 
 << 2121, 2131, 2133-2         134, 2216, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216,          2228
Switch(config-mst)# instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97,
 << $ vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97,          114, 116,3-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116,          1
 << 24
Switch(config-mst)# instance 7 vlan 172, 186, 192, 204-208, 210, 240-241, 251$ vlan 172, 186, 192, 204-208, 210, 240-241, 251-         252, 630,
 << 186, 192, 204-208, 210, 240-241, 251-252, 630,          928
Switch(config-mst)# instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, $ vlan 2009, 2033-2034, 2038, 2054
 << , 2056, 2071, 2         075, 2082, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082,          2084
Switch(config-mst)# instance 8 vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192,
 << $ vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192,          2204-2208, 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208,          221
 << 0
Switch(config-mst)# instance 8 vlan 2240-2241, 2251-2252, 2630, 2928
Switch(config-mst)# instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 9$ vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 
 << 98         -99, 102,12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102,          112
Switch(config-mst)# instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 50
 << $ vlan 130, 132, 147-148, 158, 212, 226, 236, 500         , 505, 51132, 147-148, 158, 212, 226, 236, 500, 505, 510         -511
Switch(config-mst
 << )# instance 9 vlan 522, 551-570, 603, 629, 633, 742, 802, 92$ vlan 522, 551-570, 603, 629, 633, 742, 802, 926         , 929
Switch(config-mst)# instance 10 vlan 2004-2005, 2012, 2018-2019
 << , 2032, 2044, $0 vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 2         057, 20624-2005, 2012, 2018-2019, 2032, 2044, 2057, 2062,  
 <<         2068
Switch(config-mst)# instance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132,$0 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132,          2147-2148
 << 6, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148,          2158
Switch(config-mst)# instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522,$0 vlan 221
 << 2, 2236, 2500, 2505, 2510-2511, 2522,          2603, 2622, 2236, 2500, 2505, 2510-2511, 2522, 2603, 2629         , 2633
Switch(config-mst)# instance 10 vlan 2802, 2926, 2929
Swit
 << ch(config-mst)# instance 11 vlan 8, 43, 52, 146, 156-157, 180, 200, 218
Switch(config-mst)# instance 12 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180,$2 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180
 << ,          2200, 2218, 2043, 2052, 2146, 2156-2157, 2180, 2200, 2218         
Switch(config-mst)#
Switch(config-mst)#end
Switch#
Jul  7 15:40:49: %SYS-5-CONFIG_I: Configured fr
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << om console by console
Switch#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
Expect: matched string 1: (config)#
 >> hostname c29s1p.f2.cresswell 

Expect: searching for 2 strs:  :# :>
 << hostname c29s1p.f2.cresswell 
c29s1p.f2.cresswell(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s1p.f2.cresswell#
 << 
Jul  7 15:40:54: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.f2.cresswell#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.f2.cresswell(config)#
Expect: matched string 1: (config)#
 >> snmp-server contact 6F-2016

Expect: searching for 1 strs:  :#
 << snmp-server contact 6F-2016
c29s1p.f2.cresswell(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s1p.f2.cresswell#
 << 
Jul  7 15:41:00: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.f2.cresswell#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.f2.cresswell(config)#
Expect: matched string 1: (config)#
 >> interface vlan 92

Expect: searching for 1 strs:  :(config-if)#
 << interface vlan 92
c29s1p.f2.cresswell(config-if)#
Expect: matched string 1: (config-if)#
 >> ip address 10.92.3.103 255.255.0.0

 >> ip broadcast-address 10.92.255.255

 >> end

Expect: searching for 1 strs:  :Configured
 << ip address 10.92.3.103 255.255.0.0
c29s1p.f2.cresswell(config-if)#ip broadcast-address 10.92.255.255
c29s1p.f2.cresswell(config-if)#end
c29s1p.f2.cresswell#
 << 
Jul  7 15:41:06: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.f2.cresswell#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.f2.cresswell(config)#
Expect: matched string 1: (config)#
 >> interface Vlan92

Expect: searching for 1 strs:  :(config-if)#
 << interface Vlan92
c29s1p.f2.cresswell(config-if)#
Expect: matched string 1: (config-if)#
 >> ip default-gateway 10.92.0.1

 >> end

Expect: searching for 1 strs:  :Configured
 << ip default-gateway 10.92.0.1
c29s1p.f2.cresswell(config)#end
c29s1p.f2.cresswell#
Jul  7 15:41:12: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.f2.cresswell#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.f2.cresswell(config)#
Expect: matched string 1: (config)#
 >> ip dhcp snooping

Expect: searching for 1 strs:  :#
 << ip dhcp snooping
c29s1p.f2.cresswell(config)#
Expect: matched string 1: #
 >> ip dhcp snooping vlan 31

Expect: searching for 1 strs:  :#
 << ip dhcp snooping vlan 31
c29s1p.f2.cresswell(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s1p.f2.cresswell#
Jul  7 15:41:19: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.f2.cresswell#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.f2.cresswell(config)#
Expect: matched string 1: (config)#
 >> default interface range gi1/0/1 - 48 

 >> interface range gi1/0/1 - 48 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi1/0/1 - 48 
c29s1p.f2.cresswell(config)#interface range gi1/0/1 - 48 
c29s1p.f2.cresswell(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport access vlan 31

 >> switchport mode access

 >> spanning-tree portfast

 >> switchport port-security maximum 2

 >> switchport port-security

 >> switchport port-security aging time 15

 >> switchport port-security violation protect

 >> switchport port-security aging type inactivity

 >> power inline never

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport access vlan 31
c29s1p.f2.cresswell(config-if-range)#switchport mode access
c29s1p.f2.cresswell(config-if-range)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, concentr
 << ators, switches, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast will be configured in 48 interfaces due to the range command 
 but will only have effect when the interfac
 << es are in a non-trunking mode.
c29s1p.f2.cresswell(config-if-range)#switchport port-security maximum 2
c29s1p.f2.cresswell(config-if-range)#switchport port-security
c29s1p.f2.cresswell(config-if-range)#switchport port-security aging time 15
c29s1p.f2.
 << cresswell(config-if-range)#switchport port-security violation prote$port-security violation protec         t
c29s1p.f2.cresswell(config-if-range)#switchport port-security aging type inac
 << $port-security aging type inact         ivity
c29s1p.f2.cresswell(config-if-range)#power inline never

 << c29s1p.f2.cresswell(config-if-range)#end
c29s1p.f2.cresswell#
 << 
Jul  7 15:41:29: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.f2.cresswell#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.f2.cresswell(config)#
Expect: matched string 1: (config)#
 >> default interface range gi1/0/1 - 24 

 >> interface range gi1/0/1 - 24 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi1/0/1 - 24 
c29s1p.f2.cresswell(config)#interface range gi1/0/1 - 24 
c29s1p.f2.cresswell(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport access vlan 552

 >> switchport mode access

 >> spanning-tree portfast

 >> no power inline consumption

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport access vlan 552
c29s1p.f2.cresswell(config-if-range)#switchport mode access
c29s1p.f2.cresswell(config-if-range)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, concent
 << rators, switches, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast will be configured in 24 interfaces due to the range command 
 but will only have effect when the interfa
 << ces are in a non-trunking mode.
c29s1p.f2.cresswell(config-if-range)#no power inline consumption
c29s1p.f2.cresswell(config-if-range)#end
c29s1p.f2.cresswell#
 << 
Jul  7 15:41:37: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.f2.cresswell#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.f2.cresswell(config)#
Expect: matched string 1: (config)#
 >> default interface gi1/0/25 

 >> interface gi1/0/25 

Expect: searching for 1 strs:  :(config-if)#
 << default interface gi1/0/25 
Interface GigabitEthernet1/0/25 set to default configuration
c29s1p.f2.cresswell(config)#interface gi1/0/25 
c29s1p.f2.cresswell(config-if)#
Expect: matched string 1: (config-if)#
 >> switchport access vlan 802

 >> switchport mode access

 >> spanning-tree portfast

 >> power inline never

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport access vlan 802
c29s1p.f2.cresswell(config-if)#switchport mode access
c29s1p.f2.cresswell(config-if)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, concentrators, swit
 << ches, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast has been configured on GigabitEthernet1/0/25 but will only
 have effect when the interface is in a non-trunking mode.
 << 
c29s1p.f2.cresswell(config-if)#power inline never
c29s1p.f2.cresswell(config-if)#end
c29s1p.f2.cresswell#
 << 
Jul  7 15:41:43: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.f2.cresswell#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.f2.cresswell(config)#
Expect: matched string 1: (config)#
 >> default interface range gi1/0/26 - 27 

 >> interface range gi1/0/26 - 27 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi1/0/26 - 27 
c29s1p.f2.cresswell(config)#interface range gi1/0/26 - 27 
c29s1p.f2.cresswell(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport access vlan 96

 >> switchport mode access

 >> spanning-tree portfast

 >> power inline never

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport access vlan 96
c29s1p.f2.cresswell(config-if-range)#switchport mode access
c29s1p.f2.cresswell(config-if-range)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, concentr
 << ators, switches, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast will be configured in 2 interfaces due to the range command 
 but will only have effect when the interface
 << s are in a non-trunking mode.
c29s1p.f2.cresswell(config-if-range)#power inline never
c29s1p.f2.cresswell(config-if-range)#end
c29s1p.f2.cresswell#
 << 
Jul  7 15:41:49: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.f2.cresswell#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.f2.cresswell(config)#
Expect: matched string 1: (config)#
 >> default interface gi1/0/28 

 >> interface gi1/0/28 

Expect: searching for 1 strs:  :(config-if)#
 << default interface gi1/0/28 
Interface GigabitEthernet1/0/28 set to default configuration
c29s1p.f2.cresswell(config)#interface gi1/0/28 
c29s1p.f2.cresswell(config-if)#
Expect: matched string 1: (config-if)#
 >> switchport access vlan 507

 >> switchport mode access

 >> spanning-tree portfast

 >> power inline never

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport access vlan 507
c29s1p.f2.cresswell(config-if)#switchport mode access
c29s1p.f2.cresswell(config-if)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, concentrators, swit
 << ches, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast has been configured on GigabitEthernet1/0/28 but will only
 have effect when the interface is in a non-trunking mode.
 << 
c29s1p.f2.cresswell(config-if)#power inline never
c29s1p.f2.cresswell(config-if)#end
c29s1p.f2.cresswell#
 << 
Jul  7 15:41:55: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.f2.cresswell#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.f2.cresswell(config)#
Expect: matched string 1: (config)#
 >> default interface gi1/0/29 

 >> interface gi1/0/29 

Expect: searching for 1 strs:  :(config-if)#
 << default interface gi1/0/29 
Interface GigabitEthernet1/0/29 set to default configuration
c29s1p.f2.cresswell(config)#interface gi1/0/29 
c29s1p.f2.cresswell(config-if)#
Expect: matched string 1: (config-if)#
 >> switchport access vlan 97

 >> switchport mode access

 >> spanning-tree portfast

 >> power inline never

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport access vlan 97
c29s1p.f2.cresswell(config-if)#switchport mode access
c29s1p.f2.cresswell(config-if)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, concentrators, switc
 << hes, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast has been configured on GigabitEthernet1/0/29 but will only
 have effect when the interface is in a non-trunking mode.
 << 
c29s1p.f2.cresswell(config-if)#power inline never
c29s1p.f2.cresswell(config-if)#end
c29s1p.f2.cresswell#
 << 
Jul  7 15:42:01: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.f2.cresswell#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.f2.cresswell(config)#
Expect: matched string 1: (config)#
 >> default interface gi1/0/30 

 >> interface gi1/0/30 

Expect: searching for 1 strs:  :(config-if)#
 << default interface gi1/0/30 
Interface GigabitEthernet1/0/30 set to default configuration
c29s1p.f2.cresswell(config)#interface gi1/0/30 
c29s1p.f2.cresswell(config-if)#
Expect: matched string 1: (config-if)#
 >> switchport access vlan 176

 >> switchport mode access

 >> spanning-tree portfast

 >> switchport port-security maximum 2

 >> switchport port-security

 >> switchport port-security aging time 15

 >> switchport port-security violation protect

 >> switchport port-security aging type inactivity

 >> power inline never

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport access vlan 176
c29s1p.f2.cresswell(config-if)#switchport mode access
c29s1p.f2.cresswell(config-if)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, concentrators, swit
 << ches, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast has been configured on GigabitEthernet1/0/30 but will only
 have effect when the interface is in a non-trunking mode.
 << 
c29s1p.f2.cresswell(config-if)#switchport port-security maximum 2
c29s1p.f2.cresswell(config-if)#switchport port-security
c29s1p.f2.cresswell(config-if)#switchport port-security aging time 15
c29s1p.f2.cresswell(config-if)#switchport port-security vi
 << olation protect
c29s1p.f2.cresswell(config-if)#switchport port-security aging type inactivity
c29s1p.f2.cresswell(config-if)#power inline never
c29s1p.f2.cresswell(config-if)#end
c29s1p.f2.cresswell#
 << 
Jul  7 15:42:08: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.f2.cresswell#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.f2.cresswell(config)#
Expect: matched string 1: (config)#
 >> default interface gi1/0/31 

 >> interface gi1/0/31 

Expect: searching for 1 strs:  :(config-if)#
 << default interface gi1/0/31 
Interface GigabitEthernet1/0/31 set to default configuration
c29s1p.f2.cresswell(config)#interface gi1/0/31 
c29s1p.f2.cresswell(config-if)#
Expect: matched string 1: (config-if)#
 >> switchport access vlan 96

 >> switchport mode access

 >> spanning-tree portfast

 >> power inline never

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport access vlan 96
c29s1p.f2.cresswell(config-if)#switchport mode access
c29s1p.f2.cresswell(config-if)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, concentrators, switc
 << hes, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast has been configured on GigabitEthernet1/0/31 but will only
 have effect when the interface is in a non-trunking mode.
 << 
c29s1p.f2.cresswell(config-if)#power inline never
c29s1p.f2.cresswell(config-if)#end
c29s1p.f2.cresswell#
 << 
Jul  7 15:42:14: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.f2.cresswell#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.f2.cresswell(config)#
Expect: matched string 1: (config)#
 >> default interface range gi1/0/39 - 48 

 >> interface range gi1/0/39 - 48 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi1/0/39 - 48 
c29s1p.f2.cresswell(config)#interface range gi1/0/39 - 48 
c29s1p.f2.cresswell(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport mode trunk

 >> switchport trunk native vlan 92

 >> ip dhcp snooping trust

 >> no keepalive

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport mode trunk
c29s1p.f2.cresswell(config-if-range)#switchport trunk native vlan 92
c29s1p.f2.cresswell(config-if-range)#ip dhcp snooping trust
c29s1p.f2.cresswell(config-if-range)#no keepalive
c29s1p.f2.cresswell(config-if-range)#end
c29s1p.f
 << 2.cresswell#
 << 
Jul  7 15:42:20: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.f2.cresswell#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.f2.cresswell(config)#
Expect: matched string 1: (config)#
 >> default interface range te1/0/1 - 2 

 >> interface range te1/0/1 - 2 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range te1/0/1 - 2 
c29s1p.f2.cresswell(config)#interface range te1/0/1 - 2 
c29s1p.f2.cresswell(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport mode trunk

 >> switchport trunk native vlan 92

 >> ip dhcp snooping trust

 >> no keepalive

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport mode trunk
c29s1p.f2.cresswell(config-if-range)#switchport trunk native vlan 92
c29s1p.f2.cresswell(config-if-range)#ip dhcp snooping trust
c29s1p.f2.cresswell(config-if-range)#no keepalive
c29s1p.f2.cresswell(config-if-range)#end
c29s1p.f
 << 2.cresswell#
 << 
Jul  7 15:42:26: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.f2.cresswell#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.f2.cresswell(config)#
Expect: matched string 1: (config)#
 >> default interface range gi1/0/49 - 50 

 >> interface range gi1/0/49 - 50 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi1/0/49 - 50 
c29s1p.f2.cresswell(config)#interface range gi1/0/49 - 50 
c29s1p.f2.cresswell(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport mode trunk

 >> switchport trunk native vlan 92

 >> ip dhcp snooping trust

 >> no keepalive

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport mode trunk
c29s1p.f2.cresswell(config-if-range)#switchport trunk native vlan 92
c29s1p.f2.cresswell(config-if-range)#ip dhcp snooping trust
c29s1p.f2.cresswell(config-if-range)#no keepalive
c29s1p.f2.cresswell(config-if-range)#end
c29s1p.f
 << 2.cresswell#
 << 
Jul  7 15:42:32: %SYS-5-CONFIG_I: Configured from console by console
Jul  7 15:42:33: %LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet1/0/49, changed state to down
Jul  7 15:42:33: %LINEPROTO-5-UPDOWN: Line protocol on Interface Gigabit
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << Ethernet1/0/50, changed state to down
c29s1p.f2.cresswell#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.f2.cresswell(config)#
Expect: matched string 1: (config)#
 >> crypto key generate rsa

 >> no

 >> 2048

Expect: searching for 2 strs:  :OK :(config)#
 << crypto key generate rsa
The name for the keys will be: c29s1p.f2.cresswell.mgmt.msstate.edu
Choose the size of the key modulus in the range of 360 to 4096 for your
  General Purpose Keys. Choosing a key modulus greater than 512 may take
  a few minute
 << s.

How many bits in the modulus [512]: no
% A decimal number between 360 and 4096.
How many bits in the modulus [512]: 2048
% Generating 2048 bit RSA keys, keys will be non-exportable...
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...
crypto key generate rsa
The name for the keys will be: c29s1p.f2.cresswell.mgmt.msstate.edu
Choose the size of the key modulus in the range of 360 to 4096 for your
  General Purpose Keys. Choosing a key modulus greater than 512 may take
  a few minutes.

How many bits in the modulus [512]: no
% A decimal number between 360 and 4096.
How many bits in the modulus [512]: 2048
% Generating 2048 bit RSA keys, keys will be non-exportable...
...

 >> end

Expect: searching for 1 strs:  :Configured
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
[OK] (elapsed time was 22 seconds)

c29s1p.f2.cresswell(config)#end
c29s1p.f2.cresswell#
Jul  7 15:42:58: %SSH-5-ENABLED: SSH 1.99 has been enabled
Jul  7 15:42:58: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> write mem

Expect: searching for 2 strs:  :# :>
 << 
c29s1p.f2.cresswell#write mem
Building configuration...

Expect: matched string 1: #
 >> 
Expect: searching for 2 strs:  :# :>
 << [OK]
c29s1p.f2.cresswell#
c29s1p.f2.cresswell#
c29s1p.f2.cresswell#
Expect: matched string 1: #
 >> sh run

Expect: searching for 2 strs:  :# :>
 << sh run
Building configuration...

Current configuration : 13684 bytes
!
! Last configuration change at 15:42:58 CDT Fri Jul 7 2017
! NVRAM config last updated at 15:43:00 CDT Fri Jul 7 2017
!
version 15.0
no service pad
service timestamps debug 
 << datetime localtime
service timestamps log datetime localtime
service password-encryption
!
hostname c29s1p.f2.cresswell
!
boot-start-marker
boot-end-marker
!
enable secret 5 $1$4dsT$dMGk06DpAXwWmOHBsa5iq0
enable password 7 123817121356004E3D
!
 << 
username root privilege 15 secret 5 $1$Oy2e$aE8G/R.WSYpKyyQ5FDeUl0
no aaa new-model
clock timezone CST -6 0
clock summer-time CDT recurring
switch 1 provision ws-c2960x-48fpd-l
authentication mac-move permit
!
!
ip dhcp snooping vlan 31
ip dhcp 
 << snooping
ip domain-name mgmt.msstate.edu
ip name-server 130.18.80.12
!
!
crypto pki trustpoint TP-self-signed-2494998912
 enrollment selfsigned
 subject-name cn=IOS-Self-Signed-Certificate-2494998912
 revocation-check none
 rsakeypair TP-self-sig
 << ned-2494998912
!
!
crypto pki certificate chain TP-self-signed-2494998912
 certificate self-signed 01
  	quit
!
spanning-tree mode mst
spanning-tree portfast bpduguard default
spanning-tree extend system-id
!
spanning-tree mst configuration
 n
 << ame msstate
 revision 1
 instance 1 vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 63, 70
 instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 160
 instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 230, 232, 242, 246
 instan
 << ce 1 vlan 256, 611-612, 654, 741, 996, 999
 instance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037, 2039-2040
 instance 2 vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096, 2104, 2110, 2126
 instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 
 << 2168, 2189, 2194, 2202
 instance 2 vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 2654, 2999
 instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176, 196
 instance 3 vlan 244, 248, 927
 instance 4 vlan 2042, 2051, 2059, 2064, 2066, 2069, 2
 << 072, 2108, 2113, 2128
 instance 4 vlan 2144, 2176, 2196, 2244, 2248, 2927
 instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 228
 instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216, 2228
 instance 7 vlan 9, 33-34, 38, 54, 56, 71
 << , 75, 82, 84, 97, 114, 116, 124
 instance 7 vlan 172, 186, 192, 204-208, 210, 240-241, 251-252, 630, 928
 instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082, 2084
 instance 8 vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208, 22
 << 10
 instance 8 vlan 2240-2241, 2251-2252, 2630, 2928
 instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102, 112
 instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 500, 505, 510-511
 instance 9 vlan 522, 551-570, 603, 629, 633, 742, 
 << 802, 926, 929
 instance 10 vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 2057, 2062, 2068
 instance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148, 2158
 instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522, 2603, 2629, 2633
 instance 1
 << 0 vlan 2802, 2926, 2929
 instance 11 vlan 8, 43, 52, 146, 156-157, 180, 200, 218
 instance 12 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180, 2200, 2218
!
!
!
!
!
!
errdisable recovery cause udld
errdisable recovery cause bpduguard
errdisable rec
 << overy cause security-violation
errdisable recovery cause channel-misconfig (STP)
errdisable recovery cause pagp-flap
errdisable recovery cause dtp-flap
errdisable recovery cause link-flap
errdisable recovery cause sfp-config-mismatch
errdisable reco
 << very cause gbic-invalid
errdisable recovery cause psecure-violation
errdisable recovery cause port-mode-failure
errdisable recovery cause dhcp-rate-limit
errdisable recovery cause pppoe-ia-rate-limit
errdisable recovery cause mac-limit
errdisable re
 << covery cause vmps
errdisable recovery cause storm-control
errdisable recovery cause inline-power
errdisable recovery cause arp-inspection
errdisable recovery cause loopback
errdisable recovery cause small-frame
errdisable recovery cause psp
errdisa
 << ble recovery interval 1800
!
vlan internal allocation policy ascending
!
!
!
!
!
!
interface FastEthernet0
 no ip address
 shutdown
!
interface GigabitEthernet1/0/1
 switchport access vlan 552
 switchport mode access
 spanning-tree portfas
 << t
!
interface GigabitEthernet1/0/2
 switchport access vlan 552
 switchport mode access
 spanning-tree portfast
!
interface GigabitEthernet1/0/3
 switchport access vlan 552
 switchport mode access
 spanning-tree portfast
!
interface GigabitEthe
 << rnet1/0/4
 switchport access vlan 552
 switchport mode access
 spanning-tree portfast
!
interface GigabitEthernet1/0/5
 switchport access vlan 552
 switchport mode access
 spanning-tree portfast
!
interface GigabitEthernet1/0/6
 switchport acce
 << ss vlan 552
 switchport mode access
 spanning-tree portfast
!
interface GigabitEthernet1/0/7
 switchport access vlan 552
 switchport mode access
 spanning-tree portfast
!
interface GigabitEthernet1/0/8
 switchport access vlan 552
 switchport mo
 << de access
 spanning-tree portfast
!
interface GigabitEthernet1/0/9
 switchport access vlan 552
 switchport mode access
 spanning-tree portfast
!
interface GigabitEthernet1/0/10
 switchport access vlan 552
 switchport mode access
 spanning-tree 
 << portfast
!
interface GigabitEthernet1/0/11
 switchport access vlan 552
 switchport mode access
 spanning-tree portfast
!
interface GigabitEthernet1/0/12
 switchport access vlan 552
 switchport mode access
 spanning-tree portfast
!
interface Gi
 << gabitEthernet1/0/13
 switchport access vlan 552
 switchport mode access
 spanning-tree portfast
!
interface GigabitEthernet1/0/14
 switchport access vlan 552
 switchport mode access
 spanning-tree portfast
!
interface GigabitEthernet1/0/15
 swi
 << tchport access vlan 552
 switchport mode access
 spanning-tree portfast
!
interface GigabitEthernet1/0/16
 switchport access vlan 552
 switchport mode access
 spanning-tree portfast
!
interface GigabitEthernet1/0/17
 switchport access vlan 552

 <<  switchport mode access
 spanning-tree portfast
!
interface GigabitEthernet1/0/18
 switchport access vlan 552
 switchport mode access
 spanning-tree portfast
!
interface GigabitEthernet1/0/19
 switchport access vlan 552
 switchport mode access

 <<  spanning-tree portfast
!
interface GigabitEthernet1/0/20
 switchport access vlan 552
 switchport mode access
 spanning-tree portfast
!
interface GigabitEthernet1/0/21
 switchport access vlan 552
 switchport mode access
 spanning-tree portfast

 << !
interface GigabitEthernet1/0/22
 switchport access vlan 552
 switchport mode access
 spanning-tree portfast
!
interface GigabitEthernet1/0/23
 switchport access vlan 552
 switchport mode access
 spanning-tree portfast
!
interface GigabitEther
 << net1/0/24
 switchport access vlan 552
 switchport mode access
 spanning-tree portfast
!
interface GigabitEthernet1/0/25
 switchport access vlan 802
 switchport mode access
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1
 << /0/26
 switchport access vlan 96
 switchport mode access
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/27
 switchport access vlan 96
 switchport mode access
 power inline never
 spanning-tree portfast
!
interface G
 << igabitEthernet1/0/28
 switchport access vlan 507
 switchport mode access
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/29
 switchport access vlan 97
 switchport mode access
 power inline never
 spanning-tree portfast
 << 
!
interface GigabitEthernet1/0/30
 switchport access vlan 176
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport p
 << ort-security aging type inactivity
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/31
 switchport access vlan 96
 switchport mode access
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/32
 s
 << witchport access vlan 31
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 powe
 << r inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/33
 switchport access vlan 31
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-sec
 << urity violation protect
 switchport port-security aging type inactivity
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/34
 switchport access vlan 31
 switchport mode access
 switchport port-security maximum 2
 switchpo
 << rt port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/35
 switchport access v
 << lan 31
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 power inline never
 s
 << panning-tree portfast
!
interface GigabitEthernet1/0/36
 switchport access vlan 31
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation pr
 << otect
 switchport port-security aging type inactivity
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/37
 switchport access vlan 31
 switchport mode access
 switchport port-security maximum 2
 switchport port-security

 <<  switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/38
 switchport access vlan 31
 switchpor
 << t mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 power inline never
 spanning-tree portf
 << ast
!
interface GigabitEthernet1/0/39
 switchport trunk native vlan 92
 switchport mode trunk
 no keepalive
 ip dhcp snooping trust
!
interface GigabitEthernet1/0/40
 switchport trunk native vlan 92
 switchport mode trunk
 no keepalive
 ip dhc
 << p snooping trust
!
interface GigabitEthernet1/0/41
 switchport trunk native vlan 92
 switchport mode trunk
 no keepalive
 ip dhcp snooping trust
!
interface GigabitEthernet1/0/42
 switchport trunk native vlan 92
 switchport mode trunk
 no keepa
 << live
 ip dhcp snooping trust
!
interface GigabitEthernet1/0/43
 switchport trunk native vlan 92
 switchport mode trunk
 no keepalive
 ip dhcp snooping trust
!
interface GigabitEthernet1/0/44
 switchport trunk native vlan 92
 switchport mode tru
 << nk
 no keepalive
 ip dhcp snooping trust
!
interface GigabitEthernet1/0/45
 switchport trunk native vlan 92
 switchport mode trunk
 no keepalive
 ip dhcp snooping trust
!
interface GigabitEthernet1/0/46
 switchport trunk native vlan 92
 switch
 << port mode trunk
 no keepalive
 ip dhcp snooping trust
!
interface GigabitEthernet1/0/47
 switchport trunk native vlan 92
 switchport mode trunk
 no keepalive
 ip dhcp snooping trust
!
interface GigabitEthernet1/0/48
 switchport trunk native vla
 << n 92
 switchport mode trunk
 no keepalive
 ip dhcp snooping trust
!
interface GigabitEthernet1/0/49
 switchport trunk native vlan 92
 switchport mode trunk
 ip dhcp snooping trust
!
interface GigabitEthernet1/0/50
 switchport trunk native vlan 
 << 92
 switchport mode trunk
 ip dhcp snooping trust
!
interface TenGigabitEthernet1/0/1
 switchport trunk native vlan 92
 switchport mode trunk
 ip dhcp snooping trust
!
interface TenGigabitEthernet1/0/2
 switchport trunk native vlan 92
 switchpo
 << rt mode trunk
 ip dhcp snooping trust
!
interface Vlan1
 no ip address
 no ip route-cache
 shutdown
!
interface Vlan92
 ip address 10.92.3.103 255.255.0.0
 ip broadcast-address 10.92.255.255
!
ip default-gateway 10.92.0.1
no ip http server
n
 << o ip http secure-server
!
logging facility local1
logging host 130.18.8.12
access-list 1 permit 10.92.0.0 0.0.255.255
access-list 1 permit 130.18.8.0 0.0.0.255
access-list 1 permit 10.93.0.0 0.0.255.255
access-list 1 permit 130.18.1.0 0.0.0.255
!
 << 
snmp-server community sysnet RO 1
snmp-server community c2-b2=a2 RW 1
snmp-server contact 6F-2016
snmp-server enable traps snmp authentication linkdown linkup coldstart warmstart
snmp-server enable traps transceiver all
snmp-server enable traps tty
 << 
snmp-server enable traps cluster
snmp-server enable traps config-copy
snmp-server enable traps config
snmp-server enable traps config-ctid
snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-auth-fail-vlan no-guest-vlan
snmp-server enable tr
 << aps entity
snmp-server enable traps power-ethernet police
snmp-server enable traps cpu threshold
snmp-server enable traps rep
snmp-server enable traps bridge newroot topologychange
snmp-server enable traps stpx inconsistency root-inconsistency loop-i
 << nconsistency
snmp-server enable traps syslog
snmp-server enable traps vtp
snmp-server enable traps vlancreate
snmp-server enable traps vlandelete
snmp-server enable traps flash insertion removal
snmp-server enable traps port-security
snmp-server en
 << able traps envmon fan shutdown supply temperature status
snmp-server enable traps errdisable
snmp-server enable traps mac-notification change move threshold
snmp-server enable traps vlan-membership
snmp-server host 130.18.8.12 sysnet 
!
!
line con 
 << 0
line vty 0 4
 access-class 1 in
 password 7 132405170A5108603C
 login local
 transport input ssh
line vty 5 15
 access-class 1 in
 password 7 132405170A5108603C
 login local
 transport input ssh
!
ntp server 10.92.0.5
end

c29s1p.f2.cress
 << well#
Expect: matched string 1: #
 >> show interface status

Expect: searching for 2 strs:  :# :>
 << show interface status

Port      Name               Status       Vlan       Duplex  Speed Type
Gi1/0/1                      notconnect   552          auto   auto 10/100/1000BaseTX
Gi1/0/2                      notconnect   552          auto   auto 10/1
 << 00/1000BaseTX
Gi1/0/3                      notconnect   552          auto   auto 10/100/1000BaseTX
Gi1/0/4                      notconnect   552          auto   auto 10/100/1000BaseTX
Gi1/0/5                      notconnect   552          auto   auto 1
 << 0/100/1000BaseTX
Gi1/0/6                      notconnect   552          auto   auto 10/100/1000BaseTX
Gi1/0/7                      notconnect   552          auto   auto 10/100/1000BaseTX
Gi1/0/8                      notconnect   552          auto   aut
 << o 10/100/1000BaseTX
Gi1/0/9                      notconnect   552          auto   auto 10/100/1000BaseTX
Gi1/0/10                     notconnect   552          auto   auto 10/100/1000BaseTX
Gi1/0/11                     notconnect   552          auto   
 << auto 10/100/1000BaseTX
Gi1/0/12                     notconnect   552          auto   auto 10/100/1000BaseTX
Gi1/0/13                     notconnect   552          auto   auto 10/100/1000BaseTX
Gi1/0/14                     notconnect   552          auto
 <<    auto 10/100/1000BaseTX
Gi1/0/15                     notconnect   552          auto   auto 10/100/1000BaseTX
Gi1/0/16                     notconnect   552          auto   auto 10/100/1000BaseTX
Gi1/0/17                     notconnect   552          a
 << uto   auto 10/100/1000BaseTX
Gi1/0/18                     notconnect   552          auto   auto 10/100/1000BaseTX
Gi1/0/19                     notconnect   552          auto   auto 10/100/1000BaseTX
Gi1/0/20                     notconnect   552        
 <<   auto   auto 10/100/1000BaseTX
Gi1/0/21                     notconnect   552          auto   auto 10/100/1000BaseTX
Gi1/0/22                     notconnect   552          auto   auto 10/100/1000BaseTX
Gi1/0/23                     notconnect   552     
 <<      auto   auto 10/100/1000BaseTX
Gi1/0/24                     notconnect   552          auto   auto 10/100/1000BaseTX
Gi1/0/25                     notconnect   802          auto   auto 10/100/1000BaseTX
Gi1/0/26                     notconnect   96   
 <<         auto   auto 10/100/1000BaseTX
Gi1/0/27                     notconnect   96           auto   auto 10/100/1000BaseTX
Gi1/0/28                     notconnect   507          auto   auto 10/100/1000BaseTX
Gi1/0/29                     notconnect   97
 <<            auto   auto 10/100/1000BaseTX
Gi1/0/30                     notconnect   176          auto   auto 10/100/1000BaseTX
Gi1/0/31                     notconnect   96           auto   auto 10/100/1000BaseTX
Gi1/0/32                     notconnect  
 <<  31           auto   auto 10/100/1000BaseTX
Gi1/0/33                     notconnect   31           auto   auto 10/100/1000BaseTX
Gi1/0/34                     notconnect   31           auto   auto 10/100/1000BaseTX
Gi1/0/35                     notconnec
 << t   31           auto   auto 10/100/1000BaseTX
Gi1/0/36                     notconnect   31           auto   auto 10/100/1000BaseTX
Gi1/0/37                     notconnect   31           auto   auto 10/100/1000BaseTX
Gi1/0/38                     notcon
 << nect   31           auto   auto 10/100/1000BaseTX
Gi1/0/39                     notconnect   1            auto   auto 10/100/1000BaseTX
Gi1/0/40                     notconnect   1            auto   auto 10/100/1000BaseTX
Gi1/0/41                     not
 << connect   1            auto   auto 10/100/1000BaseTX
Gi1/0/42                     notconnect   1            auto   auto 10/100/1000BaseTX
Gi1/0/43                     notconnect   1            auto   auto 10/100/1000BaseTX
Gi1/0/44                     
 << notconnect   1            auto   auto 10/100/1000BaseTX
Gi1/0/45                     notconnect   1            auto   auto 10/100/1000BaseTX
Gi1/0/46                     notconnect   1            auto   auto 10/100/1000BaseTX
Gi1/0/47                  
 <<    notconnect   1            auto   auto 10/100/1000BaseTX
Gi1/0/48                     notconnect   1            auto   auto 10/100/1000BaseTX
Te1/0/1                      notconnect   1            full    10G Not Present
Te1/0/2                      
 << notconnect   1            full    10G Not Present
Fa0                          disabled     routed       auto   auto 10/100BaseTX
c29s1p.f2.cresswell#
Expect: matched string 1: #
