trying to use serial port: /dev/ttyUSB0
 >> 
 >> 

Expect: searching for 4 strs:  :[yes/no] :Press RETURN to get started. :# :Switch>
 << 
c29s1p.r246b.allen>
c29s1p.r246b.allen>
c29s1p.r246b.allen>
c29s1p.r246b.allen>
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

c29s1p.r246b.allen>
c29s1p.r246b.allen>
c29s1p.r246b.allen>
c29s1p.r246b.allen>
...

 >> 

Expect: searching for 2 strs:  :# :>
 << 
c29s1p.r246b.allen>
c29s1p.r246b.allen>
Expect: matched string 2: >
 >> term len 0

Expect: searching for 2 strs:  :# :>
 << term len 0
c29s1p.r246b.allen>
Expect: matched string 2: >
 >> show version

Expect: searching for 2 strs:  :# :>
 << show version
Cisco IOS Software, C2960X Software (C2960X-UNIVERSALK9-M), Version 15.0(2)EX5, RELEASE SOFTWARE (fc1)
Technical Support: http://www.cisco.com/techsupport
Copyright (c) 1986-2014 by Cisco Systems, Inc.
Compiled Fri 21-Feb-14 05:54 by prod
 << _rel_team

ROM: Bootstrap program is C2960X boot loader
BOOTLDR: C2960X Boot Loader (C2960X-HBOOT-M) Version 15.2(2r)E1, RELEASE SOFTWARE (fc1)

c29s1p.r246b.allen uptime is 18 minutes
System returned to ROM by power-on
System restarted at 03:56:15
 <<  CDT Tue Oct 17 2017
System image file is "flash:/c2960x-universalk9-mz.150-2.EX5/c2960x-universalk9-mz.150-2.EX5.bin"


This product contains cryptographic features and is subject to United
States and local country laws governing import, export, tra
 << nsfer and
use. Delivery of Cisco cryptographic products does not imply
third-party authority to import, export, distribute or use encryption.
Importers, exporters, distributors and users are responsible for
compliance with U.S. and local country laws.
 <<  By using this product you
agree to comply with applicable laws and regulations. If you are unable
to comply with U.S. and local laws, return this product immediately.

A summary of U.S. laws governing Cisco cryptographic products may be found at:
ht
 << tp://www.cisco.com/wwl/export/crypto/tool/stqrg.html

If you require further assistance please contact us by sending email to
export@cisco.com.

cisco WS-C2960X-48FPD-L (APM86XXX) processor (revision F0) with 524288K bytes of memory.
Processor board
 <<  ID FCW1905A5UH
Last reset from power-on
2 Virtual Ethernet interfaces
1 FastEthernet interface
50 Gigabit Ethernet interfaces
2 Ten Gigabit Ethernet interfaces
The password-recovery mechanism is enabled.

512K bytes of flash-simulated non-volatil
 << e configuration memory.
Base ethernet MAC Address       : BC:F1:F2:85:19:00
Motherboard assembly number     : 73-15964-02
Power supply part number        : 341-0527-01
Motherboard serial number       : FOC19052W0H
Power supply serial number      : DC
 << B1903642T
Model revision number           : F0
Motherboard revision number     : C0
Model number                    : WS-C2960X-48FPD-L
Daughterboard assembly number   : 73-14200-03
Daughterboard serial number     : FOC190577P5
System serial number 
 <<            : FCW1905A5UH
Top Assembly Part Number        : 800-41461-01
Top Assembly Revision Number    : C0
Version ID                      : V02
CLEI Code Number                : CMMLJ00ARB
Daughterboard revision number   : A0
Hardware Board Revis
 << ion Number  : 0x12


Switch Ports Model              SW Version            SW Image                 
------ ----- -----              ----------            ----------               
*    1 52    WS-C2960X-48FPD-L  15.0(2)EX5            C2960X-UNIVERSA
 << LK9-M     


Configuration register is 0xF

c29s1p.r246b.allen>
Expect: matched string 2: >
 >> enable

Expect: searching for 2 strs:  :Password: :#
 << enable
Password: 
Expect: matched string 1: Password:
 >> Area=l*w

Expect: searching for 1 strs:  :#
 << 
c29s1p.r246b.allen#
Expect: matched string 1: #
 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.r246b.allen(config)#
Expect: matched string 1: (config)#
 >> no service pad

 >> service timestamps debug datetime localtime

 >> service timestamps log datetime localtime

 >> service password-encryption

 >> boot-start-marker

 >> boot-end-marker

 >> enable secret Area=l*w

 >> enable password Area=l*w

 >> username root privilege 15 secret Area=l*w

 >> no aaa new-model

 >> clock timezone CST -6 0

 >> clock summer-time CDT recurring

 >> authentication mac-move permit

 >> ip domain-name mgmt.msstate.edu

 >> ip name-server 130.18.80.12

 >> vtp domain vtp01.mgmt.msstate.edu

 >> vtp mode client

 >> crypto pki trustpoint TP-self-signed-2494998912

 >>  enrollment selfsigned

 >>  subject-name cn=IOS-Self-Signed-Certificate-2494998912

 >>  revocation-check none

 >>  rsakeypair TP-self-signed-2494998912

 >> crypto pki certificate chain TP-self-signed-2494998912

 >>  certificate self-signed 01 nvram:IOS-Self-Sig#3232.cer

 >> spanning-tree portfast bpduguard default

 >> spanning-tree extend system-id

 >> vlan internal allocation policy ascending

 >> errdisable recovery cause all

 >> errdisable recovery interval 1800

 >> interface FastEthernet0

 >>  no ip address

 >>  shutdown

 >> interface Vlan1

 >>  no ip address

 >>  no ip route-cache

 >>  shutdown

 >> interface Vlan92

 >> no ip http server

 >> no ip http secure-server

 >> logging facility local1

 >> logging host 130.18.8.12

 >> access-list 1 permit 10.92.0.0 0.0.255.255

 >> access-list 1 permit 130.18.8.0 0.0.0.255

 >> access-list 1 permit 10.93.0.0 0.0.255.255

 >> access-list 1 permit 130.18.1.0 0.0.0.255

 >> snmp-server community sysnet RO 1

 >> snmp-server community c2-b2=a2 RW 1

 >> snmp-server enable traps snmp authentication linkdown linkup coldstart warmstart

 >> snmp-server enable traps transceiver all

 >> snmp-server enable traps tty

 >> snmp-server enable traps cluster

 >> snmp-server enable traps config-copy

 >> snmp-server enable traps config

 >> snmp-server enable traps config-ctid

 >> snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-auth-fail-vlan no-guest-vlan

 >> snmp-server enable traps entity

 >> snmp-server enable traps power-ethernet police

 >> snmp-server enable traps cpu threshold

 >> snmp-server enable traps rep

 >> snmp-server enable traps bridge newroot topologychange

 >> snmp-server enable traps stpx inconsistency root-inconsistency loop-inconsistency

 >> snmp-server enable traps syslog

 >> snmp-server enable traps vtp

 >> snmp-server enable traps vlancreate

 >> snmp-server enable traps vlandelete

 >> snmp-server enable traps flash insertion removal

 >> snmp-server enable traps port-security

 >> snmp-server enable traps envmon fan shutdown supply temperature status

 >> snmp-server enable traps errdisable

 >> snmp-server enable traps mac-notification change move threshold

 >> snmp-server enable traps vlan-membership

 >> snmp-server host 130.18.8.12 sysnet 

 >> line con 0

 >> line vty 0 15

 >>  access-class 1 in

 >>  password Area=l*w

 >>  login local

 >>  transport input ssh

 >> ntp server 10.92.0.5

 >> 

 >> end

Expect: searching for 1 strs:  :Configured
 << no service pad
c29s1p.r246b.allen(config)#service timestamps debug datetime localtime
c29s1p.r246b.allen(config)#service timestamps log datetime localtime
c29s1p.r246b.allen(config)#service password-encryption
c29s1p.r246b.allen(config)#boot-start-mar
 << ker
c29s1p.r246b.allen(config)#boot-end-marker
c29s1p.r246b.allen(config)#enable secret Area=l*w
The enable secret you have chosen is the same as your enable password.
This is not recommended.  Re-enter the enable secret.

c29s1p.r246b.allen(config)
 << #enable password Area=l*w
The enable password you have chosen is the same as your enable secret.
This is not recommended.  Re-enter the enable password.

c29s1p.r246b.allen(config)#username root privilege 15 secret Area=l*w
c29s1p.r246b.allen(config)
 << #no aaa new-model
c29s1p.r246b.allen(config)#clock timezone CST -6 0
c29s1p.r246b.allen(config)#clock summer-time CDT recurring
c29s1p.r246b.allen(config)#authentication mac-move permit
c29s1p.r246b.allen(config)#ip domain-name mgmt.msstate.edu
c29s1
 << p.r246b.allen(config)#ip name-server 130.18.80.12
c29s1p.r246b.allen(config)#vtp domain vtp01.mgmt.msstate.edu
Changing VTP domain name from NULL to vtp01.mgmt.msstate.edu
c29s1p.r246b.allen(config)#vtp mode client
Setting device to VTP Client mode fo
 << r VLANS.
c29s1p.r246b.allen(config)#crypto pki trustpoint TP-self-signed-2494998912
c29s1p.r246b.allen(ca-trustpoint)# enrollment selfsigned
c29s1p.r246b.allen(ca-trustpoint)# subject-name cn=IOS-Self-Signed-Certificat
 << $me cn=IOS-Self-Signed-Certificate         -24949989Self-Signed-Certificate-249499891         2
c29s1p.r246b.allen(ca-trustpoint)# revocation-check none
c29s1p.r246b.allen(ca-trustpoin
 << t)#
Oct 17 04:17:18: %SW_VLAN-6-VTP_DOMAIN_NAME_CHG: VTP domain name changed to vtp01.mgmt.msstate.edu. rsakeypair TP-self-signed-2494998912
c29s1p.r246b.allen(ca-trustpoint)#crypto pki certificate chain TP-self-signed
 << $certificate chain TP-self-signed-         249499891e chain TP-self-signed-2494998912         
c29s1p.r246b.allen(config-cert-chain)# certificate self-signed 01 nvram:IOS-S
 << $e self-signed 01 nvram:IOS-Se         lf-Sig#32ned 01 nvram:IOS-Self-Sig#323         2.cer
c29s1p.r246b.allen(config-cert-chain)#spanning-tree portfast bpduguard defaul
 << $ee portfast bpduguard default         
c29s1p.r246b.allen(config)#spanning-tree extend system-id
c29s1p.r246b.allen(config)#vlan internal allocation policy ascending
c29s1p.r246b.allen(config)#errdisable rec
 << overy cause all
c29s1p.r246b.allen(config)#errdisable recovery interval 1800
c29s1p.r246b.allen(config)#interface FastEthernet0
c29s1p.r246b.allen(config-if)#
Oct 17 04:17:20: % Multiple self signed certificates in config
    certificate for trust po
 << int TP-self-signed-2494998912 ignored
 no ip address
c29s1p.r246b.allen(config-if)# shutdown
c29s1p.r246b.allen(config-if)#interface Vlan1
c29s1p.r246b.allen(config-if)# no ip address
c29s1p.r246b.allen(config-if)# no ip route-cache
c29s1p.r246b.all
 << en(config-if)# shutdown
c29s1p.r246b.allen(config-if)#interface Vlan92
c29s1p.r246b.allen(config-if)#no ip http server
c29s1p.r246b.allen(config)#no ip http secure-server
c29s1p.r246b.allen(config)#logging facility local1
c29s1p.r246b.allen(config)#l
 << ogging host 130.18.8.12
c29s1p.r246b.allen(config)#access-list 1 permit 10.92.0.0 0.0.255.255
c29s1p.r246b.allen(config)#access-list 1 permit 130.18.8.0 0.0.0.255
c29s1p.r246b.allen(config)#access-list 1 permit 10.93.0.0 0.0.255.255
c29s1p.r246b.allen
 << (config)#access-list 1 permit 130.18.1.0 0.0.0.255
c29s1p.r246b.allen(config)#snmp-server community sysnet RO 1
c29s1p.r246b.allen(config)#snmp-server community c2-b2=a2 RW 1
c29s1p.r246b.allen(config)#snmp-server enable traps snmp authentication linkd
 << $ enable traps snmp authentication linkdo         wn linkupaps snmp authentication linkdown linkup          coldstart
 << uthentication linkdown linkup coldstart          warmstart
c29s1p.r246b.allen(config)#snmp-server enable traps transceiver all
c29s1p.r246b.allen(config)#snmp-server enable traps tty
c29s1p.r246b.allen(config)#snmp-
 << server enable traps cluster
c29s1p.r246b.allen(config)#snmp-server enable traps config-copy
c29s1p.r246b.allen(config)#snmp-server enable traps config
c29s1p.r246b.allen(config)#snmp-server enable traps config-ctid
c29s1p.r246b.allen(config)#snmp-serv
 << er enable traps dot1x auth-fail-vlan gues$ enable traps dot1x auth-fail-vlan guest         -vlan no-aps dot1x auth-fail-vlan guest-vlan no-a       
 <<   uth-fail-uth-fail-vlan guest-vlan no-auth-fail-v         lan no-guvlan guest-vlan no-auth-fail-vlan no-gue         st-vlan
c29s1
 << p.r246b.allen(config)#snmp-server enable traps entity
c29s1p.r246b.allen(config)#snmp-server enable traps power-ethernet police
c29s1p.r246b.allen(config)#snmp-server enable traps cpu threshold
c29s1p.r246b.allen(config)#snmp-server enable traps rep
c
 << 29s1p.r246b.allen(config)#snmp-server enable traps bridge newroot topologych$ enable traps bridge newroot topologycha         nge
c29s1p.r246b.allen(config)#snmp-server enable traps stpx inconsis
 << tency root-i$ enable traps stpx inconsistency root-in         consistenaps stpx inconsistency root-inconsistenc         y loop-in
 << nconsistency root-inconsistency loop-inc         onsistenccy root-inconsistency loop-inconsistency         
c29s1p.r246b.allen(config)#snmp-server 
 << enable traps syslog
c29s1p.r246b.allen(config)#snmp-server enable traps vtp
c29s1p.r246b.allen(config)#snmp-server enable traps vlancreate
c29s1p.r246b.allen(config)#snmp-server enable traps vlandelete
c29s1p.r246b.allen(config)#snmp-server enable tra
 << ps flash insertion removal
c29s1p.r246b.allen(config)#snmp-server enable traps port-security
c29s1p.r246b.allen(config)#snmp-server enable traps envmon fan shutdown suppl$ enable traps envmon fan shutdow
 << n supply          temperataps envmon fan shutdown supply temperatu         re status
c29s1p.r246b.allen(config)#snmp-server enable traps errdisable
c29s1p.r246b.allen(config)#snmp-server
 <<  enable traps mac-notification change m$ enable traps mac-notification change mo         ve threshaps mac-notification change move thresho         
 << ld
c29s1p.r246b.allen(config)#snmp-server enable traps vlan-membership
c29s1p.r246b.allen(config)#snmp-server host 130.18.8.12 sysnet 
c29s1p.r246b.allen(config)#line con 0
c29s1p.r246b.allen(config-line)#line vty 0 15
c29s1p.r246b.allen(con
 << fig-line)# access-class 1 in
c29s1p.r246b.allen(config-line)# password Area=l*w
c29s1p.r246b.allen(config-line)# login local
c29s1p.r246b.allen(config-line)# transport input ssh
c29s1p.r246b.allen(config-line)#ntp server 10.92.0.5
c29s1p.r246b.allen(
 << config)#
c29s1p.r246b.allen(config)#end
c29s1p.r246b.allen#
 << 
Oct 17 04:17:32: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.r246b.allen#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.r246b.allen(config)#
Expect: matched string 1: (config)#
 >> spanning-tree mode mst

 >> spanning-tree etherchannel guard misconfig

 >> spanning-tree mst configuration

 >>  name msstate

 >>  revision 1

 >>  instance 1 vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 63, 70

 >>  instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 160

 >>  instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 230, 232, 242, 246

 >>  instance 1 vlan 256, 611-612, 654, 741, 996, 999

 >>  instance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037, 2039-2040

 >>  instance 2 vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096, 2104, 2110, 2126

 >>  instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 2189, 2194, 2202

 >>  instance 2 vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 2654, 2999

 >>  instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176, 196

 >>  instance 3 vlan 244, 248, 927

 >>  instance 4 vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072, 2108, 2113, 2128

 >>  instance 4 vlan 2144, 2176, 2196, 2244, 2248, 2927

 >>  instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 228

 >>  instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216, 2228

 >>  instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116, 124

 >>  instance 7 vlan 172, 186, 192, 204-208, 210, 240-241, 251-252, 630, 928

 >>  instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082, 2084

 >>  instance 8 vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208, 2210

 >>  instance 8 vlan 2240-2241, 2251-2252, 2630, 2928

 >>  instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102, 112

 >>  instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 500, 505, 510-511

 >>  instance 9 vlan 522, 551-570, 603, 629, 633, 742, 802, 926, 929

 >>  instance 10 vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 2057, 2062, 2068

 >>  instance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148, 2158

 >>  instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522, 2603, 2629, 2633

 >>  instance 10 vlan 2802, 2926, 2929

 >>  instance 11 vlan 8, 43, 52, 146, 156-157, 180, 200, 218

 >>  instance 12 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180, 2200, 2218

 >> 

 >> end

Expect: searching for 1 strs:  :Configured
 << spanning-tree mode mst
c29s1p.r246b.allen(config)#spanning-tree etherchannel guard misconfig
c29s1p.r246b.allen(config)#spanning-tree mst configuration
c29s1p.r246b.allen(config-mst)# name msstate
c29s1p.r246b.allen(config-mst)# revision 1
c29s1p.r24
 << 6b.allen(config-mst)# instance 1 vlan 2, 7, 11, 20, 22, 24, 31, 35,$ vlan 2, 7, 11, 20, 22, 24, 31, 35,          37, 39-40, 11, 20, 22, 24, 31, 35, 37, 39-
 << 40,          50, 60, 22, 24, 31, 35, 37, 39-40, 50, 60, 6         3, 70
c29s1p.r246b.allen(config-mst)# instance 1 vlan 78, 80, 86, 91, 96, 104, 110,
 << $ vlan 78, 80, 86, 91, 96, 104, 110,          126, 136,80, 86, 91, 96, 104, 110, 126, 136,          140, 152,, 96, 104, 110, 126, 136, 140, 152
 << ,          160
c29s1p.r246b.allen(config-mst)# instance 1 vlan 162-163, 168, 189, 194, 202, $ vlan 162-163, 168, 189, 194, 202, 2         20, 222, 
 << 163, 168, 189, 194, 202, 220, 222, 2         30, 232, 89, 194, 202, 220, 222, 230, 232, 2         42, 246
c29s1p.r246b.allen(config-mst)# instance 1 vlan 256, 611-612, 654, 741, 996, 
 << $ vlan 256, 611-612, 654, 741, 996, 9         99
c29s1p.r246b.allen(config-mst)# instance 2 vlan 2002, 2007, 2011, 2020, 2022,$ vlan 2002, 2007, 2011, 2020, 202
 << 2,          2024, 203, 2007, 2011, 2020, 2022, 2024, 2031         , 2035, 211, 2020, 2022, 2024, 2031, 2035, 20         37, 2039-
 << 2022, 2024, 2031, 2035, 2037, 2039-2         040
c29s1p.r246b.allen(config-mst)# instance 2 vlan 2050, 2060, 2063, 2070, 2080,$ vlan 2050, 2060, 2063, 2070, 2080, 
 <<          2086, 209, 2060, 2063, 2070, 2080, 2086, 2096         , 2104, 263, 2070, 2080, 2086, 2096, 2104, 21         10, 2126
c29s1p.r246
 << b.allen(config-mst)# instance 2 vlan 2136, 2140, 2152, 2160, 2162-$ vlan 2136, 2140, 2152, 2160, 2162-2         163, 2168, 2140, 2152, 2160, 2162-2163, 216
 << 8,          2189, 2152, 2160, 2162-2163, 2168, 2189, 219         4, 2202
c29s1p.r246b.allen(config-mst)# instance 2 vlan 2220, 2222, 2232, 2242, 2246,
 << $ vlan 2220, 2222, 2232, 2242, 2246,          2611-2612, 2222, 2232, 2242, 2246, 2611-2612,          2654, 2932, 2242, 2246, 2611-2612, 2654, 
 << 299         9
c29s1p.r246b.allen(config-mst)# instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 1$ vlan 42, 51, 59, 64, 66, 69, 72, 10         8, 113, 1
 << 51, 59, 64, 66, 69, 72, 108, 113, 12         8, 144, 1, 66, 69, 72, 108, 113, 128, 144, 17         6, 196
c29s1p.r246b.allen(config-mst)# instance 3 vlan 244, 248, 927
c29s1p.r246b.allen(co
 << nfig-mst)# instance 4 vlan 2042, 2051, 2059, 2064, 2066,$ vlan 2042, 2051, 2059, 2064, 2066,          2069, 207, 2051, 2059, 2064, 2066, 2069, 2072        
 <<  , 2108, 259, 2064, 2066, 2069, 2072, 2108, 21         13, 2128
c29s1p.r246b.allen(config-mst)# instance 4 vlan 2144, 2176, 2196, 2244, 2248,$ vl
 << an 2144, 2176, 2196, 2244, 2248,          2927
c29s1p.r246b.allen(config-mst)# instance 5 vlan 16, 48, 58, 88, 121, 131, 133$ vlan 16, 48, 58, 88, 121, 131, 133-         134, 216,
 << 48, 58, 88, 121, 131, 133-134, 216,          228
c29s1p.r246b.allen(config-mst)# instance 6 vlan 2016, 2048, 2058, 2088, 2121,$ vlan 2016, 2048, 2058, 2088, 2121,   
 <<        2131, 213, 2048, 2058, 2088, 2121, 2131, 2133         -2134, 2258, 2088, 2121, 2131, 2133-2134, 221         6, 2228
c29s1p.r246b.a
 << llen(config-mst)# instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75,$ vlan 9, 33-34, 38, 54, 56, 71, 75,          82, 84, 93-34, 38, 54, 56, 71, 75, 82, 84, 97 
 <<         , 114, 1154, 56, 71, 75, 82, 84, 97, 114, 116         , 124
c29s1p.r246b.allen(config-mst)# instance 7 vlan 172, 186, 192, 204-208, 210, 
 << $ vlan 172, 186, 192, 204-208, 210, 2         40-241, 2186, 192, 204-208, 210, 240-241, 25         1-252, 63204-208, 210, 240-241, 251-252, 630      
 <<    , 928
c29s1p.r246b.allen(config-mst)# instance 8 vlan 2009, 2033-2034, 2038, 2054, $ vlan 2009, 2033-2034, 2038, 2054, 2         056, 2071, 20
 << 33-2034, 2038, 2054, 2056, 2071,          2075, 204, 2038, 2054, 2056, 2071, 2075, 208         2, 2084
c29s1p.r246b.allen(config-mst)# instance 8 vlan 2097, 2114, 2116, 2124, 2172,
 << $ vlan 2097, 2114, 2116, 2124, 2172,          2186, 219, 2114, 2116, 2124, 2172, 2186, 2192         , 2204-2216,
 <<  2124, 2172, 2186, 2192, 2204-220         8, 2210
c29s1p.r246b.allen(config-mst)# instance 8 vlan 2240-2241, 2251-2252, 2630, 2$ vlan 2240-2241, 2251-2252, 2630, 29         28
c29s1p.r246b.
 << allen(config-mst)# instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 6$ vlan 4-5, 12, 18-19, 32, 44, 57, 62         , 68, 76,12, 18-19, 32, 44, 57, 62, 68, 76,   
 <<        98-99, 10, 32, 44, 57, 62, 68, 76, 98-99, 102         , 112
c29s1p.r246b.allen(config-mst)# instance 9 vlan 130, 132, 147-148, 158, 212, $
 <<  vlan 130, 132, 147-148, 158, 212, 2         26, 236, 132, 147-148, 158, 212, 226, 236, 5         00, 505, 148, 158, 212, 226, 236, 500, 505, 5     
 <<     10-511
c29s1p.r246b.allen(config-mst)# instance 9 vlan 522, 551-570, 603, 629, 633, $ vlan 522, 551-570, 603, 629, 633, 7         42, 802, 551
 << -570, 603, 629, 633, 742, 802, 9         26, 929
c29s1p.r246b.allen(config-mst)# instance 10 vlan 2004-2005, 2012, 2018-2019, $0 vlan 2004-2005, 2012, 2018-2019, 2         032, 2044
 << 4-2005, 2012, 2018-2019, 2032, 2044,          2057, 2012, 2018-2019, 2032, 2044, 2057, 206         2, 2068
c29s1p.r246b.allen(config-mst)# instance 10 vlan
 <<  2076, 2098-2099, 2102, 2112,$0 vlan 2076, 2098-2099, 2102, 2112,          2130, 2136, 2098-2099, 2102, 2112, 2130, 2132         , 2147-21
 << 99, 2102, 2112, 2130, 2132, 2147-214         8, 2158
c29s1p.r246b.allen(config-mst)# instance 10 vlan 2212, 2236, 2500, 2505, 2510$0 vlan 2212, 2236, 2500, 2505, 
 << 2510-         2511, 2522, 2236, 2500, 2505, 2510-2511, 2522         , 2603, 2500, 2505, 2510-2511, 2522, 2603, 26         29, 2633
c29s1p
 << .r246b.allen(config-mst)# instance 10 vlan 2802, 2926, 2929
c29s1p.r246b.allen(config-mst)# instance 11 vlan 8, 43, 52, 146, 156-157, 180$1 vlan 8, 43, 52, 146, 156-157, 180,          200, 218
c29s1
 << p.r246b.allen(config-mst)# instance 12 vlan 2008, 2043, 2052, 2146, 2156$2 vlan 2008, 2043, 2052, 2146, 2156-         2157, 2188, 2043, 2052, 2146, 2156-21
 << 57, 2180         , 2200, 2052, 2146, 2156-2157, 2180, 2200, 22         18
c29s1p.r246b.allen(config-mst)#
c29s1p.r246b.allen(config-mst)#end
c29s1p.r246b.allen#
 << 
Oct 17 04:17:50: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.r246b.allen#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.r246b.allen(config)#
Expect: matched string 1: (config)#
 >> hostname c29s3p.rl2501.cvm.wise 

Expect: searching for 2 strs:  :# :>
 << hostname c29s3p.rl2501.cvm.wise 
c29s3p.rl2501.cvm.wi(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s3p.rl2501.cvm.wise#
 << 
Oct 17 04:17:56: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s3p.rl2501.cvm.wise#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s3p.rl2501.cvm.wi(config)#
Expect: matched string 1: (config)#
 >> snmp-server contact 6F-2012

Expect: searching for 1 strs:  :#
 << snmp-server contact 6F-2012
c29s3p.rl2501.cvm.wi(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s3p.rl2501.cvm.wise#
 << 
Oct 17 04:18:02: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s3p.rl2501.cvm.wise#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s3p.rl2501.cvm.wi(config)#
Expect: matched string 1: (config)#
 >> interface vlan 92

Expect: searching for 1 strs:  :(config-if)#
 << interface vlan 92
c29s3p.rl2501.cvm.wi(config-if)#
Expect: matched string 1: (config-if)#
 >> ip address 10.92.5.234 255.255.0.0

 >> ip broadcast-address 10.92.255.255

 >> end

Expect: searching for 1 strs:  :Configured
 << ip address 10.92.5.234 255.255.0.0
c29s3p.rl2501.cvm.wi(config-if)#ip broadcast-address 10.92.255.255
c29s3p.rl2501.cvm.wi(config-if)#end
c29s3p.rl2501.cvm.wise#
 << 
Oct 17 04:18:08: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s3p.rl2501.cvm.wise#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s3p.rl2501.cvm.wi(config)#
Expect: matched string 1: (config)#
 >> interface Vlan92

Expect: searching for 1 strs:  :(config-if)#
 << interface Vlan92
c29s3p.rl2501.cvm.wi(config-if)#
Expect: matched string 1: (config-if)#
 >> ip default-gateway 10.92.0.1

 >> end

Expect: searching for 1 strs:  :Configured
 << ip default-gateway 10.92.0.1
c29s3p.rl2501.cvm.wi(config)#end
c29s3p.rl2501.cvm.wise#
Oct 17 04:18:14: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s3p.rl2501.cvm.wise#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s3p.rl2501.cvm.wi(config)#
Expect: matched string 1: (config)#
 >> ip dhcp snooping

Expect: searching for 1 strs:  :#
 << ip dhcp snooping
c29s3p.rl2501.cvm.wi(config)#
Expect: matched string 1: #
 >> ip dhcp snooping vlan 136

Expect: searching for 1 strs:  :#
 << ip dhcp snooping vlan 136
c29s3p.rl2501.cvm.wi(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s3p.rl2501.cvm.wise#
Oct 17 04:18:21: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s3p.rl2501.cvm.wise#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s3p.rl2501.cvm.wi(config)#
Expect: matched string 1: (config)#
 >> default interface range gi1/0/1 - 48 

 >> interface range gi1/0/1 - 48 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi1/0/1 - 48 
c29s3p.rl2501.cvm.wi(config)#interface range gi1/0/1 - 48 
c29s3p.rl2501.cvm.wi(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport access vlan 136

 >> switchport mode access

 >> spanning-tree portfast

 >> switchport port-security maximum 2

 >> switchport port-security

 >> switchport port-security aging time 15

 >> switchport port-security violation protect

 >> switchport port-security aging type inactivity

 >> power inline never

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport access vlan 136
c29s3p.rl2501.cvm.wi(config-if-range)#switchport mode access
c29s3p.rl2501.cvm.wi(config-if-range)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, conce
 << ntrators, switches, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast will be configured in 48 interfaces due to the range command 
 but will only have effect when the inter
 << faces are in a non-trunking mode.
c29s3p.rl2501.cvm.wi(config-if-range)#switchport port-security maximum 2
c29s3p.rl2501.cvm.wi(config-if-range)#switchport port-security
c29s3p.rl2501.cvm.wi(config-if-range)#switchport port-security aging time 15
c29s
 << 3p.rl2501.cvm.wi(config-if-range)#switchport port-security violation prot$port-security violation prote         ct
c29s3p.rl2501.cvm.wi(config-if-range)#switchport port-security aging type ina
 << $port-security aging type inac         tivity
c29s3p.rl2501.cvm.wi(config-if-range)#power inline never

 << c29s3p.rl2501.cvm.wi(config-if-range)#end
c29s3p.rl2501.cvm.wise#
 << 
Oct 17 04:18:32: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s3p.rl2501.cvm.wise#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s3p.rl2501.cvm.wi(config)#
Expect: matched string 1: (config)#
 >> default interface gi1/0/48 

 >> interface gi1/0/48 

Expect: searching for 1 strs:  :(config-if)#
 << default interface gi1/0/48 
Interface GigabitEthernet1/0/48 set to default configuration
c29s3p.rl2501.cvm.wi(config)#interface gi1/0/48 
c29s3p.rl2501.cvm.wi(config-if)#
Expect: matched string 1: (config-if)#
 >> switchport mode trunk

 >> switchport trunk native vlan 92

 >> ip dhcp snooping trust

 >> no keepalive

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport mode trunk
c29s3p.rl2501.cvm.wi(config-if)#switchport trunk native vlan 92
c29s3p.rl2501.cvm.wi(config-if)#ip dhcp snooping trust
c29s3p.rl2501.cvm.wi(config-if)#no keepalive
c29s3p.rl2501.cvm.wi(config-if)#end
c29s3p.rl2501.cvm.wise#
 << 
Oct 17 04:18:38: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s3p.rl2501.cvm.wise#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s3p.rl2501.cvm.wi(config)#
Expect: matched string 1: (config)#
 >> default interface range te1/0/1 - 2 

 >> interface range te1/0/1 - 2 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range te1/0/1 - 2 
c29s3p.rl2501.cvm.wi(config)#interface range te1/0/1 - 2 
c29s3p.rl2501.cvm.wi(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport mode trunk

 >> switchport trunk native vlan 92

 >> ip dhcp snooping trust

 >> no keepalive

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport mode trunk
c29s3p.rl2501.cvm.wi(config-if-range)#switchport trunk native vlan 92
c29s3p.rl2501.cvm.wi(config-if-range)#ip dhcp snooping trust
c29s3p.rl2501.cvm.wi(config-if-range)#no keepalive
c29s3p.rl2501.cvm.wi(config-if-range)#end
c29s
 << 3p.rl2501.cvm.wise#
 << 
Oct 17 04:18:44: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s3p.rl2501.cvm.wise#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s3p.rl2501.cvm.wi(config)#
Expect: matched string 1: (config)#
 >> default interface range gi1/0/49 - 50 

 >> interface range gi1/0/49 - 50 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi1/0/49 - 50 
c29s3p.rl2501.cvm.wi(config)#interface range gi1/0/49 - 50 
c29s3p.rl2501.cvm.wi(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport mode trunk

 >> switchport trunk native vlan 92

 >> ip dhcp snooping trust

 >> no keepalive

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport mode trunk
c29s3p.rl2501.cvm.wi(config-if-range)#switchport trunk native vlan 92
c29s3p.rl2501.cvm.wi(config-if-range)#ip dhcp snooping trust
c29s3p.rl2501.cvm.wi(config-if-range)#no keepalive
c29s3p.rl2501.cvm.wi(config-if-range)#end
c29s
 << 3p.rl2501.cvm.wise#
 << 
Oct 17 04:18:50: %SYS-5-CONFIG_I: Configured from console by console
Oct 17 04:18:51: %LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet1/0/49, changed state to down
Oct 17 04:18:51: %LINEPROTO-5-UPDOWN: Line protocol on Interface Gigabit
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << Ethernet1/0/50, changed state to down
c29s3p.rl2501.cvm.wise#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s3p.rl2501.cvm.wi(config)#
Expect: matched string 1: (config)#
 >> crypto key generate rsa

 >> no

 >> 2048

Expect: searching for 2 strs:  :OK :(config)#
 << crypto key generate rsa
The name for the keys will be: c29s3p.rl2501.cvm.wise.mgmt.msstate.edu
Choose the size of the key modulus in the range of 360 to 4096 for your
  General Purpose Keys. Choosing a key modulus greater than 512 may take
  a few min
 << utes.

How many bits in the modulus [512]: no
% A decimal number between 360 and 4096.
How many bits in the modulus [512]: 2048
% Generating 2048 bit RSA keys, keys will be non-exportable...
 << 
 << 
 << 
 << 
 << 
 << 
[OK] (elapsed time was 6 seconds)

c29s3p.rl2501.cvm.wi(config)#
Expect: matched string 1: OK
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s3p.rl2501.cvm.wise#
Oct 17 04:19:02: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> write mem

Expect: searching for 2 strs:  :# :>
 << 
c29s3p.rl2501.cvm.wise#write mem
Building configuration...

Expect: matched string 1: #
 >> 
Expect: searching for 2 strs:  :# :>
 << [OK]
c29s3p.rl2501.cvm.wise#
c29s3p.rl2501.cvm.wise#
c29s3p.rl2501.cvm.wise#
Expect: matched string 1: #
 >> sh run

Expect: searching for 2 strs:  :# :>
 << sh run
Building configuration...

Current configuration : 25441 bytes
!
! Last configuration change at 04:19:02 CDT Tue Oct 17 2017
! NVRAM config last updated at 04:19:04 CDT Tue Oct 17 2017
!
version 15.0
no service pad
service timestamps debu
 << g datetime localtime
service timestamps log datetime localtime
service password-encryption
!
hostname c29s3p.rl2501.cvm.wise
!
boot-start-marker
boot-end-marker
!
logging buffered informational
enable secret 5 $1$Yha4$JH1IJOMCRWcVbTsix3qGr1
ena
 << ble password 7 08005E4B0844095D05
!
username root privilege 15 secret 5 $1$LN39$1OyzDIKkioRQ1tR8E3hTM/
no aaa new-model
clock timezone CST -6 0
clock summer-time CDT recurring
switch 1 provision ws-c2960x-48fpd-l
authentication mac-move permit
!

 << !
ip dhcp snooping vlan 24,136
ip dhcp snooping
ip domain-name mgmt.msstate.edu
ip name-server 130.18.80.12
!
mls qos map policed-dscp  24 26 46 to 0
mls qos map cos-dscp 0 8 16 24 32 46 48 56
mls qos srr-queue output cos-map queue 1 threshold 3 5
 << 
mls qos srr-queue output cos-map queue 2 threshold 3 3 6 7
mls qos srr-queue output cos-map queue 3 threshold 3 2 4
mls qos srr-queue output cos-map queue 4 threshold 2 1
mls qos srr-queue output cos-map queue 4 threshold 3 0
mls qos srr-queue outpu
 << t dscp-map queue 1 threshold 3 40 41 42 43 44 45 46 47
mls qos srr-queue output dscp-map queue 2 threshold 3 24 25 26 27 28 29 30 31
mls qos srr-queue output dscp-map queue 2 threshold 3 48 49 50 51 52 53 54 55
mls qos srr-queue output dscp-map queue 2
 <<  threshold 3 56 57 58 59 60 61 62 63
mls qos srr-queue output dscp-map queue 3 threshold 3 16 17 18 19 20 21 22 23
mls qos srr-queue output dscp-map queue 3 threshold 3 32 33 34 35 36 37 38 39
mls qos srr-queue output dscp-map queue 4 threshold 1 8
ml
 << s qos srr-queue output dscp-map queue 4 threshold 2 9 10 11 12 13 14 15
mls qos srr-queue output dscp-map queue 4 threshold 3 0 1 2 3 4 5 6 7
mls qos queue-set output 1 threshold 1 138 138 92 138
mls qos queue-set output 1 threshold 2 138 138 92 400
m
 << ls qos queue-set output 1 threshold 3 36 77 100 318
mls qos queue-set output 1 threshold 4 20 50 67 400
mls qos queue-set output 2 threshold 1 149 149 100 149
mls qos queue-set output 2 threshold 2 118 118 100 235
mls qos queue-set output 2 threshold 
 << 3 41 68 100 272
mls qos queue-set output 2 threshold 4 42 72 100 242
mls qos queue-set output 1 buffers 10 10 26 54
mls qos queue-set output 2 buffers 16 6 17 61
mls qos
!
crypto pki trustpoint TP-self-signed-4068808960
 enrollment selfsigned
 sub
 << ject-name cn=IOS-Self-Signed-Certificate-4068808960
 revocation-check none
 rsakeypair TP-self-signed-4068808960
!
crypto pki trustpoint TP-self-signed-2494998912
 enrollment selfsigned
 subject-name cn=IOS-Self-Signed-Certificate-2494998912
 revoc
 << ation-check none
 rsakeypair TP-self-signed-2494998912
!
!
crypto pki certificate chain TP-self-signed-4068808960
 certificate self-signed 01
  3082022B 30820194 A0030201 02020101 300D0609 2A864886 F70D0101 05050030 
  31312F30 2D060355 04031326 49
 << 4F532D 53656C66 2D536967 6E65642D 43657274 
  69666963 6174652D 34303638 38303839 3630301E 170D3137 31303137 30383538 
  30355A17 0D323030 31303130 30303030 305A3031 312F302D 06035504 03132649 
  4F532D53 656C662D 5369676E 65642D43 65727469 66696361 74
 << 652D34 30363838 
  30383936 3030819F 300D0609 2A864886 F70D0101 01050003 818D0030 81890281 
  8100E74B 66CF1FFA 0157D61E 5F2E11D8 079EB416 4D861675 A7FDFC11 C0CAC788 
  3F8B40DB 78E2DD64 6660A6A3 3713346A CBE45F64 53AC5CEB 86407CD5 2B575997 
  B40C81F
 << C 1867C64F B623B34D F6E1775C 92446537 791247E7 83B20627 0CB754C9 
  54C42747 6A253E7D 30F970A9 104B5812 95DE7F4B 136811AE 6E42E014 C4F15403 
  BFE50203 010001A3 53305130 0F060355 1D130101 FF040530 030101FF 301F0603 
  551D2304 18301680 14E487DE 3D98B1B
 << 5 FED4E995 4891708D FEEAAACC DC301D06 
  03551D0E 04160414 E487DE3D 98B1B5FE D4E99548 91708DFE EAAACCDC 300D0609 
  2A864886 F70D0101 05050003 8181001E E0E8EB2C EAEBC789 4A0AEF3A B1634756 
  580147BA B6574E80 76BEB744 E82F409A 42ADBDDB 00DDD0A7 C45FF2A
 << 4 39D8DE14 
  C71ED548 02654049 F1C3798B 63291B2F 7D5C12B8 59716954 7CF61825 5F3E7507 
  2D40BB49 5FE11FC5 3BBA6E38 DD89E967 937648F6 48C29541 67C75BF7 E9A82490 
  93310DDA 02BBF9AF 5882A886 448EE0
  	quit
crypto pki certificate chain TP-self-signed-
 << 2494998912
!
spanning-tree mode mst
spanning-tree portfast bpduguard default
spanning-tree extend system-id
!
spanning-tree mst configuration
 name msstate
 revision 1
 instance 1 vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 63, 70
 ins
 << tance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 160
 instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 230, 232, 242, 246
 instance 1 vlan 256, 611-612, 654, 741, 996, 999
 instance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031, 2
 << 035, 2037, 2039-2040
 instance 2 vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096, 2104, 2110, 2126
 instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 2189, 2194, 2202
 instance 2 vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 2654, 2999
 instance 
 << 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176, 196
 instance 3 vlan 244, 248, 927
 instance 4 vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072, 2108, 2113, 2128
 instance 4 vlan 2144, 2176, 2196, 2244, 2248, 2927
 instance 5 vlan 16, 48, 58,
 <<  88, 121, 131, 133-134, 216, 228
 instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216, 2228
 instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116, 124
 instance 7 vlan 172, 186, 192, 204-208, 210, 240-241, 251-252, 630, 92
 << 8
 instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082, 2084
 instance 8 vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208, 2210
 instance 8 vlan 2240-2241, 2251-2252, 2630, 2928
 instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 
 << 68, 76, 98-99, 102, 112
 instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 500, 505, 510-511
 instance 9 vlan 522, 551-570, 603, 629, 633, 742, 802, 926, 929
 instance 10 vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 2057, 2062, 2068
 instance 10 
 << vlan 2076, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148, 2158
 instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522, 2603, 2629, 2633
 instance 10 vlan 2802, 2926, 2929
 instance 11 vlan 8, 43, 52, 146, 156-157, 180, 200, 218
 instance 12 vlan 200
 << 8, 2043, 2052, 2146, 2156-2157, 2180, 2200, 2218
!
!
!
!
!
!
errdisable recovery cause udld
errdisable recovery cause bpduguard
errdisable recovery cause security-violation
errdisable recovery cause channel-misconfig (STP)
errdisable recovery c
 << ause pagp-flap
errdisable recovery cause dtp-flap
errdisable recovery cause link-flap
errdisable recovery cause sfp-config-mismatch
errdisable recovery cause gbic-invalid
errdisable recovery cause psecure-violation
errdisable recovery cause port-mod
 << e-failure
errdisable recovery cause dhcp-rate-limit
errdisable recovery cause pppoe-ia-rate-limit
errdisable recovery cause mac-limit
errdisable recovery cause vmps
errdisable recovery cause storm-control
errdisable recovery cause inline-power
errd
 << isable recovery cause arp-inspection
errdisable recovery cause loopback
errdisable recovery cause small-frame
errdisable recovery cause psp
errdisable recovery interval 1800
!
vlan internal allocation policy ascending
!
!
class-map match-all Auto
 << QoS-VoIP-RTP-Trust
  match ip dscp ef 
class-map match-all AutoQoS-VoIP-Control-Trust
  match ip dscp cs3  af31 
!
policy-map AutoQoS-Police-CiscoPhone
 class AutoQoS-VoIP-RTP-Trust
   set dscp ef
  police 320000 8000 exceed-action policed-dscp-tr
 << ansmit
 class AutoQoS-VoIP-Control-Trust
   set dscp cs3
  police 32000 8000 exceed-action policed-dscp-transmit
!
!
!
!
!
!
interface FastEthernet0
 no ip address
 shutdown
!
interface GigabitEthernet1/0/1
 switchport access vlan 136
 swi
 << tchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 power inline never
 spanning-tree
 <<  portfast
!
interface GigabitEthernet1/0/2
 switchport access vlan 136
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 swit
 << chport port-security aging type inactivity
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/3
 switchport access vlan 136
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport 
 << port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/4
 switchport access vlan 136
 switchport mode acces
 << s
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 power inline never
 spanning-tree portfast
!
inte
 << rface GigabitEthernet1/0/5
 switchport access vlan 136
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-securi
 << ty aging type inactivity
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/6
 switchport access vlan 136
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security agin
 << g time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/7
 switchport access vlan 136
 switchport mode access
 switchport por
 << t-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 power inline never
 spanning-tree portfast
!
interface GigabitEther
 << net1/0/8
 switchport access vlan 136
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inac
 << tivity
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/9
 switchport access vlan 136
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switch
 << port port-security violation protect
 switchport port-security aging type inactivity
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/10
 switchport access vlan 136
 switchport mode access
 switchport port-security maximu
 << m 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/11
 switc
 << hport access vlan 136
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 power i
 << nline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/12
 switchport access vlan 136
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-secur
 << ity violation protect
 switchport port-security aging type inactivity
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/13
 switchport access vlan 136
 switchport mode access
 switchport port-security maximum 2
 switchpor
 << t port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/14
 switchport access vl
 << an 136
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 power inline never
 s
 << panning-tree portfast
!
interface GigabitEthernet1/0/15
 switchport access vlan 136
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation p
 << rotect
 switchport port-security aging type inactivity
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/16
 switchport access vlan 136
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 << 
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/17
 switchport access vlan 136
 switch
 << port mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 power inline never
 spanning-tree po
 << rtfast
!
interface GigabitEthernet1/0/18
 switchport access vlan 136
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switch
 << port port-security aging type inactivity
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/19
 switchport access vlan 136
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport p
 << ort-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/20
 switchport access vlan 136
 switchport mode acces
 << s
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 power inline never
 spanning-tree portfast
!
inte
 << rface GigabitEthernet1/0/21
 switchport access vlan 136
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-secur
 << ity aging type inactivity
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/22
 switchport access vlan 136
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security ag
 << ing time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/23
 switchport access vlan 136
 switchport mode access
 switchport 
 << port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 power inline never
 spanning-tree portfast
!
interface GigabitEt
 << hernet1/0/24
 switchport access vlan 136
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type 
 << inactivity
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/25
 switchport access vlan 136
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 s
 << witchport port-security violation protect
 switchport port-security aging type inactivity
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/26
 switchport access vlan 136
 switchport mode access
 switchport port-security m
 << aximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/27
 
 << switchport access vlan 136
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 po
 << wer inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/28
 switchport access vlan 136
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-
 << security violation protect
 switchport port-security aging type inactivity
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/29
 switchport access vlan 136
 switchport mode access
 switchport port-security maximum 2
 swit
 << chport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/30
 switchport acce
 << ss vlan 136
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 power inline neve
 << r
 spanning-tree portfast
!
interface GigabitEthernet1/0/31
 switchport access vlan 136
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violat
 << ion protect
 switchport port-security aging type inactivity
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/32
 switchport access vlan 136
 switchport mode access
 switchport port-security maximum 2
 switchport port-sec
 << urity
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/33
 switchport access vlan 136
 s
 << witchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 power inline never
 spanning-tr
 << ee portfast
!
interface GigabitEthernet1/0/34
 switchport access vlan 136
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 s
 << witchport port-security aging type inactivity
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/35
 switchport access vlan 136
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchp
 << ort port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/36
 switchport access vlan 136
 switchport mode 
 << access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 power inline never
 spanning-tree portfast
!
 << 
interface GigabitEthernet1/0/37
 switchport access vlan 136
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-
 << security aging type inactivity
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/38
 switchport access vlan 136
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-securi
 << ty aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/39
 switchport access vlan 136
 switchport mode access
 switch
 << port port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 power inline never
 spanning-tree portfast
!
interface Giga
 << bitEthernet1/0/40
 switchport access vlan 136
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging 
 << type inactivity
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/41
 switchport access vlan 136
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 1
 << 5
 switchport port-security violation protect
 switchport port-security aging type inactivity
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/42
 switchport access vlan 136
 switchport mode access
 switchport port-secur
 << ity maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/
 << 43
 switchport access vlan 136
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 << 
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/44
 switchport access vlan 136
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport 
 << port-security violation protect
 switchport port-security aging type inactivity
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/45
 switchport access vlan 136
 switchport mode access
 switchport port-security maximum 2

 <<  switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/46
 switchport
 <<  access vlan 136
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 power inline
 <<  never
 spanning-tree portfast
!
interface GigabitEthernet1/0/47
 switchport access vlan 136
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security v
 << iolation protect
 switchport port-security aging type inactivity
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/48
 switchport trunk native vlan 92
 switchport mode trunk
 no keepalive
 ip dhcp snooping trust
!
inter
 << face GigabitEthernet1/0/49
 switchport trunk native vlan 92
 switchport mode trunk
 ip dhcp snooping trust
!
interface GigabitEthernet1/0/50
 switchport trunk native vlan 92
 switchport mode trunk
 ip dhcp snooping trust
!
interface TenGigabitEt
 << hernet1/0/1
 switchport trunk native vlan 92
 switchport mode trunk
 ip dhcp snooping trust
!
interface TenGigabitEthernet1/0/2
 switchport trunk native vlan 92
 switchport mode trunk
 ip dhcp snooping trust
!
interface Vlan1
 no ip address
 n
 << o ip route-cache
 shutdown
!
interface Vlan92
 ip address 10.92.5.234 255.255.0.0
 ip broadcast-address 10.92.255.255
!
ip default-gateway 10.92.0.1
no ip http server
no ip http secure-server
!
logging facility local1
logging host 130.18.8.12
 << 
access-list 1 permit 130.18.92.0 0.0.3.255
access-list 1 permit 10.92.0.0 0.0.255.255
access-list 1 permit 130.18.8.0 0.0.0.255
access-list 1 permit 10.93.0.0 0.0.255.255
access-list 1 permit 130.18.1.0 0.0.0.255
!
snmp-server community sysnet RO 1
 << 
snmp-server community c2-b2=a2 RW 1
snmp-server community spongebob RO
snmp-server contact 6F-2012
snmp-server enable traps snmp authentication linkdown linkup coldstart warmstart
snmp-server enable traps transceiver all
snmp-server enable traps tt
 << y
snmp-server enable traps cluster
snmp-server enable traps config-copy
snmp-server enable traps config
snmp-server enable traps config-ctid
snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-auth-fail-vlan no-guest-vlan
snmp-server enable 
 << traps entity
snmp-server enable traps power-ethernet group 1
snmp-server enable traps power-ethernet police
snmp-server enable traps cpu threshold
snmp-server enable traps rep
snmp-server enable traps bridge newroot topologychange
snmp-server enable
 <<  traps stpx inconsistency root-inconsistency loop-inconsistency
snmp-server enable traps syslog
snmp-server enable traps vtp
snmp-server enable traps vlancreate
snmp-server enable traps vlandelete
snmp-server enable traps flash insertion removal
snm
 << p-server enable traps port-security
snmp-server enable traps envmon fan shutdown supply temperature status
snmp-server enable traps errdisable
snmp-server enable traps mac-notification change move threshold
snmp-server enable traps vlan-membership
sn
 << mp-server host 130.18.8.12 sysnet 
!
!
line con 0
line vty 0 4
 access-class 1 in
 password 7 072E33494F54154F00
 login local
 length 0
 transport input ssh
line vty 5 15
 access-class 1 in
 password 7 072E33494F54154F00
 login local
 transp
 << ort input ssh
!
ntp server 10.92.0.5
end

c29s3p.rl2501.cvm.wise#
Expect: matched string 1: #
 >> show interface status

Expect: searching for 2 strs:  :# :>
 << show interface status

Port      Name               Status       Vlan       Duplex  Speed Type
Gi1/0/1                      notconnect   136          auto   auto 10/100/1000BaseTX
Gi1/0/2                      notconnect   136          auto   auto 10/1
 << 00/1000BaseTX
Gi1/0/3                      notconnect   136          auto   auto 10/100/1000BaseTX
Gi1/0/4                      notconnect   136          auto   auto 10/100/1000BaseTX
Gi1/0/5                      notconnect   136          auto   auto 1
 << 0/100/1000BaseTX
Gi1/0/6                      notconnect   136          auto   auto 10/100/1000BaseTX
Gi1/0/7                      notconnect   136          auto   auto 10/100/1000BaseTX
Gi1/0/8                      notconnect   136          auto   aut
 << o 10/100/1000BaseTX
Gi1/0/9                      notconnect   136          auto   auto 10/100/1000BaseTX
Gi1/0/10                     notconnect   136          auto   auto 10/100/1000BaseTX
Gi1/0/11                     notconnect   136          auto   
 << auto 10/100/1000BaseTX
Gi1/0/12                     notconnect   136          auto   auto 10/100/1000BaseTX
Gi1/0/13                     notconnect   136          auto   auto 10/100/1000BaseTX
Gi1/0/14                     notconnect   136          auto
 <<    auto 10/100/1000BaseTX
Gi1/0/15                     notconnect   136          auto   auto 10/100/1000BaseTX
Gi1/0/16                     notconnect   136          auto   auto 10/100/1000BaseTX
Gi1/0/17                     notconnect   136          a
 << uto   auto 10/100/1000BaseTX
Gi1/0/18                     notconnect   136          auto   auto 10/100/1000BaseTX
Gi1/0/19                     notconnect   136          auto   auto 10/100/1000BaseTX
Gi1/0/20                     notconnect   136        
 <<   auto   auto 10/100/1000BaseTX
Gi1/0/21                     notconnect   136          auto   auto 10/100/1000BaseTX
Gi1/0/22                     notconnect   136          auto   auto 10/100/1000BaseTX
Gi1/0/23                     notconnect   136     
 <<      auto   auto 10/100/1000BaseTX
Gi1/0/24                     notconnect   136          auto   auto 10/100/1000BaseTX
Gi1/0/25                     notconnect   136          auto   auto 10/100/1000BaseTX
Gi1/0/26                     notconnect   136  
 <<         auto   auto 10/100/1000BaseTX
Gi1/0/27                     notconnect   136          auto   auto 10/100/1000BaseTX
Gi1/0/28                     notconnect   136          auto   auto 10/100/1000BaseTX
Gi1/0/29                     notconnect   13
 << 6          auto   auto 10/100/1000BaseTX
Gi1/0/30                     notconnect   136          auto   auto 10/100/1000BaseTX
Gi1/0/31                     notconnect   136          auto   auto 10/100/1000BaseTX
Gi1/0/32                     notconnect  
 <<  136          auto   auto 10/100/1000BaseTX
Gi1/0/33                     notconnect   136          auto   auto 10/100/1000BaseTX
Gi1/0/34                     notconnect   136          auto   auto 10/100/1000BaseTX
Gi1/0/35                     notconnec
 << t   136          auto   auto 10/100/1000BaseTX
Gi1/0/36                     notconnect   136          auto   auto 10/100/1000BaseTX
Gi1/0/37                     notconnect   136          auto   auto 10/100/1000BaseTX
Gi1/0/38                     notcon
 << nect   136          auto   auto 10/100/1000BaseTX
Gi1/0/39                     notconnect   136          auto   auto 10/100/1000BaseTX
Gi1/0/40                     notconnect   136          auto   auto 10/100/1000BaseTX
Gi1/0/41                     not
 << connect   136          auto   auto 10/100/1000BaseTX
Gi1/0/42                     notconnect   136          auto   auto 10/100/1000BaseTX
Gi1/0/43                     notconnect   136          auto   auto 10/100/1000BaseTX
Gi1/0/44                     
 << notconnect   136          auto   auto 10/100/1000BaseTX
Gi1/0/45                     notconnect   136          auto   auto 10/100/1000BaseTX
Gi1/0/46                     notconnect   136          auto   auto 10/100/1000BaseTX
Gi1/0/47                  
 <<    notconnect   136          auto   auto 10/100/1000BaseTX
Gi1/0/48                     notconnect   1            auto   auto 10/100/1000BaseTX
Te1/0/1                      notconnect   1            full    10G Not Present
Te1/0/2                      
 << notconnect   1            full    10G Not Present
Fa0                          disabled     routed       auto   auto 10/100BaseTX
c29s3p.rl2501.cvm.wise#
Expect: matched string 1: #
