trying to use serial port: /dev/ttyUSB0
 >> 
 >> 

Expect: searching for 4 strs:  :[yes/no] :Press RETURN to get started. :# :Switch>
 << 


         --- System Configuration Dialog ---

Enable secret warning
----------------------------------
In order to access the device manager, an enable secret is required
If you enter the initial configuration dialog, you will be prompted for t
 << he enable secret
If you choose not to enter the intial configuration dialog, or if you exit setup without setting the enable secret,
please set an enable secret using the following CLI in configuration mode-
enable secret 0 <cleartext password>
------
 << ----------------------------
Would you like to enter the initial configuration dialog? [yes/no]: 
% Please answer 'yes' or 'no'.
Would you like to enter the initial configuration dialog? [yes/no]: 
% Please answer 'yes' or 'no'.
Would you like to ent
Expect: matched string 1: [yes/no]
 >> 

 >> no

 >> term len 0

Expect: searching for 2 strs:  :# :>
 << er the initial configuration dialog? [yes/no]: 
% Please answer 'yes' or 'no'.
Would you like to enter the initial configuration dialog? [yes/no]: 
% Please answer 'yes' or 'no'.
Would you like to enter the initial configuration dialog? [yes/no]: 
% 
 << Please answer 'yes' or 'no'.
Would you like to enter the initial configuration dialog? [yes/no]: no
Switch>term len 0
Switch>
Expect: matched string 2: >
 >> show version

Expect: searching for 2 strs:  :# :>
 << show version
Cisco IOS Software, C2960S Software (C2960S-UNIVERSALK9-M), Version 15.0(2)SE8, RELEASE SOFTWARE (fc1)
Technical Support: http://www.cisco.com/techsupport
Copyright (c) 1986-2015 by Cisco Systems, Inc.
Compiled Wed 13-May-15 23:10 by prod
 << _rel_team

ROM: Bootstrap program is C2960S board boot loader
BOOTLDR: C2960S Boot Loader (C2960S-HBOOT-M) Version 12.2(55r)SE, RELEASE SOFTWARE (fc1)

Switch uptime is 22 minutes
System returned to ROM by power-on
System image file is "flash:/c296
 << 0s-universalk9-mz.150-2.SE8.bin"


This product contains cryptographic features and is subject to United
States and local country laws governing import, export, transfer and
use. Delivery of Cisco cryptographic products does not imply
third-party au
 << thority to import, export, distribute or use encryption.
Importers, exporters, distributors and users are responsible for
compliance with U.S. and local country laws. By using this product you
agree to comply with applicable laws and regulations. If yo
 << u are unable
to comply with U.S. and local laws, return this product immediately.

A summary of U.S. laws governing Cisco cryptographic products may be found at:
http://www.cisco.com/wwl/export/crypto/tool/stqrg.html

If you require further assistan
 << ce please contact us by sending email to
export@cisco.com.

cisco WS-C2960S-48LPD-L (PowerPC) processor (revision G0) with 131072K bytes of memory.
Processor board ID FOC1719W3VH
Last reset from power-on
1 Virtual Ethernet interface
1 FastEthernet 
 << interface
50 Gigabit Ethernet interfaces
2 Ten Gigabit Ethernet interfaces
The password-recovery mechanism is enabled.

512K bytes of flash-simulated non-volatile configuration memory.
Base ethernet MAC Address       : D0:C7:89:59:D8:80
Motherboard
 <<  assembly number     : 73-12426-10
Power supply part number        : 341-0393-02
Motherboard serial number       : FOC17190MUJ
Power supply serial number      : DCA1711U0A7
Model revision number           : G0
Motherboard revision number     : A0
Mo
 << del number                    : WS-C2960S-48LPD-L
Daughterboard assembly number   : 73-11933-04
Daughterboard serial number     : FOC17190DL0
System serial number            : FOC1719W3VH
Top Assembly Part Number        : 800-32460-04
Top Assembly Re
 << vision Number    : A0
Version ID                      : V04
CLEI Code Number                : COMGC00ARD
Daughterboard revision number   : A0
Hardware Board Revision Number  : 0x01


Switch Ports Model              SW Version            SW Image   
 <<               
------ ----- -----              ----------            ----------               
*    1 52    WS-C2960S-48LPD-L  15.0(2)SE8            C2960S-UNIVERSALK9-M     


Configuration register is 0xF

Switch>
Expect: matched string 2: >
 >> enable

Expect: searching for 2 strs:  :Password: :#
 << enable
Switch#
Expect: matched string 2: #
 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
Expect: matched string 1: (config)#
 >> no service pad

 >> service timestamps debug datetime localtime

 >> service timestamps log datetime localtime

 >> service password-encryption

 >> boot-start-marker

 >> boot-end-marker

 >> enable secret Area=l*w

 >> enable password Area=l*w

 >> username root privilege 15 secret Area=l*w

 >> no aaa new-model

 >> clock timezone CST -6

 >> clock summer-time CDT recurring

 >> authentication mac-move permit

 >> ip domain-name mgmt.msstate.edu

 >> ip name-server 130.18.80.12

 >> vtp domain vtp01.mgmt.msstate.edu

 >> vtp mode client

 >> crypto pki trustpoint TP-self-signed-2494998912

 >>  enrollment selfsigned

 >>  subject-name cn=IOS-Self-Signed-Certificate-2494998912

 >>  revocation-check none

 >>  rsakeypair TP-self-signed-2494998912

 >> crypto pki certificate chain TP-self-signed-2494998912

 >>  certificate self-signed 01 nvram:IOS-Self-Sig#3232.cer

 >> spanning-tree portfast bpduguard default

 >> spanning-tree extend system-id

 >> vlan internal allocation policy ascending

 >> errdisable recovery cause all

 >> errdisable recovery interval 1800

 >> interface FastEthernet0

 >>  no ip address

 >>  shutdown

 >> interface Vlan1

 >>  no ip address

 >>  no ip route-cache

 >>  shutdown

 >> interface Vlan92

 >> no ip http server

 >> no ip http secure-server

 >> ip sla enable reaction-alerts

 >> logging facility local1

 >> logging host 130.18.8.12

 >> access-list 1 permit 10.92.0.0 0.0.255.255

 >> access-list 1 permit 130.18.8.0 0.0.0.255

 >> access-list 1 permit 10.93.0.0 0.0.255.255

 >> access-list 1 permit 130.18.1.0 0.0.0.255

 >> snmp-server community sysnet RO 1

 >> snmp-server community c2-b2=a2 RW 1

 >> snmp-server enable traps snmp authentication linkdown linkup coldstart warmstart

 >> snmp-server enable traps transceiver all

 >> snmp-server enable traps tty

 >> snmp-server enable traps cluster

 >> snmp-server enable traps config-copy

 >> snmp-server enable traps config

 >> snmp-server enable traps config-ctid

 >> snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-auth-fail-vlan no-guest-vlan

 >> snmp-server enable traps entity

 >> snmp-server enable traps power-ethernet group 1

 >> snmp-server enable traps power-ethernet police

 >> snmp-server enable traps cpu threshold

 >> snmp-server enable traps rep

 >> snmp-server enable traps rtr

 >> snmp-server enable traps bridge newroot topologychange

 >> snmp-server enable traps stpx inconsistency root-inconsistency loop-inconsistency

 >> snmp-server enable traps syslog

 >> snmp-server enable traps vtp

 >> snmp-server enable traps vlancreate

 >> snmp-server enable traps vlandelete

 >> snmp-server enable traps flash insertion removal

 >> snmp-server enable traps port-security

 >> snmp-server enable traps envmon fan shutdown supply temperature status

 >> snmp-server enable traps errdisable

 >> snmp-server enable traps mac-notification change move threshold

 >> snmp-server enable traps vlan-membership

 >> snmp-server host 130.18.8.12 sysnet 

 >> line con 0

 >> line vty 0 15

 >>  access-class 1 in

 >>  password Area=l*w

 >>  login local

 >>  transport input ssh

 >> ntp clock-period 22519226

 >> ntp server 10.92.0.5

 >> 

 >> end

Expect: searching for 1 strs:  :Configured
 << no service pad
Switch(config)#service timestamps debug datetime localtime
Switch(config)#service timestamps log datetime localtime
Switch(config)#service password-encryption
Switch(config)#boot-start-marker
Switch(config)#boot-end-marker
Switch(conf
 << ig)#enable secret Area=l*w
Switch(config)#enable password Area=l*w
The enable password you have chosen is the same as your enable secret.
This is not recommended.  Re-enter the enable password.

Switch(config)#username root privilege 15 secret Area=l
 << *w
Switch(config)#no aaa new-model
Switch(config)#clock timezone CST -6
Switch(config)#clock summer-time CDT recurring
Switch(config)#authentication mac-move permit
Switch(config)#ip domain-name mgmt.msstate.edu
Switch(config)#ip name-server 130.18.
 << 80.12
Switch(config)#vtp domain vtp01.mgmt.msstate.edu
Domain name already set to vtp01.mgmt.msstate.edu.
Switch(config)#
*Jan  1 18:26:27: %SYS-6-CLOCKUPDATE: System clock has been updated from 00:26:27 UTC Mon Jan 2 2006 to 18:26:27 CST Sun Jan 1 20
 << 06, configured from console by console.
*Jan  1 18:26:27: %SYS-6-CLOCKUPDATE: System clock has been updated from 18:26:27 CST Sun Jan 1 2006 to 18:26:27 CST Sun Jan 1 2006, configured from console by console.vtp mode client
Device mode already VTP Clien
 << t for VLANS.
Switch(config)#crypto pki trustpoint TP-self-signed-2494998912
Switch(ca-trustpoint)# enrollment selfsigned
Switch(ca-trustpoint)# subject-name cn=IOS-Self-Signed-Certificate-2494998912
Switch(ca-trustpoint)# revocation-check none
Switch
 << (ca-trustpoint)# rsakeypair TP-self-signed-2494998912
Switch(ca-trustpoint)#crypto pki certificate chain TP-self-signed-2494998912
Switch(config-cert-chain)# certificate self-signed 01 nvram:IOS-Self-Sig#3232
 << $e self-signed 01 nvram:IOS-Self-Sig#3232.         cer
Switch(config-cert-chain)#spanning-tree portfast bpduguard default
Switch(config)#spanning-tree extend system-id
Switch(config)#vlan internal allocation policy ascending
Switch(conf
 << ig)#errdisable recovery cause all
Switch(config)#errdisable recovery interval 1800
Switch(config)#interface FastEthernet0
Switch(config-if)# no ip address
Switch(config-if)# shutdown
Switch(config-if)#interface Vlan1
Switch(config-if)# no ip address
 << 
Switch(config-if)# no ip route-cache
Switch(config-if)# shutdown
Switch(config-if)#interface Vlan92
Switch(config-if)#no ip http server
Switch(config)#no ip http secure-server
Switch(config)#ip sla enable reaction-alerts
                      ^
%
 <<  Invalid input detected at '^' marker.

Switch(config)#logging facility local1
Switch(config)#logging host 130.18.8.12
Switch(config)#access-list 1 permit 10.92.0.0 0.0.255.255
Switch(config)#access-list 1 permit 130.18.8.0 0.0.0.255
Switch(config)#
 << 
*Jan  1 18:26:32: %LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan92, changed state to down
*Jan  1 18:26:33: %LINK-5-CHANGED: Interface FastEthernet0, changed state to administratively downaccess-list 1 permit 10.93.0.0 0.0.255.255
Switch(config)
 << #access-list 1 permit 130.18.1.0 0.0.0.255
Switch(config)#snmp-server community sysnet RO 1
Switch(config)#snmp-server community c2-b2=a2 RW 1
Switch(config)#snmp-server enable traps snmp authentication linkdown linkup c
 << $ enable traps snmp authentication linkdown linkup co         ldstart waps snmp authentication linkdown linkup coldstart wa         rmstart
Switc
 << h(config)#
*Jan  1 18:26:34: %LINK-5-CHANGED: Interface Vlan1, changed state to administratively downsnmp-server enable traps transceiver all
Switch(config)#snmp-server enable traps tty
Switch(config)#snmp-server enable traps cluster
Switch(config)#sn
 << mp-server enable traps config-copy
Switch(config)#snmp-server enable traps confi
*Jan  1 18:26:34: %SYS-6-LOGGINGHOST_STARTSTOP: Logging to host 130.18.8.12 port 514 started - CLI initiatedg
Switch(config)#snmp-server enable traps config-ctid
Switch(c
 << onfig)#snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-au$ enable traps dot1x auth-fail-vlan guest-vlan no-aut         h-fail-vl
 << aps dot1x auth-fail-vlan guest-vlan no-auth-fail-vla         n no-guesuth-fail-vlan guest-vlan no-auth-fail-vlan no-guest         -vlan
Switch(config)#snmp-ser
 << ver enable traps entity
Switch(config)#snmp-server enable traps power-ethernet group 1
Switch(config)#snmp-server enable traps power-ethernet police
Switch(config)#snmp-server enable traps cpu threshold
Switch(config)#snmp-server enable traps rep
Swi
 << tch(config)#snmp-server enable traps rtr
                                         ^
% Invalid input detected at '^' marker.

Switch(config)#snmp-server enable traps bridge newroot topologychange
Switch(config)#snmp-server enable traps stpx inconsiste
 << ncy root-inconsistency$ enable traps stpx inconsistency root-inconsistency          loop-incoaps stpx inconsistency root-in
 << consistency loop-incon         sistency
Switch(config)#snmp-server enable traps syslog
Switch(config)#snmp-server enable traps vtp
Switch(config)#snmp-server enable traps vlancreate
Switch(config)#snmp-server enable traps vlandelete
Switch(c
 << onfig)#snmp-server enable traps flash insertion removal
Switch(config)#snmp-server enable traps port-security
Switch(config)#snmp-server enable traps envmon fan shutdown supply temperatur$ en
 << able traps envmon fan shutdown supply temperature          status
Switch(config)#snmp-server enable traps errdisable
Switch(config)#snmp-server enable traps mac-notification change move threshol
 << $ enable traps mac-notification change move threshold         
Switch(config)#snmp-server enable traps vlan-membership
Switch(config)#snmp-server host 130.18.8.12 sysnet 
Switch(config)#line con 0
Switch(config-line)#line vty 0 15
 << 
Switch(config-line)# access-class 1 in
Switch(config-line)# password Area=l*w
Switch(config-line)# login local
Switch(config-line)# transport input ssh
Switch(config-line)#ntp clock-period 22519226
%NTP: This configuration command is depreceated.

 << Switch(config)#ntp server 10.92.0.5
Switch(config)#
Switch(config)#end
Switch#
 << 
 << 
*Jan  1 18:26:43: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
Switch#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
Expect: matched string 1: (config)#
 >> spanning-tree mode mst

 >> spanning-tree etherchannel guard misconfig

 >> spanning-tree mst configuration

 >>  name msstate

 >>  revision 1

 >>  instance 1 vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 63, 70

 >>  instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 160

 >>  instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 230, 232, 242, 246

 >>  instance 1 vlan 256, 611-612, 654, 741, 996, 999

 >>  instance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037, 2039-2040

 >>  instance 2 vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096, 2104, 2110, 2126

 >>  instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 2189, 2194, 2202

 >>  instance 2 vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 2654, 2999

 >>  instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176, 196

 >>  instance 3 vlan 244, 248, 927

 >>  instance 4 vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072, 2108, 2113, 2128

 >>  instance 4 vlan 2144, 2176, 2196, 2244, 2248, 2927

 >>  instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 228

 >>  instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216, 2228

 >>  instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116, 124

 >>  instance 7 vlan 172, 186, 192, 204-208, 210, 240-241, 251-252, 630, 928

 >>  instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082, 2084

 >>  instance 8 vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208, 2210

 >>  instance 8 vlan 2240-2241, 2251-2252, 2630, 2928

 >>  instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102, 112

 >>  instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 500, 505, 510-511

 >>  instance 9 vlan 522, 551-570, 603, 629, 633, 742, 802, 926, 929

 >>  instance 10 vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 2057, 2062, 2068

 >>  instance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148, 2158

 >>  instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522, 2603, 2629, 2633

 >>  instance 10 vlan 2802, 2926, 2929

 >>  instance 11 vlan 8, 43, 52, 146, 156-157, 180, 200, 218

 >>  instance 12 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180, 2200, 2218

 >> 

 >> end

Expect: searching for 1 strs:  :Configured
 << spanning-tree mode mst
Switch(config)#spanning-tree etherchannel guard misconfig
Switch(config)#spanning-tree mst configuration
Switch(config-mst)# name msstate
Switch(config-mst)# revision 1
Switch(config-mst)# instance 1 vlan 2, 7, 11, 20, 22, 24, 
 << 31, 35, 37, 39-40, $ vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40, 5         0, 60, 63, 11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 
 << 63,          70
Switch(config-mst)# instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 1$ vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 14         0, 152, 1
 << 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 16         0
Switch(config-mst)# instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 23$ vlan 162-1
 << 63, 168, 189, 194, 202, 220, 222, 230         , 232, 24163, 168, 189, 194, 202, 220, 222, 230, 232, 242         , 246
Switch(config-mst)# instance 1 vlan 256, 611-612, 654, 741, 9
 << 96, 999
Switch(config-mst)# instance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031,$ vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031,          2035, 203
 << , 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037         , 2039-2011, 2020, 2022, 2024, 2031, 2035, 2037, 2039-204         0
Switch(config-mst)# instance 2 v
 << lan 2050, 2060, 2063, 2070, 2080, 2086, 2096,$ vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096,          2104, 211, 2060, 2063, 2070,
 <<  2080, 2086, 2096, 2104, 2110         , 2126
Switch(config-mst)# instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, $ vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 2         
 << 189, 2194, 2140, 2152, 2160, 2162-2163, 2168, 2189, 2194,          2202
Switch(config-mst)# instance 2 vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 
 << $ vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 2         654, 2999
Switch(config-mst)# instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128$ vlan 42, 51, 59, 64
 << , 66, 69, 72, 108, 113, 128,          144, 17651, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176,          196
Switch(config-mst)# instance 3 vlan 244, 248, 927
Switch(config-mst)# 
 << instance 4 vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072,$ vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072,          2108, 211, 2051,
 <<  2059, 2064, 2066, 2069, 2072, 2108, 2113         , 2128
Switch(config-mst)# instance 4 vlan 2144, 2176, 2196, 2244, 2248, 2927
Switch(config-mst)# instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 2
 << $ vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 22         8
Switch(config-mst)# instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-$ vlan 2016, 2048, 2058, 2088, 
 << 2121, 2131, 2133-2         134, 2216, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216,          2228
Switch(config-mst)# instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97,
 << $ vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97,          114, 116,3-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116,          1
 << 24
Switch(config-mst)# instance 7 vlan 172, 186, 192, 204-208, 210, 240-241, 251$ vlan 172, 186, 192, 204-208, 210, 240-241, 251-         252, 630,
 << 186, 192, 204-208, 210, 240-241, 251-252, 630,          928
Switch(config-mst)# instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, $ vlan 2009, 2033-2034, 2038, 2054
 << , 2056, 2071, 2         075, 2082, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082,          2084
Switch(config-mst)# instance 8 vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192,
 << $ vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192,          2204-2208, 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208,          221
 << 0
Switch(config-mst)# instance 8 vlan 2240-2241, 2251-2252, 2630, 2928
Switch(config-mst)# instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 9$ vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 
 << 98         -99, 102,12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102,          112
Switch(config-mst)# instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 50
 << $ vlan 130, 132, 147-148, 158, 212, 226, 236, 500         , 505, 51132, 147-148, 158, 212, 226, 236, 500, 505, 510         -511
Switch(config-mst
 << )# instance 9 vlan 522, 551-570, 603, 629, 633, 742, 802, 92$ vlan 522, 551-570, 603, 629, 633, 742, 802, 926         , 929
Switch(config-mst)# instance 10 vlan 2004-2005, 2012, 2018-2019
 << , 2032, 2044, $0 vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 2         057, 20624-2005, 2012, 2018-2019, 2032, 2044, 2057, 2062,  
 <<         2068
Switch(config-mst)# instance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132,$0 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132,          2147-2148
 << 6, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148,          2158
Switch(config-mst)# instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522,$0 vlan 221
 << 2, 2236, 2500, 2505, 2510-2511, 2522,          2603, 2622, 2236, 2500, 2505, 2510-2511, 2522, 2603, 2629         , 2633
Switch(config-mst)# instance 10 vlan 2802, 2926, 2929
Swit
 << ch(config-mst)# instance 11 vlan 8, 43, 52, 146, 156-157, 180, 200, 218
Switch(config-mst)# instance 12 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180,$2 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180
 << ,          2200, 2218, 2043, 2052, 2146, 2156-2157, 2180, 2200, 2218         
Switch(config-mst)#
Switch(config-mst)#end
Switch#
 << 
*Jan  1 18:26:59: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
Switch#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
Expect: matched string 1: (config)#
 >> hostname c29s1p.f1nw.critz 

Expect: searching for 2 strs:  :# :>
 << hostname c29s1p.f1nw.critz 
c29s1p.f1nw.critz(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s1p.f1nw.critz#
 << 
*Jan  1 18:27:06: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.f1nw.critz#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.f1nw.critz(config)#
Expect: matched string 1: (config)#
 >> snmp-server contact 6F-1771

Expect: searching for 1 strs:  :#
 << snmp-server contact 6F-1771
c29s1p.f1nw.critz(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s1p.f1nw.critz#
 << 
*Jan  1 18:27:12: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.f1nw.critz#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.f1nw.critz(config)#
Expect: matched string 1: (config)#
 >> interface vlan 92

Expect: searching for 1 strs:  :(config-if)#
 << interface vlan 92
c29s1p.f1nw.critz(config-if)#
Expect: matched string 1: (config-if)#
 >> ip address 10.92.3.152 255.255.0.0

 >> ip broadcast-address 10.92.255.255

 >> end

Expect: searching for 1 strs:  :Configured
 << ip address 10.92.3.152 255.255.0.0
c29s1p.f1nw.critz(config-if)#ip broadcast-address 10.92.255.255
c29s1p.f1nw.critz(config-if)#end
c29s1p.f1nw.critz#
 << 
*Jan  1 18:27:19: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.f1nw.critz#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.f1nw.critz(config)#
Expect: matched string 1: (config)#
 >> interface Vlan92

Expect: searching for 1 strs:  :(config-if)#
 << interface Vlan92
c29s1p.f1nw.critz(config-if)#
Expect: matched string 1: (config-if)#
 >> ip default-gateway 10.92.0.1

 >> end

Expect: searching for 1 strs:  :Configured
 << ip default-gateway 10.92.0.1
c29s1p.f1nw.critz(config)#end
c29s1p.f1nw.critz#
*Jan  1 18:27:24: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.f1nw.critz#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.f1nw.critz(config)#
Expect: matched string 1: (config)#
 >> ip dhcp snooping

Expect: searching for 1 strs:  :#
 << ip dhcp snooping
c29s1p.f1nw.critz(config)#
Expect: matched string 1: #
 >> ip dhcp snooping vlan 252

Expect: searching for 1 strs:  :#
 << ip dhcp snooping vlan 252
c29s1p.f1nw.critz(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s1p.f1nw.critz#
 << 
*Jan  1 18:27:31: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.f1nw.critz#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.f1nw.critz(config)#
Expect: matched string 1: (config)#
 >> default interface range gi1/0/1 - 48 

 >> interface range gi1/0/1 - 48 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi1/0/1 - 48 

 << c29s1p.f1nw.critz(config)#interface range gi1/0/1 - 48 
c29s1p.f1nw.critz(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport access vlan 252

 >> switchport mode access

 >> spanning-tree portfast

 >> switchport port-security maximum 2

 >> switchport port-security

 >> switchport port-security aging time 15

 >> switchport port-security violation protect

 >> switchport port-security aging type inactivity

 >> power inline never

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport access vlan 252
c29s1p.f1nw.critz(config-if-range)#switchport mode access
c29s1p.f1nw.critz(config-if-range)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, concentrato
 << rs, switches, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast will be configured in 48 interfaces due to the range command 
 but will only have effect when the interfaces 
 << are in a non-trunking mode.
c29s1p.f1nw.critz(config-if-range)#switchport port-security maximum 2
c29s1p.f1nw.critz(config-if-range)#switchport port-security
c29s1p.f1nw.critz(config-if-range)#switchport port-security aging time 15
c29s1p.f1nw.critz(c
 << onfig-if-range)#switchport port-security violation protect
c29s1p.f1nw.critz(config-if-range)#switchport port-security aging type inacti$port-security aging type inactiv         ity
c29s1p.f1nw.critz(co
 << nfig-if-range)#power inline never
c29s1p.f1nw.critz(config-if-range)#end
c29s1p.f1nw.critz#
 << 
*Jan  1 18:27:42: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.f1nw.critz#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.f1nw.critz(config)#
Expect: matched string 1: (config)#
 >> default interface gi1/0/1 

 >> interface gi1/0/1 

Expect: searching for 1 strs:  :(config-if)#
 << default interface gi1/0/1 
Interface GigabitEthernet1/0/1 set to default configuration
c29s1p.f1nw.critz(config)#interface gi1/0/1 
c29s1p.f1nw.critz(config-if)#
Expect: matched string 1: (config-if)#
 >> switchport access vlan 97

 >> switchport mode access

 >> spanning-tree portfast

 >> power inline never

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport access vlan 97
c29s1p.f1nw.critz(config-if)#switchport mode access
c29s1p.f1nw.critz(config-if)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, concentrators, switches,
 <<  bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast has been configured on GigabitEthernet1/0/1 but will only
 have effect when the interface is in a non-trunking mode.
c29s
 << 1p.f1nw.critz(config-if)#power inline never
c29s1p.f1nw.critz(config-if)#end
c29s1p.f1nw.critz#
 << 
*Jan  1 18:27:48: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.f1nw.critz#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.f1nw.critz(config)#
Expect: matched string 1: (config)#
 >> default interface gi1/0/17 

 >> interface gi1/0/17 

Expect: searching for 1 strs:  :(config-if)#
 << default interface gi1/0/17 
Interface GigabitEthernet1/0/17 set to default configuration
c29s1p.f1nw.critz(config)#interface gi1/0/17 
c29s1p.f1nw.critz(config-if)#
Expect: matched string 1: (config-if)#
 >> switchport access vlan 672

 >> switchport mode access

 >> spanning-tree portfast

 >> switchport port-security maximum 2

 >> switchport port-security

 >> switchport port-security aging time 15

 >> switchport port-security violation protect

 >> switchport port-security aging type inactivity

 >> power inline never

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport access vlan 672
c29s1p.f1nw.critz(config-if)#switchport mode access
c29s1p.f1nw.critz(config-if)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, concentrators, switches
 << , bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast has been configured on GigabitEthernet1/0/17 but will only
 have effect when the interface is in a non-trunking mode.
c2
 << 9s1p.f1nw.critz(config-if)#switchport port-security maximum 2
c29s1p.f1nw.critz(config-if)#switchport port-security
c29s1p.f1nw.critz(config-if)#switchport port-security aging time 15
c29s1p.f1nw.critz(config-if)#switchport port-security violation prot
 << ect
c29s1p.f1nw.critz(config-if)#switchport port-security aging type inactivity
c29s1p.f1nw.critz(config-if)#power inline never
c29s1p.f1nw.critz(config-if)#end
c29s1p.f1nw.critz#
 << 
*Jan  1 18:27:55: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.f1nw.critz#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.f1nw.critz(config)#
Expect: matched string 1: (config)#
 >> default interface range gi1/0/3 - 13 

 >> interface range gi1/0/3 - 13 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi1/0/3 - 13 
c29s1p.f1nw.critz(config)#interface range gi1/0/3 - 13 
c29s1p.f1nw.critz(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport access vlan 252

 >> switchport mode access

 >> spanning-tree portfast

 >> switchport port-security maximum 2

 >> switchport port-security

 >> switchport port-security aging time 15

 >> switchport port-security violation protect

 >> switchport port-security aging type inactivity

 >> power inline consumption 15400

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport access vlan 252
c29s1p.f1nw.critz(config-if-range)#switchport mode access
c29s1p.f1nw.critz(config-if-range)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, concentrato
 << rs, switches, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast will be configured in 11 interfaces due to the range command 
 but will only have effect when the interfaces 
 << are in a non-trunking mode.
c29s1p.f1nw.critz(config-if-range)#switchport port-security maximum 2
c29s1p.f1nw.critz(config-if-range)#switchport port-security
c29s1p.f1nw.critz(config-if-range)#switchport port-security aging time 15
c29s1p.f1nw.critz(c
 << onfig-if-range)#switchport port-security violation protect
c29s1p.f1nw.critz(config-if-range)#switchport port-security aging type inacti$port-security aging type inactiv         ity
c29s1p.f1nw.critz(co
 << nfig-if-range)#power inline consumption 15400
%CAUTION: Interface Gi1/0/3: Misconfiguring the 'power inline
 consumption/allocation' command may cause damage to the switch and void
 your warranty. Take precaution not to oversubscribe the power supply.
 << 
 It is recommended to enable power policing if the switch supports it.
 Refer to documentation.

%CAUTION: Interface Gi1/0/4: Misconfiguring the 'power inline
 consumption/allocation' command may cause damage to the switch and void
 your warranty. T
 << ake precaution not to oversubscribe the power supply.
 It is recommended to enable power policing if the switch supports it.
 Refer to documentation.

%CAUTION: Interface Gi1/0/5: Misconfiguring the 'power inline
 consumption/allocation' command may 
 << cause damage to the switch and void
 your warranty. Take precaution not to oversubscribe the power supply.
 It is recommended to enable power policing if the switch supports it.
 Refer to documentation.

%CAUTION: Interface Gi1/0/6: Misconfiguring th
 << e 'power inline
 consumption/allocation' command may cause damage to the switch and void
 your warranty. Take precaution not to oversubscribe the power supply.
 It is recommended to enable power policing if the switch supports it.
 Refer to documentat
 << ion.

%CAUTION: Interface Gi1/0/7: Misconfiguring the 'power inline
 consumption/allocation' command may cause damage to the switch and void
 your warranty. Take precaution not to oversubscribe the power supply.
 It is recommended to enable power pol
 << icing if the switch supports it.
 Refer to documentation.

%CAUTION: Interface Gi1/0/8: Misconfiguring the 'power inline
 consumption/allocation' command may cause damage to the switch and void
 your warranty. Take precaution not to oversubscribe the
 <<  power supply.
 It is recommended to enable power policing if the switch supports it.
 Refer to documentation.

%CAUTION: Interface Gi1/0/9: Misconfiguring the 'power inline
 consumption/allocation' command may cause damage to the switch and void
 y
 << our warranty. Take precaution not to oversubscribe the power supply.
 It is recommended to enable power policing if the switch supports it.
 Refer to documentation.

%CAUTION: Interface Gi1/0/10: Misconfiguring the 'power inline
 consumption/allocati
 << on' command may cause damage to the switch and void
 your warranty. Take precaution not to oversubscribe the power supply.
 It is recommended to enable power policing if the switch supports it.
 Refer to documentation.

%CAUTION: Interface Gi1/0/11: 
 << Misconfiguring the 'power inline
 consumption/allocation' command may cause damage to the switch and void
 your warranty. Take precaution not to oversubscribe the power supply.
 It is recommended to enable power policing if the switch supports it.
 Re
 << fer to documentation.

%CAUTION: Interface Gi1/0/12: Misconfiguring the 'power inline
 consumption/allocation' command may cause damage to the switch and void
 your warranty. Take precaution not to oversubscribe the power supply.
 It is recommended t
 << o enable power policing if the switch supports it.
 Refer to documentation.

%CAUTION: Interface Gi1/0/13: Misconfiguring the 'power inline
 consumption/allocation' command may cause damage to the switch and void
 your warranty. Take precaution not t
 << o oversubscribe the power supply.
 It is recommended to enable power policing if the switch supports it.
 Refer to documentation.

c29s1p.f1nw.critz(config-if-range)#end
c29s1p.f1nw.critz#
 << 
*Jan  1 18:28:06: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.f1nw.critz#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.f1nw.critz(config)#
Expect: matched string 1: (config)#
 >> default interface range gi1/0/47 - 48 

 >> interface range gi1/0/47 - 48 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi1/0/47 - 48 
c29s1p.f1nw.critz(config)#interface range gi1/0/47 - 48 
c29s1p.f1nw.critz(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport trunk encapsulation dot1q

 >> switchport mode trunk

 >> switchport trunk native vlan 92

 >> ip dhcp snooping trust

 >> no keepalive

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport trunk encapsulation dot1q
                                                    ^
% Invalid input detected at '^' marker.

c29s1p.f1nw.critz(config-if-range)#switchport mode trunk
c29s1p.f1nw.critz(config-if-range)#switchport trunk native vl
 << an 92
c29s1p.f1nw.critz(config-if-range)#ip dhcp snooping trust
c29s1p.f1nw.critz(config-if-range)#no keepalive
c29s1p.f1nw.critz(config-if-range)#end
c29s1p.f1nw.critz#
*Jan  1 18:28:13: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.f1nw.critz#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.f1nw.critz(config)#
Expect: matched string 1: (config)#
 >> default interface range te1/0/1 - 2 

 >> interface range te1/0/1 - 2 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range te1/0/1 - 2 
c29s1p.f1nw.critz(config)#interface range te1/0/1 - 2 
c29s1p.f1nw.critz(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport trunk encapsulation dot1q

 >> switchport mode trunk

 >> switchport trunk native vlan 92

 >> ip dhcp snooping trust

 >> no keepalive

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport trunk encapsulation dot1q
                                                    ^
% Invalid input detected at '^' marker.

c29s1p.f1nw.critz(config-if-range)#switchport mode trunk
c29s1p.f1nw.critz(config-if-range)#switchport trunk native vl
 << an 92
c29s1p.f1nw.critz(config-if-range)#ip dhcp snooping trust
c29s1p.f1nw.critz(config-if-range)#no keepalive
c29s1p.f1nw.critz(config-if-range)#end
c29s1p.f1nw.critz#
 << 
*Jan  1 18:28:19: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.f1nw.critz#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.f1nw.critz(config)#
Expect: matched string 1: (config)#
 >> default interface range gi1/0/49 - 50 

 >> interface range gi1/0/49 - 50 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi1/0/49 - 50 
c29s1p.f1nw.critz(config)#interface range gi1/0/49 - 50 
c29s1p.f1nw.critz(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport trunk encapsulation dot1q

 >> switchport mode trunk

 >> switchport trunk native vlan 92

 >> ip dhcp snooping trust

 >> no keepalive

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport trunk encapsulation dot1q
                                                    ^
% Invalid input detected at '^' marker.

c29s1p.f1nw.critz(config-if-range)#switchport mode trunk
c29s1p.f1nw.critz(config-if-range)#switchport trunk native vl
 << an 92
c29s1p.f1nw.critz(config-if-range)#ip dhcp snooping trust
c29s1p.f1nw.critz(config-if-range)#no keepalive
c29s1p.f1nw.critz(config-if-range)#end
c29s1p.f1nw.critz#
 << 
*Jan  1 18:28:26: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.f1nw.critz#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.f1nw.critz(config)#
Expect: matched string 1: (config)#
 >> crypto key generate rsa

 >> no

 >> 2048

Expect: searching for 2 strs:  :OK :(config)#
 << crypto key generate rsa
The name for the keys will be: c29s1p.f1nw.critz.mgmt.msstate.edu
Choose the size of the key modulus in the range of 360 to 4096 for your
  General Purpose Keys. Choosing a key modulus greater than 512 may take
  a few minutes.
 << 

How many bits in the modulus [512]: no
% A decimal number between 360 and 4096.
How many bits in the modulus [512]: 2048
% Generating 2048 bit RSA keys, keys will be non-exportable...
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...
crypto key generate rsa
The name for the keys will be: c29s1p.f1nw.critz.mgmt.msstate.edu
Choose the size of the key modulus in the range of 360 to 4096 for your
  General Purpose Keys. Choosing a key modulus greater than 512 may take
  a few minutes.

How many bits in the modulus [512]: no
% A decimal number between 360 and 4096.
How many bits in the modulus [512]: 2048
% Generating 2048 bit RSA keys, keys will be non-exportable...
...

 >> end

Expect: searching for 1 strs:  :Configured
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

...

 >> 

 >> write mem

Expect: searching for 2 strs:  :# :>
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

...

 >> 
Expect: searching for 2 strs:  :# :>
 << 
[OK] (elapsed time was 34 seconds)

c29s1p.f1nw.critz(config)#end
c29s1p.f1nw.critz#
c29s1p.f1nw.critz#write mem
Building configuration...

*Jan  1 18:29:05: %SSH-5-ENABLED: SSH 1.99 has been enabled
*Jan  1 18:29:06: %SYS-5-CONFIG_I: Configured
Expect: matched string 1: #
 >> sh run

Expect: searching for 2 strs:  :# :>
 <<  from console by console[OK]
c29s1p.f1nw.critz#
c29s1p.f1nw.critz#
c29s1p.f1nw.critz#sh run
Building configuration...

Expect: matched string 1: #
 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
Current configuration : 21473 bytes
!
! Last configuration change at 18:29:06 CST Sun Jan 1 2006
!
version 15.0
no service pad
service timestamps debug datetime localtime
service timestamps log datetime localtime
service password-encryption
!

 << hostname c29s1p.f1nw.critz
!
boot-start-marker
boot-end-marker
!
enable secret 5 $1$A46H$fupJdjP3fNeawtdSrdZ8l0
enable password 7 096D5C0C18581B581C
!
username root privilege 15 secret 5 $1$vDCA$z7Jix/S00BuWCFYRkPK9U1
no aaa new-model
clock time
 << zone CST -6 0
clock summer-time CDT recurring
switch 1 provision ws-c2960s-48lpd-l
authentication mac-move permit
!
!
ip dhcp snooping vlan 252
ip dhcp snooping
ip domain-name mgmt.msstate.edu
ip name-server 130.18.80.12
!
!
crypto pki trustpo
 << int TP-self-signed-2494998912
 enrollment selfsigned
 subject-name cn=IOS-Self-Signed-Certificate-2494998912
 revocation-check none
 rsakeypair TP-self-signed-2494998912
!
!
crypto pki certificate chain TP-self-signed-2494998912
 certificate self-
 << signed 01
  	quit
!
spanning-tree mode mst
spanning-tree portfast bpduguard default
spanning-tree extend system-id
!
spanning-tree mst configuration
 name msstate
 revision 1
 instance 1 vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 63, 
 << 70
 instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 160
 instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 230, 232, 242, 246
 instance 1 vlan 256, 611-612, 654, 741, 996, 999
 instance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024,
 <<  2031, 2035, 2037, 2039-2040
 instance 2 vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096, 2104, 2110, 2126
 instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 2189, 2194, 2202
 instance 2 vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 2654, 2999
 i
 << nstance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176, 196
 instance 3 vlan 244, 248, 927
 instance 4 vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072, 2108, 2113, 2128
 instance 4 vlan 2144, 2176, 2196, 2244, 2248, 2927
 instance 5 vlan 16,
 <<  48, 58, 88, 121, 131, 133-134, 216, 228
 instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216, 2228
 instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116, 124
 instance 7 vlan 172, 186, 192, 204-208, 210, 240-241, 251-252,
 <<  630, 928
 instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082, 2084
 instance 8 vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208, 2210
 instance 8 vlan 2240-2241, 2251-2252, 2630, 2928
 instance 9 vlan 4-5, 12, 18-19, 32, 44, 
 << 57, 62, 68, 76, 98-99, 102, 112
 instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 500, 505, 510-511
 instance 9 vlan 522, 551-570, 603, 629, 633, 742, 802, 926, 929
 instance 10 vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 2057, 2062, 2068
 inst
 << ance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148, 2158
 instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522, 2603, 2629, 2633
 instance 10 vlan 2802, 2926, 2929
 instance 11 vlan 8, 43, 52, 146, 156-157, 180, 200, 218
 instance 12 
 << vlan 2008, 2043, 2052, 2146, 2156-2157, 2180, 2200, 2218
!
!
!
!
!
!
errdisable recovery cause udld
errdisable recovery cause bpduguard
errdisable recovery cause security-violation
errdisable recovery cause channel-misconfig (STP)
errdisable re
 << covery cause pagp-flap
errdisable recovery cause dtp-flap
errdisable recovery cause link-flap
errdisable recovery cause sfp-config-mismatch
errdisable recovery cause gbic-invalid
errdisable recovery cause psecure-violation
errdisable recovery cause 
 << port-mode-failure
errdisable recovery cause dhcp-rate-limit
errdisable recovery cause pppoe-ia-rate-limit
errdisable recovery cause mac-limit
errdisable recovery cause vmps
errdisable recovery cause storm-control
errdisable recovery cause inline-pow
 << er
errdisable recovery cause arp-inspection
errdisable recovery cause loopback
errdisable recovery cause small-frame
errdisable recovery cause psp
errdisable recovery interval 1800
!
!
!
!
vlan internal allocation policy ascending
!
!
! 
!

 << !
!
!
!
!
!
!
interface FastEthernet0
 no ip address
 shutdown
!
interface GigabitEthernet1/0/1
 switchport access vlan 97
 switchport mode access
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/2
 switchport a
 << ccess vlan 252
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline n
 << ever
 spanning-tree portfast
!
interface GigabitEthernet1/0/3
 switchport access vlan 252
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport 
 << port-security aging type inactivity
 switchport port-security
 power inline consumption 15400
 spanning-tree portfast
!
interface GigabitEthernet1/0/4
 switchport access vlan 252
 switchport mode access
 switchport port-security maximum 2
 switch
 << port port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline consumption 15400
 spanning-tree portfast
!
interface GigabitEthernet1/0/5
 switch
 << port access vlan 252
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power in
 << line consumption 15400
 spanning-tree portfast
!
interface GigabitEthernet1/0/6
 switchport access vlan 252
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging tim
 << e 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline consumption 15400
 spanning-tree portfast
!
interface GigabitEthernet1/0/7
 switchport access vlan 252
 switchport mode access
 switchport port-security 
 << maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline consumption 15400
 spanning-tree portfast
!
interface GigabitEthe
 << rnet1/0/8
 switchport access vlan 252
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-s
 << ecurity
 power inline consumption 15400
 spanning-tree portfast
!
interface GigabitEthernet1/0/9
 switchport access vlan 252
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-
 << security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline consumption 15400
 spanning-tree portfast
!
interface GigabitEthernet1/0/10
 switchport access vlan 252
 switchport mode access
 switch
 << port port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline consumption 15400
 spanning-tree portfast
!
in
 << terface GigabitEthernet1/0/11
 switchport access vlan 252
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 << 
 switchport port-security
 power inline consumption 15400
 spanning-tree portfast
!
interface GigabitEthernet1/0/12
 switchport access vlan 252
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation prote
 << ct
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline consumption 15400
 spanning-tree portfast
!
interface GigabitEthernet1/0/13
 switchport access vlan 252
 switchport
 <<  mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline consumption 15400
 spanning
 << -tree portfast
!
interface GigabitEthernet1/0/14
 switchport access vlan 252
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security 
 << aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/15
 switchport access vlan 252
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violat
 << ion protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/16
 switchport access vlan 252
 switchport mo
 << de access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
 << 
!
interface GigabitEthernet1/0/17
 switchport access vlan 672
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inac
 << tivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/18
 switchport access vlan 252
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 s
 << witchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/19
 switchport access vlan 252
 switchport mode access
 swi
 << tchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface G
 << igabitEthernet1/0/20
 switchport access vlan 252
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switch
 << port port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/21
 switchport access vlan 252
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-
 << security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/22
 switchport access vlan 252
 switchport mode access
 switchport port-se
 << curity maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1
 << /0/23
 switchport access vlan 252
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-secur
 << ity
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/24
 switchport access vlan 252
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging 
 << time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/25
 switchport access vlan 252
 switchport mode access
 switchport port-security maximum 
 << 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/26
 switchp
 << ort access vlan 252
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inl
 << ine never
 spanning-tree portfast
!
interface GigabitEthernet1/0/27
 switchport access vlan 252
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switc
 << hport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/28
 switchport access vlan 252
 switchport mode access
 switchport port-security maximum 2
 switchport 
 << port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/29
 switchport access vlan
 <<  252
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spa
 << nning-tree portfast
!
interface GigabitEthernet1/0/30
 switchport access vlan 252
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-secu
 << rity aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/31
 switchport access vlan 252
 switchport mode access
 switchport port-security maximum 2
 switchport port-security v
 << iolation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/32
 switchport access vlan 252
 switchpo
 << rt mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree port
 << fast
!
interface GigabitEthernet1/0/33
 switchport access vlan 252
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type
 <<  inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/34
 switchport access vlan 252
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protec
 << t
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/35
 switchport access vlan 252
 switchport mode access
 << 
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interf
 << ace GigabitEthernet1/0/36
 switchport access vlan 252
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 s
 << witchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/37
 switchport access vlan 252
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport 
 << port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/38
 switchport access vlan 252
 switchport mode access
 switchport po
 << rt-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthe
 << rnet1/0/39
 switchport access vlan 252
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-
 << security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/40
 switchport access vlan 252
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security a
 << ging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/41
 switchport access vlan 252
 switchport mode access
 switchport port-security max
 << imum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/42
 sw
 << itchport access vlan 252
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 powe
 << r inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/43
 switchport access vlan 252
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 
 << switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/44
 switchport access vlan 252
 switchport mode access
 switchport port-security maximum 2
 switch
 << port port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/45
 switchport access
 <<  vlan 252
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 << 
 spanning-tree portfast
!
interface GigabitEthernet1/0/46
 switchport access vlan 252
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port
 << -security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/47
 switchport trunk native vlan 92
 switchport mode trunk
 no keepalive
 ip dhcp snooping trust
!
interface Gi
 << gabitEthernet1/0/48
 switchport trunk native vlan 92
 switchport mode trunk
 no keepalive
 ip dhcp snooping trust
!
interface GigabitEthernet1/0/49
 switchport trunk native vlan 92
 switchport mode trunk
 ip dhcp snooping trust
!
interface Giga
 << bitEthernet1/0/50
 switchport trunk native vlan 92
 switchport mode trunk
 ip dhcp snooping trust
!
interface TenGigabitEthernet1/0/1
 switchport trunk native vlan 92
 switchport mode trunk
 ip dhcp snooping trust
!
interface TenGigabitEthernet1
 << /0/2
 switchport trunk native vlan 92
 switchport mode trunk
 ip dhcp snooping trust
!
interface Vlan1
 no ip address
 no ip route-cache
 shutdown
!
interface Vlan92
 ip address 10.92.3.152 255.255.0.0
 ip broadcast-address 10.92.255.255
!
i
 << p default-gateway 10.92.0.1
no ip http server
no ip http secure-server
!
logging facility local1
logging host 130.18.8.12
access-list 1 permit 10.92.0.0 0.0.255.255
access-list 1 permit 130.18.8.0 0.0.0.255
access-list 1 permit 10.93.0.0 0.0.255.2
 << 55
access-list 1 permit 130.18.1.0 0.0.0.255
!
snmp-server community sysnet RO 1
snmp-server community c2-b2=a2 RW 1
snmp-server contact 6F-1771
snmp-server enable traps snmp authentication linkdown linkup coldstart warmstart
snmp-server enable tra
 << ps transceiver all
snmp-server enable traps tty
snmp-server enable traps cluster
snmp-server enable traps config-copy
snmp-server enable traps config
snmp-server enable traps config-ctid
snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-au
 << th-fail-vlan no-guest-vlan
snmp-server enable traps entity
snmp-server enable traps power-ethernet group 1
snmp-server enable traps power-ethernet police
snmp-server enable traps cpu threshold
snmp-server enable traps rep
snmp-server enable traps br
 << idge newroot topologychange
snmp-server enable traps stpx inconsistency root-inconsistency loop-inconsistency
snmp-server enable traps vtp
snmp-server enable traps vlancreate
snmp-server enable traps vlandelete
snmp-server enable traps flash insertio
 << n removal
snmp-server enable traps port-security
snmp-server enable traps envmon fan shutdown supply temperature status
snmp-server enable traps errdisable
snmp-server enable traps mac-notification change move threshold
snmp-server enable traps vlan-
 << membership
snmp-server host 130.18.8.12 sysnet 
!
!
line con 0
line vty 0 4
 access-class 1 in
 password 7 096D5C0C18581B581C
 login local
 transport input ssh
line vty 5 15
 access-class 1 in
 password 7 096D5C0C18581B581C
 login local
 tra
 << nsport input ssh
!
ntp server 10.92.0.5
end

c29s1p.f1nw.critz#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.f1nw.critz(config)#
Expect: matched string 1: (config)#
 >> no service pad

 >> service timestamps debug datetime localtime

 >> service timestamps log datetime localtime

 >> service password-encryption

 >> boot-start-marker

 >> boot-end-marker

 >> enable secret Area=l*w

 >> enable password Area=l*w

 >> username root privilege 15 secret Area=l*w

 >> no aaa new-model

 >> clock timezone CST -6

 >> clock summer-time CDT recurring

 >> authentication mac-move permit

 >> ip domain-name mgmt.msstate.edu

 >> ip name-server 130.18.80.12

 >> vtp domain vtp01.mgmt.msstate.edu

 >> vtp mode client

 >> crypto pki trustpoint TP-self-signed-2494998912

 >>  enrollment selfsigned

 >>  subject-name cn=IOS-Self-Signed-Certificate-2494998912

 >>  revocation-check none

 >>  rsakeypair TP-self-signed-2494998912

 >> crypto pki certificate chain TP-self-signed-2494998912

 >>  certificate self-signed 01 nvram:IOS-Self-Sig#3232.cer

 >> spanning-tree portfast bpduguard default

 >> spanning-tree extend system-id

 >> vlan internal allocation policy ascending

 >> errdisable recovery cause all

 >> errdisable recovery interval 1800

 >> interface FastEthernet0

 >>  no ip address

 >>  shutdown

 >> interface Vlan1

 >>  no ip address

 >>  no ip route-cache

 >>  shutdown

 >> interface Vlan92

 >> no ip http server

 >> no ip http secure-server

 >> ip sla enable reaction-alerts

 >> logging facility local1

 >> logging host 130.18.8.12

 >> access-list 1 permit 10.92.0.0 0.0.255.255

 >> access-list 1 permit 130.18.8.0 0.0.0.255

 >> access-list 1 permit 10.93.0.0 0.0.255.255

 >> access-list 1 permit 130.18.1.0 0.0.0.255

 >> snmp-server community sysnet RO 1

 >> snmp-server community c2-b2=a2 RW 1

 >> snmp-server enable traps snmp authentication linkdown linkup coldstart warmstart

 >> snmp-server enable traps transceiver all

 >> snmp-server enable traps tty

 >> snmp-server enable traps cluster

 >> snmp-server enable traps config-copy

 >> snmp-server enable traps config

 >> snmp-server enable traps config-ctid

 >> snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-auth-fail-vlan no-guest-vlan

 >> snmp-server enable traps entity

 >> snmp-server enable traps power-ethernet group 1

 >> snmp-server enable traps power-ethernet police

 >> snmp-server enable traps cpu threshold

 >> snmp-server enable traps rep

 >> snmp-server enable traps rtr

 >> snmp-server enable traps bridge newroot topologychange

 >> snmp-server enable traps stpx inconsistency root-inconsistency loop-inconsistency

 >> snmp-server enable traps syslog

 >> snmp-server enable traps vtp

 >> snmp-server enable traps vlancreate

 >> snmp-server enable traps vlandelete

 >> snmp-server enable traps flash insertion removal

 >> snmp-server enable traps port-security

 >> snmp-server enable traps envmon fan shutdown supply temperature status

 >> snmp-server enable traps errdisable

 >> snmp-server enable traps mac-notification change move threshold

 >> snmp-server enable traps vlan-membership

 >> snmp-server host 130.18.8.12 sysnet 

 >> line con 0

 >> line vty 0 15

 >>  access-class 1 in

 >>  password Area=l*w

 >>  login local

 >>  transport input ssh

 >> ntp clock-period 22519226

 >> ntp server 10.92.0.5

 >> 

 >> end

Expect: searching for 1 strs:  :Configured
 << no service pad
c29s1p.f1nw.critz(config)#service timestamps debug datetime localtime
c29s1p.f1nw.critz(config)#service timestamps log datetime localtime
c29s1p.f1nw.critz(config)#service password-encryption
c29s1p.f1nw.critz(config)#boot-start-marker
 << 
c29s1p.f1nw.critz(config)#boot-end-marker
c29s1p.f1nw.critz(config)#enable secret Area=l*w
The enable secret you have chosen is the same as your enable password.
This is not recommended.  Re-enter the enable secret.

c29s1p.f1nw.critz(config)#enable
 <<  password Area=l*w
The enable password you have chosen is the same as your enable secret.
This is not recommended.  Re-enter the enable password.

c29s1p.f1nw.critz(config)#username root privilege 15 secret Area=l*w
c29s1p.f1nw.critz(config)#no aaa n
 << ew-model
c29s1p.f1nw.critz(config)#clock timezone CST -6
c29s1p.f1nw.critz(config)#clock summer-time CDT recurring
c29s1p.f1nw.critz(config)#authentication mac-move permit
c29s1p.f1nw.critz(config)#ip domain-name mgmt.msstate.edu
c29s1p.f1nw.critz(co
 << nfig)#ip name-server 130.18.80.12
c29s1p.f1nw.critz(config)#vtp domain vtp01.mgmt.msstate.edu
Domain name already set to vtp01.mgmt.msstate.edu.
c29s1p.f1nw.critz(config)#vtp mode client
Device mode already VTP Client for VLANS.
c29s1p.f1nw.critz(con
 << fig)#crypto pki trustpoint TP-self-signed-2494998912
c29s1p.f1nw.critz(ca-trustpoint)# enrollment selfsigned
c29s1p.f1nw.critz(ca-trustpoint)# subject-name cn=IOS-Self-Signed-Certificate$me cn=IOS-Self-Signed-
 << Certificate-         249499891Self-Signed-Certificate-2494998912         
c29s1p.f1nw.critz(ca-trustpoint)# revocation-check none
c29s1p.f1nw.critz(ca-trustpoint)# rsakeypair TP-self-signed-24
 << 94998912
c29s1p.f1nw.critz(ca-trustpoint)#crypto pki certificate chain TP-self-signed-$certificate chain TP-self-signed-2         494998912
c29s1p.f1nw.critz(config-cert-chain)# certificate self-signe
 << d 01 nvram:IOS-Se$e self-signed 01 nvram:IOS-Sel         f-Sig#323ned 01 nvram:IOS-Self-Sig#3232         .cer
c29s1p.f1nw.critz(config-cert-chain)#spanning-t
 << ree portfast bpduguard default
c29s1p.f1nw.critz(config)#spanning-tree extend system-id
c29s1p.f1nw.critz(config)#vlan internal allocation policy ascending
c29s1p.f1nw.critz(config)#errdisable recovery cause all
c29s1p.f1nw.critz(config)#errdisable re
 << covery interval 1800
c29s1p.f1nw.critz(config)#
*Jan  1 18:32:25: % Multiple self signed certificates in config
    certificate for trust point TP-self-signed-2494998912 ignored
interface FastEthernet0
c29s1p.f1nw.critz(config-if)# no ip address
c29
 << s1p.f1nw.critz(config-if)# shutdown
c29s1p.f1nw.critz(config-if)#interface Vlan1
c29s1p.f1nw.critz(config-if)# no ip address
c29s1p.f1nw.critz(config-if)# no ip route-cache
c29s1p.f1nw.critz(config-if)# shutdown
c29s1p.f1nw.critz(config-if)#interface
 <<  Vlan92
c29s1p.f1nw.critz(config-if)#no ip http server
c29s1p.f1nw.critz(config)#no ip http secure-server
c29s1p.f1nw.critz(config)#ip sla enable reaction-alerts
                                 ^
% Invalid input detected at '^' marker.

c29s1p.f1n
 << w.critz(config)#logging facility local1
c29s1p.f1nw.critz(config)#logging host 130.18.8.12
c29s1p.f1nw.critz(config)#access-list 1 permit 10.92.0.0 0.0.255.255
c29s1p.f1nw.critz(config)#access-list 1 permit 130.18.8.0 0.0.0.255
c29s1p.f1nw.critz(confi
 << g)#access-list 1 permit 10.93.0.0 0.0.255.255
c29s1p.f1nw.critz(config)#access-list 1 permit 130.18.1.0 0.0.0.255
c29s1p.f1nw.critz(config)#snmp-server community sysnet RO 1
c29s1p.f1nw.critz(config)#snmp-server community c2-b2=a2 RW 1
c29s1p.f1nw.cri
 << tz(config)#snmp-server enable traps snmp authentication linkdo$ enable traps snmp authentication linkdow         n linkup aps snmp authentication
 <<  linkdown linkup c         oldstart uthentication linkdown linkup coldstart w         armstart
c29s1p.f1nw.critz(config)#snmp-server enable traps transceiver all
c29s1p.f1nw.critz(confi
 << g)#snmp-server enable traps tty
c29s1p.f1nw.critz(config)#snmp-server enable traps cluster
c29s1p.f1nw.critz(config)#snmp-server enable traps config-copy
c29s1p.f1nw.critz(config)#snmp-server enable traps config
c29s1p.f1nw.critz(config)#snmp-server e
 << nable traps config-ctid
c29s1p.f1nw.critz(config)#snmp-server enable traps dot1x auth-fail-vlan guest$ enable traps dot1x auth-fail-vlan guest-         vlan no-a
 << aps dot1x auth-fail-vlan guest-vlan no-au         th-fail-vuth-fail-vlan guest-vlan no-auth-fail-vl         an no-guevlan
 <<  guest-vlan no-auth-fail-vlan no-gues         t-vlan
c29s1p.f1nw.critz(config)#snmp-server enable traps entity
c29s1p.f1nw.critz(config)#snmp-server enable traps power-ethernet group 1
c29s1p.f1nw.critz(config)#snmp-server enable traps power-e
 << thernet police
c29s1p.f1nw.critz(config)#snmp-server enable traps cpu threshold
c29s1p.f1nw.critz(config)#snmp-server enable traps rep
c29s1p.f1nw.critz(config)#snmp-server enable traps rtr
                                                    ^
% Inva
 << lid input detected at '^' marker.

c29s1p.f1nw.critz(config)#snmp-server enable traps bridge newroot topologycha$ enable traps bridge newroot topologychan         ge
c29s1p.f1nw.critz(config)#
 << snmp-server enable traps stpx inconsistency root-in$ enable traps stpx inconsistency root-inc         onsistencaps stpx inconsistency root-incons
 << istency          loop-incnconsistency root-inconsistency loop-inco         nsistency
c29s1p.f1nw.critz(config)#snmp-server enable traps syslog
c29s1p.f1nw.critz(config)#snmp-server enab
 << le traps vtp
c29s1p.f1nw.critz(config)#snmp-server enable traps vlancreate
c29s1p.f1nw.critz(config)#snmp-server enable traps vlandelete
c29s1p.f1nw.critz(config)#snmp-server enable traps flash insertion removal
c29s1p.f1nw.critz(config)#snmp-server e
 << nable traps port-security
c29s1p.f1nw.critz(config)#snmp-server enable traps envmon fan shutdown supply$ enable traps envmon fan shutdown supply          temperatu
 << aps envmon fan shutdown supply temperatur         e status
c29s1p.f1nw.critz(config)#snmp-server enable traps errdisable
c29s1p.f1nw.critz(config)#snmp-server enable traps mac-notification change mo
 << $ enable traps mac-notification change mov         e threshoaps mac-notification change move threshol         d
c29s1p.f1nw.critz(config)#snmp-server enable traps
 <<  vlan-membership
c29s1p.f1nw.critz(config)#snmp-server host 130.18.8.12 sysnet 
c29s1p.f1nw.critz(config)#line con 0
c29s1p.f1nw.critz(config-line)#line vty 0 15
c29s1p.f1nw.critz(config-line)# access-class 1 in
c29s1p.f1nw.critz(config-line)# passwo
 << rd Area=l*w
c29s1p.f1nw.critz(config-line)# login local
c29s1p.f1nw.critz(config-line)# transport input ssh
c29s1p.f1nw.critz(config-line)#ntp clock-period 22519226
%NTP: This configuration command is depreceated.
c29s1p.f1nw.critz(config)#ntp server
 <<  10.92.0.5
c29s1p.f1nw.critz(config)#
c29s1p.f1nw.critz(config)#end
c29s1p.f1nw.critz#
 << 
*Jan  1 18:32:38: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.f1nw.critz#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.f1nw.critz(config)#
Expect: matched string 1: (config)#
 >> spanning-tree mode mst

 >> spanning-tree etherchannel guard misconfig

 >> spanning-tree mst configuration

 >>  name msstate

 >>  revision 1

 >>  instance 1 vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 63, 70

 >>  instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 160

 >>  instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 230, 232, 242, 246

 >>  instance 1 vlan 256, 611-612, 654, 741, 996, 999

 >>  instance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037, 2039-2040

 >>  instance 2 vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096, 2104, 2110, 2126

 >>  instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 2189, 2194, 2202

 >>  instance 2 vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 2654, 2999

 >>  instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176, 196

 >>  instance 3 vlan 244, 248, 927

 >>  instance 4 vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072, 2108, 2113, 2128

 >>  instance 4 vlan 2144, 2176, 2196, 2244, 2248, 2927

 >>  instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 228

 >>  instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216, 2228

 >>  instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116, 124

 >>  instance 7 vlan 172, 186, 192, 204-208, 210, 240-241, 251-252, 630, 928

 >>  instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082, 2084

 >>  instance 8 vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208, 2210

 >>  instance 8 vlan 2240-2241, 2251-2252, 2630, 2928

 >>  instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102, 112

 >>  instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 500, 505, 510-511

 >>  instance 9 vlan 522, 551-570, 603, 629, 633, 742, 802, 926, 929

 >>  instance 10 vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 2057, 2062, 2068

 >>  instance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148, 2158

 >>  instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522, 2603, 2629, 2633

 >>  instance 10 vlan 2802, 2926, 2929

 >>  instance 11 vlan 8, 43, 52, 146, 156-157, 180, 200, 218

 >>  instance 12 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180, 2200, 2218

 >> 

 >> end

Expect: searching for 1 strs:  :Configured
 << spanning-tree mode mst
c29s1p.f1nw.critz(config)#spanning-tree etherchannel guard misconfig
c29s1p.f1nw.critz(config)#spanning-tree mst configuration
c29s1p.f1nw.critz(config-mst)# name msstate
c29s1p.f1nw.critz(config-mst)# revision 1
c29s1p.f1nw.cr
 << itz(config-mst)# instance 1 vlan 2, 7, 11, 20, 22, 24, 31, 35, $ vlan 2, 7, 11, 20, 22, 24, 31, 35, 3         7, 39-40,, 11, 20, 22, 24, 31, 35, 37, 39-4
 << 0,          50, 60, 622, 24, 31, 35, 37, 39-40, 50, 60, 63         , 70
c29s1p.f1nw.critz(config-mst)# instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 
 << $ vlan 78, 80, 86, 91, 96, 104, 110, 1         26, 136, 80, 86, 91, 96, 104, 110, 126, 136, 1         40, 152, , 96, 104, 110, 126, 136, 14
 << 0, 152, 1         60
c29s1p.f1nw.critz(config-mst)# instance 1 vlan 162-163, 168, 189, 194, 202, 2$ vlan 162-163, 168, 189, 194, 202, 22         0, 222, 2
 << 163, 168, 189, 194, 202, 220, 222, 23         0, 232, 289, 194, 202, 220, 222, 230, 232, 24         2, 246
c29s1p.f1nw.critz(config-mst)# instance 1 vlan 256, 611-612, 654, 741, 99
 << 6, 9$ vlan 256, 611-612, 654, 741, 996, 99         9
c29s1p.f1nw.critz(config-mst)# instance 2 vlan 2002, 2007, 2011, 2020, 2022, $ vlan 2002, 2007, 20
 << 11, 2020, 2022, 2         024, 2031, 2007, 2011, 2020, 2022, 2024, 2031,          2035, 2011, 2020, 2022, 2024, 2031, 2035, 203         
 << 7, 2039-22022, 2024, 2031, 2035, 2037, 2039-20         40
c29s1p.f1nw.critz(config-mst)# instance 2 vlan 2050, 2060, 2063, 2070, 2080, $ vlan 2050, 2060
 << , 2063, 2070, 2080, 2         086, 2096, 2060, 2063, 2070, 2080, 2086, 2096,          2104, 2163, 2070, 2080, 2086, 2096, 2104, 211         
 << 0, 2126
c29s1p.f1nw.critz(config-mst)# instance 2 vlan 2136, 2140, 2152, 2160, 2162-2$ vlan 2136, 2140, 2152, 2160, 2162-21         63, 2168,, 2140,
 <<  2152, 2160, 2162-2163, 2168,          2189, 21952, 2160, 2162-2163, 2168, 2189, 2194         , 2202
c29s1p.f1nw.critz(config-mst)# instance 2 vlan 2220, 2222, 2232, 2242, 2246, 
 << $ vlan 2220, 2222, 2232, 2242, 2246, 2         611-2612,, 2222, 2232, 2242, 2246, 2611-2612,          2654, 299
 << 32, 2242, 2246, 2611-2612, 2654, 2999         
c29s1p.f1nw.critz(config-mst)# instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 10$ vlan 42, 51, 59, 64, 66, 69, 72, 108         , 113, 12
 << 51, 59, 64, 66, 69, 72, 108, 113, 128         , 144, 17, 66, 69, 72, 108, 113, 128, 144, 176         , 196
c29s1p.f1nw.critz(config-mst)# instance 3 vla
 << n 244, 248, 927
c29s1p.f1nw.critz(config-mst)# instance 4 vlan 2042, 2051, 2059, 2064, 2066, $ vlan 2042, 2051, 2059, 2064, 2066, 2         069, 2072, 2
 << 051, 2059, 2064, 2066, 2069, 2072,          2108, 2159, 2064, 2066, 2069, 2072, 2108, 211         3, 2128
c29s1p.f1nw.critz(config-mst)# instance 4 vlan 2144, 2176, 2196, 2244, 2248, 
 << $ vlan 2144, 2176, 2196, 2244, 2248, 2         927
c29s1p.f1nw.critz(config-mst)# instance 5 vlan 16, 48, 58, 88, 121, 131, 133-$ vlan 16, 48, 58, 88, 121, 13
 << 1, 133-1         34, 216, 48, 58, 88, 121, 131, 133-134, 216, 2         28
c29s1p.f1nw.critz(config-mst)# instance 6 vlan 2016, 2048, 2058, 2088, 2121, 
 << $ vlan 2016, 2048, 2058, 2088, 2121, 2         131, 2133, 2048, 2058, 2088, 2121, 2131, 2133-         2134, 22158, 2088, 2121, 2131, 213
 << 3-2134, 2216         , 2228
c29s1p.f1nw.critz(config-mst)# instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, $ vlan 9, 33-34, 38, 54, 56, 71, 75, 8         2, 84, 97
 << 3-34, 38, 54, 56, 71, 75, 82, 84, 97,          114, 11654, 56, 71, 75, 82, 84, 97, 114, 116,          124
c29s1p.f1nw.critz(config-mst)# instance 7 vlan 172, 186, 192, 204-
 << 208, 210, 2$ vlan 172, 186, 192, 204-208, 210, 24         0-241, 25186, 192, 204-208, 210, 240-241, 251         -252, 630
 << 204-208, 210, 240-241, 251-252, 630,          928
c29s1p.f1nw.critz(config-mst)# instance 8 vlan 2009, 2033-2034, 2038, 2054, 2$ vlan 2009, 2033-2034, 2038, 2054, 20         
 << 56, 2071,, 2033-2034, 2038, 2054, 2056, 2071,          2075, 2084, 2038, 2054, 2056, 2071, 2075, 2082         , 2084
c29s1p.f1nw.critz(con
 << fig-mst)# instance 8 vlan 2097, 2114, 2116, 2124, 2172, $ vlan 2097, 2114, 2116, 2124, 2172, 2         186, 2192, 2114, 2116, 2124, 2172, 2186, 2192,    
 <<       2204-22016, 2124, 2172, 2186, 2192, 2204-2208         , 2210
c29s1p.f1nw.critz(config-mst)# instance 8 vlan 2240-2241, 2251-2252, 2630, 29
 << $ vlan 2240-2241, 2251-2252, 2630, 292         8
c29s1p.f1nw.critz(config-mst)# instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62$ vlan 4-5, 12, 18-19, 32, 44, 57, 62,          68, 76, 
 << 12, 18-19, 32, 44, 57, 62, 68, 76, 9         8-99, 102, 32, 44, 57, 62, 68, 76, 98-99, 102,          112
c29s1p.f1nw.critz(config-mst)# instance 9 vlan
 <<  130, 132, 147-148, 158, 212, 2$ vlan 130, 132, 147-148, 158, 212, 22         6, 236, 5132, 147-148, 158, 212, 226, 236, 50         0, 505, 5
 << 148, 158, 212, 226, 236, 500, 505, 51         0-511
c29s1p.f1nw.critz(config-mst)# instance 9 vlan 522, 551-570, 603, 629, 633, 7$ vlan 522, 551-570, 603, 6
 << 29, 633, 74         2, 802, 9551-570, 603, 629, 633, 742, 802, 92         6, 929
c29s1p.f1nw.critz(config-mst)# instance 10 vlan 2004-2005, 2012, 2018-2019, 2
 << $0 vlan 2004-2005, 2012, 2018-2019, 20         32, 2044,4-2005, 2012, 2018-2019, 2032, 2044,          2057, 20612, 2018-2019, 2032,
 <<  2044, 2057, 2062         , 2068
c29s1p.f1nw.critz(config-mst)# instance 10 vlan 2076, 2098-2099, 2102, 2112, $0 vlan 2076, 2098-2099, 2102, 2112, 2         130, 2132
 << 6, 2098-2099, 2102, 2112, 2130, 2132,          2147-21499, 2102, 2112, 2130, 2132, 2147-2148         , 2158
c29s1p.f1nw.critz(config-mst)# instance 10 vlan 2212, 2236,
 <<  2500, 2505, 2510-$0 vlan 2212, 2236, 2500, 2505, 2510-2         511, 25222, 2236, 2500, 2505, 2510-2511, 2522,          2603, 26
 << 500, 2505, 2510-2511, 2522, 2603, 262         9, 2633
c29s1p.f1nw.critz(config-mst)# instance 10 vlan 2802, 2926, 2929
c29s1p.f1nw.critz(config-mst)# instance 11 vlan 8, 43, 52, 146, 156-157, 180,
 << $1 vlan 8, 43, 52, 146, 156-157, 180,          200, 218
c29s1p.f1nw.critz(config-mst)# instance 12 vlan 2008, 2043, 2052, 2146, 2156-$2 vlan 2008, 2043, 2052, 2146, 215
 << 6-2         157, 21808, 2043, 2052, 2146, 2156-2157, 2180,          2200, 22052, 2146, 2156-2157, 2180, 2200, 221         8
c29s1p.f1nw
 << .critz(config-mst)#
c29s1p.f1nw.critz(config-mst)#end
c29s1p.f1nw.critz#
 << 
*Jan  1 18:32:56: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.f1nw.critz#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.f1nw.critz(config)#
Expect: matched string 1: (config)#
 >> hostname c29s1p.f1nw.critz 

Expect: searching for 2 strs:  :# :>
 << hostname c29s1p.f1nw.critz 
c29s1p.f1nw.critz(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s1p.f1nw.critz#
 << 
*Jan  1 18:33:03: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.f1nw.critz#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.f1nw.critz(config)#
Expect: matched string 1: (config)#
 >> snmp-server contact 6F-1771

Expect: searching for 1 strs:  :#
 << snmp-server contact 6F-1771
c29s1p.f1nw.critz(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s1p.f1nw.critz#
 << 
*Jan  1 18:33:09: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.f1nw.critz#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.f1nw.critz(config)#
Expect: matched string 1: (config)#
 >> interface vlan 92

Expect: searching for 1 strs:  :(config-if)#
 << interface vlan 92
c29s1p.f1nw.critz(config-if)#
Expect: matched string 1: (config-if)#
 >> ip address 10.92.3.152 255.255.0.0

 >> ip broadcast-address 10.92.255.255

 >> end

Expect: searching for 1 strs:  :Configured
 << ip address 10.92.3.152 255.255.0.0
c29s1p.f1nw.critz(config-if)#ip broadcast-address 10.92.255.255
c29s1p.f1nw.critz(config-if)#end
c29s1p.f1nw.critz#
 << 
*Jan  1 18:33:15: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.f1nw.critz#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.f1nw.critz(config)#
Expect: matched string 1: (config)#
 >> interface Vlan92

Expect: searching for 1 strs:  :(config-if)#
 << interface Vlan92
c29s1p.f1nw.critz(config-if)#
Expect: matched string 1: (config-if)#
 >> ip default-gateway 10.92.0.1

 >> end

Expect: searching for 1 strs:  :Configured
 << ip default-gateway 10.92.0.1
c29s1p.f1nw.critz(config)#end
c29s1p.f1nw.critz#
*Jan  1 18:33:21: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.f1nw.critz#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.f1nw.critz(config)#
Expect: matched string 1: (config)#
 >> ip dhcp snooping

Expect: searching for 1 strs:  :#
 << ip dhcp snooping
c29s1p.f1nw.critz(config)#
Expect: matched string 1: #
 >> ip dhcp snooping vlan 252

Expect: searching for 1 strs:  :#
 << ip dhcp snooping vlan 252
c29s1p.f1nw.critz(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s1p.f1nw.critz#
 << 
*Jan  1 18:33:28: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.f1nw.critz#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.f1nw.critz(config)#
Expect: matched string 1: (config)#
 >> default interface range gi1/0/1 - 48 

 >> interface range gi1/0/1 - 48 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi1/0/1 - 48 

 << 
 << c29s1p.f1nw.critz(config)#interface range gi1/0/1 - 48 
c29s1p.f1nw.critz(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport access vlan 252

 >> switchport mode access

 >> spanning-tree portfast

 >> switchport port-security maximum 2

 >> switchport port-security

 >> switchport port-security aging time 15

 >> switchport port-security violation protect

 >> switchport port-security aging type inactivity

 >> power inline never

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport access vlan 252
c29s1p.f1nw.critz(config-if-range)#switchport mode access
c29s1p.f1nw.critz(config-if-range)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, concentrato
 << rs, switches, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast will be configured in 48 interfaces due to the range command 
 but will only have effect when the interfaces 
 << are in a non-trunking mode.
c29s1p.f1nw.critz(config-if-range)#switchport port-security maximum 2
c29s1p.f1nw.critz(config-if-range)#switchport port-security
c29s1p.f1nw.critz(config-if-range)#switchport port-security aging time 15
c29s1p.f1nw.critz(c
 << onfig-if-range)#switchport port-security violation protect
c29s1p.f1nw.critz(config-if-range)#switchport port-security aging type inacti$port-security aging type inactiv         ity
c29s1p.f1nw.critz(co
 << nfig-if-range)#power inline never
c29s1p.f1nw.critz(config-if-range)#end
c29s1p.f1nw.critz#
 << 
*Jan  1 18:33:39: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.f1nw.critz#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.f1nw.critz(config)#
Expect: matched string 1: (config)#
 >> default interface gi1/0/1 

 >> interface gi1/0/1 

Expect: searching for 1 strs:  :(config-if)#
 << default interface gi1/0/1 
Interface GigabitEthernet1/0/1 set to default configuration
c29s1p.f1nw.critz(config)#interface gi1/0/1 
c29s1p.f1nw.critz(config-if)#
Expect: matched string 1: (config-if)#
 >> switchport access vlan 97

 >> switchport mode access

 >> spanning-tree portfast

 >> power inline never

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport access vlan 97
c29s1p.f1nw.critz(config-if)#switchport mode access
c29s1p.f1nw.critz(config-if)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, concentrators, switches,
 <<  bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast has been configured on GigabitEthernet1/0/1 but will only
 have effect when the interface is in a non-trunking mode.
c29s
 << 1p.f1nw.critz(config-if)#power inline never
c29s1p.f1nw.critz(config-if)#end
c29s1p.f1nw.critz#
 << 
*Jan  1 18:33:46: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.f1nw.critz#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.f1nw.critz(config)#
Expect: matched string 1: (config)#
 >> default interface gi1/0/17 

 >> interface gi1/0/17 

Expect: searching for 1 strs:  :(config-if)#
 << default interface gi1/0/17 
Interface GigabitEthernet1/0/17 set to default configuration
c29s1p.f1nw.critz(config)#interface gi1/0/17 
c29s1p.f1nw.critz(config-if)#
Expect: matched string 1: (config-if)#
 >> switchport access vlan 672

 >> switchport mode access

 >> spanning-tree portfast

 >> switchport port-security maximum 2

 >> switchport port-security

 >> switchport port-security aging time 15

 >> switchport port-security violation protect

 >> switchport port-security aging type inactivity

 >> power inline never

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport access vlan 672
c29s1p.f1nw.critz(config-if)#switchport mode access
c29s1p.f1nw.critz(config-if)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, concentrators, switches
 << , bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast has been configured on GigabitEthernet1/0/17 but will only
 have effect when the interface is in a non-trunking mode.
c2
 << 9s1p.f1nw.critz(config-if)#switchport port-security maximum 2
c29s1p.f1nw.critz(config-if)#switchport port-security
c29s1p.f1nw.critz(config-if)#switchport port-security aging time 15
c29s1p.f1nw.critz(config-if)#switchport port-security violation prot
 << ect
c29s1p.f1nw.critz(config-if)#switchport port-security aging type inactivity
c29s1p.f1nw.critz(config-if)#power inline never
c29s1p.f1nw.critz(config-if)#end
c29s1p.f1nw.critz#
 << 
 << 
*Jan  1 18:33:53: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.f1nw.critz#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.f1nw.critz(config)#
Expect: matched string 1: (config)#
 >> default interface range gi1/0/3 - 13 

 >> interface range gi1/0/3 - 13 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi1/0/3 - 13 
c29s1p.f1nw.critz(config)#interface range gi1/0/3 - 13 
c29s1p.f1nw.critz(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport access vlan 252

 >> switchport mode access

 >> spanning-tree portfast

 >> switchport port-security maximum 2

 >> switchport port-security

 >> switchport port-security aging time 15

 >> switchport port-security violation protect

 >> switchport port-security aging type inactivity

 >> power inline consumption 15400

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport access vlan 252
c29s1p.f1nw.critz(config-if-range)#switchport mode access
c29s1p.f1nw.critz(config-if-range)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, concentrato
 << rs, switches, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast will be configured in 11 interfaces due to the range command 
 but will only have effect when the interfaces 
 << are in a non-trunking mode.
c29s1p.f1nw.critz(config-if-range)#switchport port-security maximum 2
c29s1p.f1nw.critz(config-if-range)#switchport port-security
c29s1p.f1nw.critz(config-if-range)#switchport port-security aging time 15
c29s1p.f1nw.critz(c
 << onfig-if-range)#switchport port-security violation protect
c29s1p.f1nw.critz(config-if-range)#switchport port-security aging type inacti$port-security aging type inactiv         ity
c29s1p.f1nw.critz(co
 << nfig-if-range)#power inline consumption 15400
%CAUTION: Interface Gi1/0/3: Misconfiguring the 'power inline
 consumption/allocation' command may cause damage to the switch and void
 your warranty. Take precaution not to oversubscribe the power supply.
 << 
 It is recommended to enable power policing if the switch supports it.
 Refer to documentation.

%CAUTION: Interface Gi1/0/4: Misconfiguring the 'power inline
 consumption/allocation' command may cause damage to the switch and void
 your warranty. T
 << ake precaution not to oversubscribe the power supply.
 It is recommended to enable power policing if the switch supports it.
 Refer to documentation.

%CAUTION: Interface Gi1/0/5: Misconfiguring the 'power inline
 consumption/allocation' command may 
 << cause damage to the switch and void
 your warranty. Take precaution not to oversubscribe the power supply.
 It is recommended to enable power policing if the switch supports it.
 Refer to documentation.

%CAUTION: Interface Gi1/0/6: Misconfiguring th
 << e 'power inline
 consumption/allocation' command may cause damage to the switch and void
 your warranty. Take precaution not to oversubscribe the power supply.
 It is recommended to enable power policing if the switch supports it.
 Refer to documentat
 << ion.

%CAUTION: Interface Gi1/0/7: Misconfiguring the 'power inline
 consumption/allocation' command may cause damage to the switch and void
 your warranty. Take precaution not to oversubscribe the power supply.
 It is recommended to enable power pol
 << icing if the switch supports it.
 Refer to documentation.

%CAUTION: Interface Gi1/0/8: Misconfiguring the 'power inline
 consumption/allocation' command may cause damage to the switch and void
 your warranty. Take precaution not to oversubscribe the
 <<  power supply.
 It is recommended to enable power policing if the switch supports it.
 Refer to documentation.

%CAUTION: Interface Gi1/0/9: Misconfiguring the 'power inline
 consumption/allocation' command may cause damage to the switch and void
 y
 << our warranty. Take precaution not to oversubscribe the power supply.
 It is recommended to enable power policing if the switch supports it.
 Refer to documentation.

%CAUTION: Interface Gi1/0/10: Misconfiguring the 'power inline
 consumption/allocati
 << on' command may cause damage to the switch and void
 your warranty. Take precaution not to oversubscribe the power supply.
 It is recommended to enable power policing if the switch supports it.
 Refer to documentation.

%CAUTION: Interface Gi1/0/11: 
 << Misconfiguring the 'power inline
 consumption/allocation' command may cause damage to the switch and void
 your warranty. Take precaution not to oversubscribe the power supply.
 It is recommended to enable power policing if the switch supports it.
 Re
 << fer to documentation.

%CAUTION: Interface Gi1/0/12: Misconfiguring the 'power inline
 consumption/allocation' command may cause damage to the switch and void
 your warranty. Take precaution not to oversubscribe the power supply.
 It is recommended t
 << o enable power policing if the switch supports it.
 Refer to documentation.

%CAUTION: Interface Gi1/0/13: Misconfiguring the 'power inline
 consumption/allocation' command may cause damage to the switch and void
 your warranty. Take precaution not t
 << o oversubscribe the power supply.
 It is recommended to enable power policing if the switch supports it.
 Refer to documentation.

c29s1p.f1nw.critz(config-if-range)#end
c29s1p.f1nw.critz#
 << 
*Jan  1 18:34:05: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.f1nw.critz#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.f1nw.critz(config)#
Expect: matched string 1: (config)#
 >> default interface range gi1/0/47 - 48 

 >> interface range gi1/0/47 - 48 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi1/0/47 - 48 
c29s1p.f1nw.critz(config)#interface range gi1/0/47 - 48 
c29s1p.f1nw.critz(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport trunk encapsulation dot1q

 >> switchport mode trunk

 >> switchport trunk native vlan 92

 >> ip dhcp snooping trust

 >> no keepalive

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport trunk encapsulation dot1q
                                                    ^
% Invalid input detected at '^' marker.

c29s1p.f1nw.critz(config-if-range)#switchport mode trunk
c29s1p.f1nw.critz(config-if-range)#switchport trunk native vl
 << an 92
c29s1p.f1nw.critz(config-if-range)#ip dhcp snooping trust
c29s1p.f1nw.critz(config-if-range)#no keepalive
c29s1p.f1nw.critz(config-if-range)#end
c29s1p.f1nw.critz#
*Jan  1 18:34:11: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.f1nw.critz#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.f1nw.critz(config)#
Expect: matched string 1: (config)#
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s1p.f1nw.critz#
 << 
*Jan  1 18:34:15: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.f1nw.critz#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.f1nw.critz(config)#
Expect: matched string 1: (config)#
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s1p.f1nw.critz#
 << 
*Jan  1 18:34:19: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1p.f1nw.critz#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1p.f1nw.critz(config)#
Expect: matched string 1: (config)#
 >> crypto key generate rsa

 >> no

 >> 2048

Expect: searching for 2 strs:  :OK :(config)#
 << crypto key generate rsa
% You already have RSA keys defined named c29s1p.f1nw.critz.mgmt.msstate.edu.
% Do you really want to replace them? [yes/no]: no
c29s1p.f1nw.critz(config)#2048
                          ^
% Invalid input detected at '^' marker
Expect: matched string 2: (config)#
 >> end

Expect: searching for 1 strs:  :Configured
 << .

c29s1p.f1nw.critz(config)#end
c29s1p.f1nw.critz#
 << 
*Jan  1 18:34:23: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> write mem

Expect: searching for 2 strs:  :# :>
 << 
c29s1p.f1nw.critz#write mem
Building configuration...

Expect: matched string 1: #
 >> 
Expect: searching for 2 strs:  :# :>
 << [OK]
c29s1p.f1nw.critz#
c29s1p.f1nw.critz#
c29s1p.f1nw.critz#
Expect: matched string 1: #
 >> sh run

Expect: searching for 2 strs:  :# :>
 << sh run
Building configuration...

 << 
Current configuration : 21473 bytes
!
! Last configuration change at 18:34:23 CST Sun Jan 1 2006
!
version 15.0
no service pad
service timestamps debug datetime localtime
service timestamps log datetime localtime
service password-encryption
!

 << hostname c29s1p.f1nw.critz
!
boot-start-marker
boot-end-marker
!
enable secret 5 $1$lhB1$.T4a9MMEa6eOSuxZEymdP.
enable password 7 0227165E0A5B036B5B
!
username root privilege 15 secret 5 $1$pK/9$oEBU3BmpuD9PRtWQTExey0
no aaa new-model
clock time
 << zone CST -6 0
clock summer-time CDT recurring
switch 1 provision ws-c2960s-48lpd-l
authentication mac-move permit
!
!
ip dhcp snooping vlan 252
ip dhcp snooping
ip domain-name mgmt.msstate.edu
ip name-server 130.18.80.12
!
!
crypto pki trustpo
 << int TP-self-signed-2494998912
 enrollment selfsigned
 subject-name cn=IOS-Self-Signed-Certificate-2494998912
 revocation-check none
 rsakeypair TP-self-signed-2494998912
!
!
crypto pki certificate chain TP-self-signed-2494998912
 certificate self-
 << signed 01
  	quit
!
spanning-tree mode mst
spanning-tree portfast bpduguard default
spanning-tree extend system-id
!
spanning-tree mst configuration
 name msstate
 revision 1
 instance 1 vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 63, 
 << 70
 instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 160
 instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 230, 232, 242, 246
 instance 1 vlan 256, 611-612, 654, 741, 996, 999
 instance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024,
 <<  2031, 2035, 2037, 2039-2040
 instance 2 vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096, 2104, 2110, 2126
 instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 2189, 2194, 2202
 instance 2 vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 2654, 2999
 i
 << nstance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176, 196
 instance 3 vlan 244, 248, 927
 instance 4 vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072, 2108, 2113, 2128
 instance 4 vlan 2144, 2176, 2196, 2244, 2248, 2927
 instance 5 vlan 16,
 <<  48, 58, 88, 121, 131, 133-134, 216, 228
 instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216, 2228
 instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116, 124
 instance 7 vlan 172, 186, 192, 204-208, 210, 240-241, 251-252,
 <<  630, 928
 instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082, 2084
 instance 8 vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208, 2210
 instance 8 vlan 2240-2241, 2251-2252, 2630, 2928
 instance 9 vlan 4-5, 12, 18-19, 32, 44, 
 << 57, 62, 68, 76, 98-99, 102, 112
 instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 500, 505, 510-511
 instance 9 vlan 522, 551-570, 603, 629, 633, 742, 802, 926, 929
 instance 10 vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 2057, 2062, 2068
 inst
 << ance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148, 2158
 instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522, 2603, 2629, 2633
 instance 10 vlan 2802, 2926, 2929
 instance 11 vlan 8, 43, 52, 146, 156-157, 180, 200, 218
 instance 12 
 << vlan 2008, 2043, 2052, 2146, 2156-2157, 2180, 2200, 2218
!
!
!
!
!
!
errdisable recovery cause udld
errdisable recovery cause bpduguard
errdisable recovery cause security-violation
errdisable recovery cause channel-misconfig (STP)
errdisable re
 << covery cause pagp-flap
errdisable recovery cause dtp-flap
errdisable recovery cause link-flap
errdisable recovery cause sfp-config-mismatch
errdisable recovery cause gbic-invalid
errdisable recovery cause psecure-violation
errdisable recovery cause 
 << port-mode-failure
errdisable recovery cause dhcp-rate-limit
errdisable recovery cause pppoe-ia-rate-limit
errdisable recovery cause mac-limit
errdisable recovery cause vmps
errdisable recovery cause storm-control
errdisable recovery cause inline-pow
 << er
errdisable recovery cause arp-inspection
errdisable recovery cause loopback
errdisable recovery cause small-frame
errdisable recovery cause psp
errdisable recovery interval 1800
!
!
!
!
vlan internal allocation policy ascending
!
!
! 
!

 << !
!
!
!
!
!
!
interface FastEthernet0
 no ip address
 shutdown
!
interface GigabitEthernet1/0/1
 switchport access vlan 97
 switchport mode access
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/2
 switchport a
 << ccess vlan 252
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline n
 << ever
 spanning-tree portfast
!
interface GigabitEthernet1/0/3
 switchport access vlan 252
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport 
 << port-security aging type inactivity
 switchport port-security
 power inline consumption 15400
 spanning-tree portfast
!
interface GigabitEthernet1/0/4
 switchport access vlan 252
 switchport mode access
 switchport port-security maximum 2
 switch
 << port port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline consumption 15400
 spanning-tree portfast
!
interface GigabitEthernet1/0/5
 switch
 << port access vlan 252
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power in
 << line consumption 15400
 spanning-tree portfast
!
interface GigabitEthernet1/0/6
 switchport access vlan 252
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging tim
 << e 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline consumption 15400
 spanning-tree portfast
!
interface GigabitEthernet1/0/7
 switchport access vlan 252
 switchport mode access
 switchport port-security 
 << maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline consumption 15400
 spanning-tree portfast
!
interface GigabitEthe
 << rnet1/0/8
 switchport access vlan 252
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-s
 << ecurity
 power inline consumption 15400
 spanning-tree portfast
!
interface GigabitEthernet1/0/9
 switchport access vlan 252
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-
 << security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline consumption 15400
 spanning-tree portfast
!
interface GigabitEthernet1/0/10
 switchport access vlan 252
 switchport mode access
 switch
 << port port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline consumption 15400
 spanning-tree portfast
!
in
 << terface GigabitEthernet1/0/11
 switchport access vlan 252
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 << 
 switchport port-security
 power inline consumption 15400
 spanning-tree portfast
!
interface GigabitEthernet1/0/12
 switchport access vlan 252
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation prote
 << ct
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline consumption 15400
 spanning-tree portfast
!
interface GigabitEthernet1/0/13
 switchport access vlan 252
 switchport
 <<  mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline consumption 15400
 spanning
 << -tree portfast
!
interface GigabitEthernet1/0/14
 switchport access vlan 252
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security 
 << aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/15
 switchport access vlan 252
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violat
 << ion protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/16
 switchport access vlan 252
 switchport mo
 << de access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
 << 
!
interface GigabitEthernet1/0/17
 switchport access vlan 672
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inac
 << tivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/18
 switchport access vlan 252
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 s
 << witchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/19
 switchport access vlan 252
 switchport mode access
 swi
 << tchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface G
 << igabitEthernet1/0/20
 switchport access vlan 252
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switch
 << port port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/21
 switchport access vlan 252
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-
 << security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/22
 switchport access vlan 252
 switchport mode access
 switchport port-se
 << curity maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1
 << /0/23
 switchport access vlan 252
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-secur
 << ity
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/24
 switchport access vlan 252
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging 
 << time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/25
 switchport access vlan 252
 switchport mode access
 switchport port-security maximum 
 << 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/26
 switchp
 << ort access vlan 252
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inl
 << ine never
 spanning-tree portfast
!
interface GigabitEthernet1/0/27
 switchport access vlan 252
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switc
 << hport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/28
 switchport access vlan 252
 switchport mode access
 switchport port-security maximum 2
 switchport 
 << port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/29
 switchport access vlan
 <<  252
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spa
 << nning-tree portfast
!
interface GigabitEthernet1/0/30
 switchport access vlan 252
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-secu
 << rity aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/31
 switchport access vlan 252
 switchport mode access
 switchport port-security maximum 2
 switchport port-security v
 << iolation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/32
 switchport access vlan 252
 switchpo
 << rt mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree port
 << fast
!
interface GigabitEthernet1/0/33
 switchport access vlan 252
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type
 <<  inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/34
 switchport access vlan 252
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protec
 << t
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/35
 switchport access vlan 252
 switchport mode access
 << 
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interf
 << ace GigabitEthernet1/0/36
 switchport access vlan 252
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 s
 << witchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/37
 switchport access vlan 252
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport 
 << port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/38
 switchport access vlan 252
 switchport mode access
 switchport po
 << rt-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthe
 << rnet1/0/39
 switchport access vlan 252
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-
 << security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/40
 switchport access vlan 252
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security a
 << ging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/41
 switchport access vlan 252
 switchport mode access
 switchport port-security max
 << imum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/42
 sw
 << itchport access vlan 252
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 powe
 << r inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/43
 switchport access vlan 252
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 
 << switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/44
 switchport access vlan 252
 switchport mode access
 switchport port-security maximum 2
 switch
 << port port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/45
 switchport access
 <<  vlan 252
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport por