trying to use serial port: /dev/ttyUSB0
 >> 
 >> 

Expect: searching for 4 strs:  :[yes/no] :Press RETURN to get started. :# :Switch>
 << 
Switch>
Switch>
Switch>
Switch>
Expect: matched string 4: Switch>
 >> term len 0

Expect: searching for 2 strs:  :# :>
 << term len 0

 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...
term len 0

...

 >> show version

Expect: searching for 2 strs:  :# :>
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

...

 >> enable

Expect: searching for 2 strs:  :Password: :#
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

...

 >> sh license udi

Expect: searching for 2 strs:  :# :>
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

...

 >> 

Expect: searching for 4 strs:  :[yes/no] :Press RETURN to get started. :# :Switch>
 << Switch>show version
Cisco IOS Software, C2960 Software (C2960-LANBASEK9-M), Version 12.2(55)SE10, RELEASE SOFTWARE (fc2)
Technical Support: http://www.cisco.com/techsupport
Copyright (c) 1986-2015 by Cisco Systems, Inc.
Compiled Wed 11-Feb-15 11:46 by
Expect: matched string 4: Switch>
 >> show version

Expect: searching for 2 strs:  :# :>
 <<  prod_rel_team
Image text-base: 0x00003000, data-base: 0x01900000

ROM: Bootstrap program is C2960 boot loader
BOOTLDR: C2960 Boot Loader (C2960-HBOOT-M) Version 12.2(53r)SEY3, RELEASE SOFTWARE (fc1)

Switch uptime is 2 minutes
System returned to R
 << OM by power-on
System image file is "flash:/c2960-lanbasek9-mz.122-55.SE10.bin"


This product contains cryptographic features and is subject to United
States and local country laws governing import, export, transfer and
use. Delivery of Cisco crypt
 << ographic products does not imply
third-party authority to import, export, distribute or use encryption.
Importers, exporters, distributors and users are responsible for
compliance with U.S. and local country laws. By using this product you
agree to co
 << mply with applicable laws and regulations. If you are unable
to comply with U.S. and local laws, return this product immediately.

A summary of U.S. laws governing Cisco cryptographic products may be found at:
http://www.cisco.com/wwl/export/crypto/to
 << ol/stqrg.html

If you require further assistance please contact us by sending email to
export@cisco.com.

cisco WS-C2960-24TC-L (PowerPC405) processor (revision Y0) with 65536K bytes of memory.
Processor board ID FOC1841S2DS
Last reset from power-o
 << n
1 Virtual Ethernet interface
24 FastEthernet interfaces
2 Gigabit Ethernet interfaces
The password-recovery mechanism is enabled.

64K bytes of flash-simulated non-volatile configuration memory.
Base ethernet MAC Address       : E0:D1:73:08:B6:80
 << 
Motherboard assembly number     : 73-12599-06
Power supply part number        : 341-0097-03
Motherboard serial number       : FOC1841397A
Power supply serial number      : DCA183781PX
Model revision number           : Y0
Motherboard revision number
 <<      : B0
Model number                    : WS-C2960-24TC-L
System serial number            : FOC1841S2DS
Top Assembly Part Number        : 800-32796-02
Top Assembly Revision Number    : B0
Version ID                      : V11
CLEI Code Number     
 <<            : COM3K00BRF
Hardware Board Revision Number  : 0x0A


Switch Ports Model              SW Version            SW Image                 
------ ----- -----              ----------            ----------               
*    1 26    WS-C2960-24
 << TC-L    12.2(55)SE10          C2960-LANBASEK9-M        


Configuration register is 0xF

Switch>enable
Switch#sh license udi
            ^
% Invalid input detected at '^' marker.

Switch#
Switch#
Switch#show version
Cisco IOS Software, C2960 
Expect: matched string 1: #
 >> enable

Expect: searching for 2 strs:  :Password: :#
 << Software (C2960-LANBASEK9-M), Version 12.2(55)SE10, RELEASE SOFTWARE (fc2)
Technical Support: http://www.cisco.com/techsupport
Copyright (c) 1986-2015 by Cisco Systems, Inc.
Compiled Wed 11-Feb-15 11:46 by prod_rel_team
Image text-base: 0x00003000, da
 << ta-base: 0x01900000

ROM: Bootstrap program is C2960 boot loader
BOOTLDR: C2960 Boot Loader (C2960-HBOOT-M) Version 12.2(53r)SEY3, RELEASE SOFTWARE (fc1)

Switch uptime is 3 minutes
System returned to ROM by power-on
System image file is "flash:/c2
 << 960-lanbasek9-mz.122-55.SE10.bin"


This product contains cryptographic features and is subject to United
States and local country laws governing import, export, transfer and
use. Delivery of Cisco cryptographic products does not imply
third-party a
 << uthority to import, export, distribute or use encryption.
Importers, exporters, distributors and users are responsible for
compliance with U.S. and local country laws. By using this product you
agree to comply with applicable laws and regulations. If y
 << ou are unable
to comply with U.S. and local laws, return this product immediately.

A summary of U.S. laws governing Cisco cryptographic products may be found at:
http://www.cisco.com/wwl/export/crypto/tool/stqrg.html

If you require further assista
 << nce please contact us by sending email to
export@cisco.com.

cisco WS-C2960-24TC-L (PowerPC405) processor (revision Y0) with 65536K bytes of memory.
Processor board ID FOC1841S2DS
Last reset from power-on
1 Virtual Ethernet interface
24 FastEtherne
 << t interfaces
2 Gigabit Ethernet interfaces
The password-recovery mechanism is enabled.

64K bytes of flash-simulated non-volatile configuration memory.
Base ethernet MAC Address       : E0:D1:73:08:B6:80
Motherboard assembly number     : 73-12599-06
 << 
Power supply part number        : 341-0097-03
Motherboard serial number       : FOC1841397A
Power supply serial number      : DCA183781PX
Model revision number           : Y0
Motherboard revision number     : B0
Model number                    : WS
 << -C2960-24TC-L
System serial number            : FOC1841S2DS
Top Assembly Part Number        : 800-32796-02
Top Assembly Revision Number    : B0
Version ID                      : V11
CLEI Code Number                : COM3K00BRF
Hardware Board Revisio
 << n Number  : 0x0A


Switch Ports Model              SW Version            SW Image                 
------ ----- -----              ----------            ----------               
*    1 26    WS-C2960-24TC-L    12.2(55)SE10          C2960-LANBASEK9-M
 <<         


Configuration register is 0xF

Switch#enable
Switch#
Expect: matched string 2: #
 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
Expect: matched string 1: (config)#
 >> no service pad

 >> service timestamps debug datetime localtime

 >> service timestamps log datetime localtime

 >> service password-encryption

 >> boot-start-marker

 >> boot-end-marker

 >> enable secret W2w1cD0mIliG!

 >> enable password W2w1cD0mIliG!

 >> username root privilege 15 secret W2w1cD0mIliG!

 >> no aaa new-model

 >> clock timezone CST -6 0

 >> clock summer-time CDT recurring

 >> authentication mac-move permit

 >> ip domain-name mgmt.msstate.edu

 >> ip name-server 130.18.80.12

 >> vtp domain vtp01.mgmt.msstate.edu

 >> vtp mode client

 >> crypto pki trustpoint TP-self-signed-2494998912

 >>  enrollment selfsigned

 >>  subject-name cn=IOS-Self-Signed-Certificate-2494998912

 >>  revocation-check none

 >>  rsakeypair TP-self-signed-2494998912

 >> crypto pki certificate chain TP-self-signed-2494998912

 >>  certificate self-signed 01 nvram:IOS-Self-Sig#3232.cer

 >> spanning-tree portfast bpduguard default

 >> spanning-tree extend system-id

 >> vlan internal allocation policy ascending

 >> errdisable recovery cause all

 >> errdisable recovery interval 1800

 >> interface Vlan1

 >>  no ip address

 >>  no ip route-cache

 >>  shutdown

 >> interface Vlan92

 >> ip http server

 >> ip http secure-server

 >> logging facility local1

 >> logging host 130.18.8.12

 >> access-list 1 permit 10.92.0.0 0.0.255.255

 >> access-list 1 permit 130.18.8.0 0.0.0.255

 >> access-list 1 permit 10.93.0.0 0.0.255.255

 >> access-list 1 permit 130.18.1.0 0.0.0.255

 >> snmp-server community sysnet RO 1

 >> snmp-server community c2-b2=a2 RW 1

 >> snmp-server enable traps snmp authentication linkdown linkup coldstart warmstart

 >> snmp-server enable traps transceiver all

 >> snmp-server enable traps tty

 >> snmp-server enable traps cluster

 >> snmp-server enable traps config-copy

 >> snmp-server enable traps config

 >> snmp-server enable traps config-ctid

 >> snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-auth-fail-vlan no-guest-vlan

 >> snmp-server enable traps entity

 >> snmp-server enable traps power-ethernet police

 >> snmp-server enable traps cpu threshold

 >> snmp-server enable traps rep

 >> snmp-server enable traps bridge newroot topologychange

 >> snmp-server enable traps stpx inconsistency root-inconsistency loop-inconsistency

 >> snmp-server enable traps syslog

 >> snmp-server enable traps vtp

 >> snmp-server enable traps vlancreate

 >> snmp-server enable traps vlandelete

 >> snmp-server enable traps flash insertion removal

 >> snmp-server enable traps port-security

 >> snmp-server enable traps envmon fan shutdown supply temperature status

 >> snmp-server enable traps errdisable

 >> snmp-server enable traps mac-notification change move threshold

 >> snmp-server enable traps vlan-membership

 >> snmp-server host 130.18.8.12 

 >> line con 0

 >> line vty 0 15

 >>  access-class 1 in

 >>  password W2w1cD0mIliG!

 >>  login local

 >>  transport input ssh

 >> ntp server 10.92.0.5

 >> 

 >> end

Expect: searching for 1 strs:  :Configured
 << no service pad
Switch(config)#service timestamps debug datetime localtime
Switch(config)#service timestamps log datetime localtime
Switch(config)#service password-encryption
Switch(config)#boot-start-marker
Switch(config)#boot-end-marker
Switch(conf
 << ig)#enable secret W2w1cD0mIliG!
Switch(config)#enable password W2w1cD0mIliG!
The enable password you have chosen is the same as your enable secret.
This is not recommended.  Re-enter the enable password.

Switch(config)#username root privilege 15 sec
 << ret W2w1cD0mIliG!
Switch(config)#no aaa new-model
Switch(config)#clock timezone CST -6 0
Switch(config)#clock summer-time CDT recurring
Switch(config)#authentication mac-move permit
Switch(config)#ip domain-name mgmt.msstate.edu
Switch(config)#ip na
 << me-server 130.18.80.12
Switch(config)#vtp domain vtp01.mgmt.msstate.edu
Domain name already set to vtp01.mgmt.msstate.edu.
Switch(config)#
*Feb 28 18:04:28: %SYS-6-CLOCKUPDATE: System clock has been updated from 00:04:28 UTC Mon Mar 1 1993 to 18:04:28
 <<  CST Sun Feb 28 1993, configured from console by console.
*Feb 28 18:04:28: %SYS-6-CLOCKUPDATE: System clock has been updated from 18:04:28 CST Sun Feb 28 1993 to 18:04:28 CST Sun Feb 28 1993, configured from console by console.vtp mode client
Device mo
 << de already VTP Client for VLANS.
Switch(config)#crypto pki trustpoint TP-self-signed-2494998912
Switch(ca-trustpoint)# enrollment selfsigned
Switch(ca-trustpoint)# subject-name cn=IOS-Self-Signed-Certificate-2494998912
Switch(ca-trustpoint)# revocatio
 << n-check none
Switch(ca-trustpoint)# rsakeypair TP-self-signed-2494998912
Switch(ca-trustpoint)#crypto pki certificate chain TP-self-signed-2494998912
Switch(config-cert-chain)# certificate self-signed 01 nvram:IOS-Self-Sig#3232
 << $e self-signed 01 nvram:IOS-Self-Sig#3232.         cer
Switch(config-cert-chain)#spanning-tree portfast bpduguard default
Switch(config)#spanning-tree extend system-id
Switch(config)#vlan internal allocation policy as
 << cending
Switch(config)#errdisable recovery cause all
Switch(config)#errdisable recovery interval 1800
Switch(config)#interface Vlan1
Switch(config-if)# no ip address
Switch(config-if)# no ip route-cache
Switch(config-if)# shutdown
Switch(config-if)
 << #interface Vlan92
Switch(config-if)#ip http server
Switch(config)#ip http secure-server
% Generating 1024 bit RSA keys, keys will be non-exportable...
*Feb 28 18:04:33: %LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan92, changed state to down[OK]
 << 

*Feb 28 18:04:39: %SSH-5-ENABLED: SSH 1.99 has been enabled
Switch(config)#logging facility local1
Switch(config)#logging host 130.18.8.12
Switch(config)#access-list 1 permit 10.92.0.0 0.0.255.255
Switch(config)#access-list 1 permit 130.18.8.0 0.0.
 << 0.255
Switch(config)#access-list 1 permit 10.93.0.0 0.0.255.255
Switch(config)#access-list 1 permit 130.18.1.0 0.0.0.255
Switch(config)#snmp-server community sysnet RO 1
Switch(config)#snmp-server community c2-b2=a2 RW 1
Switch(config)#snmp-server en
 << able traps snmp authentication linkdown linkup c$ enable traps snmp authentication linkdown linkup co         ldstart waps 
 << snmp authentication linkdown linkup coldstart wa         rmstart
Switch(config)#snmp-server enable traps transceiver all
Switch(config)#snmp-server enable traps tty
Switch(config)#snmp-server enable traps cluster
Switch(config)#snmp-server en
 << able traps config-copy
Switch(config)#snmp-server enable traps config
Switch(config)#snmp-server enable traps config-ctid
Switch(config)#snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-au
 << $ enable traps dot1x auth-fail-vlan guest-vlan no-aut         h-fail-vlaps dot1x auth-fail-vlan guest-vlan no-auth-fail-vla         n no-gues
 << 
*Feb 28 18:04:42: %PKI-4-NOAUTOSAVE: Configuration was modified.  Issue "write memory" to save new certificateuth-fail-vlan guest-vlan no-auth-fail-vlan no-guest         -vlan
Switch(config)#snmp-server enable
 <<  traps entity
Switch(config)#snmp-server enable traps power-ethernet police
Switch(config)#snmp-server enable traps cpu threshold
Switch(config)#snmp-server enable traps rep
Switch(config)#snmp-server enable traps bridge newroot topologychange
Switch
 << (config)#snmp-server enable traps stpx inconsistency root-inconsistency$ enable traps stpx inconsistency root-inconsistency          loop-inco
 << aps stpx inconsistency root-inconsistency loop-incon         sistency
Switch(config)#snmp-server enable traps syslog
Switch(config)#snmp-server enable traps vtp
Switch(config)#snmp-server enable traps vlancreate
Switch(conf
 << ig)#snmp-server enable traps vlandelete
Switch(config)#snmp-server enable traps flash insertion removal
Switch(config)#snmp-server enable traps port-security
Switch(config)#snmp-server enable traps envmon fan shutdown supply temperatur
*F
 << eb 28 18:04:43: %SYS-6-LOGGINGHOST_STARTSTOP: Logging to host 130.18.8.12 Port$ enable traps envmon fan shutdown supply temperature          status
Switch(config)#snmp-server enable traps errdisab
 << le
Switch(config)#snmp-server enable traps mac-notification change move threshol$ enable traps mac-notification change move threshold         
Switch(config)#snmp-server enable traps
 <<  vlan-membership
Switch(config)#snmp-server host 130.18.8.12 
% Incomplete command.

Switch(config)#line con 0
Switch(config-line)#line vty 0 15
Switch(config-line)# access-class 1 in
Switch(config-line)# passwor 514 started - CLI initiatedd W2w1cD
 << 0mIliG!
Switch(config-line)# login local
Switch(config-line)# transport input ssh
Switch(config-line)#ntp server 10.92.0.5
Switch(config)#
Switch(config)#end
Switch#
 << 
*Feb 28 18:04:46: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
Switch#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
Expect: matched string 1: (config)#
 >> spanning-tree mode pvst

 >> no spanning-tree vlan 2-91,93-523,525-927,929-1000

 >> spanning-tree vlan 1-1000 priority 57344

 >> end

Expect: searching for 1 strs:  :Configured
 << spanning-tree mode pvst
Switch(config)#no spanning-tree vlan 2-91,93-523,525-927,929-1000
Switch(config)#spanning-tree vlan 1-1000 priority 57344
Switch(config)#end
Switch#
 << 
*Feb 28 18:04:52: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
Switch#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
Expect: matched string 1: (config)#
 >> hostname c29s1.baseball.construction 

Expect: searching for 2 strs:  :# :>
 << hostname c29s1.baseball.construction 
c29s1.baseball.const(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s1.baseball.construction#
 << 
*Feb 28 18:04:59: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1.baseball.construction#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1.baseball.const(config)#
Expect: matched string 1: (config)#
 >> snmp-server contact 6F-0925

Expect: searching for 1 strs:  :#
 << snmp-server contact 6F-0925
c29s1.baseball.const(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s1.baseball.construction#
 << 
*Feb 28 18:05:05: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1.baseball.construction#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1.baseball.const(config)#
Expect: matched string 1: (config)#
 >> interface vlan 92

Expect: searching for 1 strs:  :(config-if)#
 << interface vlan 92
c29s1.baseball.const(config-if)#
Expect: matched string 1: (config-if)#
 >> ip address 10.92.4.159 255.255.0.0

 >> ip broadcast-address 10.92.255.255

 >> end

Expect: searching for 1 strs:  :Configured
 << ip address 10.92.4.159 255.255.0.0
c29s1.baseball.const(config-if)#ip broadcast-address 10.92.255.255
c29s1.baseball.const(config-if)#end
c29s1.baseball.construction#
 << 
*Feb 28 18:05:11: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1.baseball.construction#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1.baseball.const(config)#
Expect: matched string 1: (config)#
 >> interface Vlan92

Expect: searching for 1 strs:  :(config-if)#
 << interface Vlan92
c29s1.baseball.const(config-if)#
Expect: matched string 1: (config-if)#
 >> ip default-gateway 10.92.0.1

 >> end

Expect: searching for 1 strs:  :Configured
 << ip default-gateway 10.92.0.1
c29s1.baseball.const(config)#end
c29s1.baseball.construction#
*Feb 28 18:05:17: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1.baseball.construction#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1.baseball.const(config)#
Expect: matched string 1: (config)#
 >> default interface range fa0/1 - 24 

 >> interface range fa0/1 - 24 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range fa0/1 - 24 

 << 
 << 
 << 
 << c29s1.baseball.const(config)#interface range fa0/1 - 24 
c29s1.baseball.const(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport access vlan 928

 >> switchport mode access

 >> spanning-tree portfast

 >> power inline never

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport access vlan 928
c29s1.baseball.const(config-if-range)#switchport mode access
c29s1.baseball.const(config-if-range)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, conce
 << ntrators, switches, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast will be configured in 24 interfaces due to the range command 
 but will only have effect when the inter
 << faces are in a non-trunking mode.
c29s1.baseball.const(config-if-range)#power inline never
                                       ^
% Invalid input detected at '^' marker.

c29s1.baseball.const(config-if-range)#end
c29s1.baseball.construction#
 << 
*Feb 28 18:05:29: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1.baseball.construction#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1.baseball.const(config)#
Expect: matched string 1: (config)#
 >> default interface fa0/1 

 >> interface fa0/1 

Expect: searching for 1 strs:  :(config-if)#
 << default interface fa0/1 
Interface FastEthernet0/1 set to default configuration
c29s1.baseball.const(config)#interface fa0/1 
c29s1.baseball.const(config-if)#
Expect: matched string 1: (config-if)#
 >> switchport access vlan 564

 >> switchport mode access

 >> spanning-tree portfast

 >> power inline never

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport access vlan 564
c29s1.baseball.const(config-if)#switchport mode access
c29s1.baseball.const(config-if)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, concentrators, sw
 << itches, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast has been configured on FastEthernet0/1 but will only
 have effect when the interface is in a non-trunking mode.
c2
 << 9s1.baseball.const(config-if)#power inline never
                                 ^
% Invalid input detected at '^' marker.

c29s1.baseball.const(config-if)#end
c29s1.baseball.construction#
 << 
*Feb 28 18:05:36: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1.baseball.construction#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1.baseball.const(config)#
Expect: matched string 1: (config)#
 >> default interface fa0/24 

 >> interface fa0/24 

Expect: searching for 1 strs:  :(config-if)#
 << default interface fa0/24 
Interface FastEthernet0/24 set to default configuration
c29s1.baseball.const(config)#interface fa0/24 
c29s1.baseball.const(config-if)#
Expect: matched string 1: (config-if)#
 >> switchport mode trunk

 >> switchport trunk native vlan 92

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport mode trunk
c29s1.baseball.const(config-if)#switchport trunk native vlan 92
c29s1.baseball.const(config-if)#end
c29s1.baseball.construction#
 << 
*Feb 28 18:05:41: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1.baseball.construction#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1.baseball.const(config)#
Expect: matched string 1: (config)#
 >> default interface range gi0/1 - 2 

 >> interface range gi0/1 - 2 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi0/1 - 2 
c29s1.baseball.const(config)#interface range gi0/1 - 2 
c29s1.baseball.const(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport mode trunk

 >> switchport trunk native vlan 92

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport mode trunk
c29s1.baseball.const(config-if-range)#switchport trunk native vlan 92
c29s1.baseball.const(config-if-range)#end
c29s1.baseball.construction#
 << 
*Feb 28 18:05:47: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1.baseball.construction#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1.baseball.const(config)#
Expect: matched string 1: (config)#
 >> crypto key generate rsa

 >> no

 >> 2048

Expect: searching for 2 strs:  :OK :(config)#
 << crypto key generate rsa
The name for the keys will be: c29s1.baseball.construction.mgmt.msstate.edu
Choose the size of the key modulus in the range of 360 to 2048 for your
  General Purpose Keys. Choosing a key modulus greater than 512 may take
  a fe
 << w minutes.

How many bits in the modulus [512]: no
% A decimal number between 360 and 2048.
How many bits in the modulus [512]: 2048
% Generating 2048 bit RSA keys, keys will be non-exportable...
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...
crypto key generate rsa
The name for the keys will be: c29s1.baseball.construction.mgmt.msstate.edu
Choose the size of the key modulus in the range of 360 to 2048 for your
  General Purpose Keys. Choosing a key modulus greater than 512 may take
  a few minutes.

How many bits in the modulus [512]: no
% A decimal number between 360 and 2048.
How many bits in the modulus [512]: 2048
% Generating 2048 bit RSA keys, keys will be non-exportable...
...

 >> end

Expect: searching for 1 strs:  :Configured
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

...

 >> 

 >> write mem

Expect: searching for 2 strs:  :# :>
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

...

 >> 
Expect: searching for 2 strs:  :# :>
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

...

 >> sh run

Expect: searching for 2 strs:  :# :>
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << [OK]

c29s1.baseball.const(config)#end
c29s1.baseball.construction#
c29s1.baseball.construction#write mem
Building configuration...
[OK]
c29s1.baseball.construction#
c29s1.baseball.construction#
c29s1.baseball.construction#sh run
Building config
Expect: matched string 1: #
