trying to use serial port: /dev/ttyUSB0
 >> 
 >> 

Expect: searching for 4 strs:  :[yes/no] :Press RETURN to get started. :# :Switch>
 << 
c29s2.pressbox.dudynoble#
c29s2.pressbox.dudynoble#
c29s2.pressbox.dudynoble#
c29s2.pressbox.dudynoble#
Expect: matched string 3: #
 >> term len 0

Expect: searching for 2 strs:  :# :>
 << term len 0
c29s2.pressbox.dudynoble#
Expect: matched string 1: #
 >> show version

Expect: searching for 2 strs:  :# :>
 << show version
Cisco IOS Software, C2960X Software (C2960X-UNIVERSALK9-M), Version 15.2(2)E7, RELEASE SOFTWARE (fc3)
Technical Support: http://www.cisco.com/techsupport
Copyright (c) 1986-2017 by Cisco Systems, Inc.
Compiled Wed 12-Jul-17 13:06 by prod_
 << rel_team

ROM: Bootstrap program is C2960X boot loader
BOOTLDR: C2960X Boot Loader (C2960X-HBOOT-M) Version 15.2(3r)E1, RELEASE SOFTWARE (fc1)

c29s2.pressbox.dudynoble uptime is 1 hour, 1 minute
System returned to ROM by power-on
System restarted 
 << at 08:34:32 CST Mon Feb 26 2018
System image file is "flash:/c2960x-universalk9-mz.152-2.E7/c2960x-universalk9-mz.152-2.E7.bin"
Last reload reason: power-on



This product contains cryptographic features and is subject to United
States and local c
 << ountry laws governing import, export, transfer and
use. Delivery of Cisco cryptographic products does not imply
third-party authority to import, export, distribute or use encryption.
Importers, exporters, distributors and users are responsible for
com
 << pliance with U.S. and local country laws. By using this product you
agree to comply with applicable laws and regulations. If you are unable
to comply with U.S. and local laws, return this product immediately.

A summary of U.S. laws governing Cisco cr
 << yptographic products may be found at:
http://www.cisco.com/wwl/export/crypto/tool/stqrg.html

If you require further assistance please contact us by sending email to
export@cisco.com.

cisco WS-C2960X-24TS-L (APM86XXX) processor (revision S0) with 5
 << 24288K bytes of memory.
Processor board ID FCW2143B0S5
Last reset from power-on
2 Virtual Ethernet interfaces
1 FastEthernet interface
28 Gigabit Ethernet interfaces
The password-recovery mechanism is enabled.

512K bytes of flash-simulated non-vo
 << latile configuration memory.
Base ethernet MAC Address       : 00:27:90:F4:7C:80
Motherboard assembly number     : 73-16695-05
Power supply part number        : 341-0529-02
Motherboard serial number       : FOC214200RY
Power supply serial number     
 <<  : DCB213452XA
Model revision number           : S0
Motherboard revision number     : C0
Model number                    : WS-C2960X-24TS-L
Daughterboard assembly number   : 73-14200-03
Daughterboard serial number     : FOC213933WB
System serial num
 << ber            : FCW2143B0S5
Top Assembly Part Number        : 68-100473-02
Top Assembly Revision Number    : F0
Version ID                      : V05
CLEI Code Number                : CMMMU00ARD
Daughterboard revision number   : B0
Hardware Board R
 << evision Number  : 0x19


Switch Ports Model                     SW Version            SW Image                 
------ ----- -----                     ----------            ----------               
*    1 28    WS-C2960X-24TS-L          15.2(2)E7   
 <<           C2960X-UNIVERSALK9-M     


Configuration register is 0xF

c29s2.pressbox.dudynoble#
Expect: matched string 1: #
 >> enable

Expect: searching for 2 strs:  :Password: :#
 << enable
c29s2.pressbox.dudynoble#
Expect: matched string 2: #
 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s2.pressbox.dudyn(config)#
Expect: matched string 1: (config)#
 >> default interface 24 

 >> end

Expect: searching for 1 strs:  :Configured
 << default interface 24 
                                               ^
% Invalid input detected at '^' marker.

c29s2.pressbox.dudyn(config)#end
c29s2.pressbox.dudynoble#
 << 
Feb 26 09:36:14: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s2.pressbox.dudynoble#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s2.pressbox.dudyn(config)#
Expect: matched string 1: (config)#
 >> default interface gi1/0/24 

 >> interface gi1/0/24 

Expect: searching for 1 strs:  :(config-if)#
 << default interface gi1/0/24 
Interface GigabitEthernet1/0/24 set to default configuration
c29s2.pressbox.dudyn(config)#interface gi1/0/24 
c29s2.pressbox.dudyn(config-if)#
Expect: matched string 1: (config-if)#
 >> switchport mode trunk

 >> switchport trunk native vlan 92

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport mode trunk
c29s2.pressbox.dudyn(config-if)#switchport trunk native vlan 92
c29s2.pressbox.dudyn(config-if)#end
c29s2.pressbox.dudynoble#
 << 
Feb 26 09:36:20: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> write mem

Expect: searching for 2 strs:  :# :>
 << 
c29s2.pressbox.dudynoble#write mem
Building configuration...
[OK]
c29s2.pressbox.dudynoble#
Expect: matched string 1: #
