trying to use serial port: /dev/ttyUSB0
 >> 
 >> 

Expect: searching for 4 strs:  :[yes/no] :Press RETURN to get started. :# :Switch>
 << 
c29s3.vni.flowood#
c29s3.vni.flowood#
c29s3.vni.flowood#
c29s3.vni.flowood#
Expect: matched string 3: #
 >> term len 0

Expect: searching for 2 strs:  :# :>
 << term len 0
c29s3.vni.flowood#
Expect: matched string 1: #
 >> show version

Expect: searching for 2 strs:  :# :>
 << show version
Cisco IOS Software, C2960X Software (C2960X-UNIVERSALK9-M), Version 15.2(2)E6, RELEASE SOFTWARE (fc1)
Technical Support: http://www.cisco.com/techsupport
Copyright (c) 1986-2016 by Cisco Systems, Inc.
Compiled Fri 16-Dec-16 21:27 by prod_
 << rel_team

ROM: Bootstrap program is C2960X boot loader
BOOTLDR: C2960X Boot Loader (C2960X-HBOOT-M) Version 15.2(3r)E1, RELEASE SOFTWARE (fc1)

c29s3.vni.flowood uptime is 4 days, 1 hour, 8 minutes
System returned to ROM by power-on
System restarte
 << d at 08:57:48 CST Fri Mar 9 2018
System image file is "flash:/c2960x-universalk9-mz.152-2.E6/c2960x-universalk9-mz.152-2.E6.bin"
Last reload reason: power-on



This product contains cryptographic features and is subject to United
States and local 
 << country laws governing import, export, transfer and
use. Delivery of Cisco cryptographic products does not imply
third-party authority to import, export, distribute or use encryption.
Importers, exporters, distributors and users are responsible for
co
 << mpliance with U.S. and local country laws. By using this product you
agree to comply with applicable laws and regulations. If you are unable
to comply with U.S. and local laws, return this product immediately.

A summary of U.S. laws governing Cisco c
 << ryptographic products may be found at:
http://www.cisco.com/wwl/export/crypto/tool/stqrg.html

If you require further assistance please contact us by sending email to
export@cisco.com.

cisco WS-C2960X-48TS-L (APM86XXX) processor (revision R0) with 
 << 524288K bytes of memory.
Processor board ID FCW2129A4Y8
Last reset from power-on
2 Virtual Ethernet interfaces
1 FastEthernet interface
52 Gigabit Ethernet interfaces
The password-recovery mechanism is enabled.

512K bytes of flash-simulated non-v
 << olatile configuration memory.
Base ethernet MAC Address       : 50:F7:22:C7:17:80
Motherboard assembly number     : 73-16693-05
Power supply part number        : 341-0537-02
Motherboard serial number       : FOC21292PX9
Power supply serial number    
 <<   : LIT21224XLQ
Model revision number           : R0
Motherboard revision number     : B0
Model number                    : WS-C2960X-48TS-L
Daughterboard assembly number   : 73-14200-03
Daughterboard serial number     : FOC21284DF4
System serial nu
 << mber            : FCW2129A4Y8
Top Assembly Part Number        : 68-100471-02
Top Assembly Revision Number    : E0
Version ID                      : V05
CLEI Code Number                : CMMNF00ARD
Daughterboard revision number   : B0
Hardware Board 
 << Revision Number  : 0x19


Switch Ports Model                     SW Version            SW Image                 
------ ----- -----                     ----------            ----------               
*    1 52    WS-C2960X-48TS-L          15.2(2)E6  
 <<            C2960X-UNIVERSALK9-M     


Configuration register is 0xF

c29s3.vni.flowood#
Expect: matched string 1: #
 >> enable

Expect: searching for 2 strs:  :Password: :#
 << enable
c29s3.vni.flowood#
Expect: matched string 2: #
 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s3.vni.flowood(config)#
Expect: matched string 1: (config)#
 >> default interface 48 

 >> end

Expect: searching for 1 strs:  :Configured
 << default interface 48 
                                            ^
% Invalid input detected at '^' marker.

c29s3.vni.flowood(config)#end
c29s3.vni.flowood#
 << 
Mar 13 11:06:53: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s3.vni.flowood#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s3.vni.flowood(config)#
Expect: matched string 1: (config)#
 >> default interface gi1/0/48 

 >> interface gi1/0/48 

Expect: searching for 1 strs:  :(config-if)#
 << default interface gi1/0/48 
Interface GigabitEthernet1/0/48 set to default configuration
c29s3.vni.flowood(config)#interface gi1/0/48 
c29s3.vni.flowood(config-if)#
Expect: matched string 1: (config-if)#
 >> switchport mode trunk

 >> switchport trunk native vlan 92

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport mode trunk
c29s3.vni.flowood(config-if)#switchport trunk native vlan 92
c29s3.vni.flowood(config-if)#end
c29s3.vni.flowood#
 << 
Mar 13 11:06:58: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> write mem

Expect: searching for 2 strs:  :# :>
 << 
c29s3.vni.flowood#write mem
Building configuration...
[OK]
c29s3.vni.flowood#
Expect: matched string 1: #
