trying to use serial port: /dev/ttyUSB0
 >> 
 >> 

Expect: searching for 4 strs:  :[yes/no] :Press RETURN to get started. :# :Switch>
 << 
c29s5.ra232a.ruby>
c29s5.ra232a.ruby>
c29s5.ra232a.ruby>
c29s5.ra232a.ruby>
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

c29s5.ra232a.ruby>
c29s5.ra232a.ruby>
c29s5.ra232a.ruby>
c29s5.ra232a.ruby>
...

 >> 

Expect: searching for 2 strs:  :# :>
 << 
c29s5.ra232a.ruby>
c29s5.ra232a.ruby>
Expect: matched string 2: >
 >> term len 0

Expect: searching for 2 strs:  :# :>
 << term len 0
c29s5.ra232a.ruby>
Expect: matched string 2: >
 >> show version

Expect: searching for 2 strs:  :# :>
 << show version
Cisco IOS Software, C2960S Software (C2960S-UNIVERSALK9-M), Version 15.0(2)SE8, RELEASE SOFTWARE (fc1)
Technical Support: http://www.cisco.com/techsupport
Copyright (c) 1986-2015 by Cisco Systems, Inc.
Compiled Wed 13-May-15 23:10 by prod
 << _rel_team

ROM: Bootstrap program is C2960S board boot loader
BOOTLDR: C2960S Boot Loader (C2960S-HBOOT-M) Version 12.2(55r)SE, RELEASE SOFTWARE (fc1)

c29s5.ra232a.ruby uptime is 3 hours, 35 minutes
System returned to ROM by power-on
System image 
 << file is "flash:/c2960s-universalk9-mz.150-2.SE8.bin"


This product contains cryptographic features and is subject to United
States and local country laws governing import, export, transfer and
use. Delivery of Cisco cryptographic products does not i
 << mply
third-party authority to import, export, distribute or use encryption.
Importers, exporters, distributors and users are responsible for
compliance with U.S. and local country laws. By using this product you
agree to comply with applicable laws an
 << d regulations. If you are unable
to comply with U.S. and local laws, return this product immediately.

A summary of U.S. laws governing Cisco cryptographic products may be found at:
http://www.cisco.com/wwl/export/crypto/tool/stqrg.html

If you requ
 << ire further assistance please contact us by sending email to
export@cisco.com.

cisco WS-C2960S-24TS-L (PowerPC) processor (revision E0) with 131072K bytes of memory.
Processor board ID FOC1614Z1RT
Last reset from power-on
2 Virtual Ethernet interfa
 << ces
1 FastEthernet interface
28 Gigabit Ethernet interfaces
The password-recovery mechanism is enabled.

512K bytes of flash-simulated non-volatile configuration memory.
Base ethernet MAC Address       : F4:EA:67:A0:69:00
Motherboard assembly numbe
 << r     : 73-11910-08
Power supply part number        : 341-0328-02
Motherboard serial number       : FOC16131NJ9
Power supply serial number      : LIT16060S3U
Model revision number           : E0
Motherboard revision number     : A0
Model number     
 <<                : WS-C2960S-24TS-L
Daughterboard assembly number   : 73-11933-04
Daughterboard serial number     : FOC161343UU
System serial number            : FOC1614Z1RT
Top Assembly Part Number        : 800-30954-03
Top Assembly Revision Number   
 <<  : A0
Version ID                      : V03
CLEI Code Number                : COMGG00ARC
Daughterboard revision number   : A0
Hardware Board Revision Number  : 0x01


Switch Ports Model              SW Version            SW Image                 

 << ------ ----- -----              ----------            ----------               
*    1 28    WS-C2960S-24TS-L   15.0(2)SE8            C2960S-UNIVERSALK9-M     


Configuration register is 0xF

c29s5.ra232a.ruby>
Expect: matched string 2: >
 >> enable

Expect: searching for 2 strs:  :Password: :#
 << enable
Password: 
Expect: matched string 1: Password:
 >> W2w1cD0mIliG!

Expect: searching for 1 strs:  :#
 << 
Password: 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

Password: 
...

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
Password: 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

Password: 
...

 >> no service pad

 >> service timestamps debug datetime localtime

 >> service timestamps log datetime localtime

 >> service password-encryption

 >> boot-start-marker

 >> boot-end-marker

 >> enable secret W2w1cD0mIliG!

 >> enable password W2w1cD0mIliG!

 >> username root privilege 15 secret W2w1cD0mIliG!

 >> no aaa new-model

 >> clock timezone CST -6

 >> clock summer-time CDT recurring

 >> authentication mac-move permit

 >> ip domain-name mgmt.msstate.edu

 >> ip name-server 130.18.80.12

 >> vtp domain vtp01.mgmt.msstate.edu

 >> vtp mode client

 >> crypto pki trustpoint TP-self-signed-2494998912

 >>  enrollment selfsigned

 >>  subject-name cn=IOS-Self-Signed-Certificate-2494998912

 >>  revocation-check none

 >>  rsakeypair TP-self-signed-2494998912

 >> crypto pki certificate chain TP-self-signed-2494998912

 >>  certificate self-signed 01 nvram:IOS-Self-Sig#3232.cer

 >> spanning-tree portfast bpduguard default

 >> spanning-tree extend system-id

 >> vlan internal allocation policy ascending

 >> errdisable recovery cause all

 >> errdisable recovery interval 1800

 >> interface FastEthernet0

 >>  no ip address

 >>  shutdown

 >> interface Vlan1

 >>  no ip address

 >>  no ip route-cache

 >>  shutdown

 >> interface Vlan92

 >> no ip http server

 >> no ip http secure-server

 >> ip sla enable reaction-alerts

 >> logging facility local1

 >> logging host 130.18.8.12

 >> access-list 1 permit 10.92.0.0 0.0.255.255

 >> access-list 1 permit 130.18.8.0 0.0.0.255

 >> access-list 1 permit 10.93.0.0 0.0.255.255

 >> access-list 1 permit 130.18.1.0 0.0.0.255

 >> snmp-server community sysnet RO 1

 >> snmp-server community c2-b2=a2 RW 1

 >> snmp-server enable traps snmp authentication linkdown linkup coldstart warmstart

 >> snmp-server enable traps transceiver all

 >> snmp-server enable traps tty

 >> snmp-server enable traps cluster

 >> snmp-server enable traps config-copy

 >> snmp-server enable traps config

 >> snmp-server enable traps config-ctid

 >> snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-auth-fail-vlan no-guest-vlan

 >> snmp-server enable traps entity

 >> snmp-server enable traps power-ethernet group 1

 >> snmp-server enable traps power-ethernet police

 >> snmp-server enable traps cpu threshold

 >> snmp-server enable traps rep

 >> snmp-server enable traps rtr

 >> snmp-server enable traps bridge newroot topologychange

 >> snmp-server enable traps stpx inconsistency root-inconsistency loop-inconsistency

 >> snmp-server enable traps syslog

 >> snmp-server enable traps vtp

 >> snmp-server enable traps vlancreate

 >> snmp-server enable traps vlandelete

 >> snmp-server enable traps flash insertion removal

 >> snmp-server enable traps port-security

 >> snmp-server enable traps envmon fan shutdown supply temperature status

 >> snmp-server enable traps errdisable

 >> snmp-server enable traps mac-notification change move threshold

 >> snmp-server enable traps vlan-membership

 >> snmp-server host 130.18.8.12 sysnet 

 >> line con 0

 >> line vty 0 15

 >>  access-class 1 in

 >>  password W2w1cD0mIliG!

 >>  login local

 >>  transport input ssh

 >> ntp clock-period 22519226

 >> ntp server 10.92.0.5

 >> 

 >> enable

Expect: searching for 2 strs:  :Password: :#
 << 
% Bad secrets

c29s5.ra232a.ruby>service timestamps debug datetime localtime
                    ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby>service timestamps log datetime localtime
                    ^
% Invalid input detecte
 << d at '^' marker.

c29s5.ra232a.ruby>service password-encryption
                    ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby>boot-start-marker
Translating "boot-start-marker"...domain server (130.18.80.12)
% Unknown command or 
 << computer name, or unable to find computer address
c29s5.ra232a.ruby>boot-end-marker
Translating "boot-end-marker"...domain server (130.18.80.12)
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

% Bad secrets

c29s5.ra232a.ruby>service timestamps debug datetime localtime
                    ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby>service timestamps log datetime localtime
                    ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby>service password-encryption
                    ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby>boot-start-marker
Translating "boot-start-marker"...domain server (130.18.80.12)
% Unknown command or computer name, or unable to find computer address
c29s5.ra232a.ruby>boot-end-marker
Translating "boot-end-marker"...domain server (130.18.80.12)
...

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
 << 
 << 
 << 
 << 
% Unknown command or computer name, or unable to find computer address
c29s5.ra232a.ruby>enable secret W2w1cD0mIliG!
                         ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby>enable password W2w1cD0mIliG!
              
 <<            ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby>username root privilege 15 secret W2w1cD0mIliG!
                  ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby>no aaa new-model
                     ^
% Inval
 << id input detected at '^' marker.

c29s5.ra232a.ruby>clock timezone CST -6
                    ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby>clock summer-time CDT recurring
                    ^
% Invalid input detected at '^' marker
 << .

c29s5.ra232a.ruby>authentication mac-move permit
                   ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby>ip domain-name mgmt.msstate.edu
                  ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby>ip
 <<  name-server 130.18.80.12
                  ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby>vtp domain vtp01.mgmt.msstate.edu
                  ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby>vtp mode client
            
 <<       ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby>crypto pki trustpoint TP-self-signed-2494998912
                             ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby> enrollment selfsigned
                   
 <<   ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby> subject-name cn=IOS-Self-Signed-Certificate-2494998912
                    ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby> revocation-check none
                     ^

 << % Invalid input detected at '^' marker.

c29s5.ra232a.ruby> rsakeypair TP-self-signed-2494998912
                    ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby>crypto pki certificate chain TP-self-signed-2494998912
               
 <<               ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby> certificate self-signed 01 nvram:IOS-Self-Sig#3232.cer
                    ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby>spanning-tree portfast bpduguard def
 << ault
                   ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby>spanning-tree extend system-id
                   ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby>vlan internal allocation policy ascending
        
 <<           ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby>errdisable recovery cause all
                   ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby>errdisable recovery interval 1800
                   ^
% Invalid 
 << input detected at '^' marker.

c29s5.ra232a.ruby>interface FastEthernet0
                  ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby> no ip address
                      ^
% Invalid input detected at '^' marker.

c29s5.ra232a.
 << ruby> shutdown
Translating "shutdown"...domain server (130.18.80.12)
 << 
 << 
Expect: did not match any strings!
...

% Unknown command or computer name, or unable to find computer address
c29s5.ra232a.ruby>enable secret W2w1cD0mIliG!
                         ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby>enable password W2w1cD0mIliG!
                         ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby>username root privilege 15 secret W2w1cD0mIliG!
                  ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby>no aaa new-model
                     ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby>clock timezone CST -6
                    ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby>clock summer-time CDT recurring
                    ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby>authentication mac-move permit
                   ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby>ip domain-name mgmt.msstate.edu
                  ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby>ip name-server 130.18.80.12
                  ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby>vtp domain vtp01.mgmt.msstate.edu
                  ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby>vtp mode client
                  ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby>crypto pki trustpoint TP-self-signed-2494998912
                             ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby> enrollment selfsigned
                     ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby> subject-name cn=IOS-Self-Signed-Certificate-2494998912
                    ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby> revocation-check none
                     ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby> rsakeypair TP-self-signed-2494998912
                    ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby>crypto pki certificate chain TP-self-signed-2494998912
                             ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby> certificate self-signed 01 nvram:IOS-Self-Sig#3232.cer
                    ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby>spanning-tree portfast bpduguard default
                   ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby>spanning-tree extend system-id
                   ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby>vlan internal allocation policy ascending
                  ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby>errdisable recovery cause all
                   ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby>errdisable recovery interval 1800
                   ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby>interface FastEthernet0
                  ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby> no ip address
                      ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby> shutdown
Translating "shutdown"...domain server (130.18.80.12)
...

 >> spanning-tree mode mst

 >> spanning-tree etherchannel guard misconfig

 >> spanning-tree mst configuration

 >>  name msstate

 >>  revision 1

 >>  instance 1 vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 63, 70

 >>  instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 160

 >>  instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 230, 232, 242, 246

 >>  instance 1 vlan 256, 611-612, 654, 741, 996, 999

 >>  instance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037, 2039-2040

 >>  instance 2 vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096, 2104, 2110, 2126

 >>  instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 2189, 2194, 2202

 >>  instance 2 vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 2654, 2999

 >>  instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176, 196

 >>  instance 3 vlan 244, 248, 927

 >>  instance 4 vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072, 2108, 2113, 2128

 >>  instance 4 vlan 2144, 2176, 2196, 2244, 2248, 2927

 >>  instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 228

 >>  instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216, 2228

 >>  instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116, 124

 >>  instance 7 vlan 172, 186, 192, 204-208, 210, 240-241, 251-252, 630, 928

 >>  instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082, 2084

 >>  instance 8 vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208, 2210

 >>  instance 8 vlan 2240-2241, 2251-2252, 2630, 2928

 >>  instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102, 112

 >>  instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 500, 505, 510-511

 >>  instance 9 vlan 522, 551-570, 603, 629, 633, 742, 802, 926, 929

 >>  instance 10 vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 2057, 2062, 2068

 >>  instance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148, 2158

 >>  instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522, 2603, 2629, 2633

 >>  instance 10 vlan 2802, 2926, 2929

 >>  instance 11 vlan 8, 43, 52, 146, 156-157, 180, 200, 218

 >>  instance 12 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180, 2200, 2218

 >> 

 >> enable

Expect: searching for 2 strs:  :Password: :#
 << 
 << 
 << 
 << 
 << 
 << 
% Unknown command or computer name, or unable to find computer address
c29s5.ra232a.ruby>interface Vlan1
                  ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby> no ip address
                      ^
% Invalid input detecte
 << d at '^' marker.

c29s5.ra232a.ruby> no ip route-cache
                      ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby> shutdown
% Unknown command or computer name, or unable to find computer address
c29s5.ra232a.ruby>interface 
 << Vlan92
                  ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby>no ip http server
                     ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby>no ip http secure-server
                     ^
% Invalid i
 << nput detected at '^' marker.

c29s5.ra232a.ruby>ip sla enable reaction-alerts
                  ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby>logging facility local1
                     ^
% Invalid input detected at '^' marker.


 << c29s5.ra232a.ruby>logging host 130.18.8.12
                     ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby>access-list 1 permit 10.92.0.0 0.0.255.255
                         ^
% Invalid input detected at '^' marker.

c29s5.ra232
 << a.ruby>access-list 1 permit 130.18.8.0 0.0.0.255
                         ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby>access-list 1 permit 10.93.0.0 0.0.255.255
                         ^
% Invalid input detected at '^' marker.

c
 << 29s5.ra232a.ruby>access-list 1 permit 130.18.1.0 0.0.0.255
                         ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby>snmp-server community sysnet RO 1
                   ^
% Invalid input detected at '^' marker.

c29s5.
 << ra232a.ruby>snmp-server community c2-b2=a2 RW 1
                   ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby>snmp-server enable traps snmp authentication linkdown linku$ ena
 << ble traps snmp authentication linkdown linkup          coldstaraps snmp authentication linkdown linkup coldstart          warmstar
 << uthentication linkdown linkup coldstart warmstart         
snmp-server enable traps snmp authentication linkdown linkup coldstart warmstart ^

% Invalid input detected at '^' marker.

c29s5.ra232a.ruby>snmp-server enable traps trans
 << ceiver all
                   ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby>snmp-server enable traps tty
                   ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby>snmp-server enable traps cluster
             
 <<       ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby>snmp-server enable traps config-copy
                   ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby>snmp-server enable traps config
                   ^
% Invalid
 <<  input detected at '^' marker.

c29s5.ra232a.ruby>snmp-server enable traps config-ctid
                   ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby>snmp-server enable traps dot1x auth-fail-vlan guest-vlan no
 << $ enable traps dot1x auth-fail-vlan guest-vlan no-         auth-failaps dot1x auth-fail-vlan guest-vlan no-auth-fail-         vlan no-g
 << uth-fail-vlan guest-vlan no-auth-fail-vlan no-gu         est-vlan
snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-auth-fail-vlan no-gu ^est-vlan

% Invalid input detected at '^' mark
 << er.

c29s5.ra232a.ruby>snmp-server enable traps entity
                   ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby>snmp-server enable traps power-ethernet group 1
                   ^
% Invalid input detected at '^' marker.


 << c29s5.ra232a.ruby>snmp-server enable traps power-ethernet police
                   ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby>snmp-server enable traps cpu threshold
                   ^
% Invalid input detected at '^' marker.

c
 << 29s5.ra232a.ruby>snmp-server enable traps rep
                   ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby>snmp-server enable traps rtr
                   ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby>snmp-server 
 << enable traps bridge newroot topologychange
                   ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby>snmp-server enable traps stpx inconsistencyenable
                   ^
% Invalid input detected at '^' marker.

c29s5.ra232a
Expect: did not match any strings!
...

% Unknown command or computer name, or unable to find computer address
c29s5.ra232a.ruby>interface Vlan1
                  ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby> no ip address
                      ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby> no ip route-cache
                      ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby> shutdown
% Unknown command or computer name, or unable to find computer address
c29s5.ra232a.ruby>interface Vlan92
                  ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby>no ip http server
                     ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby>no ip http secure-server
                     ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby>ip sla enable reaction-alerts
                  ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby>logging facility local1
                     ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby>logging host 130.18.8.12
                     ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby>access-list 1 permit 10.92.0.0 0.0.255.255
                         ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby>access-list 1 permit 130.18.8.0 0.0.0.255
                         ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby>access-list 1 permit 10.93.0.0 0.0.255.255
                         ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby>access-list 1 permit 130.18.1.0 0.0.0.255
                         ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby>snmp-server community sysnet RO 1
                   ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby>snmp-server community c2-b2=a2 RW 1
                   ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby>snmp-server enable traps snmp authentication linkdown linku$ enable traps snmp authentication linkdown linkup          coldstaraps snmp authentication linkdown linkup coldstart          warmstaruthentication linkdown linkup coldstart warmstart         
snmp-server enable traps snmp authentication linkdown linkup coldstart warmstart ^

% Invalid input detected at '^' marker.

c29s5.ra232a.ruby>snmp-server enable traps transceiver all
                   ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby>snmp-server enable traps tty
                   ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby>snmp-server enable traps cluster
                   ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby>snmp-server enable traps config-copy
                   ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby>snmp-server enable traps config
                   ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby>snmp-server enable traps config-ctid
                   ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby>snmp-server enable traps dot1x auth-fail-vlan guest-vlan no$ enable traps dot1x auth-fail-vlan guest-vlan no-         auth-failaps dot1x auth-fail-vlan guest-vlan no-auth-fail-         vlan no-guth-fail-vlan guest-vlan no-auth-fail-vlan no-gu         est-vlan
snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-auth-fail-vlan no-gu ^est-vlan

% Invalid input detected at '^' marker.

c29s5.ra232a.ruby>snmp-server enable traps entity
                   ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby>snmp-server enable traps power-ethernet group 1
                   ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby>snmp-server enable traps power-ethernet police
                   ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby>snmp-server enable traps cpu threshold
                   ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby>snmp-server enable traps rep
                   ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby>snmp-server enable traps rtr
                   ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby>snmp-server enable traps bridge newroot topologychange
                   ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby>snmp-server enable traps stpx inconsistencyenable
                   ^
% Invalid input detected at '^' marker.

c29s5.ra232a
...

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << .ruby>configurespanning-tree mode mst
                     ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby>spanning-tree etherchannel guard misconfig
                   ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby>span
 << ning-tree mst configuration
                   ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby> name msstate
                        ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby> revision 1
Translating "revision"...do
 << main server (130.18.80.12)
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...
.ruby>configurespanning-tree mode mst
                     ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby>spanning-tree etherchannel guard misconfig
                   ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby>spanning-tree mst configuration
                   ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby> name msstate
                        ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby> revision 1
Translating "revision"...domain server (130.18.80.12)
...

 >> hostname c29s1.f1.edwards 

Expect: searching for 2 strs:  :# :>
 << 
 << 
 << 
 << 
 << 
 << 
 << 
% Unknown command or computer name, or unable to find computer address
c29s5.ra232a.ruby> instance 1 vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40, 5$ vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-4
Expect: matched string 2: >
 >> enable

Expect: searching for 2 strs:  :Password: :#
 << 0, 50         , 60, 63,, 11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 63,          70
 instance 1 vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 63, 70
 ^
% Invalid input 
 << detected at '^' marker.

c29s5.ra232a.ruby> instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 14$ vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 140         , 152, 16
 << 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 160         
 instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 160
 ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby> insta
 << nce 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 230$ vlan 162-163, 168, 189, 194, 202, 220, 222, 230,          232, 242163, 168
 << , 189, 194, 202, 220, 222, 230, 232, 242,          246
 instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 230, 232, 242, 246
 ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby> instance 1 vlan 256, 611-612, 654, 741, 996, 999
 << 
                   ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby> instance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031, $ vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031, 2  
 <<        035, 2037, 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037,          2039-20411, 2020, 2022, 2024, 2031, 2035, 2037
 << , 2039-2040         
 instance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037, 2039-2040 ^

% Invalid input detected at '^' marker.

c29s5.ra232a.ruby> instance 2 vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096, 
 << $ vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096, 2         104, 2110, 2060, 2063, 2070, 2080, 2086, 2096, 2104, 2110,          2126
 inst
 << ance 2 vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096, 2104, 2110, 2126
 ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby> instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 2
 << $ vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 21         89, 2194,, 2140, 2152, 2160, 2162-2163, 2168, 2189, 2194,          2202
 instance 2 vlan 2136, 2140, 2152, 2160, 2162-2
 << 163, 2168, 2189, 2194, 2202
 ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby> instance 2 vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 2$ vlan 2220, 2222, 2232, 2242, 2246, 2611-2
 << 612, 26         54, 2999
 instance 2 vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 2654, 2999
 ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby> instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128,
 << $ vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128,          144, 176,51, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176,          196
 instance 3 vla
 << n 42, 51, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176, 196
 ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby> instance 3 vlan 244, 248, 927
                   ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby> instance 4 vla
 << n 2042, 2051, 2059, 2064, 2066configure term$ vlan 2042, 2051, 2059, 2064, 2066configure termi         nal
 instance 4 vlan 2042, 2051, 2059, 2064, 2066configure terminal
 ^
% Invalid 
 << input detected at '^' marker.

c29s5.ra232a.ruby>hostname c29s1.f1.edwards 
                   ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby>enable
Password: 
Expect: matched string 1: Password:
 >> W2w1cD0mIliG!

Expect: searching for 1 strs:  :#
 << 
Password: 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

Password: 
...

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
Password: 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

Password: 
...

 >> snmp-server contact 6F-1619

Expect: searching for 1 strs:  :#
 << 
% Bad secrets

c29s5.ra232a.ruby>
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

% Bad secrets

c29s5.ra232a.ruby>
...

 >> enable

Expect: searching for 2 strs:  :Password: :#
 << enable
Password: 
Expect: matched string 1: Password:
 >> W2w1cD0mIliG!

Expect: searching for 1 strs:  :#
 << 
Password: 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

Password: 
...

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
Password: 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

Password: 
...

 >> interface vlan 92

Expect: searching for 1 strs:  :(config-if)#
 << 
% Bad secrets

c29s5.ra232a.ruby>
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

% Bad secrets

c29s5.ra232a.ruby>
...

 >> ip address 10.92.6.10 255.255.0.0

 >> ip broadcast-address 10.92.255.255

 >> enable

Expect: searching for 2 strs:  :Password: :#
 << ip address 10.92.6.10 255.255.0.0
                  ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby>ip broadcast-address 10.92.255.255
                  ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby>enable
Password: 
Expect: matched string 1: Password:
 >> W2w1cD0mIliG!

Expect: searching for 1 strs:  :#
 << 
Password: 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

Password: 
...

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
Password: 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

Password: 
...

 >> interface Vlan92

Expect: searching for 1 strs:  :(config-if)#
 << 
% Bad secrets

c29s5.ra232a.ruby>
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

% Bad secrets

c29s5.ra232a.ruby>
...

 >> ip default-gateway 10.92.0.1

 >> enable

Expect: searching for 2 strs:  :Password: :#
 << ip default-gateway 10.92.0.1
                  ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby>enable
Password: 
Expect: matched string 1: Password:
 >> W2w1cD0mIliG!

Expect: searching for 1 strs:  :#
 << 
Password: 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

Password: 
...

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
Password: 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

Password: 
...

 >> ip dhcp snooping

Expect: searching for 1 strs:  :#
 << 
% Bad secrets

c29s5.ra232a.ruby>
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

% Bad secrets

c29s5.ra232a.ruby>
...

 >> ip dhcp snooping vlan 108

Expect: searching for 1 strs:  :#
 << ip dhcp snooping vlan 108
                  ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby>
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...
ip dhcp snooping vlan 108
                  ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby>
...

 >> enable

Expect: searching for 2 strs:  :Password: :#
 << enable
Password: 
Expect: matched string 1: Password:
 >> W2w1cD0mIliG!

Expect: searching for 1 strs:  :#
 << 
Password: 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

Password: 
...

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
Password: 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

Password: 
...

 >> default interface range gi1/0/1 - 24 

 >> interface range gi1/0/1 - 24 

Expect: searching for 1 strs:  :(config-if-range)#
 << 
% Bad secrets

c29s5.ra232a.ruby>interface range gi1/0/1 - 24 
                  ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby>
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

% Bad secrets

c29s5.ra232a.ruby>interface range gi1/0/1 - 24 
                  ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby>
...

 >> enable

Expect: searching for 2 strs:  :Password: :#
 << enable
Password: 
Expect: matched string 1: Password:
 >> W2w1cD0mIliG!

Expect: searching for 1 strs:  :#
 << 
Password: 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

Password: 
...

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
Password: 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

Password: 
...

 >> default interface gi1/0/24 

 >> interface gi1/0/24 

Expect: searching for 1 strs:  :(config-if)#
 << 
% Bad secrets

c29s5.ra232a.ruby>interface gi1/0/24 
                  ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby>
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

% Bad secrets

c29s5.ra232a.ruby>interface gi1/0/24 
                  ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby>
...

 >> enable

Expect: searching for 2 strs:  :Password: :#
 << enable
Password: 
Expect: matched string 1: Password:
 >> W2w1cD0mIliG!

Expect: searching for 1 strs:  :#
 << 
Password: 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

Password: 
...

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
Password: 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

Password: 
...

 >> default interface range gi1/0/25 - 28 

 >> interface range gi1/0/25 - 28 

Expect: searching for 1 strs:  :(config-if-range)#
 << 
% Bad secrets

c29s5.ra232a.ruby>interface range gi1/0/25 - 28 
                  ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby>
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

% Bad secrets

c29s5.ra232a.ruby>interface range gi1/0/25 - 28 
                  ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby>
...

 >> enable

Expect: searching for 2 strs:  :Password: :#
 << enable
Password: 
Expect: matched string 1: Password:
 >> W2w1cD0mIliG!

Expect: searching for 1 strs:  :#
 << 
Password: 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

Password: 
...

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
Password: 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

Password: 
...

 >> crypto key generate rsa

 >> no

 >> 2048

Expect: searching for 2 strs:  :OK :(config)#
 << 
% Bad secrets

c29s5.ra232a.ruby>no
% Incomplete command.

c29s5.ra232a.ruby>2048
% Unknown command or computer name, or unable to find computer address
c29s5.ra232a.ruby>
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

% Bad secrets

c29s5.ra232a.ruby>no
% Incomplete command.

c29s5.ra232a.ruby>2048
% Unknown command or computer name, or unable to find computer address
c29s5.ra232a.ruby>
...

 >> write mem

Expect: searching for 2 strs:  :# :>
 << write mem
                   ^
% Invalid input detected at '^' marker.

c29s5.ra232a.ruby>
Expect: matched string 2: >
 >> 
Expect: searching for 2 strs:  :# :>
 << 
c29s5.ra232a.ruby>
c29s5.ra232a.ruby>
Expect: matched string 2: >
 >> enable

Expect: searching for 2 strs:  :Password: :#
 << enable
Password: 
Expect: matched string 1: Password:
 >> W2w1cD0mIliG!

Expect: searching for 1 strs:  :#
 << 
Password: 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

Password: 
...

 >> sh run

Expect: searching for 2 strs:  :# :>
 << 
Password: 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
% Password:  timeout expired!
% Bad secrets

c29s5.ra232a.ruby>
Expect: matched string 2: >
 >> enable

Expect: searching for 2 strs:  :Password: :#
 << 





























































c29s5.ra232a.ruby con0 is now available





Press RETURN to get started.















 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...






























































c29s5.ra232a.ruby con0 is now available





Press RETURN to get started.















...

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

...

 >> no service pad

 >> service timestamps debug datetime localtime

 >> service timestamps log datetime localtime

 >> service password-encryption

 >> boot-start-marker

 >> boot-end-marker

 >> enable secret W2w1cD0mIliG!

 >> enable password W2w1cD0mIliG!

 >> username root privilege 15 secret W2w1cD0mIliG!

 >> no aaa new-model

 >> clock timezone CST -6

 >> clock summer-time CDT recurring

 >> authentication mac-move permit

 >> ip domain-name mgmt.msstate.edu

 >> ip name-server 130.18.80.12

 >> vtp domain vtp01.mgmt.msstate.edu

 >> vtp mode client

 >> crypto pki trustpoint TP-self-signed-2494998912

 >>  enrollment selfsigned

 >>  subject-name cn=IOS-Self-Signed-Certificate-2494998912

 >>  revocation-check none

 >>  rsakeypair TP-self-signed-2494998912

 >> crypto pki certificate chain TP-self-signed-2494998912

 >>  certificate self-signed 01 nvram:IOS-Self-Sig#3232.cer

 >> spanning-tree portfast bpduguard default

 >> spanning-tree extend system-id

 >> vlan internal allocation policy ascending

 >> errdisable recovery cause all

 >> errdisable recovery interval 1800

 >> interface FastEthernet0

 >>  no ip address

 >>  shutdown

 >> interface Vlan1

 >>  no ip address

 >>  no ip route-cache

 >>  shutdown

 >> interface Vlan92

 >> no ip http server

 >> no ip http secure-server

 >> ip sla enable reaction-alerts

 >> logging facility local1

 >> logging host 130.18.8.12

 >> access-list 1 permit 10.92.0.0 0.0.255.255

 >> access-list 1 permit 130.18.8.0 0.0.0.255

 >> access-list 1 permit 10.93.0.0 0.0.255.255

 >> access-list 1 permit 130.18.1.0 0.0.0.255

 >> snmp-server community sysnet RO 1

 >> snmp-server community c2-b2=a2 RW 1

 >> snmp-server enable traps snmp authentication linkdown linkup coldstart warmstart

 >> snmp-server enable traps transceiver all

 >> snmp-server enable traps tty

 >> snmp-server enable traps cluster

 >> snmp-server enable traps config-copy

 >> snmp-server enable traps config

 >> snmp-server enable traps config-ctid

 >> snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-auth-fail-vlan no-guest-vlan

 >> snmp-server enable traps entity

 >> snmp-server enable traps power-ethernet group 1

 >> snmp-server enable traps power-ethernet police

 >> snmp-server enable traps cpu threshold

 >> snmp-server enable traps rep

 >> snmp-server enable traps rtr

 >> snmp-server enable traps bridge newroot topologychange

 >> snmp-server enable traps stpx inconsistency root-inconsistency loop-inconsistency

 >> snmp-server enable traps syslog

 >> snmp-server enable traps vtp

 >> snmp-server enable traps vlancreate

 >> snmp-server enable traps vlandelete

 >> snmp-server enable traps flash insertion removal

 >> snmp-server enable traps port-security

 >> snmp-server enable traps envmon fan shutdown supply temperature status

 >> snmp-server enable traps errdisable

 >> snmp-server enable traps mac-notification change move threshold

 >> snmp-server enable traps vlan-membership

 >> snmp-server host 130.18.8.12 sysnet 

 >> line con 0

 >> line vty 0 15

 >>  access-class 1 in

 >>  password W2w1cD0mIliG!

 >>  login local

 >>  transport input ssh

 >> ntp clock-period 22519226

 >> ntp server 10.92.0.5

 >> 

 >> enable

Expect: searching for 2 strs:  :Password: :#
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

...

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

...

 >> spanning-tree mode mst

 >> spanning-tree etherchannel guard misconfig

 >> spanning-tree mst configuration

 >>  name msstate

 >>  revision 1

 >>  instance 1 vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 63, 70

 >>  instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 160

 >>  instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 230, 232, 242, 246

 >>  instance 1 vlan 256, 611-612, 654, 741, 996, 999

 >>  instance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037, 2039-2040

 >>  instance 2 vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096, 2104, 2110, 2126

 >>  instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 2189, 2194, 2202

 >>  instance 2 vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 2654, 2999

 >>  instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176, 196

 >>  instance 3 vlan 244, 248, 927

 >>  instance 4 vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072, 2108, 2113, 2128

 >>  instance 4 vlan 2144, 2176, 2196, 2244, 2248, 2927

 >>  instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 228

 >>  instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216, 2228

 >>  instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116, 124

 >>  instance 7 vlan 172, 186, 192, 204-208, 210, 240-241, 251-252, 630, 928

 >>  instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082, 2084

 >>  instance 8 vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208, 2210

 >>  instance 8 vlan 2240-2241, 2251-2252, 2630, 2928

 >>  instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102, 112

 >>  instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 500, 505, 510-511

 >>  instance 9 vlan 522, 551-570, 603, 629, 633, 742, 802, 926, 929

 >>  instance 10 vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 2057, 2062, 2068

 >>  instance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148, 2158

 >>  instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522, 2603, 2629, 2633

 >>  instance 10 vlan 2802, 2926, 2929

 >>  instance 11 vlan 8, 43, 52, 146, 156-157, 180, 200, 218

 >>  instance 12 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180, 2200, 2218

 >> 

 >> enable

Expect: searching for 2 strs:  :Password: :#
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

...

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

...

 >> hostname c29s1.f1.edwards 

Expect: searching for 2 strs:  :# :>
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

...

 >> enable

Expect: searching for 2 strs:  :Password: :#
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

...

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

...

 >> snmp-server contact 6F-1619

Expect: searching for 1 strs:  :#
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

...

 >> enable

Expect: searching for 2 strs:  :Password: :#
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

...

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

...

 >> interface vlan 92

Expect: searching for 1 strs:  :(config-if)#
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

...

 >> ip address 10.92.6.10 255.255.0.0

 >> ip broadcast-address 10.92.255.255

 >> enable

Expect: searching for 2 strs:  :Password: :#
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

...

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

...

 >> interface Vlan92

Expect: searching for 1 strs:  :(config-if)#
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

...

 >> ip default-gateway 10.92.0.1

 >> enable

Expect: searching for 2 strs:  :Password: :#
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

...

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

...

 >> ip dhcp snooping

Expect: searching for 1 strs:  :#
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

...

 >> ip dhcp snooping vlan 108

Expect: searching for 1 strs:  :#
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

...

 >> enable

Expect: searching for 2 strs:  :Password: :#
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

...

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

...

 >> default interface range gi1/0/1 - 24 

 >> interface range gi1/0/1 - 24 

Expect: searching for 1 strs:  :(config-if-range)#
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

...

 >> enable

Expect: searching for 2 strs:  :Password: :#
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

...

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

...

 >> default interface gi1/0/24 

 >> interface gi1/0/24 

Expect: searching for 1 strs:  :(config-if)#
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

...

 >> enable

Expect: searching for 2 strs:  :Password: :#
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

...

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

...

 >> enable

Expect: searching for 2 strs:  :Password: :#
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

...

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

...

 >> crypto key generate rsa

 >> no

 >> 2048

Expect: searching for 2 strs:  :OK :(config)#
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

...

 >> write mem

Expect: searching for 2 strs:  :# :>
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

...

 >> 
Expect: searching for 2 strs:  :# :>
 << 
c29s5.ra232a.ruby>
c29s5.ra232a.ruby>
Expect: matched string 2: >
 >> enable

Expect: searching for 2 strs:  :Password: :#
 << enable
Password: 
Expect: matched string 1: Password:
 >> W2w1cD0mIliG!

Expect: searching for 1 strs:  :#
 << 
Password: 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

Password: 
...

 >> sh run

Expect: searching for 2 strs:  :# :>
 << 
Password: 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
% Password:  timeout expired!
% Bad secrets

c29s5.ra232a.ruby>
Expect: matched string 2: >
 >> show interface status

Expect: searching for 2 strs:  :# :>
 << 

































c29s5.ra232a.ruby con0 is now available





Press RETURN to get started.





 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...


































c29s5.ra232a.ruby con0 is now available





Press RETURN to get started.





...

