trying to use serial port: /dev/ttyUSB0
 >> 
 >> 

Expect: searching for 4 strs:  :[yes/no] :Press RETURN to get started. :# :Switch>
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

...

 >> 

Expect: searching for 2 strs:  :# :>
 << 
% Please answer 'yes' or 'no'.
Would you like to enter the initial configuration dialog? [yes/no]: 
% Please answer 'yes' or 'no'.
Would you like to enter the initial configuration dialog? [yes/no]: 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

% Please answer 'yes' or 'no'.
Would you like to enter the initial configuration dialog? [yes/no]: 
% Please answer 'yes' or 'no'.
Would you like to enter the initial configuration dialog? [yes/no]: 
...

 >> 

Expect: searching for 4 strs:  :[yes/no] :Press RETURN to get started. :# :Switch>
 << 
% Please answer 'yes' or 'no'.
Would you like to enter the initial configuration dialog? [yes/no]: 
% Please answer 'yes' or 'no'.
Would you like to enter the initial configuration dialog? [yes/no]: 
Expect: matched string 1: [yes/no]
 >> 

 >> no

 >> term len 0

Expect: searching for 2 strs:  :# :>
 << 
% Please answer 'yes' or 'no'.
Would you like to enter the initial configuration dialog? [yes/no]: 
% Please answer 'yes' or 'no'.
Would you like to enter the initial configuration dialog? [yes/no]: no
Switch>term len 0
Switch>
Expect: matched string 2: >
 >> show version

Expect: searching for 2 strs:  :# :>
 << show version
Cisco IOS Software, C2960S Software (C2960S-UNIVERSALK9-M), Version 15.0(2)SE8, RELEASE SOFTWARE (fc1)
Technical Support: http://www.cisco.com/techsupport
Copyright (c) 1986-2015 by Cisco Systems, Inc.
Compiled Wed 13-May-15 23:10 by prod
 << _rel_team

ROM: Bootstrap program is C2960S board boot loader
BOOTLDR: C2960S Boot Loader (C2960S-HBOOT-M) Version 12.2(55r)SE, RELEASE SOFTWARE (fc1)

Switch uptime is 1 hour, 16 minutes
System returned to ROM by power-on
System image file is "fla
 << sh:/c2960s-universalk9-mz.150-2.SE8.bin"


This product contains cryptographic features and is subject to United
States and local country laws governing import, export, transfer and
use. Delivery of Cisco cryptographic products does not imply
third-
 << party authority to import, export, distribute or use encryption.
Importers, exporters, distributors and users are responsible for
compliance with U.S. and local country laws. By using this product you
agree to comply with applicable laws and regulation
 << s. If you are unable
to comply with U.S. and local laws, return this product immediately.

A summary of U.S. laws governing Cisco cryptographic products may be found at:
http://www.cisco.com/wwl/export/crypto/tool/stqrg.html

If you require further 
 << assistance please contact us by sending email to
export@cisco.com.

cisco WS-C2960S-24TS-L (PowerPC) processor (revision E0) with 131072K bytes of memory.
Processor board ID FOC1614Z1RT
Last reset from power-on
1 Virtual Ethernet interface
1 FastEt
 << hernet interface
28 Gigabit Ethernet interfaces
The password-recovery mechanism is enabled.

512K bytes of flash-simulated non-volatile configuration memory.
Base ethernet MAC Address       : F4:EA:67:A0:69:00
Motherboard assembly number     : 73-11
 << 910-08
Power supply part number        : 341-0328-02
Motherboard serial number       : FOC16131NJ9
Power supply serial number      : LIT16060S3U
Model revision number           : E0
Motherboard revision number     : A0
Model number                  
 <<   : WS-C2960S-24TS-L
Daughterboard assembly number   : 73-11933-04
Daughterboard serial number     : FOC161343UU
System serial number            : FOC1614Z1RT
Top Assembly Part Number        : 800-30954-03
Top Assembly Revision Number    : A0
Versio
 << n ID                      : V03
CLEI Code Number                : COMGG00ARC
Daughterboard revision number   : A0
Hardware Board Revision Number  : 0x01


Switch Ports Model              SW Version            SW Image                 
------ ----- 
 << -----              ----------            ----------               
*    1 28    WS-C2960S-24TS-L   15.0(2)SE8            C2960S-UNIVERSALK9-M     


Configuration register is 0xF

Switch>
Expect: matched string 2: >
 >> enable

Expect: searching for 2 strs:  :Password: :#
 << enable
Switch#
Expect: matched string 2: #
 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
Expect: matched string 1: (config)#
 >> no service pad

 >> service timestamps debug datetime localtime

 >> service timestamps log datetime localtime

 >> service password-encryption

 >> boot-start-marker

 >> boot-end-marker

 >> enable secret W2w1cD0mIliG!

 >> enable password W2w1cD0mIliG!

 >> username root privilege 15 secret W2w1cD0mIliG!

 >> no aaa new-model

 >> clock timezone CST -6

 >> clock summer-time CDT recurring

 >> authentication mac-move permit

 >> ip domain-name mgmt.msstate.edu

 >> ip name-server 130.18.80.12

 >> vtp domain vtp01.mgmt.msstate.edu

 >> vtp mode client

 >> crypto pki trustpoint TP-self-signed-2494998912

 >>  enrollment selfsigned

 >>  subject-name cn=IOS-Self-Signed-Certificate-2494998912

 >>  revocation-check none

 >>  rsakeypair TP-self-signed-2494998912

 >> crypto pki certificate chain TP-self-signed-2494998912

 >>  certificate self-signed 01 nvram:IOS-Self-Sig#3232.cer

 >> spanning-tree portfast bpduguard default

 >> spanning-tree extend system-id

 >> vlan internal allocation policy ascending

 >> errdisable recovery cause all

 >> errdisable recovery interval 1800

 >> interface FastEthernet0

 >>  no ip address

 >>  shutdown

 >> interface Vlan1

 >>  no ip address

 >>  no ip route-cache

 >>  shutdown

 >> interface Vlan92

 >> no ip http server

 >> no ip http secure-server

 >> ip sla enable reaction-alerts

 >> logging facility local1

 >> logging host 130.18.8.12

 >> access-list 1 permit 10.92.0.0 0.0.255.255

 >> access-list 1 permit 130.18.8.0 0.0.0.255

 >> access-list 1 permit 10.93.0.0 0.0.255.255

 >> access-list 1 permit 130.18.1.0 0.0.0.255

 >> snmp-server community sysnet RO 1

 >> snmp-server community c2-b2=a2 RW 1

 >> snmp-server enable traps snmp authentication linkdown linkup coldstart warmstart

 >> snmp-server enable traps transceiver all

 >> snmp-server enable traps tty

 >> snmp-server enable traps cluster

 >> snmp-server enable traps config-copy

 >> snmp-server enable traps config

 >> snmp-server enable traps config-ctid

 >> snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-auth-fail-vlan no-guest-vlan

 >> snmp-server enable traps entity

 >> snmp-server enable traps power-ethernet group 1

 >> snmp-server enable traps power-ethernet police

 >> snmp-server enable traps cpu threshold

 >> snmp-server enable traps rep

 >> snmp-server enable traps rtr

 >> snmp-server enable traps bridge newroot topologychange

 >> snmp-server enable traps stpx inconsistency root-inconsistency loop-inconsistency

 >> snmp-server enable traps syslog

 >> snmp-server enable traps vtp

 >> snmp-server enable traps vlancreate

 >> snmp-server enable traps vlandelete

 >> snmp-server enable traps flash insertion removal

 >> snmp-server enable traps port-security

 >> snmp-server enable traps envmon fan shutdown supply temperature status

 >> snmp-server enable traps errdisable

 >> snmp-server enable traps mac-notification change move threshold

 >> snmp-server enable traps vlan-membership

 >> snmp-server host 130.18.8.12 sysnet 

 >> line con 0

 >> line vty 0 15

 >>  access-class 1 in

 >>  password W2w1cD0mIliG!

 >>  login local

 >>  transport input ssh

 >> ntp clock-period 22519226

 >> ntp server 10.92.0.5

 >> 

 >> end

Expect: searching for 1 strs:  :Configured
 << no service pad
Switch(config)#service timestamps debug datetime localtime
Switch(config)#service timestamps log datetime localtime
Switch(config)#service password-encryption
Switch(config)#boot-start-marker
Switch(config)#boot-end-marker
Switch(conf
 << ig)#enable secret W2w1cD0mIliG!
Switch(config)#enable password W2w1cD0mIliG!
The enable password you have chosen is the same as your enable secret.
This is not recommended.  Re-enter the enable password.

Switch(config)#username root privilege 15 sec
 << ret W2w1cD0mIliG!
Switch(config)#no aaa new-model
Switch(config)#clock timezone CST -6
Switch(config)#clock summer-time CDT recurring
Switch(config)#authentication mac-move permit
Switch(config)#ip domain-name mgmt.msstate.edu
Switch(config)#ip name
 << -server 130.18.80.12
Switch(config)#vtp domain vtp01.mgmt.msstate.edu
Domain name already set to vtp01.mgmt.msstate.edu.
Switch(config)#vtp mode client
Device mode already VTP Client for VLANS.
Switch(config)#crypto pki trustpoint TP-self-signed-2494
 << 998912
Switch(ca-trustpoint)#
*Jan  1 19:17:45: %SYS-6-CLOCKUPDATE: System clock has been updated from 01:17:45 UTC Mon Jan 2 2006 to 19:17:45 CST Sun Jan 1 2006, configured from console by console.
*Jan  1 19:17:45: %SYS-6-CLOCKUPDATE: System clock ha
 << s been updated from 19:17:45 CST Sun Jan 1 2006 to 19:17:45 CST Sun Jan 1 2006, configured from console by console. enrollment selfsigned
Switch(ca-trustpoint)# subject-name cn=IOS-Self-Signed-Certificate-2494998912
Switch(ca-trustpoint)# revocation-che
 << ck none
Switch(ca-trustpoint)# rsakeypair TP-self-signed-2494998912
Switch(ca-trustpoint)#crypto pki certificate chain TP-self-signed-2494998912
Switch(config-cert-chain)# certificate self-signed 01 nvram:IOS-Self-Sig#3232
 << $e self-signed 01 nvram:IOS-Self-Sig#3232.         cer
Switch(config-cert-chain)#spanning-tree portfast bpduguard default
Switch(config)#spanning-tree extend system-id
Switch(config)#vlan internal allocation policy ascendi
 << ng
Switch(config)#errdisable recovery cause all
Switch(config)#errdisable recovery interval 1800
Switch(config)#interface FastEthernet0
Switch(config-if)# no ip address
Switch(config-if)# shutdown
Switch(config-if)#interface Vlan1
Switch(config-if)
 << # no ip address
Switch(config-if)# no ip route-cache
Switch(config-if)# shutdown
Switch(config-if)#interface Vlan92
Switch(config-if)#no ip http server
Switch(config)#no ip http secure-server
Switch(config)#ip sla enable reaction-alerts
           
 <<            ^
% Invalid input detected at '^' marker.

Switch(config)#logging facility local1
Switch(config)#logging host 130.18.8.12
Switch(config)#access-list 1 permit 10.92.0.0 0.0.255.255
Switch(config)#access-list 1 permit 130.18.8.0 0.0.0.255

 << Switch(config)#access-list 1 permit 10.93.0.0 0.0.255.255
Switch(config)#access-list 1 permit 130.18.1.0 0.0.0.2
*Jan  1 19:17:50: %LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan92, changed state to down
*Jan  1 19:17:51: %LINK-5-CHANGED: Interfac
 << e FastEthernet0, changed state to administratively down
*Jan  1 19:17:52: %LINK-5-CHANGED: Interface Vlan1, changed state to administratively down55
Switch(config)#snmp-server community sysnet RO 1
Switch(config)#snmp-server community c2-b2=a2 RW 1
Sw
 << itch(config)#snmp-server enable traps snmp authentication linkdown linkup c$ enable traps snmp authentication linkdown linkup co         ldstart w
 << aps snmp authentication linkdown linkup coldstart wa         rmstart
Switch(config)#snmp-server enable traps transceiver all
Switch(config)#
*Jan  1 19:17:52: %SYS-6-LOGGINGHOST_STARTSTOP: Logging to host 130.18.8.12 por
 << t 514 started - CLI initiatedsnmp-server enable traps tty
Switch(config)#snmp-server enable traps cluster
Switch(config)#snmp-server enable traps config-copy
Switch(config)#snmp-server enable traps config
Switch(config)#snmp-server enable traps config
 << -ctid
Switch(config)#snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-au$ enable traps dot1x auth-fail-vlan guest-vlan no-aut         h-fail-vl
 << aps dot1x auth-fail-vlan guest-vlan no-auth-fail-vla         n no-guesuth-fail-vlan guest-vlan no-auth-fail-vlan no-guest         -vlan
Switch(c
 << onfig)#snmp-server enable traps entity
Switch(config)#snmp-server enable traps power-ethernet group 1
Group 1 is not inline power capable.

Switch(config)#snmp-server enable traps power-ethernet police
Switch(config)#snmp-server enable traps cpu thre
 << shold
Switch(config)#snmp-server enable traps rep
Switch(config)#snmp-server enable traps rtr
                                         ^
% Invalid input detected at '^' marker.

Switch(config)#snmp-server enable traps bridge newroot topologychange

 << Switch(config)#snmp-server enable traps stpx inconsistency root-inconsistency$ enable traps stpx inconsistency root-inconsistency          loop-inco
 << aps stpx inconsistency root-inconsistency loop-incon         sistency
Switch(config)#snmp-server enable traps syslog
Switch(config)#snmp-server enable traps vtp
Switch(config)#snmp-server enable traps vlancreate
Switc
 << h(config)#snmp-server enable traps vlandelete
Switch(config)#snmp-server enable traps flash insertion removal
Switch(config)#snmp-server enable traps port-security
Switch(config)#snmp-server enable traps envmon fan shutdown supply temperatur
 << $ enable traps envmon fan shutdown supply temperature          status
Switch(config)#snmp-server enable traps errdisable
Switch(config)#snmp-server enable traps mac-notification change move thr
 << eshol$ enable traps mac-notification change move threshold         
Switch(config)#snmp-server enable traps vlan-membership
Switch(config)#snmp-server host 130.18.8.12 sysnet 
Switc
 << h(config)#line con 0
Switch(config-line)#line vty 0 15
Switch(config-line)# access-class 1 in
Switch(config-line)# password W2w1cD0mIliG!
Switch(config-line)# login local
Switch(config-line)# transport input ssh
Switch(config-line)#ntp clock-period 
 << 22519226
%NTP: This configuration command is depreceated.
Switch(config)#ntp server 10.92.0.5
Switch(config)#
Switch(config)#end
Switch#
 << 
 << 
*Jan  1 19:18:01: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
Switch#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
Expect: matched string 1: (config)#
 >> spanning-tree mode mst

 >> spanning-tree etherchannel guard misconfig

 >> spanning-tree mst configuration

 >>  name msstate

 >>  revision 1

 >>  instance 1 vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 63, 70

 >>  instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 160

 >>  instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 230, 232, 242, 246

 >>  instance 1 vlan 256, 611-612, 654, 741, 996, 999

 >>  instance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037, 2039-2040

 >>  instance 2 vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096, 2104, 2110, 2126

 >>  instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 2189, 2194, 2202

 >>  instance 2 vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 2654, 2999

 >>  instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176, 196

 >>  instance 3 vlan 244, 248, 927

 >>  instance 4 vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072, 2108, 2113, 2128

 >>  instance 4 vlan 2144, 2176, 2196, 2244, 2248, 2927

 >>  instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 228

 >>  instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216, 2228

 >>  instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116, 124

 >>  instance 7 vlan 172, 186, 192, 204-208, 210, 240-241, 251-252, 630, 928

 >>  instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082, 2084

 >>  instance 8 vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208, 2210

 >>  instance 8 vlan 2240-2241, 2251-2252, 2630, 2928

 >>  instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102, 112

 >>  instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 500, 505, 510-511

 >>  instance 9 vlan 522, 551-570, 603, 629, 633, 742, 802, 926, 929

 >>  instance 10 vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 2057, 2062, 2068

 >>  instance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148, 2158

 >>  instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522, 2603, 2629, 2633

 >>  instance 10 vlan 2802, 2926, 2929

 >>  instance 11 vlan 8, 43, 52, 146, 156-157, 180, 200, 218

 >>  instance 12 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180, 2200, 2218

 >> 

 >> end

Expect: searching for 1 strs:  :Configured
 << spanning-tree mode mst
Switch(config)#spanning-tree etherchannel guard misconfig
Switch(config)#spanning-tree mst configuration
Switch(config-mst)# name msstate
Switch(config-mst)# revision 1
Switch(config-mst)# instance 1 vlan 2, 7, 11, 20, 22, 24, 
 << 31, 35, 37, 39-40, $ vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40, 5         0, 60, 63, 11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 
 << 63,          70
Switch(config-mst)# instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 1$ vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 14         0, 152, 1
 << 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 16         0
Switch(config-mst)# instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 23$ vlan 162-1
 << 63, 168, 189, 194, 202, 220, 222, 230         , 232, 24163, 168, 189, 194, 202, 220, 222, 230, 232, 242         , 246
Switch(config-mst)# instance 1 vlan 256, 611-612, 654, 741, 9
 << 96, 999
Switch(config-mst)# instance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031,$ vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031,          2035, 203
 << , 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037         , 2039-2011, 2020, 2022, 2024, 2031, 2035, 2037, 2039-204         0
Switch(config-mst)# instance 2 v
 << lan 2050, 2060, 2063, 2070, 2080, 2086, 2096,$ vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096,          2104, 211, 2060, 2063, 2070,
 <<  2080, 2086, 2096, 2104, 2110         , 2126
Switch(config-mst)# instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, $ vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 2         
 << 189, 2194, 2140, 2152, 2160, 2162-2163, 2168, 2189, 2194,          2202
Switch(config-mst)# instance 2 vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 
 << $ vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 2         654, 2999
Switch(config-mst)# instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128$ vlan 42, 51, 59, 64
 << , 66, 69, 72, 108, 113, 128,          144, 17651, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176,          196
Switch(config-mst)# instance 3 vlan 244, 248, 927
Switch(config-mst)# 
 << instance 4 vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072,$ vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072,          2108, 211, 2051,
 <<  2059, 2064, 2066, 2069, 2072, 2108, 2113         , 2128
Switch(config-mst)# instance 4 vlan 2144, 2176, 2196, 2244, 2248, 2927
Switch(config-mst)# instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 2
 << $ vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 22         8
Switch(config-mst)# instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-$ vlan 2016, 2048, 2058, 2088, 
 << 2121, 2131, 2133-2         134, 2216, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216,          2228
Switch(config-mst)# instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97,
 << $ vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97,          114, 116,3-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116,          1
 << 24
Switch(config-mst)# instance 7 vlan 172, 186, 192, 204-208, 210, 240-241, 251$ vlan 172, 186, 192, 204-208, 210, 240-241, 251-         252, 630,
 << 186, 192, 204-208, 210, 240-241, 251-252, 630,          928
Switch(config-mst)# instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, $ vlan 2009, 2033-2034, 2038, 2054
 << , 2056, 2071, 2         075, 2082, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082,          2084
Switch(config-mst)# instance 8 vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192,
 << $ vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192,          2204-2208, 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208,          221
 << 0
Switch(config-mst)# instance 8 vlan 2240-2241, 2251-2252, 2630, 2928
Switch(config-mst)# instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 9$ vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 
 << 98         -99, 102,12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102,          112
Switch(config-mst)# instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 50
 << $ vlan 130, 132, 147-148, 158, 212, 226, 236, 500         , 505, 51132, 147-148, 158, 212, 226, 236, 500, 505, 510         -511
Switch(config-mst
 << )# instance 9 vlan 522, 551-570, 603, 629, 633, 742, 802, 92$ vlan 522, 551-570, 603, 629, 633, 742, 802, 926         , 929
Switch(config-mst)# instance 10 vlan 2004-2005, 2012, 2018-2019
 << , 2032, 2044, $0 vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 2         057, 20624-2005, 2012, 2018-2019, 2032, 2044, 2057, 2062,  
 <<         2068
Switch(config-mst)# instance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132,$0 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132,          2147-2148
 << 6, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148,          2158
Switch(config-mst)# instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522,$0 vlan 221
 << 2, 2236, 2500, 2505, 2510-2511, 2522,          2603, 2622, 2236, 2500, 2505, 2510-2511, 2522, 2603, 2629         , 2633
Switch(config-mst)# instance 10 vlan 2802, 2926, 2929
Swit
 << ch(config-mst)# instance 11 vlan 8, 43, 52, 146, 156-157, 180, 200, 218
Switch(config-mst)# instance 12 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180,$2 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180
 << ,          2200, 2218, 2043, 2052, 2146, 2156-2157, 2180, 2200, 2218         
Switch(config-mst)#
Switch(config-mst)#end
Switch#
 << 
*Jan  1 19:18:17: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
Switch#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
Expect: matched string 1: (config)#
 >> hostname c29s1.f1.edwards 

Expect: searching for 2 strs:  :# :>
 << hostname c29s1.f1.edwards 
c29s1.f1.edwards(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s1.f1.edwards#
 << 
*Jan  1 19:18:24: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1.f1.edwards#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1.f1.edwards(config)#
Expect: matched string 1: (config)#
 >> snmp-server contact 6F-1619

Expect: searching for 1 strs:  :#
 << snmp-server contact 6F-1619
c29s1.f1.edwards(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s1.f1.edwards#
 << 
*Jan  1 19:18:30: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1.f1.edwards#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1.f1.edwards(config)#
Expect: matched string 1: (config)#
 >> interface vlan 92

Expect: searching for 1 strs:  :(config-if)#
 << interface vlan 92
c29s1.f1.edwards(config-if)#
Expect: matched string 1: (config-if)#
 >> ip address 10.92.6.10 255.255.0.0

 >> ip broadcast-address 10.92.255.255

 >> end

Expect: searching for 1 strs:  :Configured
 << ip address 10.92.6.10 255.255.0.0
c29s1.f1.edwards(config-if)#ip broadcast-address 10.92.255.255
c29s1.f1.edwards(config-if)#end
c29s1.f1.edwards#
 << 
*Jan  1 19:18:36: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1.f1.edwards#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1.f1.edwards(config)#
Expect: matched string 1: (config)#
 >> interface Vlan92

Expect: searching for 1 strs:  :(config-if)#
 << interface Vlan92
c29s1.f1.edwards(config-if)#
Expect: matched string 1: (config-if)#
 >> ip default-gateway 10.92.0.1

 >> end

Expect: searching for 1 strs:  :Configured
 << ip default-gateway 10.92.0.1
c29s1.f1.edwards(config)#end
c29s1.f1.edwards#
*Jan  1 19:18:42: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1.f1.edwards#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1.f1.edwards(config)#
Expect: matched string 1: (config)#
 >> ip dhcp snooping

Expect: searching for 1 strs:  :#
 << ip dhcp snooping
c29s1.f1.edwards(config)#
Expect: matched string 1: #
 >> ip dhcp snooping vlan 108

Expect: searching for 1 strs:  :#
 << ip dhcp snooping vlan 108
c29s1.f1.edwards(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s1.f1.edwards#
*Jan  1 19:18:49: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1.f1.edwards#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1.f1.edwards(config)#
Expect: matched string 1: (config)#
 >> default interface range gi1/0/1 - 24 

 >> interface range gi1/0/1 - 24 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi1/0/1 - 24 
c29s1.f1.edwards(config)#interface range gi1/0/1 - 24 
c29s1.f1.edwards(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport access vlan 108

 >> switchport mode access

 >> spanning-tree portfast

 >> switchport port-security maximum 2

 >> switchport port-security

 >> switchport port-security aging time 15

 >> switchport port-security violation protect

 >> switchport port-security aging type inactivity

 >> power inline never

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport access vlan 108
c29s1.f1.edwards(config-if-range)#switchport mode access
c29s1.f1.edwards(config-if-range)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, concentrators
 << , switches, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast will be configured in 24 interfaces due to the range command 
 but will only have effect when the interfaces ar
 << e in a non-trunking mode.
c29s1.f1.edwards(config-if-range)#switchport port-security maximum 2
c29s1.f1.edwards(config-if-range)#switchport port-security
c29s1.f1.edwards(config-if-range)#switchport port-security aging time 15
c29s1.f1.edwards(config-
 << if-range)#switchport port-security violation protect
c29s1.f1.edwards(config-if-range)#switchport port-security aging type inactiv$port-security aging type inactivi         ty
c29s1.f1.edwards(config-i
 << f-range)#power inline never
                                   ^
% Invalid input detected at '^' marker.

c29s1.f1.edwards(config-if-range)#end
c29s1.f1.edwards#
 << 
*Jan  1 19:18:57: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1.f1.edwards#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1.f1.edwards(config)#
Expect: matched string 1: (config)#
 >> default interface gi1/0/24 

 >> interface gi1/0/24 

Expect: searching for 1 strs:  :(config-if)#
 << default interface gi1/0/24 
Interface GigabitEthernet1/0/24 set to default configuration
c29s1.f1.edwards(config)#interface gi1/0/24 
c29s1.f1.edwards(config-if)#
Expect: matched string 1: (config-if)#
 >> switchport mode trunk

 >> switchport trunk native vlan 92

 >> ip dhcp snooping trust

 >> no keepalive

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport mode trunk
c29s1.f1.edwards(config-if)#switchport trunk native vlan 92
c29s1.f1.edwards(config-if)#ip dhcp snooping trust
c29s1.f1.edwards(config-if)#no keepalive
c29s1.f1.edwards(config-if)#end
c29s1.f1.edwards#
 << 
*Jan  1 19:19:04: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1.f1.edwards#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1.f1.edwards(config)#
Expect: matched string 1: (config)#
 >> default interface range gi1/0/25 - 28 

 >> interface range gi1/0/25 - 28 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi1/0/25 - 28 
c29s1.f1.edwards(config)#interface range gi1/0/25 - 28 
c29s1.f1.edwards(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport mode trunk

 >> switchport trunk native vlan 92

 >> ip dhcp snooping trust

 >> no keepalive

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport mode trunk
c29s1.f1.edwards(config-if-range)#switchport trunk native vlan 92
c29s1.f1.edwards(config-if-range)#ip dhcp snooping trust
c29s1.f1.edwards(config-if-range)#no keepalive
c29s1.f1.edwards(config-if-range)#end
c29s1.f1.edwards#
 << 
*Jan  1 19:19:10: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1.f1.edwards#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1.f1.edwards(config)#
Expect: matched string 1: (config)#
 >> crypto key generate rsa

 >> no

 >> 2048

Expect: searching for 2 strs:  :OK :(config)#
 << crypto key generate rsa
The name for the keys will be: c29s1.f1.edwards.mgmt.msstate.edu
Choose the size of the key modulus in the range of 360 to 4096 for your
  General Purpose Keys. Choosing a key modulus greater than 512 may take
  a few minutes.
 << 

How many bits in the modulus [512]: no
% A decimal number between 360 and 4096.
How many bits in the modulus [512]: 2048
% Generating 2048 bit RSA keys, keys will be non-exportable...
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...
crypto key generate rsa
The name for the keys will be: c29s1.f1.edwards.mgmt.msstate.edu
Choose the size of the key modulus in the range of 360 to 4096 for your
  General Purpose Keys. Choosing a key modulus greater than 512 may take
  a few minutes.

How many bits in the modulus [512]: no
% A decimal number between 360 and 4096.
How many bits in the modulus [512]: 2048
% Generating 2048 bit RSA keys, keys will be non-exportable...
...

 >> end

Expect: searching for 1 strs:  :Configured
 << 
 << 
 << 
 << 
 << 
 << 
 << 
[OK] (elapsed time was 18 seconds)

c29s1.f1.edwards(config)#end
c29s1.f1.edwards#
*Jan  1 19:19:32: %SSH-5-ENABLED: SSH 1.99 has been enabled
*Jan  1 19:19:33: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> write mem

Expect: searching for 2 strs:  :# :>
 << 
c29s1.f1.edwards#write mem
Building configuration...
[OK]
c29s1.f1.edwards#
Expect: matched string 1: #
 >> 
Expect: searching for 2 strs:  :# :>
 << 
c29s1.f1.edwards#
c29s1.f1.edwards#
Expect: matched string 1: #
 >> sh run

Expect: searching for 2 strs:  :# :>
 << sh run
Building configuration...

Current configuration : 13471 bytes
!
! Last configuration change at 19:19:33 CST Sun Jan 1 2006
!
version 15.0
no service pad
service timestamps debug datetime localtime
service timestamps log datetime localtim
 << e
service password-encryption
!
hostname c29s1.f1.edwards
!
boot-start-marker
boot-end-marker
!
enable secret 5 $1$6qIH$ydfGvOrnMXPMzIBeBlMSj0
enable password 7 0231564C5A052B71416705102256
!
username root privilege 15 secret 5 $1$p0CF$on4sM8o2
 << 2.hQUh/n9jwvR/
no aaa new-model
clock timezone CST -6 0
clock summer-time CDT recurring
switch 1 provision ws-c2960s-24ts-l
authentication mac-move permit
!
!
ip dhcp snooping vlan 108
ip dhcp snooping
ip domain-name mgmt.msstate.edu
ip name-se
 << rver 130.18.80.12
!
!
crypto pki trustpoint TP-self-signed-2494998912
 enrollment selfsigned
 subject-name cn=IOS-Self-Signed-Certificate-2494998912
 revocation-check none
 rsakeypair TP-self-signed-2494998912
!
!
crypto pki certificate chain TP
 << -self-signed-2494998912
 certificate self-signed 01
  	quit
!
spanning-tree mode mst
spanning-tree portfast bpduguard default
spanning-tree extend system-id
!
spanning-tree mst configuration
 name msstate
 revision 1
 instance 1 vlan 2, 7, 11, 
 << 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 63, 70
 instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 160
 instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 230, 232, 242, 246
 instance 1 vlan 256, 611-612, 654, 741, 996, 999
 instance
 <<  2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037, 2039-2040
 instance 2 vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096, 2104, 2110, 2126
 instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 2189, 2194, 2202
 instance 2 vlan 2220, 2222, 
 << 2232, 2242, 2246, 2611-2612, 2654, 2999
 instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176, 196
 instance 3 vlan 244, 248, 927
 instance 4 vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072, 2108, 2113, 2128
 instance 4 vlan 2144, 2176, 2
 << 196, 2244, 2248, 2927
 instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 228
 instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216, 2228
 instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116, 124
 instance 7 vlan 172
 << , 186, 192, 204-208, 210, 240-241, 251-252, 630, 928
 instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082, 2084
 instance 8 vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208, 2210
 instance 8 vlan 2240-2241, 2251-2252, 2630, 2928
 << 
 instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102, 112
 instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 500, 505, 510-511
 instance 9 vlan 522, 551-570, 603, 629, 633, 742, 802, 926, 929
 instance 10 vlan 2004-2005, 2012, 201
 << 8-2019, 2032, 2044, 2057, 2062, 2068
 instance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148, 2158
 instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522, 2603, 2629, 2633
 instance 10 vlan 2802, 2926, 2929
 instance 11 vlan 8, 43, 52,
 <<  146, 156-157, 180, 200, 218
 instance 12 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180, 2200, 2218
!
!
!
!
!
!
errdisable recovery cause udld
errdisable recovery cause bpduguard
errdisable recovery cause security-violation
errdisable recovery c
 << ause channel-misconfig (STP)
errdisable recovery cause pagp-flap
errdisable recovery cause dtp-flap
errdisable recovery cause link-flap
errdisable recovery cause sfp-config-mismatch
errdisable recovery cause gbic-invalid
errdisable recovery cause ps
 << ecure-violation
errdisable recovery cause port-mode-failure
errdisable recovery cause dhcp-rate-limit
errdisable recovery cause pppoe-ia-rate-limit
errdisable recovery cause mac-limit
errdisable recovery cause vmps
errdisable recovery cause storm-co
 << ntrol
errdisable recovery cause inline-power
errdisable recovery cause arp-inspection
errdisable recovery cause loopback
errdisable recovery cause small-frame
errdisable recovery cause psp
errdisable recovery interval 1800
!
!
!
!
vlan internal
 <<  allocation policy ascending
!
!
! 
!
!
!
!
!
!
!
!
interface FastEthernet0
 no ip address
 shutdown
!
interface GigabitEthernet1/0/1
 switchport access vlan 108
 switchport mode access
 switchport port-security maximum 2
 switchport p
 << ort-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/2
 switchport access vlan 108
 switchport mode 
 << access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEth
 << ernet1/0/3
 switchport access vlan 108
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-
 << security
 spanning-tree portfast
!
interface GigabitEthernet1/0/4
 switchport access vlan 108
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchp
 << ort port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/5
 switchport access vlan 108
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation 
 << protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/6
 switchport access vlan 108
 switchport mode access
 switchport por
 << t-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/7
 switchport
 <<  access vlan 108
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tre
 << e portfast
!
interface GigabitEthernet1/0/8
 switchport access vlan 108
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging
 <<  type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/9
 switchport access vlan 108
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport po
 << rt-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/10
 switchport access vlan 108
 switchport mode access
 switchport port-security maximum 2

 <<  switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/11
 switchport access vlan 108
 sw
 << itchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interf
 << ace GigabitEthernet1/0/12
 switchport access vlan 108
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 s
 << witchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/13
 switchport access vlan 108
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging t
 << ime 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/14
 switchport access vlan 108
 switchport mode access
 switchport port-security maximum 2
 switchport port-se
 << curity violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/15
 switchport access vlan 108
 switchport mode acces
 << s
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet
 << 1/0/16
 switchport access vlan 108
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-secu
 << rity
 spanning-tree portfast
!
interface GigabitEthernet1/0/17
 switchport access vlan 108
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport
 <<  port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/18
 switchport access vlan 108
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation pr
 << otect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/19
 switchport access vlan 108
 switchport mode access
 switchport port
 << -security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/20
 switchport
 <<  access vlan 108
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tre
 << e portfast
!
interface GigabitEthernet1/0/21
 switchport access vlan 108
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security agin
 << g type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/22
 switchport access vlan 108
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport 
 << port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/23
 switchport access vlan 108
 switchport mode access
 switchport port-security maximum 2
 << 
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/24
 switchport trunk native vlan 
 << 92
 switchport mode trunk
 no keepalive
 ip dhcp snooping trust
!
interface GigabitEthernet1/0/25
 switchport trunk native vlan 92
 switchport mode trunk
 ip dhcp snooping trust
!
interface GigabitEthernet1/0/26
 switchport trunk native vlan 92
 << 
 switchport mode trunk
 ip dhcp snooping trust
!
interface GigabitEthernet1/0/27
 switchport trunk native vlan 92
 switchport mode trunk
 ip dhcp snooping trust
!
interface GigabitEthernet1/0/28
 switchport trunk native vlan 92
 switchport mod
 << e trunk
 ip dhcp snooping trust
!
interface Vlan1
 no ip address
 no ip route-cache
 shutdown
!
interface Vlan92
 ip address 10.92.6.10 255.255.0.0
 ip broadcast-address 10.92.255.255
!
ip default-gateway 10.92.0.1
no ip http server
no ip ht
 << tp secure-server
!
logging facility local1
logging host 130.18.8.12
access-list 1 permit 10.92.0.0 0.0.255.255
access-list 1 permit 130.18.8.0 0.0.0.255
access-list 1 permit 10.93.0.0 0.0.255.255
access-list 1 permit 130.18.1.0 0.0.0.255
!
snmp-s
 << erver community sysnet RO 1
snmp-server community c2-b2=a2 RW 1
snmp-server contact 6F-1619
snmp-server enable traps snmp authentication linkdown linkup coldstart warmstart
snmp-server enable traps transceiver all
snmp-server enable traps tty
snmp-s
 << erver enable traps cluster
snmp-server enable traps config-copy
snmp-server enable traps config
snmp-server enable traps config-ctid
snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-auth-fail-vlan no-guest-vlan
snmp-server enable traps ent
 << ity
snmp-server enable traps power-ethernet police
snmp-server enable traps cpu threshold
snmp-server enable traps rep
snmp-server enable traps bridge newroot topologychange
snmp-server enable traps stpx inconsistency root-inconsistency loop-inconsis
 << tency
snmp-server enable traps vtp
snmp-server enable traps vlancreate
snmp-server enable traps vlandelete
snmp-server enable traps flash insertion removal
snmp-server enable traps port-security
snmp-server enable traps envmon fan shutdown supply te
 << mperature status
snmp-server enable traps errdisable
snmp-server enable traps mac-notification change move threshold
snmp-server enable traps vlan-membership
snmp-server host 130.18.8.12 sysnet 
!
!
line con 0
line vty 0 4
 access-class 1 in
 pa
 << ssword 7 1420401C5D070E7B29013F3C0552
 login local
 transport input ssh
line vty 5 15
 access-class 1 in
 password 7 1420401C5D070E7B29013F3C0552
 login local
 transport input ssh
!
ntp server 10.92.0.5
end

c29s1.f1.edwards#
Expect: matched string 1: #
 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1.f1.edwards(config)#
Expect: matched string 1: (config)#
 >> no service pad

 >> service timestamps debug datetime localtime

 >> service timestamps log datetime localtime

 >> service password-encryption

 >> boot-start-marker

 >> boot-end-marker

 >> enable secret W2w1cD0mIliG!

 >> enable password W2w1cD0mIliG!

 >> username root privilege 15 secret W2w1cD0mIliG!

 >> no aaa new-model

 >> clock timezone CST -6

 >> clock summer-time CDT recurring

 >> authentication mac-move permit

 >> ip domain-name mgmt.msstate.edu

 >> ip name-server 130.18.80.12

 >> vtp domain vtp01.mgmt.msstate.edu

 >> vtp mode client

 >> crypto pki trustpoint TP-self-signed-2494998912

 >>  enrollment selfsigned

 >>  subject-name cn=IOS-Self-Signed-Certificate-2494998912

 >>  revocation-check none

 >>  rsakeypair TP-self-signed-2494998912

 >> crypto pki certificate chain TP-self-signed-2494998912

 >>  certificate self-signed 01 nvram:IOS-Self-Sig#3232.cer

 >> spanning-tree portfast bpduguard default

 >> spanning-tree extend system-id

 >> vlan internal allocation policy ascending

 >> errdisable recovery cause all

 >> errdisable recovery interval 1800

 >> interface FastEthernet0

 >>  no ip address

 >>  shutdown

 >> interface Vlan1

 >>  no ip address

 >>  no ip route-cache

 >>  shutdown

 >> interface Vlan92

 >> no ip http server

 >> no ip http secure-server

 >> ip sla enable reaction-alerts

 >> logging facility local1

 >> logging host 130.18.8.12

 >> access-list 1 permit 10.92.0.0 0.0.255.255

 >> access-list 1 permit 130.18.8.0 0.0.0.255

 >> access-list 1 permit 10.93.0.0 0.0.255.255

 >> access-list 1 permit 130.18.1.0 0.0.0.255

 >> snmp-server community sysnet RO 1

 >> snmp-server community c2-b2=a2 RW 1

 >> snmp-server enable traps snmp authentication linkdown linkup coldstart warmstart

 >> snmp-server enable traps transceiver all

 >> snmp-server enable traps tty

 >> snmp-server enable traps cluster

 >> snmp-server enable traps config-copy

 >> snmp-server enable traps config

 >> snmp-server enable traps config-ctid

 >> snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-auth-fail-vlan no-guest-vlan

 >> snmp-server enable traps entity

 >> snmp-server enable traps power-ethernet group 1

 >> snmp-server enable traps power-ethernet police

 >> snmp-server enable traps cpu threshold

 >> snmp-server enable traps rep

 >> snmp-server enable traps rtr

 >> snmp-server enable traps bridge newroot topologychange

 >> snmp-server enable traps stpx inconsistency root-inconsistency loop-inconsistency

 >> snmp-server enable traps syslog

 >> snmp-server enable traps vtp

 >> snmp-server enable traps vlancreate

 >> snmp-server enable traps vlandelete

 >> snmp-server enable traps flash insertion removal

 >> snmp-server enable traps port-security

 >> snmp-server enable traps envmon fan shutdown supply temperature status

 >> snmp-server enable traps errdisable

 >> snmp-server enable traps mac-notification change move threshold

 >> snmp-server enable traps vlan-membership

 >> snmp-server host 130.18.8.12 sysnet 

 >> line con 0

 >> line vty 0 15

 >>  access-class 1 in

 >>  password W2w1cD0mIliG!

 >>  login local

 >>  transport input ssh

 >> ntp clock-period 22519226

 >> ntp server 10.92.0.5

 >> 

 >> end

Expect: searching for 1 strs:  :Configured
 << no service pad
c29s1.f1.edwards(config)#service timestamps debug datetime localtime
c29s1.f1.edwards(config)#service timestamps log datetime localtime
c29s1.f1.edwards(config)#service password-encryption
c29s1.f1.edwards(config)#boot-start-marker
c29
 << s1.f1.edwards(config)#boot-end-marker
c29s1.f1.edwards(config)#enable secret W2w1cD0mIliG!
The enable secret you have chosen is the same as your enable password.
This is not recommended.  Re-enter the enable secret.

c29s1.f1.edwards(config)#enable p
 << assword W2w1cD0mIliG!
The enable password you have chosen is the same as your enable secret.
This is not recommended.  Re-enter the enable password.

c29s1.f1.edwards(config)#username root privilege 15 secret W2w1cD0mIliG!
c29s1.f1.edwards(config)#no
 <<  aaa new-model
c29s1.f1.edwards(config)#clock timezone CST -6
c29s1.f1.edwards(config)#clock summer-time CDT recurring
c29s1.f1.edwards(config)#authentication mac-move permit
c29s1.f1.edwards(config)#ip domain-name mgmt.msstate.edu
c29s1.f1.edwards(c
 << onfig)#ip name-server 130.18.80.12
c29s1.f1.edwards(config)#vtp domain vtp01.mgmt.msstate.edu
Domain name already set to vtp01.mgmt.msstate.edu.
c29s1.f1.edwards(config)#vtp mode client
Device mode already VTP Client for VLANS.
c29s1.f1.edwards(confi
 << g)#crypto pki trustpoint TP-self-signed-2494998912
c29s1.f1.edwards(ca-trustpoint)# enrollment selfsigned
c29s1.f1.edwards(ca-trustpoint)# subject-name cn=IOS-Self-Signed-Certificate-$me cn=IOS-Self-Signed-Ce
 << rtificate-2         494998912
c29s1.f1.edwards(ca-trustpoint)# revocation-check none
c29s1.f1.edwards(ca-trustpoint)# rsakeypair TP-self-signed-2494998912
c29s1.f1.edwards(ca-trustpoint)#crypto pki certificate chain TP-self-signed-2
 << $certificate chain TP-self-signed-24         94998912
c29s1.f1.edwards(config-cert-chain)# certificate self-signed 01 nvram:IOS-Sel$e self-signed 01 nvram:IOS-Self       
 <<   -Sig#3232ned 01 nvram:IOS-Self-Sig#3232.         cer
c29s1.f1.edwards(config-cert-chain)#spanning-tree portfast bpduguard default
c29s1.f1.edwards(config)#spanning-tree extend system-id
c29s1.
 << f1.edwards(config)#vlan internal allocation policy ascending
c29s1.f1.edwards(config)#errdisable recovery cause all
c29s1.f1.edwards(config)#errdisable recovery interval 1800
c29s1.f1.edwards(config)#
*Jan  1 19:20:36: % Multiple self signed certifica
 << tes in config
    certificate for trust point TP-self-signed-2494998912 ignored
interface FastEthernet0
c29s1.f1.edwards(config-if)# no ip address
c29s1.f1.edwards(config-if)# shutdown
c29s1.f1.edwards(config-if)#interface Vlan1
c29s1.f1.edwards(con
 << fig-if)# no ip address
c29s1.f1.edwards(config-if)# no ip route-cache
c29s1.f1.edwards(config-if)# shutdown
c29s1.f1.edwards(config-if)#interface Vlan92
c29s1.f1.edwards(config-if)#no ip http server
c29s1.f1.edwards(config)#no ip http secure-server

 << c29s1.f1.edwards(config)#ip sla enable reaction-alerts
                                ^
% Invalid input detected at '^' marker.

c29s1.f1.edwards(config)#logging facility local1
c29s1.f1.edwards(config)#logging host 130.18.8.12
c29s1.f1.edwards(con
 << fig)#access-list 1 permit 10.92.0.0 0.0.255.255
c29s1.f1.edwards(config)#access-list 1 permit 130.18.8.0 0.0.0.255
c29s1.f1.edwards(config)#access-list 1 permit 10.93.0.0 0.0.255.255
c29s1.f1.edwards(config)#access-list 1 permit 130.18.1.0 0.0.0.255
c
 << 29s1.f1.edwards(config)#snmp-server community sysnet RO 1
c29s1.f1.edwards(config)#snmp-server community c2-b2=a2 RW 1
c29s1.f1.edwards(config)#snmp-server enable traps snmp authentication linkdow$ ena
 << ble traps snmp authentication linkdown          linkup caps snmp authentication linkdown linkup co         ldstart wuthentication linkd
 << own linkup coldstart wa         rmstart
c29s1.f1.edwards(config)#snmp-server enable traps transceiver all
c29s1.f1.edwards(config)#snmp-server enable traps tty
c29s1.f1.edwards(config)#snmp-server enable traps cluster
c29s1.f1.edwards(config)
 << #snmp-server enable traps config-copy
c29s1.f1.edwards(config)#snmp-server enable traps config
c29s1.f1.edwards(config)#snmp-server enable traps config-ctid
c29s1.f1.edwards(config)#snmp-server enable traps dot1x auth-fail-vlan guest-
 << $ enable traps dot1x auth-fail-vlan guest-v         lan no-auaps dot1x auth-fail-vlan guest-vlan no-aut         h-fail-vl
 << uth-fail-vlan guest-vlan no-auth-fail-vla         n no-guesvlan guest-vlan no-auth-fail-vlan no-guest         -vlan
c29s1.f1.edwards(config)#snmp-server enable traps 
 << entity
c29s1.f1.edwards(config)#snmp-server enable traps power-ethernet group 1
Group 1 is not inline power capable.

c29s1.f1.edwards(config)#snmp-server enable traps power-ethernet police
c29s1.f1.edwards(config)#snmp-server enable traps cpu thresh
 << old
c29s1.f1.edwards(config)#snmp-server enable traps rep
c29s1.f1.edwards(config)#snmp-server enable traps rtr
                                                   ^
% Invalid input detected at '^' marker.

c29s1.f1.edwards(config)#snmp-server enable
 <<  traps bridge newroot topologychan$ enable traps bridge newroot topologychang         e
c29s1.f1.edwards(config)#snmp-server enable traps stpx inconsistency root-inc
 << $ enable traps stpx inconsistency root-inco         nsistencyaps stpx inconsistency root-inconsistency          loop-inco
 << nconsistency root-inconsistency loop-incon         sistency
c29s1.f1.edwards(config)#snmp-server enable traps syslog
c29s1.f1.edwards(config)#snmp-server enable traps vtp
c29s1.f1.edwards(config)#snmp-server enable traps vlancreate

 << c29s1.f1.edwards(config)#snmp-server enable traps vlandelete
c29s1.f1.edwards(config)#snmp-server enable traps flash insertion removal
c29s1.f1.edwards(config)#snmp-server enable traps port-security
c29s1.f1.edwards(config)#snmp-server enable traps env
 << mon fan shutdown supply $ enable traps envmon fan shutdown supply t         emperaturaps envmon fan shutdown supply temperature         
 <<  status
c29s1.f1.edwards(config)#snmp-server enable traps errdisable
c29s1.f1.edwards(config)#snmp-server enable traps mac-notification change mov$ enable traps mac-notification change move         
 <<  thresholaps mac-notification change move threshold         
c29s1.f1.edwards(config)#snmp-server enable traps vlan-membership
c29s1.f1.edwards(config)#snmp-server host 130.18.8.12 sysn
 << et 
c29s1.f1.edwards(config)#line con 0
c29s1.f1.edwards(config-line)#line vty 0 15
c29s1.f1.edwards(config-line)# access-class 1 in
c29s1.f1.edwards(config-line)# password W2w1cD0mIliG!
c29s1.f1.edwards(config-line)# login local
c29s1.f1.edwards(co
 << nfig-line)# transport input ssh
c29s1.f1.edwards(config-line)#ntp clock-period 22519226
%NTP: This configuration command is depreceated.
c29s1.f1.edwards(config)#ntp server 10.92.0.5
c29s1.f1.edwards(config)#
c29s1.f1.edwards(config)#end
c29s1.f1.ed
 << wards#
*Jan  1 19:20:49: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1.f1.edwards#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1.f1.edwards(config)#
Expect: matched string 1: (config)#
 >> spanning-tree mode mst

 >> spanning-tree etherchannel guard misconfig

 >> spanning-tree mst configuration

 >>  name msstate

 >>  revision 1

 >>  instance 1 vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 63, 70

 >>  instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 160

 >>  instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 230, 232, 242, 246

 >>  instance 1 vlan 256, 611-612, 654, 741, 996, 999

 >>  instance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037, 2039-2040

 >>  instance 2 vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096, 2104, 2110, 2126

 >>  instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 2189, 2194, 2202

 >>  instance 2 vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 2654, 2999

 >>  instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176, 196

 >>  instance 3 vlan 244, 248, 927

 >>  instance 4 vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072, 2108, 2113, 2128

 >>  instance 4 vlan 2144, 2176, 2196, 2244, 2248, 2927

 >>  instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 228

 >>  instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216, 2228

 >>  instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116, 124

 >>  instance 7 vlan 172, 186, 192, 204-208, 210, 240-241, 251-252, 630, 928

 >>  instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082, 2084

 >>  instance 8 vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208, 2210

 >>  instance 8 vlan 2240-2241, 2251-2252, 2630, 2928

 >>  instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102, 112

 >>  instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 500, 505, 510-511

 >>  instance 9 vlan 522, 551-570, 603, 629, 633, 742, 802, 926, 929

 >>  instance 10 vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 2057, 2062, 2068

 >>  instance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148, 2158

 >>  instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522, 2603, 2629, 2633

 >>  instance 10 vlan 2802, 2926, 2929

 >>  instance 11 vlan 8, 43, 52, 146, 156-157, 180, 200, 218

 >>  instance 12 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180, 2200, 2218

 >> 

 >> end

Expect: searching for 1 strs:  :Configured
 << spanning-tree mode mst
c29s1.f1.edwards(config)#spanning-tree etherchannel guard misconfig
c29s1.f1.edwards(config)#spanning-tree mst configuration
c29s1.f1.edwards(config-mst)# name msstate
c29s1.f1.edwards(config-mst)# revision 1
c29s1.f1.edwards(c
 << onfig-mst)# instance 1 vlan 2, 7, 11, 20, 22, 24, 31, 35, 3$ vlan 2, 7, 11, 20, 22, 24, 31, 35, 37         , 39-40, , 11, 20, 22, 24, 31, 35, 37, 39-40
 << , 5         0, 60, 6322, 24, 31, 35, 37, 39-40, 50, 60, 63,          70
c29s1.f1.edwards(config-mst)# instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 1
 << $ vlan 78, 80, 86, 91, 96, 104, 110, 12         6, 136, 180, 86, 91, 96, 104, 110, 126, 136, 14         0, 152, 1, 96, 104, 110, 126, 1
 << 36, 140, 152, 16         0
c29s1.f1.edwards(config-mst)# instance 1 vlan 162-163, 168, 189, 194, 202, 22$ vlan 162-163, 168, 189, 194, 202, 220         , 222, 23
 << 163, 168, 189, 194, 202, 220, 222, 230         , 232, 2489, 194, 202, 220, 222, 230, 232, 242         , 246
c29s1.f1.edwards(config-mst)# instance 1 vlan 256, 611-612, 65
 << 4, 741, 996, 99$ vlan 256, 611-612, 654, 741, 996, 999         
c29s1.f1.edwards(config-mst)# instance 2 vlan 2002, 2007, 2011, 2020, 2022, 2$ vlan 2
 << 002, 2007, 2011, 2020, 2022, 20         24, 2031,, 2007, 2011, 2020, 2022, 2024, 2031,          2035, 20311, 2020, 2022, 2024, 2031, 2035, 2037
 <<          , 2039-202022, 2024, 2031, 2035, 2037, 2039-204         0
c29s1.f1.edwards(config-mst)# instance 2 vlan 2050, 2060, 2063, 2070, 2080, 2
 << $ vlan 2050, 2060, 2063, 2070, 2080, 20         86, 2096,, 2060, 2063, 2070, 2080, 2086, 2096,          2104, 21163, 2070, 2080, 2086, 2096,
 <<  2104, 2110         , 2126
c29s1.f1.edwards(config-mst)# instance 2 vlan 2136, 2140, 2152, 2160, 2162-21$ vlan 2136, 2140, 2152, 2160, 2162-216         3, 2168, 
 << , 2140, 2152, 2160, 2162-2163, 2168, 2         189, 219452, 2160, 2162-2163, 2168, 2189, 2194,          2202
c29s1.f1.edwards(config-mst)# instance 2 vlan 2220, 2222, 22
 << 32, 2242, 2246, 2$ vlan 2220, 2222, 2232, 2242, 2246, 26         11-2612, , 2222, 2232, 2242, 2246, 2611-2612, 2         654, 2999
c29s1.f1.e
 << dwards(config-mst)# instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108$ vlan 42, 51, 59, 64, 66, 69, 72, 108,          113, 12851, 59, 64, 66, 69, 72, 108
 << , 113, 128,          144, 176, 66, 69, 72, 108, 113, 128, 144, 176,          196
c29s1.f1.edwards(config-mst)# instance 3 vlan 244, 248, 927
c29s1.f1.edwards(config-mst)# instance 4 vlan 2
 << 042, 2051, 2059, 2064, 2066, 2$ vlan 2042, 2051, 2059, 2064, 2066, 20         69, 2072,, 2051, 2059, 2064, 2066, 2069, 2072,          2108, 21
 << 159, 2064, 2066, 2069, 2072, 2108, 2113         , 2128
c29s1.f1.edwards(config-mst)# instance 4 vlan 2144, 2176, 2196, 2244, 2248, 2$ vlan 2144, 2176,
 <<  2196, 2244, 2248, 29         27
c29s1.f1.edwards(config-mst)# instance 5 vlan 16, 48, 58, 88, 121, 131, 133-1$ vlan 16, 48, 58, 88, 121, 131, 133-13         4, 216, 2
 << 48, 58, 88, 121, 131, 133-134, 216, 22         8
c29s1.f1.edwards(config-mst)# instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2$ vlan 2016, 2048, 2058, 2088, 2121, 21      
 <<    31, 2133-, 2048, 2058, 2088, 2121, 2131, 2133-2         134, 221658, 2088, 2121, 2131, 2133-2134, 2216,          2228
c29s1.f1.edw
 << ards(config-mst)# instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, 8$ vlan 9, 33-34, 38, 54, 56, 71, 75, 82         , 84, 97,3-34, 38, 54, 56, 71, 75, 82,
 <<  84, 97,          114, 116,54, 56, 71, 75, 82, 84, 97, 114, 116,          124
c29s1.f1.edwards(config-mst)# instance 7 vlan 172, 186, 192, 204-208, 210, 24
 << $ vlan 172, 186, 192, 204-208, 210, 240         -241, 251186, 192, 204-208, 210, 240-241, 251-         252, 630,204-208, 210, 240-2
 << 41, 251-252, 630,          928
c29s1.f1.edwards(config-mst)# instance 8 vlan 2009, 2033-2034, 2038, 2054, 20$ vlan 2009, 2033-2034, 2038, 2054, 205         6, 2071, 
 << , 2033-2034, 2038, 2054, 2056, 2071, 2         075, 20824, 2038, 2054, 2056, 2071, 2075, 2082,          2084
c29s1.f1.edwards(config-mst)# instance 8 vlan 2097, 2114
 << , 2116, 2124, 2172, 2$ vlan 2097, 2114, 2116, 2124, 2172, 21         86, 2192,, 2114, 2116, 2124, 2172, 2186, 2192,          2204-2208
 << 16, 2124, 2172, 2186, 2192, 2204-2208,          2210
c29s1.f1.edwards(config-mst)# instance 8 vlan 2240-2241, 2251-2252, 2630, 292$ vlan 2240-2241, 2251-2252,
 <<  2630, 2928         
c29s1.f1.edwards(config-mst)# instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62,$ vlan 4-5, 12, 18-19, 32, 44, 57, 62,          68, 76, 9
 << 12, 18-19, 32, 44, 57, 62, 68, 76, 98         -99, 102,, 32, 44, 57, 62, 68, 76, 98-99, 102,          112
c29s1.f1.edwards(config-mst)# instance 9 vlan 130, 132, 147-148, 158, 
 << 212, 22$ vlan 130, 132, 147-148, 158, 212, 226         , 236, 50132, 147-148, 158, 212, 226, 236, 500         , 505, 51
 << 148, 158, 212, 226, 236, 500, 505, 510         -511
c29s1.f1.edwards(config-mst)# instance 9 vlan 522, 551-570, 603, 629, 633, 74$ vlan 522, 551-570, 603, 629, 633, 742      
 <<    , 802, 92551-570, 603, 629, 633, 742, 802, 926         , 929
c29s1.f1.edwards(config-mst)# instance 10 vlan 2004-2005, 2012, 2018-2019, 20$
 << 0 vlan 2004-2005, 2012, 2018-2019, 203         2, 2044, 4-2005, 2012, 2018-2019, 2032, 2044, 2         057, 206212, 2018-2019, 2032, 2044, 2057
 << , 2062,          2068
c29s1.f1.edwards(config-mst)# instance 10 vlan 2076, 2098-2099, 2102, 2112, 2$0 vlan 2076, 2098-2099, 2102, 2112, 21         30, 2132,
 << 6, 2098-2099, 2102, 2112, 2130, 2132,          2147-214899, 2102, 2112, 2130, 2132, 2147-2148,          2158
c29s1.f1.edwards(config-mst)# instance 10 vlan 2212, 2236, 2500, 
 << 2505, 2510-2$0 vlan 2212, 2236, 2500, 2505, 2510-25         11, 2522,2, 2236, 2500, 2505, 2510-2511, 2522,          2603, 262
 << 500, 2505, 2510-2511, 2522, 2603, 2629         , 2633
c29s1.f1.edwards(config-mst)# instance 10 vlan 2802, 2926, 2929
c29s1.f1.edwards(config-mst)# instance 11 vlan 8, 43, 52, 146, 156-157, 180, 
 << $1 vlan 8, 43, 52, 146, 156-157, 180, 2         00, 218
c29s1.f1.edwards(config-mst)# instance 12 vlan 2008, 2043, 2052, 2146, 2156-2$2 vlan 2008, 2043, 2052, 2146, 215
 << 6-21         57, 2180,8, 2043, 2052, 2146, 2156-2157, 2180,          2200, 221052, 2146, 2156-2157, 2180, 2200, 2218         
c29s1.f
 << 1.edwards(config-mst)#
c29s1.f1.edwards(config-mst)#end
c29s1.f1.edwards#
 << 
*Jan  1 19:21:06: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1.f1.edwards#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1.f1.edwards(config)#
Expect: matched string 1: (config)#
 >> hostname c29s1.f1.edwards 

Expect: searching for 2 strs:  :# :>
 << hostname c29s1.f1.edwards 
c29s1.f1.edwards(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s1.f1.edwards#
 << 
*Jan  1 19:21:12: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1.f1.edwards#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1.f1.edwards(config)#
Expect: matched string 1: (config)#
 >> snmp-server contact 6F-1619

Expect: searching for 1 strs:  :#
 << snmp-server contact 6F-1619
c29s1.f1.edwards(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s1.f1.edwards#
 << 
*Jan  1 19:21:18: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1.f1.edwards#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1.f1.edwards(config)#
Expect: matched string 1: (config)#
 >> interface vlan 92

Expect: searching for 1 strs:  :(config-if)#
 << interface vlan 92
c29s1.f1.edwards(config-if)#
Expect: matched string 1: (config-if)#
 >> ip address 10.92.6.10 255.255.0.0

 >> ip broadcast-address 10.92.255.255

 >> end

Expect: searching for 1 strs:  :Configured
 << ip address 10.92.6.10 255.255.0.0
c29s1.f1.edwards(config-if)#ip broadcast-address 10.92.255.255
c29s1.f1.edwards(config-if)#end
c29s1.f1.edwards#
 << 
*Jan  1 19:21:25: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1.f1.edwards#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1.f1.edwards(config)#
Expect: matched string 1: (config)#
 >> interface Vlan92

Expect: searching for 1 strs:  :(config-if)#
 << interface Vlan92
c29s1.f1.edwards(config-if)#
Expect: matched string 1: (config-if)#
 >> ip default-gateway 10.92.0.1

 >> end

Expect: searching for 1 strs:  :Configured
 << ip default-gateway 10.92.0.1
c29s1.f1.edwards(config)#end
c29s1.f1.edwards#
*Jan  1 19:21:31: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1.f1.edwards#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1.f1.edwards(config)#
Expect: matched string 1: (config)#
 >> ip dhcp snooping

Expect: searching for 1 strs:  :#
 << ip dhcp snooping
c29s1.f1.edwards(config)#
Expect: matched string 1: #
 >> ip dhcp snooping vlan 108

Expect: searching for 1 strs:  :#
 << ip dhcp snooping vlan 108
c29s1.f1.edwards(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s1.f1.edwards#
*Jan  1 19:21:38: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1.f1.edwards#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1.f1.edwards(config)#
Expect: matched string 1: (config)#
 >> default interface range gi1/0/1 - 24 

 >> interface range gi1/0/1 - 24 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi1/0/1 - 24 
c29s1.f1.edwards(config)#interface range gi1/0/1 - 24 
c29s1.f1.edwards(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport access vlan 108

 >> switchport mode access

 >> spanning-tree portfast

 >> switchport port-security maximum 2

 >> switchport port-security

 >> switchport port-security aging time 15

 >> switchport port-security violation protect

 >> switchport port-security aging type inactivity

 >> power inline never

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport access vlan 108
c29s1.f1.edwards(config-if-range)#switchport mode access
c29s1.f1.edwards(config-if-range)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, concentrators
 << , switches, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast will be configured in 24 interfaces due to the range command 
 but will only have effect when the interfaces ar
 << e in a non-trunking mode.
c29s1.f1.edwards(config-if-range)#switchport port-security maximum 2
c29s1.f1.edwards(config-if-range)#switchport port-security
c29s1.f1.edwards(config-if-range)#switchport port-security aging time 15
c29s1.f1.edwards(config-
 << if-range)#switchport port-security violation protect
c29s1.f1.edwards(config-if-range)#switchport port-security aging type inactiv$port-security aging type inactivi         ty
c29s1.f1.edwards(config-i
 << f-range)#power inline never
                                   ^
% Invalid input detected at '^' marker.

c29s1.f1.edwards(config-if-range)#end
c29s1.f1.edwards#
 << 
*Jan  1 19:21:46: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1.f1.edwards#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1.f1.edwards(config)#
Expect: matched string 1: (config)#
 >> default interface gi1/0/24 

 >> interface gi1/0/24 

Expect: searching for 1 strs:  :(config-if)#
 << default interface gi1/0/24 
Interface GigabitEthernet1/0/24 set to default configuration
c29s1.f1.edwards(config)#interface gi1/0/24 
c29s1.f1.edwards(config-if)#
Expect: matched string 1: (config-if)#
 >> switchport mode trunk

 >> switchport trunk native vlan 92

 >> ip dhcp snooping trust

 >> no keepalive

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport mode trunk
c29s1.f1.edwards(config-if)#switchport trunk native vlan 92
c29s1.f1.edwards(config-if)#ip dhcp snooping trust
c29s1.f1.edwards(config-if)#no keepalive
c29s1.f1.edwards(config-if)#end
c29s1.f1.edwards#
 << 
*Jan  1 19:21:52: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1.f1.edwards#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1.f1.edwards(config)#
Expect: matched string 1: (config)#
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s1.f1.edwards#
 << 
*Jan  1 19:21:56: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1.f1.edwards#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1.f1.edwards(config)#
Expect: matched string 1: (config)#
 >> crypto key generate rsa

 >> no

 >> 2048

Expect: searching for 2 strs:  :OK :(config)#
 << crypto key generate rsa
% You already have RSA keys defined named c29s1.f1.edwards.mgmt.msstate.edu.
% Do you really want to replace them? [yes/no]: no
c29s1.f1.edwards(config)#2048
                         ^
% Invalid input detected at '^' marker.

Expect: matched string 2: (config)#
 >> end

Expect: searching for 1 strs:  :Configured
 << 
c29s1.f1.edwards(config)#end
c29s1.f1.edwards#
 << 
*Jan  1 19:22:01: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> write mem

Expect: searching for 2 strs:  :# :>
 << 
c29s1.f1.edwards#write mem
Building configuration...
[OK]
c29s1.f1.edwards#
Expect: matched string 1: #
 >> 
Expect: searching for 2 strs:  :# :>
 << 
c29s1.f1.edwards#
c29s1.f1.edwards#
Expect: matched string 1: #
 >> sh run

Expect: searching for 2 strs:  :# :>
 << sh run
Building configuration...

Current configuration : 13471 bytes
!
! Last configuration change at 19:22:01 CST Sun Jan 1 2006
!
version 15.0
no service pad
service timestamps debug datetime localtime
service timestamps log datetime localtim
 << e
service password-encryption
!
hostname c29s1.f1.edwards
!
boot-start-marker
boot-end-marker
!
enable secret 5 $1$fbpy$zOLQbEfw8e0.fYvMGv.OD1
enable password 7 113E4B1246112F5C0903272D0F72
!
username root privilege 15 secret 5 $1$AIKa$PguEvsLa
 << CeIzx.1lQ5Ubh0
no aaa new-model
clock timezone CST -6 0
clock summer-time CDT recurring
switch 1 provision ws-c2960s-24ts-l
authentication mac-move permit
!
!
ip dhcp snooping vlan 108
ip dhcp snooping
ip domain-name mgmt.msstate.edu
ip name-se
 << rver 130.18.80.12
!
!
crypto pki trustpoint TP-self-signed-2494998912
 enrollment selfsigned
 subject-name cn=IOS-Self-Signed-Certificate-2494998912
 revocation-check none
 rsakeypair TP-self-signed-2494998912
!
!
crypto pki certificate chain TP
 << -self-signed-2494998912
 certificate self-signed 01
  	quit
!
spanning-tree mode mst
spanning-tree portfast bpduguard default
spanning-tree extend system-id
!
spanning-tree mst configuration
 name msstate
 revision 1
 instance 1 vlan 2, 7, 11, 
 << 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 63, 70
 instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 160
 instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 230, 232, 242, 246
 instance 1 vlan 256, 611-612, 654, 741, 996, 999
 instance
 <<  2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037, 2039-2040
 instance 2 vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096, 2104, 2110, 2126
 instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 2189, 2194, 2202
 instance 2 vlan 2220, 2222, 
 << 2232, 2242, 2246, 2611-2612, 2654, 2999
 instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176, 196
 instance 3 vlan 244, 248, 927
 instance 4 vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072, 2108, 2113, 2128
 instance 4 vlan 2144, 2176, 2
 << 196, 2244, 2248, 2927
 instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 228
 instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216, 2228
 instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116, 124
 instance 7 vlan 172
 << , 186, 192, 204-208, 210, 240-241, 251-252, 630, 928
 instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082, 2084
 instance 8 vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208, 2210
 instance 8 vlan 2240-2241, 2251-2252, 2630, 2928
 << 
 instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102, 112
 instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 500, 505, 510-511
 instance 9 vlan 522, 551-570, 603, 629, 633, 742, 802, 926, 929
 instance 10 vlan 2004-2005, 2012, 201
 << 8-2019, 2032, 2044, 2057, 2062, 2068
 instance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148, 2158
 instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522, 2603, 2629, 2633
 instance 10 vlan 2802, 2926, 2929
 instance 11 vlan 8, 43, 52,
 <<  146, 156-157, 180, 200, 218
 instance 12 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180, 2200, 2218
!
!
!
!
!
!
errdisable recovery cause udld
errdisable recovery cause bpduguard
errdisable recovery cause security-violation
errdisable recovery c
 << ause channel-misconfig (STP)
errdisable recovery cause pagp-flap
errdisable recovery cause dtp-flap
errdisable recovery cause link-flap
errdisable recovery cause sfp-config-mismatch
errdisable recovery cause gbic-invalid
errdisable recovery cause ps
 << ecure-violation
errdisable recovery cause port-mode-failure
errdisable recovery cause dhcp-rate-limit
errdisable recovery cause pppoe-ia-rate-limit
errdisable recovery cause mac-limit
errdisable recovery cause vmps
errdisable recovery cause storm-co
 << ntrol
errdisable recovery cause inline-power
errdisable recovery cause arp-inspection
errdisable recovery cause loopback
errdisable recovery cause small-frame
errdisable recovery cause psp
errdisable recovery interval 1800
!
!
!
!
vlan internal
 <<  allocation policy ascending
!
!
! 
!
!
!
!
!
!
!
!
interface FastEthernet0
 no ip address
 shutdown
!
interface GigabitEthernet1/0/1
 switchport access vlan 108
 switchport mode access
 switchport port-security maximum 2
 switchport p
 << ort-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/2
 switchport access vlan 108
 switchport mode 
 << access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEth
 << ernet1/0/3
 switchport access vlan 108
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-
 << security
 spanning-tree portfast
!
interface GigabitEthernet1/0/4
 switchport access vlan 108
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchp
 << ort port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/5
 switchport access vlan 108
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation 
 << protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/6
 switchport access vlan 108
 switchport mode access
 switchport por
 << t-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/7
 switchport
 <<  access vlan 108
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tre
 << e portfast
!
interface GigabitEthernet1/0/8
 switchport access vlan 108
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging
 <<  type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/9
 switchport access vlan 108
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport po
 << rt-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/10
 switchport access vlan 108
 switchport mode access
 switchport port-security maximum 2

 <<  switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/11
 switchport access vlan 108
 sw
 << itchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interf
 << ace GigabitEthernet1/0/12
 switchport access vlan 108
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 s
 << witchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/13
 switchport access vlan 108
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging t
 << ime 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/14
 switchport access vlan 108
 switchport mode access
 switchport port-security maximum 2
 switchport port-se
 << curity violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/15
 switchport access vlan 108
 switchport mode acces
 << s
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet
 << 1/0/16
 switchport access vlan 108
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-secu
 << rity
 spanning-tree portfast
!
interface GigabitEthernet1/0/17
 switchport access vlan 108
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport
 <<  port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/18
 switchport access vlan 108
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation pr
 << otect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/19
 switchport access vlan 108
 switchport mode access
 switchport port
 << -security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/20
 switchport
 <<  access vlan 108
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tre
 << e portfast
!
interface GigabitEthernet1/0/21
 switchport access vlan 108
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security agin
 << g type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/22
 switchport access vlan 108
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport 
 << port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/23
 switchport access vlan 108
 switchport mode access
 switchport port-security maximum 2
 << 
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/24
 switchport trunk native vlan 
 << 92
 switchport mode trunk
 no keepalive
 ip dhcp snooping trust
!
interface GigabitEthernet1/0/25
 switchport trunk native vlan 92
 switchport mode trunk
 ip dhcp snooping trust
!
interface GigabitEthernet1/0/26
 switchport trunk native vlan 92
 << 
 switchport mode trunk
 ip dhcp snooping trust
!
interface GigabitEthernet1/0/27
 switchport trunk native vlan 92
 switchport mode trunk
 ip dhcp snooping trust
!
interface GigabitEthernet1/0/28
 switchport trunk native vlan 92
 switchport mod
 << e trunk
 ip dhcp snooping trust
!
interface Vlan1
 no ip address
 no ip route-cache
 shutdown
!
interface Vlan92
 ip address 10.92.6.10 255.255.0.0
 ip broadcast-address 10.92.255.255
!
ip default-gateway 10.92.0.1
no ip http server
no ip ht
 << tp secure-server
!
logging facility local1
logging host 130.18.8.12
access-list 1 permit 10.92.0.0 0.0.255.255
access-list 1 permit 130.18.8.0 0.0.0.255
access-list 1 permit 10.93.0.0 0.0.255.255
access-list 1 permit 130.18.1.0 0.0.0.255
!
snmp-s
 << erver community sysnet RO 1
snmp-server community c2-b2=a2 RW 1
snmp-server contact 6F-1619
snmp-server enable traps snmp authentication linkdown linkup coldstart warmstart
snmp-server enable traps transceiver all
snmp-server enable traps tty
snmp-s
 << erver enable traps cluster
snmp-server enable traps config-copy
snmp-server enable traps config
snmp-server enable traps config-ctid
snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-auth-fail-vlan no-guest-vlan
snmp-server enable traps ent
 << ity
snmp-server enable traps power-ethernet police
snmp-server enable traps cpu threshold
snmp-server enable traps rep
snmp-server enable traps bridge newroot topologychange
snmp-server enable traps stpx inconsistency root-inconsistency loop-inconsis
 << tency
snmp-server enable traps vtp
snmp-server enable traps vlancreate
snmp-server enable traps vlandelete
snmp-server enable traps flash insertion removal
snmp-server enable traps port-security
snmp-server enable traps envmon fan shutdown supply te
 << mperature status
snmp-server enable traps errdisable
snmp-server enable traps mac-notification change move threshold
snmp-server enable traps vlan-membership
snmp-server host 130.18.8.12 sysnet 
!
!
line con 0
line vty 0 4
 access-class 1 in
 pa
 << ssword 7 10795B0E5414365B012D26220369
 login local
 transport input ssh
line vty 5 15
 access-class 1 in
 password 7 10795B0E5414365B012D26220369
 login local
 transport input ssh
!
ntp server 10.92.0.5
end

c29s1.f1.edwards#
Expect: matched string 1: #
 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

...

 >> no service pad

 >> service timestamps debug datetime localtime

 >> service timestamps log datetime localtime

 >> service password-encryption

 >> boot-start-marker

 >> boot-end-marker

 >> enable secret W2w1cD0mIliG!

 >> enable password W2w1cD0mIliG!

 >> username root privilege 15 secret W2w1cD0mIliG!

 >> no aaa new-model

 >> clock timezone CST -6

 >> clock summer-time CDT recurring

 >> authentication mac-move permit

 >> ip domain-name mgmt.msstate.edu

 >> ip name-server 130.18.80.12

 >> vtp domain vtp01.mgmt.msstate.edu

 >> vtp mode client

 >> crypto pki trustpoint TP-self-signed-2494998912

 >>  enrollment selfsigned

 >>  subject-name cn=IOS-Self-Signed-Certificate-2494998912

 >>  revocation-check none

 >>  rsakeypair TP-self-signed-2494998912

 >> crypto pki certificate chain TP-self-signed-2494998912

 >>  certificate self-signed 01 nvram:IOS-Self-Sig#3232.cer

 >> spanning-tree portfast bpduguard default

 >> spanning-tree extend system-id

 >> vlan internal allocation policy ascending

 >> errdisable recovery cause all

 >> errdisable recovery interval 1800

 >> interface FastEthernet0

 >>  no ip address

 >>  shutdown

 >> interface Vlan1

 >>  no ip address

 >>  no ip route-cache

 >>  shutdown

 >> interface Vlan92

 >> no ip http server

 >> no ip http secure-server

 >> ip sla enable reaction-alerts

 >> logging facility local1

 >> logging host 130.18.8.12

 >> access-list 1 permit 10.92.0.0 0.0.255.255

 >> access-list 1 permit 130.18.8.0 0.0.0.255

 >> access-list 1 permit 10.93.0.0 0.0.255.255

 >> access-list 1 permit 130.18.1.0 0.0.0.255

 >> snmp-server community sysnet RO 1

 >> snmp-server community c2-b2=a2 RW 1

 >> snmp-server enable traps snmp authentication linkdown linkup coldstart warmstart

 >> snmp-server enable traps transceiver all

 >> snmp-server enable traps tty

 >> snmp-server enable traps cluster

 >> snmp-server enable traps config-copy

 >> snmp-server enable traps config

 >> snmp-server enable traps config-ctid

 >> snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-auth-fail-vlan no-guest-vlan

 >> snmp-server enable traps entity

 >> snmp-server enable traps power-ethernet group 1

 >> snmp-server enable traps power-ethernet police

 >> snmp-server enable traps cpu threshold

 >> snmp-server enable traps rep

 >> snmp-server enable traps rtr

 >> snmp-server enable traps bridge newroot topologychange

 >> snmp-server enable traps stpx inconsistency root-inconsistency loop-inconsistency

 >> snmp-server enable traps syslog

 >> snmp-server enable traps vtp

 >> snmp-server enable traps vlancreate

 >> snmp-server enable traps vlandelete

 >> snmp-server enable traps flash insertion removal

 >> snmp-server enable traps port-security

 >> snmp-server enable traps envmon fan shutdown supply temperature status

 >> snmp-server enable traps errdisable

 >> snmp-server enable traps mac-notification change move threshold

 >> snmp-server enable traps vlan-membership

 >> snmp-server host 130.18.8.12 sysnet 

 >> line con 0

 >> line vty 0 15

 >>  access-class 1 in

 >>  password W2w1cD0mIliG!

 >>  login local

 >>  transport input ssh

 >> ntp clock-period 22519226

 >> ntp server 10.92.0.5

 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

...

 >> spanning-tree mode mst

 >> spanning-tree etherchannel guard misconfig

 >> spanning-tree mst configuration

 >>  name msstate

 >>  revision 1

 >>  instance 1 vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 63, 70

 >>  instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 160

 >>  instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 230, 232, 242, 246

 >>  instance 1 vlan 256, 611-612, 654, 741, 996, 999

 >>  instance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037, 2039-2040

 >>  instance 2 vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096, 2104, 2110, 2126

 >>  instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 2189, 2194, 2202

 >>  instance 2 vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 2654, 2999

 >>  instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176, 196

 >>  instance 3 vlan 244, 248, 927

 >>  instance 4 vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072, 2108, 2113, 2128

 >>  instance 4 vlan 2144, 2176, 2196, 2244, 2248, 2927

 >>  instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 228

 >>  instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216, 2228

 >>  instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116, 124

 >>  instance 7 vlan 172, 186, 192, 204-208, 210, 240-241, 251-252, 630, 928

 >>  instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082, 2084

 >>  instance 8 vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208, 2210

 >>  instance 8 vlan 2240-2241, 2251-2252, 2630, 2928

 >>  instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102, 112

 >>  instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 500, 505, 510-511

 >>  instance 9 vlan 522, 551-570, 603, 629, 633, 742, 802, 926, 929

 >>  instance 10 vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 2057, 2062, 2068

 >>  instance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148, 2158

 >>  instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522, 2603, 2629, 2633

 >>  instance 10 vlan 2802, 2926, 2929

 >>  instance 11 vlan 8, 43, 52, 146, 156-157, 180, 200, 218

 >>  instance 12 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180, 2200, 2218

 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 <<     
 << 
 <<  id iu
 <<  
 << 
 << 
 << c
 <<   '^' 
 << 
 << 
 << ker.91
 << 
 << >e
 << 
 << 
 << 
 << 
 << 
 << 
 << e r
 << 
 << 
 << 
 << e
 << 
 << 
 << 
 << 
 << se al
 <<  
 <<   
 <<  
 <<  
 <<   
 << 
 << 
 << 
 << 
 << 
 << I
 << v
 << id
 << 
 << 
 << 
 << 
 << 
 << ec
 << 
 << 
 << 
 << 
 << 
 << '
 << 
 << 
 << 
 << 
 << s
 << 
 << .e
 << 
 << 
 << 
 << 
 << 
 << 
 << d
 << 
 << 
 << 
 << 
 << c
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 <<  
 << 0
 
 <<    
 << 
 << 
 <<  
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << Iv
 << 
 << i
 << 
 << 
 << 
 << p
 << 
 <<  d
 << 
 << 
 << cte
 << 
 << 
 << 
 << 
 << 
 << ^
 <<  
 << 
 << e
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << i
 << e
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << e
 << 
 << 
 << 
 << 
 << 
 << 
 <<  
 <<   
 << 
 <<  
 << 
 << 
 << 
 << 
 << 
 << 
 << 

 << 
 << I
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << detected at 
 << ^
 << 
 << 
 << 
 << 
 << 
 << c2s.f
 << .edwa
 << 
 << 
 << 
 << 
 <<  
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << s
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 <<    
 << 
 <<  
 <<    
 << 
 << 
% I
 << v
 << d
 << i
 << 
 << 
 << 
 << 
 << e
 << 
 << 
 << 
 << 
 << a
 << 
 << 
 <<  
 << a
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << edwardshu
 << 
 << 
 << 
 << sl
 << i
 << 
 << 
 << 
 << 
 << t
 << ".
 << 
 << d
 << mai
 << 
 << 
 << 
 << rve
 <<  
 << 
 << 
 << 
 << 
 << 
 << 
 << 8
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...
     id iu c  '^' ker.91>ee rese al       Ividec's.edc 0
     Ivip dcte^ eiee    
Idetected at ^c2s.f.edwa s       
% Ivdiea aedwardshuslit".dmairve 8
...

 >> hostname c29s1.f1.edwards 

Expect: searching for 2 strs:  :# :>
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << U
 << k 
 << 
 << 
 << 
 << a
 << 
 << 
 << 
 << 
 << computen
 << 
 << 
 <<  or unabl
 <<  
 << 
 << 
 << nd cop
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << f
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << c
 << V
 << an1
  
 <<  
 <<  
 << 
 << 
 << 
 <<  
 <<  
 << 
 << 
 << 
 << 
 << 
 << 
 << a inpu
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 <<  
 << 
 << 
 << 
 << 
 << 
 << 
 << e
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << .f
 << edwa
 << 
 << 
 << 
 <<  
 << 
 <<  
 << 
 << 
 <<  
 << 
 << 
 << 
 << 
 << 
 << 
 <<     
 << 
 << 
 << 
 << n
 << 
 << 
 << det
 << 
 << te
 << 
 << 
 << ' marker
 << 
 << 
 << 
 << c
 << d
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << te
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 <<  
 << 
 << 
 <<    
 <<  
 <<   
 <<  
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << ai
 << 
 << 
 << 
 << 
 << d
 << tect
 << 
 << 
 << 
 << 
 << ^' ma
 << ke
 << 
 << .
 << 
 << 
 << 
 << u
 << d
 << w
 << 
 << 
 << 
 << wn
 << 
 << o
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << r 
 << 
 << me
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << p
 << 
 << 
 << 
 << 
 << 
 << 
 << r
 << s
 << 
c
 << 
 << 
 << 1
 << 
 << 
 << e
 << 
 << 
 << 
 << >
Expect: matched string 2: >
 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
 << 
 << 
 << 
 << 
 << 
 << 0
 << 0..
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 <<   
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 <<  
 <<    
 <<  
 << 
 << 
 << 
 << 
 << 
 << v
 << 
 << 
 << 
 << 
 << 
 << 
 << etcd
 << 
 << t
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 9s
 << 
 << 
 << 1
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << p-
 << 
 << 
 << e
 << 
 << 
 << 
 << 
 << n
 << 
 << 
 << 
 << 
 <<  1
 << 
 
 << 
 << 
 << 
 <<       
 << 
 << 
 << i
 << 
 << npt de
 << ected
 << 
 << 
 << 
 << 
 << '
 << 
 << r
 << 
 << .
 << 
 << 
 << 
 << 
 << 
 << 
 << f
 << w
 << 
 << 
 << s
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << u
 << y 
 << 
 << b
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 <<   
 << 
 << 
 <<   
 << 
 <<  
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << i
 << 
 << 
 << 
 <<  
 << tec
 << 
 << dt '^mar
 << er
 << 
 << 
 << 
 << 
 << 
 << 
 << s
 << .1.
 << 
 << 
 << a
 << 
 << 
 << 
 << 
 << nm
 << 
 << s
 << 
 << 
 << r
 << 
 << 
 << b
 << 
 << 
 << 
 << 
 << a
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << aut
 << 
 << icat
 << 
 << 
 << 
 << 
 << 
 << kd
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << $
 << 
 << le tr
 << pss
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << tic
 << 
 << 
 << n 
 << 
 << 
 << 
 << d
 << 
 << 
 << 
 << inku
 << 
 << 
 << 
 << 
 << 
 <<  
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << auh
 << 
 << 
 << 
 << 
 << i
 << nown lik
 << 
 << 
 << l
 << ta
 << 
 << 
 << 
 << 
 << 
 << 
 <<   
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << mst
 << 
 << t
 << 
 << 
 << nm
 << 
 << 
 << 
 << r
 <<  n
 << 
 << l
 << 
 << 
 << r
 << p
 << 
 << 
 << 
 << mpa
 << 
 << 
 << 
 << 
 << 
 << ca
 << 
 << 
 << 
 << 
 << 
 <<  
 << 
 << 
 << 
 << 
 << 
 << 
 << ld
 << 
 << 
 << r
 << 
 << 
 << 
 << 

 << 
 << 
 << 
 << int
 << 
 << 
 << 
 <<  
 << 
 << 
 << 
 << 
 << .
c29s1.f1.e
 << 
 << 
 << 
 << ds
 << 
 << 
 << 
 << er enable 
 << 
 << t
 << 
 <<  al
 << 
 << 
 << 
 <<      
 <<        ^
% I
 << 
 << 
 << 
 << d input d
 << t
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << m
 << er.

c2
 << 
 << 1
 << 1
 << 
 << dw
 << rds
 << 
 << 
 << r
 << 
 << 
 << 
 << 
 << 
 << l
 <<  traps tt
 << 
 <<  
 << 
 << 
 << 
 << 
 <<  
 << 
 << %
 << 
 << 
 << 
 << 
 << 
 << id input
 << 
 << t
 << 
 << 
 << 
 << 
 << 
 << 
 << r.
 << 
c
 << 9
 << 1.f
 << 
 << rds>
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << s
 << 
 << 
 << 
 << 
 <<   
 << 
 <<       
 << ^
% Invalid 
 << n
 << u
 << 
 << a
 << 
 << '^
 <<  marker.

 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << >
 << 
 << 
 << 
 << 
 << 
 << 
 << er 
 << 
 << 
 << 
 <<  traps 
 << n
 << 
 << 
 << y
 << 
 <<  
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 <<    
 << 
 << 
 << 
 << 

 << 
 << 
 << 
 << va
 << 
 << 
 <<  
 << np
 << 
 << 
 << 
 << 
 << cte
 << 
 << 
 << 
 << 
 << 

 << 
 << 
 << 
 << 
 << 
 << 
 << f
 << 
 << ds>s
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << t
 << a
 << 
 << 
 << n
 << i  
 <<  
 << 
 <<  
 << 
 << 
 << 
u
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << ^'
 << 
 << 
 << 
 << 
 << 
 << 
 << .
 << 

 << 1.f1.edwards>
 << n
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 <<   c
 << nfig
 << ct
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << ^
 << 
 << 
 << 
 << 
 << t
 << 
 << e
 << 
 << 
 << 
 << 
 << d
 << 
 << ^
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << f1.
 << 
 << a
 << ds>s
 << erver
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << a
 << 
 << d
 << 
 << 
 << a
 << 
 << 
 << il
 << 
 << a gu
 << 
 << 
 << -
 << 
 << 
 << 
 << 
 << 
 << 
 << -
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << $
 << ena
 << 
 << 
 <<  t
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << x
 << 
 << aa 
 << 
 << 
 << 
 << 
 << o
 << 
 <<   
 << 
 << 
 <<   
 << 
 << 
 << 
 << 
 << 
 << -
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << o
 << 
 << 
 << 
 << n
 << ue
 << 
 << 
 << 
 << -auth
 << a
 << 
 << 
 << 
 << 
 << 
 <<  
 <<      lan nog
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << a
 << 
 << 
 << 
 << 
 << t
 << 
 << a
 << no
 << th-
 << v
 << an
 << o
 << 
 << 
 << 
 << 
 <<   
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << t
 << vl
sn
 << p
 << s
 << 
 << 
 << e
 << 
 << le
 << 
 << 
 << 
 <<  do
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << l
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << vl nu
 << 
 << -
 << 
 << l
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 <<  Ina
 << 
 << 
 << d
 << t
 << 
 << t
 << 
 <<  at '^
 << er
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << f1
 << 
 << d
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 <<  
 << n
 << 
 << le
 << s
 << 
 << 
 << 
 <<   
 << 
 << 
 <<  
 << ^
 << al
 << d nput de
 << d
 << 
 << t
 << 
 << 
 << 
 << 
 << m
 << 
 << ker.
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << f1.e
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << mp
 <<  
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << e 
 << 
 <<    
 << 
 << 
 << 
 << 
 << 
 <<  
 << 
 << 
 << 
 << 
 << 
 << ali i
 << u
 <<  d
 << 
 << 
 << cte
 <<  
 << t '^' 
 << a
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 1
 << f
 << .
 << 
 << rds>snmp-rv
 << 
 <<  
 << na
 << 
 << o
 << 
 << 
 << 
 << 
 << th
 << ne
 << 
 << ce
 <<  
 << 
 << 
 <<  
 << 
 << 
 <<  
 <<  
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << c
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << r
 << 

 << 
 << 
 << 
 << d
 << 
 << 
 << 
 << 
 << 
 << 
 << n
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << raps 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << od
 << 
 << 
 << 
 << 
 <<  
 << 
 << 
 <<   
 << %
 << 
 << va
 << 
 <<  
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << t
 << 
 << 
 <<  
 << t
 << 
 << 
 << 
 << m
 << 
 << e
 << 
 << 
 << 
 << 
 << s
 << 
 << 
 << 
 << 
 << >
 << 
 << 
 << 
 << 
 << rv
 << e
 << 
 << 
 << le
 << 
 << re
 <<            
 << 
 << 
 << 
 <<  
 <<  
 << %
 << 
 << v
 << 
 << 
 <<  
 << 
 << 
 << 
 << e
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << .

 << 
 << 
 << 
 << 1
 << 1.ed
 << r
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << ve
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << ap
 <<  

 << 
 << 
 << 
 <<  
 <<  
 <<  
 <<  
 << 
 << 
 << 
 <<  ^
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 <<  det
 << ^'
 << a
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << s
 << 
 << 
 << se
 << 
 << 
 << 
 << 
 << 
 << bl 
 << r
 << p
 <<  ne
 << o
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << o
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 <<  
 << 
 << 
 << 
 << 
 << 
 << 
 <<     ^
% In
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << c
 << 
 << 
 <<  
 << t 
 << 
 << '
 << 
 << 
 << .
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << .
 << 
 << 
 << dwa
 << sn
 << 
 << -
 << e
 << 
 << 
 << enab
 << 
 << 
 << 
 << 
 << 
 << p
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << y
 << 
 << 
 << 
 << gu
 << 
 <<  t
 << 
 << 
 << 
 << n9
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << e t
 << 
 << 
 << 
 << st
 << 
 << ci
 << 
 << 
 << 
 << 
 << c
 << 
 << fim
 << 
 << 92 
 << 
 <<  
 << 
 << 
 << 
 << 
 << 
 << 
 << 9
 << 
 << 
 << 
 << 
 << 
 <<  
 <<  
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << nv
 << l
 << n
 << ut
 << tc
 << 
 << 
 << 
 << ^
 << 
 << 
 << 9sf1.ed
 << s> n
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << n 2004-2
 << 
 << 
 << 
 << 
 << 
 << 1
 << -
 << 
 << 
 << 
 << 
 << , 2044
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 <<  
 << 
 << 
 << 
 << 
 << 
 << 042
 << 
 <<  01
 << 
 <<  
 << 
 << 
 << 
 << -
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << , 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 <<    
 <<  
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 <<  
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 2
 << 
 << 
 << 
 << 
 << 0
 << -
 << 
 << 
 << 
 << 
 << 
 << 2
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << , 
 << 
 << 57
 << 
 << 
 <<  
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 <<  
 << 
 << s
 << 
 << 
 << 
 << 
 << 
 << 
 << -
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << ,
 << 26,
 << 2068
 
 << 
 << %
 << 
 << v
 << 
 << 
 << 
 << 
 << 
 << u 
 << 
 << 
 <<  at'
 << m
 << 
 << .
 << 

 << 
 << 
 << 
 << a
 << 
 << 
 << 
 << nc
 << 
 << 
 << 
 <<  vla 2
 << 
 << 9
 << 
 << 
 << 
 << 
 << 
 <<  
 << 
 << 
 << 
 << -2
 << 11, 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 2
 << 
 << 
 << 
 << 
 << 
 << 9
 << ,
 << 210
 << 
 << 
 << 
 << 
 << 
 << 505
 << 
 << 2510-251
 << 
 <<  2  
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 08
 << 
 << 
 << 
 << 
 << 02,15
 << 
 << 5
 << 1,
 << 
 << 
 << 
 << 2
 << 
 << 6
 << 
 << 
 << 
 <<   
 << 
 << 
 << 
 << 
 << 
 << 629, 26
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << ,
 << 210
 << 15
 << 
 <<  
 << 
 << 
 << 0
 << 
 << 52
 << 
 << 
 << 
 << 6
 << 
 << 
 <<  2629, 
 << 
 << 
 << 
 << 
 << 
 << 
 <<  
 << 
 instance 10 
 << an 
 << 
 << 99
 << 
 << 1
 << , 2510-
 << 
 << 11, 52
 <<  
 << 
 << 
 << 3
 << 
 << 26
 << 9
 <<  
 << 6 ^33
 << 
% 
 << 
 << 
 << 
 << i
 << 
 << 
 << 
 << p
 <<  d
 << 
 << 
 << 
 << t 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << r
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << ds> instance v
 << 
 << 8
 << 
 << 
 << 
 << 
 << 26
 << 
 << 2929
   
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 <<  
 << 
 << v
 << etected at 
 << '
 << 
 << r.

 << 
 << c2
 << 1
 << 
 << 
 << >
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << l
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << ,
 << 
 << 
 << 
 << 1
 << 
 << 
 <<  
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 21
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 <<   
 <<  
 << ^
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << et
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 <<  
 << are
 << 
 << 
 << 
 << 
 << 
 << 
 << s
 << .f1.edw
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << t
 << v
 << 
 <<  2
 << 8 
 << 30
 << 
 << ,
 << 
 << 
 << 4
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 1
 << 
 << , 80, 22
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 <<  
 << 
 << 
 <<  
 << 
 << 5
 <<  
 << 
 << 
 << 
 << 
 <<  
 << 1
 << 
 << 5
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 0
 << 
 << 2
 << 1
 << 
 
 << 
 << stn
 << e 12 v
 << n8, 24
 << 
 <<  2
 <<  256
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 <<  ^

 <<  I
 << d 
 << p 
 << 
 << 
 << 
 << '^' 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << d
 << 
 << ds
 << 
 << 
 << 2
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << e ti
 << 
 << 
 << 
 << 
 <<  
 << 
 << 
 << 
 <<    
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 <<  
 << n
 << l
 << 
 << n
 << 
 << 
 <<  
 << 
 << ectedat
 << 
 << 
 << 
 << 
 << r
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << f.ed
 << 
 << 
 << 
 << m c2
 << 
 << 
 << eward    
 <<  
 << 
 << 
 << 
 << 
 <<  I
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << t 
 <<  m
 << r
 << 
 << 
 << 
 << 

 << c
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << e
 << 
 << 
 << 
 << 
 << 
  
 << 
 <<  
 <<    
 << 
 << 
 << 
 <<  
 <<  
 <<  ^
 << 
 << 
 << n
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << put
 << 
 << c
 << 
 << d
 << 
 << t 
 << 
 << 
 << 
 << 
 << 


 << 9s1.f1.ed
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...
00..       vetcdt9s1p-en 1
       inpt deected'r.fwsuy b     i tecdt '^marers.1.anmsrbaauticatkd$le trpssticn dinku auhinown liklta  msttnmr nlrpmpaca ldr
int .
c29s1.f1.edser enable t al            ^
% Id input dtmer.

c211dwrdsrl traps tt  %id inputtr.
c91.frds>s        ^
% Invalid nua'^ marker.
>er  traps ny    
va npcte
fds>stani    
u^'.
1.f1.edwards>n  cnfigct^ted^f1.ads>serveradaila gu--$ena txaa o    -onue-autha      lan nogatanoth-vano  tvl
snpsele dolvl nu-l Inadtt at '^erf1d nles   ^ald nput dedtmker.f1.emp e     ali iu dcte t '^' a1f.rds>snmp-rv naothnece    cr
dnraps od   %va t tmes>rvelere             %v e.
11.edrveap 
     ^ det^'assebl rp neoo     ^
% Inc t '..dwasn-eenabpygu tn9e tstcicfim92  9  nvlnuttc^9sf1.eds> nn 2004-21-, 2044 042 01 -,      20-2, 57  s-,26,2068
 %vu  at'm.
anc vla 29 -211, 29,2105052510-251 2  0802,1551,26  629, 26,21015 0526 2629,  
 instance 10 an 991, 2510-11, 52 3269 6 ^33
% ip dt rds> instance v8262929
    vetected at 'r.
c21>l,1 21   ^et ares.f1.edwtv 28 30,41, 80, 22  5  15021
 stne 12 vn8, 24 2 256 ^
 Id p '^' dds2e ti     nln ectedatrf.edm c2eward      It  mr
ce
         ^nputcdt 

9s1.f1.ed
...

 >> snmp-server contact 6F-1619

Expect: searching for 1 strs:  :#
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

...

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

...

 >> interface vlan 92

Expect: searching for 1 strs:  :(config-if)#
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

...

 >> ip address 10.92.6.10 255.255.0.0

 >> ip broadcast-address 10.92.255.255

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

...

 >> interface Vlan92

Expect: searching for 1 strs:  :(config-if)#
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

...

 >> ip default-gateway 10.92.0.1

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

...

 >> ip dhcp snooping

Expect: searching for 1 strs:  :#
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

...

 >> ip dhcp snooping vlan 108

Expect: searching for 1 strs:  :#
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

...

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

...

 >> default interface range gi1/0/1 - 24 

 >> interface range gi1/0/1 - 24 

Expect: searching for 1 strs:  :(config-if-range)#
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

...

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

...

 >> default interface gi1/0/24 

 >> interface gi1/0/24 

Expect: searching for 1 strs:  :(config-if)#
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

...

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

...

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

...

 >> crypto key generate rsa

 >> no

 >> 2048

Expect: searching for 2 strs:  :OK :(config)#
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

...

 >> write mem

Expect: searching for 2 strs:  :# :>
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

...

 >> 
Expect: searching for 2 strs:  :# :>
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

...

 >> sh run

Expect: searching for 2 strs:  :# :>
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

...

 >> show interface status

Expect: searching for 2 strs:  :# :>
 << 
 << 
 << 
 << 
 << 
 << 000BaseTX0/2    
 <<  
 << 
 << 
 << 
 <<   
 << 
 <<  
 << tcon
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 <<  
 <<  
 << 
 << 
 << 
 << 00/1000BaseTX
G
 << 1
 << 
 << 
 << 
 << 
 <<  
 << 
 << 
 << 
 <<  
 << 
 << 
 << 
 << 
 << c
 << 
 << 
 << 
 << 
 << 
 << 
 <<  
 << 
 << 
 << 
 << 
 << 
 << t
 << 
 << 1
 << 
 << 100/1000
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 1/
 << 
 << 
 << 
 <<     
 << 
 << 
 << 
 << 
 << 
 <<    
 << 
 << 
 << 
 << 
 << ct
 <<  
 << 10
 << 
 << 
 <<  
 << 
 << 
 << 
 <<  a
 << 
 << 
 << 
 << 
 << 
 << uto 
 << 0
 << /1
 << 
 << 
 << 
 << 
 << e
 << 
 << 
 << 

 << 
 << /0/
 << 
 << 
 << 
 << 
 << 
 << 
 <<  
 <<         
 << 
 << 
 << 
 <<  
 << 
 << 
 << 
 << 
 <<  
 << 
 << t
 << 
 << 
 << 
 << 
 << 
 << /10
 << 0BaseX

 << 
 << /
 << /6    
 <<   
 << 
 << 
 << 
 << 
 << 
 <<  
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << ect   108
 << 
 <<  
 << 
 << 
 << 
 <<   aut
 << 
 <<   
 << 
 << 
 << 
 << 00B
 << 
 << 
 << 
 << X
 << i
 << 
 << 
 << 
 << 
 << 
 << 
 <<  
 <<   
 << 
 << 
 << 
 <<  n
 << tc
 << nne
 << t
 << 
 <<  10
 <<  
 <<   
 << 
 <<  ato 
 <<  aut
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << Gi/
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 <<  
 <<     
 <<        
 << 
 << 
 << ct 
 <<  1
 << 8      
 <<    aut
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 00
 << 100
 << Bas
 << 
 << 1/  
 <<      
 << 
 <<  
 << 
 <<  
 << 
 << 
 << o
 << 
 << 
 << 
 << 
 << e
 <<   
 << 
 << 
 << 
 <<  t
 << 
 << 
 << o 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 1
 << 
 << 
 << 
 << 
 <<  
 <<  
 << 
 << 
 << 
 << 
 <<  
 <<   not
 << oe
 << 
 << 
 <<  
 << 
 << 
 << 
 <<  
 << 
 <<     
 << uto
 << 
 << 
 << 
 << 
 << 
 << 
 << T
 << 
 << 
 << 
 << 
 << 1
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 <<    
 << 
 << 
 <<   
 << 
 << 
 << 
 << 
 << nnec
 <<  
 << 
 << 
 << 
 << 
 << 
 << 
 <<  
 << 
 << 
 <<  au
 << o   a
 << 
 << 
 <<  
 << 
 << 100/10
 << 
 << 
 << 
 << 
 << T
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...
000BaseTX0/2        tcon  00/1000BaseTX
G1  c t1100/10001/       ct 10  auto 0/1e
/0/           t/100BaseX
//6       ect   108   aut  00BXi    ntcnnet 10    ato  autGi/            ct  18         aut00100Bas1/         oe   to 1     notoe      utoT1     nnec   auo   a 100/10T
...

