trying to use serial port: /dev/ttyUSB0
 >> 
 >> 

Expect: searching for 4 strs:  :[yes/no] :Press RETURN to get started. :# :Switch>
 << 


         --- System Configuration Dialog ---

Enable secret warning
----------------------------------
In order to access the device manager, an enable secret is required
If you enter the initial configuration dialog, you will be prompted for t
 << he enable secret
If you choose not to enter the intial configuration dialog, or if you exit setup without setting the enable secret,
please set an enable secret using the following CLI in configuration mode-
enable secret 0 <cleartext password>
------
 << ----------------------------
Would you like to enter the initial configuration dialog? [yes/no]: 
% Please answer 'yes' or 'no'.
Would you like to enter the initial configuration dialog? [yes/no]: 
% Please answer 'yes' or 'no'.
Would you like to ent
Expect: matched string 1: [yes/no]
 >> 

 >> no

 >> term len 0

Expect: searching for 2 strs:  :# :>
 << er the initial configuration dialog? [yes/no]: 
% Please answer 'yes' or 'no'.
Would you like to enter the initial configuration dialog? [yes/no]: 
% Please answer 'yes' or 'no'.
Would you like to enter the initial configuration dialog? [yes/no]: 
% 
 << Please answer 'yes' or 'no'.
Would you like to enter the initial configuration dialog? [yes/no]: no
Switch>term len 0
Switch>
Expect: matched string 2: >
 >> show version

Expect: searching for 2 strs:  :# :>
 << 
May 23 16:19:43.096: %LINK-5-CHANGED: Interface Vlan1, changed state to administratively down
May 23 16:19:43.096: %LINK-5-CHANGED: Interface FastEthernet0, changed state to administratively downshow version
Cisco IOS Software, C2960X Software (C2960X
 << -UNIVERSALK9-M), Version 15.2(2)E7, RELEASE SOFTWARE (fc3)
Technical Support: http://www.cisco.com/techsupport
Copyright (c) 1986-2017 by Cisco Systems, Inc.
Compiled Wed 12-Jul-17 13:06 by prod_rel_team

ROM: Bootstrap program is C2960X boot loader
 << 
BOOTLDR: C2960X Boot Loader (C2960X-HBOOT-M) Version 15.2(3r)E1, RELEASE SOFTWARE (fc1)

Switch uptime is 4 minutes
System returned to ROM by power-on
System restarted at 16:15:47 UTC Wed May 23 2018
System image file is "flash:/c2960x-universalk9-m
 << z.152-2.E7/c2960x-universalk9-mz.152-2.E7.bin"
Last reload reason: Unknown reason



This product contains cryptographic features and is subject to United
States and local country laws governing import, export, transfer and
use. Delivery of Cisco c
 << ryptographic products does not imply
third-party authority to import, export, distribute or use encryption.
Importers, exporters, distributors and users are responsible for
compliance with U.S. and local country laws. By using this product you
agree t
 << o comply with applicable laws and regulations. If you are unable
to comply with U.S. and local laws, return this product immediately.

A summary of U.S. laws governing Cisco cryptographic products may be found at:
http://www.cisco.com/wwl/export/crypt
 << o/tool/stqrg.html

If you require further assistance please contact us by sending email to
export@cisco.com.

cisco WS-C2960X-24PS-L (APM86XXX) processor (revision S0) with 524288K bytes of memory.
Processor board ID FJC2213W064
Last reset from pow
 << er-on
1 Virtual Ethernet interface
1 FastEthernet interface
28 Gigabit Ethernet interfaces
The password-recovery mechanism is enabled.

512K bytes of flash-simulated non-volatile configuration memory.
Base ethernet MAC Address       : 70:01:B5:35:5
 << 1:80
Motherboard assembly number     : 73-16694-06
Power supply part number        : 341-0528-02
Motherboard serial number       : FJZ22120AP2
Power supply serial number      : LIT21512TUE
Model revision number           : S0
Motherboard revision nu
 << mber     : D0
Model number                    : WS-C2960X-24PS-L
Daughterboard assembly number   : 73-14200-03
Daughterboard serial number     : FJZ221006TL
System serial number            : FJC2213W064
Top Assembly Part Number        : 68-100472-03
 << 
Top Assembly Revision Number    : G0
Version ID                      : V05
CLEI Code Number                : CMMLR00ARE
Daughterboard revision number   : B0
Hardware Board Revision Number  : 0x19


Switch Ports Model                     SW Version
 <<             SW Image                 
------ ----- -----                     ----------            ----------               
*    1 28    WS-C2960X-24PS-L          15.2(2)E7             C2960X-UNIVERSALK9-M     


Configuration register is 0xF

Swi
 << tch>
Expect: matched string 2: >
 >> enable

Expect: searching for 2 strs:  :Password: :#
 << enable
Switch#
Expect: matched string 2: #
 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
Expect: matched string 1: (config)#
 >> no service pad

 >> service timestamps debug datetime localtime

 >> service timestamps log datetime localtime

 >> service password-encryption

 >> boot-start-marker

 >> boot-end-marker

 >> enable secret W2w1cD0mIliG!

 >> enable password W2w1cD0mIliG!

 >> username root privilege 15 secret W2w1cD0mIliG!

 >> no aaa new-model

 >> clock timezone CST -6 0

 >> clock summer-time CDT recurring

 >> authentication mac-move permit

 >> ip domain-name mgmt.msstate.edu

 >> ip name-server 130.18.80.12

 >> vtp domain vtp01.mgmt.msstate.edu

 >> vtp mode client

 >> crypto pki trustpoint TP-self-signed-2494998912

 >>  enrollment selfsigned

 >>  subject-name cn=IOS-Self-Signed-Certificate-2494998912

 >>  revocation-check none

 >>  rsakeypair TP-self-signed-2494998912

 >> crypto pki certificate chain TP-self-signed-2494998912

 >>  certificate self-signed 01 nvram:IOS-Self-Sig#3232.cer

 >> spanning-tree portfast bpduguard default

 >> spanning-tree extend system-id

 >> vlan internal allocation policy ascending

 >> lldp run

 >> errdisable recovery cause all

 >> errdisable recovery interval 1800

 >> interface FastEthernet0

 >>  no ip address

 >>  shutdown

 >> interface Vlan1

 >>  no ip address

 >>  no ip route-cache

 >>  shutdown

 >> interface Vlan92

 >> no ip http server

 >> no ip http secure-server

 >> logging facility local1

 >> logging host 130.18.8.12

 >> access-list 1 permit 10.92.0.0 0.0.255.255

 >> access-list 1 permit 130.18.8.0 0.0.0.255

 >> access-list 1 permit 10.93.0.0 0.0.255.255

 >> access-list 1 permit 130.18.1.0 0.0.0.255

 >> snmp-server community sysnet RO 1

 >> snmp-server community c2-b2=a2 RW 1

 >> snmp-server enable traps snmp authentication linkdown linkup coldstart warmstart

 >> snmp-server enable traps transceiver all

 >> snmp-server enable traps tty

 >> snmp-server enable traps cluster

 >> snmp-server enable traps config-copy

 >> snmp-server enable traps config

 >> snmp-server enable traps config-ctid

 >> snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-auth-fail-vlan no-guest-vlan

 >> snmp-server enable traps entity

 >> snmp-server enable traps power-ethernet police

 >> snmp-server enable traps cpu threshold

 >> snmp-server enable traps rep

 >> snmp-server enable traps bridge newroot topologychange

 >> snmp-server enable traps stpx inconsistency root-inconsistency loop-inconsistency

 >> snmp-server enable traps syslog

 >> snmp-server enable traps vtp

 >> snmp-server enable traps vlancreate

 >> snmp-server enable traps vlandelete

 >> snmp-server enable traps flash insertion removal

 >> snmp-server enable traps port-security

 >> snmp-server enable traps envmon fan shutdown supply temperature status

 >> snmp-server enable traps errdisable

 >> snmp-server enable traps mac-notification change move threshold

 >> snmp-server enable traps vlan-membership

 >> snmp-server host 130.18.8.12 sysnet 

 >> line con 0

 >> line vty 0 15

 >>  access-class 1 in

 >>  password W2w1cD0mIliG!

 >>  login local

 >>  transport input ssh

 >> ntp server 10.92.0.5

 >> 

 >> end

Expect: searching for 1 strs:  :Configured
 << no service pad
Switch(config)#service timestamps debug datetime localtime
Switch(config)#service timestamps log datetime localtime
Switch(config)#service password-encryption
Switch(config)#boot-start-marker
Switch(config)#boot-end-marker
Switch(conf
 << ig)#enable secret W2w1cD0mIliG!
Switch(config)#enable password W2w1cD0mIliG!
The enable password you have chosen is the same as your enable secret.
This is not recommended.  Re-enter the enable password.

Switch(config)#username root privilege 15 sec
 << ret W2w1cD0mIliG!
Switch(config)#no aaa new-model
Switch(config)#clock timezone CST -6 0
Switch(config)#clock summer-time CDT recurring
Switch(config)#authentication mac-move permit
Switch(config)#ip domain-name mgmt.msstate.edu
Switch(config)#ip na
 << me-server 130.18.80.12
Switch(config)#vtp domain vtp01.mgmt.msstate.edu
Changing VTP domain name from NULL to vtp01.mgmt.msstate.edu
Switch(config)#vtp mode client
Setting device to VTP Client mode for VLANS.
Switch(config)#crypto pki trustpoint TP-s
 << elf-signed-2494998912
Switch(ca-trustpoint)# enrollment selfsigned
Switch(ca-trustpoint)# subject-name cn=IOS-Self-Signed-Certificate
May 23 10:22:13: %SYS-6-CLOCKUPDATE: System clock has been updated from 16:22:13 UTC Wed May 23 2018 to 10:22:13 CST W
 << ed May 23 2018, configured from console by console.
May 23 11:22:13: %SYS-6-CLOCKUPDATE: System clock has been updated from 10:22:13 CST Wed May 23 2018 to 11:22:13 CDT Wed May 23 2018, configured from console by console.-2494998912
Switch(ca-trustpoint
 << )# revocation-check none
Switch(ca-trustpoint)# rsakeypair TP-self-signed-2494998912
Switch(ca-trustpoint)#crypto pki certificate chain TP-self-signed-2494998912
Switch(config-cert-chain)# certificate self-signed 01 nvram:IOS-Self-Sig#3232
 << $e self-signed 01 nvram:IOS-Self-Sig#3232.         cer
Switch(config-cert-chain)#
May 23 11:22:14: %SW_VLAN-6-VTP_DOMAIN_NAME_CHG: VTP domain name changed to vtp01.mgmt.msstate.edu.spanning-tree portfast bp
 << duguard default
Switch(config)#spanning-tree extend system-id
Switch(config)#vlan internal allocation policy ascending
Switch(config)#lldp run
Switch(config)#errdisable recovery cause all
Switch(config)#errdisable recovery interval 1800
Switch(confi
 << g)#interface FastEthernet0
Switch(config-if)# no ip address
Switch(config-if)# shutdown
Switch(config-if)#interface Vlan1
Switch(config-if)# no ip address
Switch(config-if)# no ip route-cache
Switch(config-if)# shutdown
Switch(config-if)#interface 
 << Vlan92
Switch(config-if)#no ip http server
Switch(config)#no ip http secure-se
May 23 11:22:22: %LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan92, changed state to downrver
Switch(config)#logging facility local1
Switch(config)#logging host 130.1
 << 8.8.12
Switch(config)#access-list 1 permit 10.92.0.0 0.0.255.255
Switch(config)#access-list 1 permit 130.18.8.0 0.0.0.255
Switch(config)#access-list 1 permit 10.93.0.0 0.0.255.255
Switch(config)#access-list 1 permit 130.18.1.0 0.0.0.255
Switch(config
 << )#snmp-server community sysnet RO 1
Switch(config)#snmp-server community c2-b2=a2 RW 1
Switch(config)#snmp-server enable traps snmp authentication linkdown linkup c$ enable traps snmp authent
 << ication linkdown linkup co         ldstart waps snmp authentication linkdown linkup coldstart wa         rmstart
Switch(config)#snmp-server enable traps transceiver all
Switc
 << h(config)#snmp-server enable traps tty
Switch(config)#snmp-server enable traps cluster
Switch(config)#snmp-server enable traps config-copy
Switch(config)#snmp-server enable traps config
Switch(config)#snmp-server enable traps config-ctid
Switch(confi
 << g)#snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-au$ enable traps dot1x auth-fail-vlan guest-vlan no-aut         h-fail-vl
 << aps dot1x auth-fail-vlan guest-vlan no-auth-fail-vla         n no-guesuth-fail-vlan guest-vlan no-auth-fail-vlan no-guest         -vlan
snmp-server enable traps do
 << t1x auth-fail-vlan guest-vlan no-auth-fail-vlan no-gu                         ^est-vlan

% Invalid input detected at '^' m
May 23 11:22:25: %SYS-6-LOGGINGHOST_STARTSTOP: Logging to host 130.18.8.12 port 514 started - CLI initiatedarker.

Switch(confi
 << g)#snmp-server enable traps entity
Switch(config)#snmp-server enable traps power-ethernet police
Switch(config)#snmp-server enable traps cpu threshold
Switch(config)#snmp-server enable traps rep
                                        ^
% Invalid inp
 << ut detected at '^' marker.

Switch(config)#snmp-server enable traps bridge newroot topologychange
Switch(config)#snmp-server enable traps stpx inconsistency root-inconsistency$ enable traps 
 << stpx inconsistency root-inconsistency          loop-incoaps stpx inconsistency root-inconsistency loop-incon         sistency
Switch(config)#snmp-server enable traps syslog
S
 << witch(config)#snmp-server enable traps vtp
Switch(config)#snmp-server enable traps vlancreate
Switch(config)#snmp-server enable traps vlandelete
Switch(config)#snmp-server enable traps flash insertion removal
Switch(config)#snmp-server enable traps po
 << rt-security
Switch(config)#snmp-server enable traps envmon fan shutdown supply temperatur$ enable traps envmon fan shutdown supply temperature          status
Switch(config)#snmp-ser
 << ver enable traps errdisable
Switch(config)#snmp-server enable traps mac-notification change move threshol$ enable traps mac-notification change move threshold         
Switch(config)
 << #snmp-server enable traps vlan-membership
Switch(config)#snmp-server host 130.18.8.12 sysnet 
Switch(config)#line con 0
Switch(config-line)#line vty 0 15
Switch(config-line)# access-class 1 in
Switch(config-line)# password W2w1cD0mIliG!
Switch(confi
 << g-line)# login local
Switch(config-line)# transport input ssh
Switch(config-line)#ntp server 10.92.0.5
Switch(config)#
Switch(config)#end
Switch#
May 23 11:22:30: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
Switch#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
Expect: matched string 1: (config)#
 >> spanning-tree mode mst

 >> spanning-tree etherchannel guard misconfig

 >> spanning-tree mst configuration

 >>  name msstate

 >>  revision 1

 >>  instance 1 vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 63, 70

 >>  instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 160

 >>  instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 230, 232, 242, 246

 >>  instance 1 vlan 256, 611-612, 654, 741, 996, 999

 >>  instance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037, 2039-2040

 >>  instance 2 vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096, 2104, 2110, 2126

 >>  instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 2189, 2194, 2202

 >>  instance 2 vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 2654, 2999

 >>  instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176, 196

 >>  instance 3 vlan 244, 248, 927

 >>  instance 4 vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072, 2108, 2113, 2128

 >>  instance 4 vlan 2144, 2176, 2196, 2244, 2248, 2927

 >>  instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 228

 >>  instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216, 2228

 >>  instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116, 124

 >>  instance 7 vlan 172, 186, 192, 204-208, 210, 240-241, 251-252, 630, 928

 >>  instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082, 2084

 >>  instance 8 vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208, 2210

 >>  instance 8 vlan 2240-2241, 2251-2252, 2630, 2928

 >>  instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102, 112

 >>  instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 500, 505, 510-511

 >>  instance 9 vlan 522, 551-570, 603, 629, 633, 742, 802, 926, 929

 >>  instance 10 vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 2057, 2062, 2068

 >>  instance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148, 2158

 >>  instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522, 2603, 2629, 2633

 >>  instance 10 vlan 2802, 2926, 2929

 >>  instance 11 vlan 8, 43, 52, 146, 156-157, 180, 200, 218

 >>  instance 12 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180, 2200, 2218

 >> 

 >> end

Expect: searching for 1 strs:  :Configured
 << spanning-tree mode mst
Switch(config)#spanning-tree etherchannel guard misconfig
Switch(config)#spanning-tree mst configuration
Switch(config-mst)# name msstate
Switch(config-mst)# revision 1
Switch(config-mst)# instance 1 vlan 2, 7, 11, 20, 22, 24, 
 << 31, 35, 37, 39-40, $ vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40, 5         0, 60, 63, 11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 
 << 63,          70
Switch(config-mst)# instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 1$ vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 14         0, 152, 1
 << 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 16         0
Switch(config-mst)# instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 23$ vlan 162-1
 << 63, 168, 189, 194, 202, 220, 222, 230         , 232, 24163, 168, 189, 194, 202, 220, 222, 230, 232, 242         , 246
Switch(config-mst)# instance 1 vlan 256, 611-612, 654, 741, 9
 << 96, 999
Switch(config-mst)# instance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031,$ vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031,          2035, 203
 << , 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037         , 2039-2011, 2020, 2022, 2024, 2031, 2035, 2037, 2039-204         0
Switch(config-mst)# instance 2 v
 << lan 2050, 2060, 2063, 2070, 2080, 2086, 2096,$ vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096,          2104, 211, 2060, 2063, 2070,
 <<  2080, 2086, 2096, 2104, 2110         , 2126
Switch(config-mst)# instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, $ vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 2         
 << 189, 2194, 2140, 2152, 2160, 2162-2163, 2168, 2189, 2194,          2202
Switch(config-mst)# instance 2 vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 
 << $ vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 2         654, 2999
Switch(config-mst)# instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128$ vlan 42, 51, 59, 64
 << , 66, 69, 72, 108, 113, 128,          144, 17651, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176,          196
Switch(config-mst)# instance 3 vlan 244, 248, 927
Switch(config-mst)# 
 << instance 4 vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072,$ vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072,          2108, 211, 2051,
 <<  2059, 2064, 2066, 2069, 2072, 2108, 2113         , 2128
Switch(config-mst)# instance 4 vlan 2144, 2176, 2196, 2244, 2248, 2927
Switch(config-mst)# instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 2
 << $ vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 22         8
Switch(config-mst)# instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-$ vlan 2016, 2048, 2058, 2088, 
 << 2121, 2131, 2133-2         134, 2216, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216,          2228
Switch(config-mst)# instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97,
 << $ vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97,          114, 116,3-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116,          1
 << 24
Switch(config-mst)# instance 7 vlan 172, 186, 192, 204-208, 210, 240-241, 251$ vlan 172, 186, 192, 204-208, 210, 240-241, 251-         252, 630,
 << 186, 192, 204-208, 210, 240-241, 251-252, 630,          928
Switch(config-mst)# instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, $ vlan 2009, 2033-2034, 2038, 2054
 << , 2056, 2071, 2         075, 2082, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082,          2084
Switch(config-mst)# instance 8 vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192,
 << $ vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192,          2204-2208, 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208,          221
 << 0
Switch(config-mst)# instance 8 vlan 2240-2241, 2251-2252, 2630, 2928
Switch(config-mst)# instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 9$ vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 
 << 98         -99, 102,12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102,          112
Switch(config-mst)# instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 50
 << $ vlan 130, 132, 147-148, 158, 212, 226, 236, 500         , 505, 51132, 147-148, 158, 212, 226, 236, 500, 505, 510         -511
Switch(config-mst
 << )# instance 9 vlan 522, 551-570, 603, 629, 633, 742, 802, 92$ vlan 522, 551-570, 603, 629, 633, 742, 802, 926         , 929
Switch(config-mst)# instance 10 vlan 2004-2005, 2012, 2018-2019
 << , 2032, 2044, $0 vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 2         057, 20624-2005, 2012, 2018-2019, 2032, 2044, 2057, 2062,  
 <<         2068
Switch(config-mst)# instance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132,$0 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132,          2147-2148
 << 6, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148,          2158
Switch(config-mst)# instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522,$0 vlan 221
 << 2, 2236, 2500, 2505, 2510-2511, 2522,          2603, 2622, 2236, 2500, 2505, 2510-2511, 2522, 2603, 2629         , 2633
Switch(config-mst)# instance 10 vlan 2802, 2926, 2929
Swit
 << ch(config-mst)# instance 11 vlan 8, 43, 52, 146, 156-157, 180, 200, 218
Switch(config-mst)# instance 12 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180,$2 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180
 << ,          2200, 2218, 2043, 2052, 2146, 2156-2157, 2180, 2200, 2218         
Switch(config-mst)#
Switch(config-mst)#end
Switch#
May 23 11:22:45: %SYS-5-CONFIG_I: Configured fr
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << om console by console
Switch#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
Expect: matched string 1: (config)#
 >> hostname c29s3p.f2.cresswell 

Expect: searching for 2 strs:  :# :>
 << hostname c29s3p.f2.cresswell 
c29s3p.f2.cresswell(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s3p.f2.cresswell#
 << 
May 23 11:22:50: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s3p.f2.cresswell#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s3p.f2.cresswell(config)#
Expect: matched string 1: (config)#
 >> snmp-server contact 6F-2282

Expect: searching for 1 strs:  :#
 << snmp-server contact 6F-2282
c29s3p.f2.cresswell(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s3p.f2.cresswell#
 << 
May 23 11:22:56: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s3p.f2.cresswell#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s3p.f2.cresswell(config)#
Expect: matched string 1: (config)#
 >> interface vlan 92

Expect: searching for 1 strs:  :(config-if)#
 << interface vlan 92
c29s3p.f2.cresswell(config-if)#
Expect: matched string 1: (config-if)#
 >> ip address 10.92.3.211 255.255.0.0

 >> ip broadcast-address 10.92.255.255

 >> end

Expect: searching for 1 strs:  :Configured
 << ip address 10.92.3.211 255.255.0.0
c29s3p.f2.cresswell(config-if)#ip broadcast-address 10.92.255.255
c29s3p.f2.cresswell(config-if)#end
c29s3p.f2.cresswell#
 << 
May 23 11:23:02: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s3p.f2.cresswell#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s3p.f2.cresswell(config)#
Expect: matched string 1: (config)#
 >> interface Vlan92

Expect: searching for 1 strs:  :(config-if)#
 << interface Vlan92
c29s3p.f2.cresswell(config-if)#
Expect: matched string 1: (config-if)#
 >> ip default-gateway 10.92.0.1

 >> end

Expect: searching for 1 strs:  :Configured
 << ip default-gateway 10.92.0.1
c29s3p.f2.cresswell(config)#end
c29s3p.f2.cresswell#
May 23 11:23:08: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s3p.f2.cresswell#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s3p.f2.cresswell(config)#
Expect: matched string 1: (config)#
 >> ip dhcp snooping

Expect: searching for 1 strs:  :#
 << ip dhcp snooping
c29s3p.f2.cresswell(config)#
Expect: matched string 1: #
 >> ip dhcp snooping vlan 31

Expect: searching for 1 strs:  :#
 << ip dhcp snooping vlan 31
c29s3p.f2.cresswell(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s3p.f2.cresswell#
May 23 11:23:15: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s3p.f2.cresswell#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s3p.f2.cresswell(config)#
Expect: matched string 1: (config)#
 >> default interface range gi1/0/1 - 24 

 >> interface range gi1/0/1 - 24 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi1/0/1 - 24 
c29s3p.f2.cresswell(config)#interface range gi1/0/1 - 24 
c29s3p.f2.cresswell(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport access vlan 31

 >> switchport mode access

 >> spanning-tree portfast

 >> switchport port-security maximum 2

 >> switchport port-security

 >> switchport port-security aging time 15

 >> switchport port-security violation protect

 >> switchport port-security aging type inactivity

 >> power inline never

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport access vlan 31
c29s3p.f2.cresswell(config-if-range)#switchport mode access
c29s3p.f2.cresswell(config-if-range)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, concentr
 << ators, switches, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast will be configured in 24 interfaces due to the range command 
 but will only have effect when the interfac
 << es are in a non-trunking mode.
c29s3p.f2.cresswell(config-if-range)#switchport port-security maximum 2
c29s3p.f2.cresswell(config-if-range)#switchport port-security
c29s3p.f2.cresswell(config-if-range)#switchport port-security aging time 15
c29s3p.f2.
 << cresswell(config-if-range)#switchport port-security violation prote$port-security violation protec         t
c29s3p.f2.cresswell(config-if-range)#switchport port-security aging type inac
 << $port-security aging type inact         ivity
c29s3p.f2.cresswell(config-if-range)#power inline never
c29s3p.f2.cresswell(config-if-range)#end
c29s3p.f2.cresswell#
 << 
May 23 11:23:23: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s3p.f2.cresswell#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s3p.f2.cresswell(config)#
Expect: matched string 1: (config)#
 >> default interface gi1/0/24 

 >> interface gi1/0/24 

Expect: searching for 1 strs:  :(config-if)#
 << default interface gi1/0/24 
Interface GigabitEthernet1/0/24 set to default configuration
c29s3p.f2.cresswell(config)#interface gi1/0/24 
c29s3p.f2.cresswell(config-if)#
Expect: matched string 1: (config-if)#
 >> switchport mode trunk

 >> switchport trunk native vlan 92

 >> ip dhcp snooping trust

 >> no keepalive

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport mode trunk
c29s3p.f2.cresswell(config-if)#switchport trunk native vlan 92
c29s3p.f2.cresswell(config-if)#ip dhcp snooping trust
c29s3p.f2.cresswell(config-if)#no keepalive
c29s3p.f2.cresswell(config-if)#end
c29s3p.f2.cresswell#
 << 
May 23 11:23:29: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s3p.f2.cresswell#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s3p.f2.cresswell(config)#
Expect: matched string 1: (config)#
 >> default interface range gi1/0/25 - 28 

 >> interface range gi1/0/25 - 28 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi1/0/25 - 28 
c29s3p.f2.cresswell(config)#interface range gi1/0/25 - 28 
c29s3p.f2.cresswell(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport mode trunk

 >> switchport trunk native vlan 92

 >> ip dhcp snooping trust

 >> no keepalive

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport mode trunk
c29s3p.f2.cresswell(config-if-range)#switchport trunk native vlan 92
c29s3p.f2.cresswell(config-if-range)#ip dhcp snooping trust
c29s3p.f2.cresswell(config-if-range)#no keepalive
c29s3p.f2.cresswell(config-if-range)#end
c29s3p.f
 << 2.cresswell#
 << 
May 23 11:23:35: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s3p.f2.cresswell#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s3p.f2.cresswell(config)#
Expect: matched string 1: (config)#
 >> crypto key generate rsa

 >> no

 >> 2048

Expect: searching for 2 strs:  :OK :(config)#
 << crypto key generate rsa
The name for the keys will be: c29s3p.f2.cresswell.mgmt.msstate.edu
Choose the size of the key modulus in the range of 360 to 4096 for your
  General Purpose Keys. Choosing a key modulus greater than 512 may take
  a few minute
 << s.

How many bits in the modulus [512]: no
% A decimal number between 360 and 4096.
How many bits in the modulus [512]: 2048
% Generating 2048 bit RSA keys, keys will be non-exportable...
 << 
 << 
 << 
 << 
[OK] (elapsed time was 5 seconds)

c29s3p.f2.cresswell(config)#
Expect: matched string 1: OK
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s3p.f2.cresswell#
May 23 11:23:44: %SSH-5-ENABLED: SSH 1.99 has been enabled
May 23 11:23:45: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> write mem

Expect: searching for 2 strs:  :# :>
 << 
c29s3p.f2.cresswell#write mem
Building configuration...

Expect: matched string 1: #
 >> 
Expect: searching for 2 strs:  :# :>
 << [OK]
c29s3p.f2.cresswell#
c29s3p.f2.cresswell#
c29s3p.f2.cresswell#
Expect: matched string 1: #
 >> sh run

Expect: searching for 2 strs:  :# :>
 << sh run
Building configuration...

 << 
Current configuration : 13919 bytes
!
! Last configuration change at 11:23:45 CDT Wed May 23 2018
! NVRAM config last updated at 11:23:48 CDT Wed May 23 2018
!
version 15.2
no service pad
service timestamps debug datetime localtime
service times
 << tamps log datetime localtime
service password-encryption
!
hostname c29s3p.f2.cresswell
!
boot-start-marker
boot-end-marker
!
enable secret 5 $1$hInq$gYZLAutA1XuIOSXlNPJmf0
enable password 7 133245055A0F207A260D243A1263
!
username root privileg
 << e 15 secret 5 $1$a0Iq$MMrd/J5ClZ6zgHY2p0aE00
no aaa new-model
clock timezone CST -6 0
clock summer-time CDT recurring
switch 1 provision ws-c2960x-24ps-l
!
!
ip dhcp snooping vlan 31
ip dhcp snooping
ip domain-name mgmt.msstate.edu
ip name-serve
 << r 130.18.80.12
!
!
!
!
!
authentication mac-move permit
!
!
crypto pki trustpoint TP-self-signed-2494998912
 enrollment selfsigned
 subject-name cn=IOS-Self-Signed-Certificate-2494998912
 revocation-check none
 rsakeypair TP-self-signed-24949
 << 98912
!
!
crypto pki certificate chain TP-self-signed-2494998912
 certificate self-signed 01
  	quit
!
spanning-tree mode mst
spanning-tree portfast bpduguard default
spanning-tree extend system-id
!
spanning-tree mst configuration
 name mssta
 << te
 revision 1
 instance 1 vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 63, 70
 instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 160
 instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 230, 232, 242, 246
 instance 1 vlan
 <<  256, 611-612, 654, 741, 996, 999
 instance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037, 2039-2040
 instance 2 vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096, 2104, 2110, 2126
 instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 218
 << 9, 2194, 2202
 instance 2 vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 2654, 2999
 instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176, 196
 instance 3 vlan 244, 248, 927
 instance 4 vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072, 2108
 << , 2113, 2128
 instance 4 vlan 2144, 2176, 2196, 2244, 2248, 2927
 instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 228
 instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216, 2228
 instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, 82,
 <<  84, 97, 114, 116, 124
 instance 7 vlan 172, 186, 192, 204-208, 210, 240-241, 251-252, 630, 928
 instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082, 2084
 instance 8 vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208, 2210
 inst
 << ance 8 vlan 2240-2241, 2251-2252, 2630, 2928
 instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102, 112
 instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 500, 505, 510-511
 instance 9 vlan 522, 551-570, 603, 629, 633, 742, 802, 926,
 <<  929
 instance 10 vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 2057, 2062, 2068
 instance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148, 2158
 instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522, 2603, 2629, 2633
 instance 10 vlan 28
 << 02, 2926, 2929
 instance 11 vlan 8, 43, 52, 146, 156-157, 180, 200, 218
 instance 12 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180, 2200, 2218
!
errdisable recovery cause udld
errdisable recovery cause bpduguard
errdisable recovery cause security-vio
 << lation
errdisable recovery cause channel-misconfig
errdisable recovery cause pagp-flap
errdisable recovery cause dtp-flap
errdisable recovery cause link-flap
errdisable recovery cause sfp-config-mismatch
errdisable recovery cause gbic-invalid
errdi
 << sable recovery cause psecure-violation
errdisable recovery cause port-mode-failure
errdisable recovery cause dhcp-rate-limit
errdisable recovery cause pppoe-ia-rate-limit
errdisable recovery cause mac-limit
errdisable recovery cause vmps
errdisable 
 << recovery cause storm-control
errdisable recovery cause inline-power
errdisable recovery cause arp-inspection
errdisable recovery cause loopback
errdisable recovery cause small-frame
errdisable recovery cause psp
errdisable recovery interval 1800
!
 << 
!
!
!
vlan internal allocation policy ascending
!
lldp run
!
! 
!
!
!
!
!
!
!
!
interface FastEthernet0
 no ip address
 shutdown
!
interface GigabitEthernet1/0/1
 switchport access vlan 31
 switchport mode access
 switchport port-s
 << ecurity maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEtherne
 << t1/0/2
 switchport access vlan 31
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-secu
 << rity
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/3
 switchport access vlan 31
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging 
 << time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/4
 switchport access vlan 31
 switchport mode access
 switchport port-security maximum 2
 << 
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/5
 switchpor
 << t access vlan 31
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inlin
 << e never
 spanning-tree portfast
!
interface GigabitEthernet1/0/6
 switchport access vlan 31
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchpo
 << rt port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/7
 switchport access vlan 31
 switchport mode access
 switchport port-security maximum 2
 switchport port-
 << security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/8
 switchport access vlan 31

 <<  switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning
 << -tree portfast
!
interface GigabitEthernet1/0/9
 switchport access vlan 31
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security a
 << ging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/10
 switchport access vlan 31
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violatio
 << n  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/11
 switchport access vlan 31
 switchport mode
 <<  access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast

 << !
interface GigabitEthernet1/0/12
 switchport access vlan 31
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inact
 << ivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/13
 switchport access vlan 31
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 sw
 << itchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/14
 switchport access vlan 31
 switchport mode access
 switc
 << hport port-security
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
May 23 11:24:12: %PNP-6-PNP_DISCOVERY_STOPPED: PnP Discovery stopped (Aborted by non-PnP bootstrapping)
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
May 23 11:24:41: SMI Director is not configured, disabling SMI
May 23 11:24:41: disable_smartinstall_operation:Disabling SMI
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...
sh run
Building configuration...

Current configuration : 13919 bytes
!
! Last configuration change at 11:23:45 CDT Wed May 23 2018
! NVRAM config last updated at 11:23:48 CDT Wed May 23 2018
!
version 15.2
no service pad
service timestamps debug datetime localtime
service timestamps log datetime localtime
service password-encryption
!
hostname c29s3p.f2.cresswell
!
boot-start-marker
boot-end-marker
!
enable secret 5 $1$hInq$gYZLAutA1XuIOSXlNPJmf0
enable password 7 133245055A0F207A260D243A1263
!
username root privilege 15 secret 5 $1$a0Iq$MMrd/J5ClZ6zgHY2p0aE00
no aaa new-model
clock timezone CST -6 0
clock summer-time CDT recurring
switch 1 provision ws-c2960x-24ps-l
!
!
ip dhcp snooping vlan 31
ip dhcp snooping
ip domain-name mgmt.msstate.edu
ip name-server 130.18.80.12
!
!
!
!
!
authentication mac-move permit
!
!
crypto pki trustpoint TP-self-signed-2494998912
 enrollment selfsigned
 subject-name cn=IOS-Self-Signed-Certificate-2494998912
 revocation-check none
 rsakeypair TP-self-signed-2494998912
!
!
crypto pki certificate chain TP-self-signed-2494998912
 certificate self-signed 01
  	quit
!
spanning-tree mode mst
spanning-tree portfast bpduguard default
spanning-tree extend system-id
!
spanning-tree mst configuration
 name msstate
 revision 1
 instance 1 vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 63, 70
 instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 160
 instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 230, 232, 242, 246
 instance 1 vlan 256, 611-612, 654, 741, 996, 999
 instance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037, 2039-2040
 instance 2 vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096, 2104, 2110, 2126
 instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 2189, 2194, 2202
 instance 2 vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 2654, 2999
 instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176, 196
 instance 3 vlan 244, 248, 927
 instance 4 vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072, 2108, 2113, 2128
 instance 4 vlan 2144, 2176, 2196, 2244, 2248, 2927
 instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 228
 instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216, 2228
 instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116, 124
 instance 7 vlan 172, 186, 192, 204-208, 210, 240-241, 251-252, 630, 928
 instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082, 2084
 instance 8 vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208, 2210
 instance 8 vlan 2240-2241, 2251-2252, 2630, 2928
 instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102, 112
 instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 500, 505, 510-511
 instance 9 vlan 522, 551-570, 603, 629, 633, 742, 802, 926, 929
 instance 10 vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 2057, 2062, 2068
 instance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148, 2158
 instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522, 2603, 2629, 2633
 instance 10 vlan 2802, 2926, 2929
 instance 11 vlan 8, 43, 52, 146, 156-157, 180, 200, 218
 instance 12 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180, 2200, 2218
!
errdisable recovery cause udld
errdisable recovery cause bpduguard
errdisable recovery cause security-violation
errdisable recovery cause channel-misconfig
errdisable recovery cause pagp-flap
errdisable recovery cause dtp-flap
errdisable recovery cause link-flap
errdisable recovery cause sfp-config-mismatch
errdisable recovery cause gbic-invalid
errdisable recovery cause psecure-violation
errdisable recovery cause port-mode-failure
errdisable recovery cause dhcp-rate-limit
errdisable recovery cause pppoe-ia-rate-limit
errdisable recovery cause mac-limit
errdisable recovery cause vmps
errdisable recovery cause storm-control
errdisable recovery cause inline-power
errdisable recovery cause arp-inspection
errdisable recovery cause loopback
errdisable recovery cause small-frame
errdisable recovery cause psp
errdisable recovery interval 1800
!
!
!
!
vlan internal allocation policy ascending
!
lldp run
!
! 
!
!
!
!
!
!
!
!
interface FastEthernet0
 no ip address
 shutdown
!
interface GigabitEthernet1/0/1
 switchport access vlan 31
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/2
 switchport access vlan 31
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/3
 switchport access vlan 31
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/4
 switchport access vlan 31
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/5
 switchport access vlan 31
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/6
 switchport access vlan 31
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/7
 switchport access vlan 31
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/8
 switchport access vlan 31
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/9
 switchport access vlan 31
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/10
 switchport access vlan 31
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/11
 switchport access vlan 31
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/12
 switchport access vlan 31
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/13
 switchport access vlan 31
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/14
 switchport access vlan 31
 switchport mode access
 switchport port-security
May 23 11:24:12: %PNP-6-PNP_DISCOVERY_STOPPED: PnP Discovery stopped (Aborted by non-PnP bootstrapping)
May 23 11:24:41: SMI Director is not configured, disabling SMI
May 23 11:24:41: disable_smartinstall_operation:Disabling SMI
...

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s3p.f2.cresswell(config)#
Expect: matched string 1: (config)#
 >> no service pad

 >> service timestamps debug datetime localtime

 >> service timestamps log datetime localtime

 >> service password-encryption

 >> boot-start-marker

 >> boot-end-marker

 >> enable secret W2w1cD0mIliG!

 >> enable password W2w1cD0mIliG!

 >> username root privilege 15 secret W2w1cD0mIliG!

 >> no aaa new-model

 >> clock timezone CST -6 0

 >> clock summer-time CDT recurring

 >> authentication mac-move permit

 >> ip domain-name mgmt.msstate.edu

 >> ip name-server 130.18.80.12

 >> vtp domain vtp01.mgmt.msstate.edu

 >> vtp mode client

 >> crypto pki trustpoint TP-self-signed-2494998912

 >>  enrollment selfsigned

 >>  subject-name cn=IOS-Self-Signed-Certificate-2494998912

 >>  revocation-check none

 >>  rsakeypair TP-self-signed-2494998912

 >> crypto pki certificate chain TP-self-signed-2494998912

 >>  certificate self-signed 01 nvram:IOS-Self-Sig#3232.cer

 >> spanning-tree portfast bpduguard default

 >> spanning-tree extend system-id

 >> vlan internal allocation policy ascending

 >> lldp run

 >> errdisable recovery cause all

 >> errdisable recovery interval 1800

 >> interface FastEthernet0

 >>  no ip address

 >>  shutdown

 >> interface Vlan1

 >>  no ip address

 >>  no ip route-cache

 >>  shutdown

 >> interface Vlan92

 >> no ip http server

 >> no ip http secure-server

 >> logging facility local1

 >> logging host 130.18.8.12

 >> access-list 1 permit 10.92.0.0 0.0.255.255

 >> access-list 1 permit 130.18.8.0 0.0.0.255

 >> access-list 1 permit 10.93.0.0 0.0.255.255

 >> access-list 1 permit 130.18.1.0 0.0.0.255

 >> snmp-server community sysnet RO 1

 >> snmp-server community c2-b2=a2 RW 1

 >> snmp-server enable traps snmp authentication linkdown linkup coldstart warmstart

 >> snmp-server enable traps transceiver all

 >> snmp-server enable traps tty

 >> snmp-server enable traps cluster

 >> snmp-server enable traps config-copy

 >> snmp-server enable traps config

 >> snmp-server enable traps config-ctid

 >> snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-auth-fail-vlan no-guest-vlan

 >> snmp-server enable traps entity

 >> snmp-server enable traps power-ethernet police

 >> snmp-server enable traps cpu threshold

 >> snmp-server enable traps rep

 >> snmp-server enable traps bridge newroot topologychange

 >> snmp-server enable traps stpx inconsistency root-inconsistency loop-inconsistency

 >> snmp-server enable traps syslog

 >> snmp-server enable traps vtp

 >> snmp-server enable traps vlancreate

 >> snmp-server enable traps vlandelete

 >> snmp-server enable traps flash insertion removal

 >> snmp-server enable traps port-security

 >> snmp-server enable traps envmon fan shutdown supply temperature status

 >> snmp-server enable traps errdisable

 >> snmp-server enable traps mac-notification change move threshold

 >> snmp-server enable traps vlan-membership

 >> snmp-server host 130.18.8.12 sysnet 

 >> line con 0

 >> line vty 0 15

 >>  access-class 1 in

 >>  password W2w1cD0mIliG!

 >>  login local

 >>  transport input ssh

 >> ntp server 10.92.0.5

 >> 

 >> end

Expect: searching for 1 strs:  :Configured
 << no service pad
c29s3p.f2.cresswell(config)#service timestamps debug datetime localtime
c29s3p.f2.cresswell(config)#service timestamps log datetime localtime
c29s3p.f2.cresswell(config)#service password-encryption
c29s3p.f2.cresswell(config)#boot-start
 << -marker
c29s3p.f2.cresswell(config)#boot-end-marker
c29s3p.f2.cresswell(config)#enable secret W2w1cD0mIliG!
The enable secret you have chosen is the same as your enable password.
This is not recommended.  Re-enter the enable secret.

c29s3p.f2.cress
 << well(config)#enable password W2w1cD0mIliG!
The enable password you have chosen is the same as your enable secret.
This is not recommended.  Re-enter the enable password.

c29s3p.f2.cresswell(config)#username root privilege 15 secret W2w1cD0mIliG!
c29
 << s3p.f2.cresswell(config)#no aaa new-model
c29s3p.f2.cresswell(config)#clock timezone CST -6 0
c29s3p.f2.cresswell(config)#clock summer-time CDT recurring
c29s3p.f2.cresswell(config)#authentication mac-move permit
c29s3p.f2.cresswell(config)#ip domain-
 << name mgmt.msstate.edu
c29s3p.f2.cresswell(config)#ip name-server 130.18.80.12
c29s3p.f2.cresswell(config)#vtp domain vtp01.mgmt.msstate.edu
Domain name already set to vtp01.mgmt.msstate.edu.
c29s3p.f2.cresswell(config)#vtp mode client
Device mode alr
 << eady VTP Client for VLANS.
c29s3p.f2.cresswell(config)#crypto pki trustpoint TP-self-signed-2494998912
c29s3p.f2.cresswell(ca-trustpoint)# enrollment selfsigned
c29s3p.f2.cresswell(ca-trustpoint)# subject-name cn=IOS-Self-Signed-Certifica
 << $me cn=IOS-Self-Signed-Certificat         e-2494998Self-Signed-Certificate-24949989         12
c29s3p.f2.cresswell(ca-trustpoint)# revocation-check none
c29s3p.f2.cre
 << sswell(ca-trustpoint)# rsakeypair TP-self-signed-2494998912
c29s3p.f2.cresswell(ca-trustpoint)#crypto pki certificate chain TP-self-signe$certificate chain TP-self-signed         -24949989
 << e chain TP-self-signed-249499891         2
c29s3p.f2.cresswell(config-cert-chain)# certificate self-signed 01 nvram:IOS-$e self-signed 01 nvram:IOS-S         elf-Sig#3
 << ned 01 nvram:IOS-Self-Sig#32         32.cer
c29s3p.f2.cresswell(config-cert-chain)#spanning-tree portfast bpduguard defau$ee portfast bpduguard defaul         t
c29s
 << 3p.f2.cresswell(config)#spanning-tree extend system-id
c29s3p.f2.cresswell(config)#vlan internal allocation policy ascending
c29s3p.f2.cresswell(config)#lldp run
c29s3p.f2.cresswell(config)#errdisable recovery cause all
c29s3p.f2.cresswell(config)#
M
 << ay 23 11:26:57: % Multiple self signed certificates in config
    certificate for trust point TP-self-signed-2494998912 ignored
errdisable recovery interval 1800
c29s3p.f2.cresswell(config)#interface FastEthernet0
c29s3p.f2.cresswell(config-if)# no ip
 <<  address
c29s3p.f2.cresswell(config-if)# shutdown
c29s3p.f2.cresswell(config-if)#interface Vlan1
c29s3p.f2.cresswell(config-if)# no ip address
c29s3p.f2.cresswell(config-if)# no ip route-cache
c29s3p.f2.cresswell(config-if)# shutdown
c29s3p.f2.cress
 << well(config-if)#interface Vlan92
c29s3p.f2.cresswell(config-if)#no ip http server
c29s3p.f2.cresswell(config)#no ip http secure-server
c29s3p.f2.cresswell(config)#logging facility local1
c29s3p.f2.cresswell(config)#logging host 130.18.8.12
c29s3p.f2.
 << cresswell(config)#access-list 1 permit 10.92.0.0 0.0.255.255
c29s3p.f2.cresswell(config)#access-list 1 permit 130.18.8.0 0.0.0.255
c29s3p.f2.cresswell(config)#access-list 1 permit 10.93.0.0 0.0.255.255
c29s3p.f2.cresswell(config)#access-list 1 permit 1
 << 30.18.1.0 0.0.0.255
c29s3p.f2.cresswell(config)#snmp-server community sysnet RO 1
c29s3p.f2.cresswell(config)#snmp-server community c2-b2=a2 RW 1
c29s3p.f2.cresswell(config)#snmp-server enable traps snmp authentication link
 << $ enable traps snmp authentication linkd         own linkuaps snmp authentication linkdown linkup          coldstaruthent
 << ication linkdown linkup coldstart          warmstarion linkdown linkup coldstart warmstart         
c29s3p.f2.cresswell(config)#snmp-server enable traps transceiver all
c29s3p.f2.cresswel
 << l(config)#snmp-server enable traps tty
c29s3p.f2.cresswell(config)#snmp-server enable traps cluster
c29s3p.f2.cresswell(config)#snmp-server enable traps config-copy
c29s3p.f2.cresswell(config)#snmp-server enable traps config
c29s3p.f2.cresswell(config
 << )#snmp-server enable traps config-ctid
c29s3p.f2.cresswell(config)#snmp-server enable traps dot1x auth-fail-vlan gue$ enable traps dot1x auth-fail-vlan gues         t-vlan no
 << aps dot1x auth-fail-vlan guest-vlan no-         auth-failuth-fail-vlan guest-vlan no-auth-fail-         vlan no-gvla
 << n guest-vlan no-auth-fail-vlan no-gu         est-vlan
snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-auth-fail-vlan no-gu                         ^est-vlan

% Invalid input detected at '^' marker.

c29s3p.f2.cresswell(config)#sn
 << mp-server enable traps entity
c29s3p.f2.cresswell(config)#snmp-server enable traps power-ethernet police
c29s3p.f2.cresswell(config)#snmp-server enable traps cpu threshold
c29s3p.f2.cresswell(config)#snmp-server enable traps rep
                      
 <<                                ^
% Invalid input detected at '^' marker.

c29s3p.f2.cresswell(config)#snmp-server enable traps bridge newroot topologyc$ enable traps bridge newroot topologych         
 << ange
c29s3p.f2.cresswell(config)#snmp-server enable traps stpx inconsistency root-$ enable traps stpx inconsistency root-i         nconsisteap
 << s stpx inconsistency root-inconsisten         cy loop-inconsistency root-inconsistency loop-in         consistency root-inconsistency loop-in
 << consistenc         y
c29s3p.f2.cresswell(config)#snmp-server enable traps syslog
c29s3p.f2.cresswell(config)#snmp-server enable traps vtp
c29s3p.f2.cresswell(config)#snmp-server enable traps vlancreate
c29s3p.f2.cresswell(config)#snmp-server 
 << enable traps vlandelete
c29s3p.f2.cresswell(config)#snmp-server enable traps flash insertion removal
c29s3p.f2.cresswell(config)#snmp-server enable traps port-security
c29s3p.f2.cresswell(config)#snmp-server enable traps envmon fan shutdown supp
 << $ enable traps envmon fan shutdown suppl         y temperaaps envmon fan shutdown supply temperat         ure statu
 <<  fan shutdown supply temperature status         
c29s3p.f2.cresswell(config)#snmp-server enable traps errdisable
c29s3p.f2.cresswell(config)#snmp-server enable traps mac-notification change 
 << $ enable traps mac-notification change m         ove thresaps mac-notification change move thresh         old
c29s3p.f2.cresswell(config)#snmp-server enable traps vlan-membershi
 << p
c29s3p.f2.cresswell(config)#snmp-server host 130.18.8.12 sysnet 
c29s3p.f2.cresswell(config)#line con 0
c29s3p.f2.cresswell(config-line)#line vty 0 15
c29s3p.f2.cresswell(config-line)# access-class 1 in
c29s3p.f2.cresswell(config-line)# password W2
 << w1cD0mIliG!
c29s3p.f2.cresswell(config-line)# login local
c29s3p.f2.cresswell(config-line)# transport input ssh
c29s3p.f2.cresswell(config-line)#ntp server 10.92.0.5
c29s3p.f2.cresswell(config)#
c29s3p.f2.cresswell(config)#end
c29s3p.f2.cresswell#
 << 
May 23 11:27:10: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s3p.f2.cresswell#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s3p.f2.cresswell(config)#
Expect: matched string 1: (config)#
 >> spanning-tree mode mst

 >> spanning-tree etherchannel guard misconfig

 >> spanning-tree mst configuration

 >>  name msstate

 >>  revision 1

 >>  instance 1 vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 63, 70

 >>  instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 160

 >>  instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 230, 232, 242, 246

 >>  instance 1 vlan 256, 611-612, 654, 741, 996, 999

 >>  instance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037, 2039-2040

 >>  instance 2 vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096, 2104, 2110, 2126

 >>  instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 2189, 2194, 2202

 >>  instance 2 vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 2654, 2999

 >>  instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176, 196

 >>  instance 3 vlan 244, 248, 927

 >>  instance 4 vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072, 2108, 2113, 2128

 >>  instance 4 vlan 2144, 2176, 2196, 2244, 2248, 2927

 >>  instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 228

 >>  instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216, 2228

 >>  instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116, 124

 >>  instance 7 vlan 172, 186, 192, 204-208, 210, 240-241, 251-252, 630, 928

 >>  instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082, 2084

 >>  instance 8 vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208, 2210

 >>  instance 8 vlan 2240-2241, 2251-2252, 2630, 2928

 >>  instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102, 112

 >>  instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 500, 505, 510-511

 >>  instance 9 vlan 522, 551-570, 603, 629, 633, 742, 802, 926, 929

 >>  instance 10 vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 2057, 2062, 2068

 >>  instance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148, 2158

 >>  instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522, 2603, 2629, 2633

 >>  instance 10 vlan 2802, 2926, 2929

 >>  instance 11 vlan 8, 43, 52, 146, 156-157, 180, 200, 218

 >>  instance 12 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180, 2200, 2218

 >> 

 >> end

Expect: searching for 1 strs:  :Configured
 << spanning-tree mode mst
c29s3p.f2.cresswell(config)#spanning-tree etherchannel guard misconfig
c29s3p.f2.cresswell(config)#spanning-tree mst configuration
c29s3p.f2.cresswell(config-mst)# name msstate
c29s3p.f2.cresswell(config-mst)# revision 1
c29s3p
 << .f2.cresswell(config-mst)# instance 1 vlan 2, 7, 11, 20, 22, 24, 31, 35$ vlan 2, 7, 11, 20, 22, 24, 31, 35,          37, 39-4, 11, 20, 22, 24, 31, 35, 37, 39
 << -40         , 50, 60,22, 24, 31, 35, 37, 39-40, 50, 60,          63, 70
c29s3p.f2.cresswell(config-mst)# instance 1 vlan 78, 80, 86, 91, 96, 104, 110
 << $ vlan 78, 80, 86, 91, 96, 104, 110,          126, 13680, 86, 91, 96, 104, 110, 126, 136,          140, 152, 96, 104, 110, 126, 136, 140, 152,     
 <<      160
c29s3p.f2.cresswell(config-mst)# instance 1 vlan 162-163, 168, 189, 194, 202,$ vlan 162-163, 168, 189, 194, 202,          220, 222,163, 16
 << 8, 189, 194, 202, 220, 222,          230, 232,89, 194, 202, 220, 222, 230, 232,          242, 246
c29s3p.f2.cresswell(config-mst)# instance 1 vlan 256, 611-612, 654, 741, 996,
 << $ vlan 256, 611-612, 654, 741, 996,          999
c29s3p.f2.cresswell(config-mst)# instance 2 vlan 2002, 2007, 2011, 2020, 2022$ vlan 2002, 2007, 2011, 2020, 2022,         
 <<  2024, 20, 2007, 2011, 2020, 2022, 2024, 203         1, 2035, 11, 2020, 2022, 2024, 2031, 2035, 2         037, 2039
 << 2022, 2024, 2031, 2035, 2037, 2039-         2040
c29s3p.f2.cresswell(config-mst)# instance 2 vlan 2050, 2060, 2063, 2070, 2080$ vlan 2050, 2060, 2063, 2070, 2080,          20
 << 86, 20, 2060, 2063, 2070, 2080, 2086, 209         6, 2104, 63, 2070, 2080, 2086, 2096, 2104, 2         110, 2126
c29s3p.f2.cresswell(config-mst)# in
 << stance 2 vlan 2136, 2140, 2152, 2160, 2162$ vlan 2136, 2140, 2152, 2160, 2162-         2163, 216, 2140, 2152, 2160, 2162-2163, 2168         , 2189, 
 << 252, 2160, 2162-2163, 2168, 2189, 21         94, 2202
c29s3p.f2.cresswell(config-mst)# instance 2 vlan 2220, 2222, 2232, 2242, 2246$ vlan 2220, 2222, 2232, 
 << 2242, 2246,          2611-261, 2222, 2232, 2242, 2246, 2611-2612         , 2654, 232, 2242, 2246, 2611-2612, 2654, 29         99
c29s3p.f2.
 << cresswell(config-mst)# instance 3 vlan 42, 51, 59, 64, 66, 69, 72, $ vlan 42, 51, 59, 64, 66, 69, 72, 1         08, 113, 51, 59, 64, 66, 69, 72, 108, 113, 1 
 <<         28, 144, , 66, 69, 72, 108, 113, 128, 144, 1         76, 196
c29s3p.f2.cresswell(config-mst)# instance 3 vlan 244, 248, 927
c29s3p.f2.cresswell(config-mst)# instance 4 vlan 2042, 2051
 << , 2059, 2064, 2066$ vlan 2042, 2051, 2059, 2064, 2066,          2069, 20, 2051, 2059, 2064, 2066, 2069, 207         2, 2108, 
 << 59, 2064, 2066, 2069, 2072, 2108, 2         113, 2128
c29s3p.f2.cresswell(config-mst)# instance 4 vlan 2144, 2176, 2196, 2244, 2248$ vlan 2144, 2176, 2196, 2244, 2248,         
 <<  2927
c29s3p.f2.cresswell(config-mst)# instance 5 vlan 16, 48, 58, 88, 121, 131, 13$ vlan 16, 48, 58, 88, 121, 131, 133         -134, 21648, 58, 88, 1
 << 21, 131, 133-134, 216,          228
c29s3p.f2.cresswell(config-mst)# instance 6 vlan 2016, 2048, 2058, 2088, 2121$ vlan 2016, 2048, 2058, 2088, 2121,          2131, 21
 << , 2048, 2058, 2088, 2121, 2131, 213         3-2134, 258, 2088, 2121, 2131, 2133-2134, 22         16, 2228
c29s3p.f2.cresswell(config-mst)# instance 7 vlan 9, 33-34, 38, 54,
 <<  56, 71, 75$ vlan 9, 33-34, 38, 54, 56, 71, 75,          82, 84, 3-34, 38, 54, 56, 71, 75, 82, 84, 9         7, 114, 1
 << 54, 56, 71, 75, 82, 84, 97, 114, 11         6, 124
c29s3p.f2.cresswell(config-mst)# instance 7 vlan 172, 186, 192, 204-208, 210,$ vlan 172, 186, 192, 204-208, 210,          240-
 << 241, 186, 192, 204-208, 210, 240-241, 2         51-252, 6204-208, 210, 240-241, 251-252, 63         0, 928
c29s3p.f2.cresswell(config-mst)# instance 8
 <<  vlan 2009, 2033-2034, 2038, 2054,$ vlan 2009, 2033-2034, 2038, 2054,          2056, 207, 2033-2034, 2038, 2054, 2056, 2071         , 2075, 2
 << 4, 2038, 2054, 2056, 2071, 2075, 20         82, 2084
c29s3p.f2.cresswell(config-mst)# instance 8 vlan 2097, 2114, 2116, 2124, 2172$ vlan 2097, 2114, 2116, 2124, 21
 << 72,          2186, 21, 2114, 2116, 2124, 2172, 2186, 219         2, 2204-216, 2124, 2172, 2186, 2192, 2204-22         08, 2210
c29s3p.f2.cr
 << esswell(config-mst)# instance 8 vlan 2240-2241, 2251-2252, 2630, $ vlan 2240-2241, 2251-2252, 2630, 2         928
c29s3p.f2.cresswell(config-mst)# instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 
 << $ vlan 4-5, 12, 18-19, 32, 44, 57, 6         2, 68, 7612, 18-19, 32, 44, 57, 62, 68, 76,          98-99, 1, 32, 44
 << , 57, 62, 68, 76, 98-99, 10         2, 112
c29s3p.f2.cresswell(config-mst)# instance 9 vlan 130, 132, 147-148, 158, 212,$ vlan 130, 132, 147-148, 158, 212,          226, 236,
 << 132, 147-148, 158, 212, 226, 236,          500, 505,148, 158, 212, 226, 236, 500, 505,          510-511
c29s3p.f2.cresswell(config-mst)# instance 9 vlan 522, 551-570,
 <<  603, 629, 633,$ vlan 522, 551-570, 603, 629, 633,          742, 802,551-570, 603, 629, 633, 742, 802,          926, 929
c29s3p.f2.cresswell(config-
 << mst)# instance 10 vlan 2004-2005, 2012, 2018-2019,$0 vlan 2004-2005, 2012, 2018-2019,          2032, 2044-2005, 2012, 2018-2019, 2032, 2044         
 << , 2057, 212, 2018-2019, 2032, 2044, 2057, 20         62, 2068
c29s3p.f2.cresswell(config-mst)# instance 10 vlan 2076, 2098-2099, 2102, 2112$0 vlan 2076, 209
 << 8-2099, 2102, 2112,          2130, 216, 2098-2099, 2102, 2112, 2130, 213         2, 2147-299, 2102, 2112, 2130, 2132, 2147-21         48, 21
 << 58
c29s3p.f2.cresswell(config-mst)# instance 10 vlan 2212, 2236, 2500, 2505, 251$0 vlan 2212, 2236, 2500, 2505, 2510         -2511, 252, 2236, 2500, 2505, 2
 << 510-2511, 252         2, 2603, 500, 2505, 2510-2511, 2522, 2603, 2         629, 2633
c29s3p.f2.cresswell(config-mst)# instance 10 vlan 2802, 2926, 2929
c29s3p.f2.cresswell(config-mst)# instan
 << ce 11 vlan 8, 43, 52, 146, 156-157, 18$1 vlan 8, 43, 52, 146, 156-157, 180         , 200, 2143, 52, 146, 156-157, 180, 200, 218         
c29s3p.f2.
 << cresswell(config-mst)# instance 12 vlan 2008, 2043, 2052, 2146, 215$2 vlan 2008, 2043, 2052, 2146, 2156         -2157, 218, 2043, 2052, 2146, 2156-2157, 218 
 <<         0, 2200, 052, 2146, 2156-2157, 2180, 2200, 2         218
c29s3p.f2.cresswell(config-mst)#
c29s3p.f2.cresswell(config-mst)#end
c29s3p.f2.cresswell#
 << 
May 23 11:27:28: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s3p.f2.cresswell#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s3p.f2.cresswell(config)#
Expect: matched string 1: (config)#
 >> hostname c29s3p.f2.cresswell 

Expect: searching for 2 strs:  :# :>
 << hostname c29s3p.f2.cresswell 
c29s3p.f2.cresswell(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s3p.f2.cresswell#
 << 
May 23 11:27:34: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s3p.f2.cresswell#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s3p.f2.cresswell(config)#
Expect: matched string 1: (config)#
 >> snmp-server contact 6F-2282

Expect: searching for 1 strs:  :#
 << snmp-server contact 6F-2282
c29s3p.f2.cresswell(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s3p.f2.cresswell#
 << 
May 23 11:27:40: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s3p.f2.cresswell#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s3p.f2.cresswell(config)#
Expect: matched string 1: (config)#
 >> interface vlan 92

Expect: searching for 1 strs:  :(config-if)#
 << interface vlan 92
c29s3p.f2.cresswell(config-if)#
Expect: matched string 1: (config-if)#
 >> ip address 10.92.3.211 255.255.0.0

 >> ip broadcast-address 10.92.255.255

 >> end

Expect: searching for 1 strs:  :Configured
 << ip address 10.92.3.211 255.255.0.0
c29s3p.f2.cresswell(config-if)#ip broadcast-address 10.92.255.255
c29s3p.f2.cresswell(config-if)#end
c29s3p.f2.cresswell#
 << 
May 23 11:27:47: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s3p.f2.cresswell#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s3p.f2.cresswell(config)#
Expect: matched string 1: (config)#
 >> interface Vlan92

Expect: searching for 1 strs:  :(config-if)#
 << interface Vlan92
c29s3p.f2.cresswell(config-if)#
Expect: matched string 1: (config-if)#
 >> ip default-gateway 10.92.0.1

 >> end

Expect: searching for 1 strs:  :Configured
 << ip default-gateway 10.92.0.1
c29s3p.f2.cresswell(config)#end
c29s3p.f2.cresswell#
May 23 11:27:53: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s3p.f2.cresswell#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s3p.f2.cresswell(config)#
Expect: matched string 1: (config)#
 >> ip dhcp snooping

Expect: searching for 1 strs:  :#
 << ip dhcp snooping
c29s3p.f2.cresswell(config)#
Expect: matched string 1: #
 >> ip dhcp snooping vlan 31

Expect: searching for 1 strs:  :#
 << ip dhcp snooping vlan 31
c29s3p.f2.cresswell(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s3p.f2.cresswell#
May 23 11:28:00: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s3p.f2.cresswell#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s3p.f2.cresswell(config)#
Expect: matched string 1: (config)#
 >> default interface range gi1/0/1 - 24 

 >> interface range gi1/0/1 - 24 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi1/0/1 - 24 
c29s3p.f2.cresswell(config)#interface range gi1/0/1 - 24 
c29s3p.f2.cresswell(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport access vlan 31

 >> switchport mode access

 >> spanning-tree portfast

 >> switchport port-security maximum 2

 >> switchport port-security

 >> switchport port-security aging time 15

 >> switchport port-security violation protect

 >> switchport port-security aging type inactivity

 >> power inline never

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport access vlan 31
c29s3p.f2.cresswell(config-if-range)#switchport mode access
c29s3p.f2.cresswell(config-if-range)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, concentr
 << ators, switches, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast will be configured in 24 interfaces due to the range command 
 but will only have effect when the interfac
 << es are in a non-trunking mode.
c29s3p.f2.cresswell(config-if-range)#switchport port-security maximum 2
c29s3p.f2.cresswell(config-if-range)#switchport port-security
c29s3p.f2.cresswell(config-if-range)#switchport port-security aging time 15
c29s3p.f2.
 << cresswell(config-if-range)#switchport port-security violation prote$port-security violation protec         t
c29s3p.f2.cresswell(config-if-range)#switchport port-security aging type inac
 << $port-security aging type inact         ivity
c29s3p.f2.cresswell(config-if-range)#power inline never
c29s3p.f2.cresswell(config-if-range)#end
c29s3p.f2.cresswell#
 << 
May 23 11:28:08: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s3p.f2.cresswell#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s3p.f2.cresswell(config)#
Expect: matched string 1: (config)#
 >> default interface gi1/0/24 

 >> interface gi1/0/24 

Expect: searching for 1 strs:  :(config-if)#
 << default interface gi1/0/24 
Interface GigabitEthernet1/0/24 set to default configuration
c29s3p.f2.cresswell(config)#interface gi1/0/24 
c29s3p.f2.cresswell(config-if)#
Expect: matched string 1: (config-if)#
 >> switchport mode trunk

 >> switchport trunk native vlan 92

 >> ip dhcp snooping trust

 >> no keepalive

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport mode trunk
c29s3p.f2.cresswell(config-if)#switchport trunk native vlan 92
c29s3p.f2.cresswell(config-if)#ip dhcp snooping trust
c29s3p.f2.cresswell(config-if)#no keepalive
c29s3p.f2.cresswell(config-if)#end
c29s3p.f2.cresswell#
 << 
May 23 11:28:14: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s3p.f2.cresswell#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s3p.f2.cresswell(config)#
Expect: matched string 1: (config)#
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s3p.f2.cresswell#
 << 
May 23 11:28:18: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s3p.f2.cresswell#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s3p.f2.cresswell(config)#
Expect: matched string 1: (config)#
 >> crypto key generate rsa

 >> no

 >> 2048

Expect: searching for 2 strs:  :OK :(config)#
 << crypto key generate rsa
% You already have RSA keys defined named c29s3p.f2.cresswell.mgmt.msstate.edu.
% Do you really want to replace them? [yes/no]: no
c29s3p.f2.cresswell(config)#2048
                            ^
% Invalid input detected at '^' 
Expect: matched string 2: (config)#
 >> end

Expect: searching for 1 strs:  :Configured
 << marker.

c29s3p.f2.cresswell(config)#end
c29s3p.f2.cresswell#
 << 
May 23 11:28:23: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> write mem

Expect: searching for 2 strs:  :# :>
 << 
c29s3p.f2.cresswell#write mem
Building configuration...
[OK]
c29s3p.f2.cresswell#
Expect: matched string 1: #
 >> 
Expect: searching for 2 strs:  :# :>
 << 
c29s3p.f2.cresswell#
c29s3p.f2.cresswell#
Expect: matched string 1: #
 >> sh run

Expect: searching for 2 strs:  :# :>
 << sh run
Building configuration...

Current configuration : 13922 bytes
!
! Last configuration change at 11:28:23 CDT Wed May 23 2018
! NVRAM config last updated at 11:28:26 CDT Wed May 23 2018
!
version 15.2
no service pad
service timestamps debu
 << g datetime localtime
service timestamps log datetime localtime
service password-encryption
!
hostname c29s3p.f2.cresswell
!
boot-start-marker
boot-end-marker
!
enable secret 5 $1$VK0i$3fIDO33YnOsIv5ykIZyI0/
enable password 7 06315D361D4D2D49083E
 << 1E022B45
!
username root privilege 15 secret 5 $1$BX1W$KTqNrovl1R7vj1Qlgbn28.
no aaa new-model
clock timezone CST -6 0
clock summer-time CDT recurring
switch 1 provision ws-c2960x-24ps-l
!
!
ip dhcp snooping vlan 31
ip dhcp snooping
ip domain-n
 << ame mgmt.msstate.edu
ip name-server 130.18.80.12
!
!
!
!
!
authentication mac-move permit
!
!
crypto pki trustpoint TP-self-signed-2494998912
 enrollment selfsigned
 subject-name cn=IOS-Self-Signed-Certificate-2494998912
 revocation-check non
 << e
 rsakeypair TP-self-signed-2494998912
!
!
crypto pki certificate chain TP-self-signed-2494998912
 certificate self-signed 01
  	quit
!
spanning-tree mode mst
spanning-tree portfast bpduguard default
spanning-tree extend system-id
!
spanning-
 << tree mst configuration
 name msstate
 revision 1
 instance 1 vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 63, 70
 instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 160
 instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 2
 << 30, 232, 242, 246
 instance 1 vlan 256, 611-612, 654, 741, 996, 999
 instance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037, 2039-2040
 instance 2 vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096, 2104, 2110, 2126
 instance 2 vlan 2136, 214
 << 0, 2152, 2160, 2162-2163, 2168, 2189, 2194, 2202
 instance 2 vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 2654, 2999
 instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176, 196
 instance 3 vlan 244, 248, 927
 instance 4 vlan 2042, 2051,
 <<  2059, 2064, 2066, 2069, 2072, 2108, 2113, 2128
 instance 4 vlan 2144, 2176, 2196, 2244, 2248, 2927
 instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 228
 instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216, 2228
 instance 7 vla
 << n 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116, 124
 instance 7 vlan 172, 186, 192, 204-208, 210, 240-241, 251-252, 630, 928
 instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082, 2084
 instance 8 vlan 2097, 2114, 2116, 2124, 2172,
 <<  2186, 2192, 2204-2208, 2210
 instance 8 vlan 2240-2241, 2251-2252, 2630, 2928
 instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102, 112
 instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 500, 505, 510-511
 instance 9 vlan 522, 551
 << -570, 603, 629, 633, 742, 802, 926, 929
 instance 10 vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 2057, 2062, 2068
 instance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148, 2158
 instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522, 260
 << 3, 2629, 2633
 instance 10 vlan 2802, 2926, 2929
 instance 11 vlan 8, 43, 52, 146, 156-157, 180, 200, 218
 instance 12 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180, 2200, 2218
!
errdisable recovery cause udld
errdisable recovery cause bpduguard
err
 << disable recovery cause security-violation
errdisable recovery cause channel-misconfig
errdisable recovery cause pagp-flap
errdisable recovery cause dtp-flap
errdisable recovery cause link-flap
errdisable recovery cause sfp-config-mismatch
errdisable
 <<  recovery cause gbic-invalid
errdisable recovery cause psecure-violation
errdisable recovery cause port-mode-failure
errdisable recovery cause dhcp-rate-limit
errdisable recovery cause pppoe-ia-rate-limit
errdisable recovery cause mac-limit
errdisab
 << le recovery cause vmps
errdisable recovery cause storm-control
errdisable recovery cause inline-power
errdisable recovery cause arp-inspection
errdisable recovery cause loopback
errdisable recovery cause small-frame
errdisable recovery cause psp
er
 << rdisable recovery interval 1800
!
!
!
!
vlan internal allocation policy ascending
!
lldp run
!
! 
!
!
!
!
!
!
!
!
interface FastEthernet0
 no ip address
 shutdown
!
interface GigabitEthernet1/0/1
 switchport access vlan 31
 switchp
 << ort mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree po
 << rtfast
!
interface GigabitEthernet1/0/2
 switchport access vlan 31
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging typ
 << e inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/3
 switchport access vlan 31
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protec
 << t
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/4
 switchport access vlan 31
 switchport mode access
 
 << switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interfa
 << ce GigabitEthernet1/0/5
 switchport access vlan 31
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 swi
 << tchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/6
 switchport access vlan 31
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport por
 << t-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/7
 switchport access vlan 31
 switchport mode access
 switchport port-se
 << curity maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet
 << 1/0/8
 switchport access vlan 31
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-secur
 << ity
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/9
 switchport access vlan 31
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging t
 << ime 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/10
 switchport access vlan 31
 switchport mode access
 switchport port-security maximum 2
 << 
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/11
 switchpo
 << rt access vlan 31
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inli
 << ne never
 spanning-tree portfast
!
interface GigabitEthernet1/0/12
 switchport access vlan 31
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switch
 << port port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/13
 switchport access vlan 31
 switchport mode access
 switchport port-security maximum 2
 switchport po
 << rt-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/14
 switchport access vlan 
 << 31
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 span
 << ning-tree portfast
!
interface GigabitEthernet1/0/15
 switchport access vlan 31
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-secur
 << ity aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/16
 switchport access vlan 31
 switchport mode access
 switchport port-security maximum 2
 switchport port-security vio
 << lation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/17
 switchport access vlan 31
 switchport
 <<  mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portf
 << ast
!
interface GigabitEthernet1/0/18
 switchport access vlan 31
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type 
 << inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/19
 switchport access vlan 31
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 << 
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/20
 switchport access vlan 31
 switchport mode access
 
 << switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interfa
 << ce GigabitEthernet1/0/21
 switchport access vlan 31
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 sw
 << itchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/22
 switchport access vlan 31
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport p
 << ort-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/23
 switchport access vlan 31
 switchport mode access
 switchport port
 << -security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEther
 << net1/0/24
 switchport trunk native vlan 92
 switchport mode trunk
 no keepalive
 ip dhcp snooping trust
!
interface GigabitEthernet1/0/25
 switchport trunk native vlan 92
 switchport mode trunk
 ip dhcp snooping trust
!
interface GigabitEtherne
 << t1/0/26
 switchport trunk native vlan 92
 switchport mode trunk
 ip dhcp snooping trust
!
interface GigabitEthernet1/0/27
 switchport trunk native vlan 92
 switchport mode trunk
 ip dhcp snooping trust
!
interface GigabitEthernet1/0/28
 switchp
 << ort trunk native vlan 92
 switchport mode trunk
 ip dhcp snooping trust
!
interface Vlan1
 no ip address
 no ip route-cache
 shutdown
!
interface Vlan92
 ip address 10.92.3.211 255.255.0.0
 ip broadcast-address 10.92.255.255
!
ip default-gate
 << way 10.92.0.1
no ip http server
no ip http secure-server
!
!
logging facility local1
logging host 130.18.8.12
access-list 1 permit 10.92.0.0 0.0.255.255
access-list 1 permit 130.18.8.0 0.0.0.255
access-list 1 permit 10.93.0.0 0.0.255.255
access-
 << list 1 permit 130.18.1.0 0.0.0.255
!
snmp-server community sysnet RO 1
snmp-server community c2-b2=a2 RW 1
snmp-server contact 6F-2282
snmp-server enable traps snmp authentication linkdown linkup coldstart warmstart
snmp-server enable traps transcei
 << ver all
snmp-server enable traps tty
snmp-server enable traps cluster
snmp-server enable traps config-copy
snmp-server enable traps config
snmp-server enable traps config-ctid
snmp-server enable traps entity
snmp-server enable traps power-ethernet 
 << police
snmp-server enable traps cpu threshold
snmp-server enable traps bridge newroot topologychange
snmp-server enable traps stpx inconsistency root-inconsistency loop-inconsistency
snmp-server enable traps syslog
snmp-server enable traps vtp
snmp-
 << server enable traps vlancreate
snmp-server enable traps vlandelete
snmp-server enable traps flash insertion removal
snmp-server enable traps port-security
snmp-server enable traps envmon fan shutdown supply temperature status
snmp-server enable traps
 <<  errdisable
snmp-server enable traps mac-notification change move threshold
snmp-server enable traps vlan-membership
snmp-server host 130.18.8.12 sysnet 
no vstack
!
line con 0
line vty 0 4
 access-class 1 in
 password 7 133245055A0F207A260D243A1
 << 263
 login local
 transport input ssh
line vty 5 15
 access-class 1 in
 password 7 133245055A0F207A260D243A1263
 login local
 transport input ssh
!
ntp server 10.92.0.5
end

c29s3p.f2.cresswell#
Expect: matched string 1: #
 >> show interface status

Expect: searching for 2 strs:  :# :>
 << show interface status

Port      Name               Status       Vlan       Duplex  Speed Type 
Gi1/0/1                      notconnect   31           auto   auto 10/100/1000BaseTX
Gi1/0/2                      notconnect   31           auto   auto 10/
 << 100/1000BaseTX
Gi1/0/3                      notconnect   31           auto   auto 10/100/1000BaseTX
Gi1/0/4                      notconnect   31           auto   auto 10/100/1000BaseTX
Gi1/0/5                      notconnect   31           auto   auto 
 << 10/100/1000BaseTX
Gi1/0/6                      notconnect   31           auto   auto 10/100/1000BaseTX
Gi1/0/7                      notconnect   31           auto   auto 10/100/1000BaseTX
Gi1/0/8                      notconnect   31           auto   au
 << to 10/100/1000BaseTX
Gi1/0/9                      notconnect   31           auto   auto 10/100/1000BaseTX
Gi1/0/10                     notconnect   31           auto   auto 10/100/1000BaseTX
Gi1/0/11                     notconnect   31           auto  
 <<  auto 10/100/1000BaseTX
Gi1/0/12                     notconnect   31           auto   auto 10/100/1000BaseTX
Gi1/0/13                     notconnect   31           auto   auto 10/100/1000BaseTX
Gi1/0/14                     notconnect   31           aut
 << o   auto 10/100/1000BaseTX
Gi1/0/15                     notconnect   31           auto   auto 10/100/1000BaseTX
Gi1/0/16                     notconnect   31           auto   auto 10/100/1000BaseTX
Gi1/0/17                     notconnect   31           
 << auto   auto 10/100/1000BaseTX
Gi1/0/18                     notconnect   31           auto   auto 10/100/1000BaseTX
Gi1/0/19                     notconnect   31           auto   auto 10/100/1000BaseTX
Gi1/0/20                     notconnect   31        
 <<    auto   auto 10/100/1000BaseTX
Gi1/0/21                     notconnect   31           auto   auto 10/100/1000BaseTX
Gi1/0/22                     notconnect   31           auto   auto 10/100/1000BaseTX
Gi1/0/23                     notconnect   31     
 <<       auto   auto 10/100/1000BaseTX
Gi1/0/24                     notconnect   1            auto   auto 10/100/1000BaseTX
Gi1/0/25                     notconnect   1            auto   auto Not Present
Gi1/0/26                     notconnect   1         
 <<    auto   auto Not Present
Gi1/0/27                     notconnect   1            auto   auto Not Present
Gi1/0/28                     notconnect   1            auto   auto Not Present
Fa0                          disabled     routed       auto   auto 
 << 10/100BaseTX
c29s3p.f2.cresswell#
Expect: matched string 1: #
