trying to use serial port: /dev/ttyUSB0
 >> 
 >> 

Expect: searching for 4 strs:  :[yes/no] :Press RETURN to get started. :# :Switch>
 << 
Switch>
Switch>
Switch>
Switch>
Expect: matched string 4: Switch>
 >> term len 0

Expect: searching for 2 strs:  :# :>
 << term len 0
Switch>
Expect: matched string 2: >
 >> show version

Expect: searching for 2 strs:  :# :>
 << show version
Cisco IOS Software, C3560CX Software (C3560CX-UNIVERSALK9-M), Version 15.2(4)E5, RELEASE SOFTWARE (fc2)
Technical Support: http://www.cisco.com/techsupport
Copyright (c) 1986-2017 by Cisco Systems, Inc.
Compiled Mon 18-Sep-17 08:28 by pro
 << d_rel_team

ROM: Bootstrap program is C3560CX boot loader
BOOTLDR: C3560CX Boot Loader (C3560CX-HBOOT-M) Version 15.2(4r)E3, RELEASE SOFTWARE (fc1)

Switch uptime is 1 day, 22 hours, 17 minutes
System returned to ROM by power-on
System restarted at
 <<  15:16:40 UTC Mon Jun 4 2018
System image file is "flash:/c3560cx-universalk9-mz.152-4.E5/c3560cx-universalk9-mz.152-4.E5.bin"
Last reload reason: Unknown reason



This product contains cryptographic features and is subject to United
States and lo
 << cal country laws governing import, export, transfer and
use. Delivery of Cisco cryptographic products does not imply
third-party authority to import, export, distribute or use encryption.
Importers, exporters, distributors and users are responsible for
 << 
compliance with U.S. and local country laws. By using this product you
agree to comply with applicable laws and regulations. If you are unable
to comply with U.S. and local laws, return this product immediately.

A summary of U.S. laws governing Cis
 << co cryptographic products may be found at:
http://www.cisco.com/wwl/export/crypto/tool/stqrg.html

If you require further assistance please contact us by sending email to
export@cisco.com.

License Level: ipbase
License Type: Default. No valid lice
 << nse found.
Next reload license Level: ipbase

cisco WS-C3560CX-12PC-S (APM86XXX) processor (revision L0) with 524288K bytes of memory.
Processor board ID FOC2218Y2M0
Last reset from power-on
1 Virtual Ethernet interface
16 Gigabit Ethernet interfac
 << es
The password-recovery mechanism is enabled.

512K bytes of flash-simulated non-volatile configuration memory.
Base ethernet MAC Address       : 84:8A:8D:AD:31:80
Motherboard assembly number     : 73-100864-04
Power supply part number        : 341
 << -0675-02
Motherboard serial number       : FOC22173YXZ
Power supply serial number      : LIT22052N5V
Model revision number           : L0
Motherboard revision number     : B0
Model number                    : WS-C3560CX-12PC-S
System serial number  
 <<           : FOC2218Y2M0
Top Assembly Part Number        : 68-100571-01
Top Assembly Revision Number    : C0
Version ID                      : V03
CLEI Code Number                : CMM1L10DRB
Hardware Board Revision Number  : 0x09


Switch Ports Mo
 << del                     SW Version            SW Image                 
------ ----- -----                     ----------            ----------               
*    1 16    WS-C3560CX-12PC-S         15.2(4)E5             C3560CX-UNIVERSALK9-M    


Co
 << nfiguration register is 0xF

Switch>
Expect: matched string 2: >
 >> enable

Expect: searching for 2 strs:  :Password: :#
 << enable
Switch#
Expect: matched string 2: #
 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
Expect: matched string 1: (config)#
 >> no service pad

 >> service timestamps debug datetime localtime

 >> service timestamps log datetime localtime

 >> service password-encryption

 >> logging buffered informational

 >> enable secret W2w1cD0mIliG!

 >> enable password W2w1cD0mIliG!

 >> username root privilege 15 secret W2w1cD0mIliG!

 >> no aaa new-model

 >> clock timezone CST -6

 >> clock summer-time CDT recurring

 >> system mtu routing 1500

 >> ip subnet-zero

 >> ip domain-name mgmt.msstate.edu

 >> ip name-server 130.18.80.13

 >> ip name-server 130.18.80.12

 >> vtp domain vtp01.mgmt.msstate.edu

 >> vtp mode client

 >> crypto pki trustpoint TP-self-signed-2494998912

 >>  enrollment selfsigned

 >>  subject-name cn=IOS-Self-Signed-Certificate-2494998912

 >>  revocation-check none

 >>  rsakeypair TP-self-signed-2494998912

 >> crypto pki certificate chain TP-self-signed-2494998912

 >>  certificate self-signed 01 nvram:IOS-Self-Sig#3232.cer

 >> spanning-tree portfast bpduguard default

 >> spanning-tree extend system-id

 >> vlan internal allocation policy ascending

 >> lldp run

 >> errdisable recovery cause all

 >> errdisable recovery interval 1800

 >> interface Vlan1

 >>  no ip address

 >>  no ip route-cache

 >> interface Vlan92

 >> no ip http server

 >> no ip http secure-server

 >> logging facility local1

 >> logging 130.18.8.12

 >> access-list 1 permit 10.92.0.0 0.0.255.255

 >> access-list 1 permit 130.18.8.0 0.0.0.255

 >> access-list 1 permit 10.93.0.0 0.0.255.255

 >> access-list 1 permit 130.18.1.0 0.0.0.255

 >> snmp-server community sysnet RO 1

 >> snmp-server community c2-b2=a2 RW 1

 >> snmp-server enable traps snmp authentication linkdown linkup coldstart warmstart

 >> snmp-server enable traps transceiver all

 >> snmp-server enable traps tty

 >> snmp-server enable traps cluster

 >> snmp-server enable traps config-copy

 >> snmp-server enable traps config

 >> snmp-server enable traps config-ctid

 >> snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-auth-fail-vlan no-guest-vlan

 >> snmp-server enable traps entity

 >> snmp-server enable traps power-ethernet police

 >> snmp-server enable traps cpu threshold

 >> snmp-server enable traps rep

 >> snmp-server enable traps bridge newroot topologychange

 >> snmp-server enable traps stpx inconsistency root-inconsistency loop-inconsistency

 >> snmp-server enable traps syslog

 >> snmp-server enable traps vtp

 >> snmp-server enable traps vlancreate

 >> snmp-server enable traps vlandelete

 >> snmp-server enable traps flash insertion removal

 >> snmp-server enable traps port-security

 >> snmp-server enable traps envmon fan shutdown supply temperature status

 >> snmp-server enable traps errdisable

 >> snmp-server enable traps mac-notification change move threshold

 >> snmp-server enable traps vlan-membership

 >> snmp-server host 130.18.8.12 sysnet

 >> line con 0

 >> line vty 0 15

 >>  access-class 1 in

 >>  password W2w1cD0mIliG!

 >>  login local

 >>  transport input ssh

 >> ntp server 10.92.0.5

 >> 

 >> end

Expect: searching for 1 strs:  :Configured
 << no service pad
Switch(config)#service timestamps debug datetime localtime
Switch(config)#service timestamps log datetime localtime
Switch(config)#service password-encryption
Switch(config)#logging buffered informational
Switch(config)#enable secret W
 << 2w1cD0mIliG!
Switch(config)#enable password W2w1cD0mIliG!
The enable password you have chosen is the same as your enable secret.
This is not recommended.  Re-enter the enable password.

Switch(config)#username root privilege 15 secret W2w1cD0mIliG!

 << Switch(config)#no aaa new-model
Switch(config)#clock timezone CST -6
Switch(config)#clock summer-time CDT recurring
Switch(config)#system mtu routing 1500
Switch(config)#ip subnet-zero
Switch(config)#
Jun  6 13:35:57: %SYS-5-LOG_CONFIG_CHANGE: Buffe
 << r logging: level informational, xml disabled, filtering disabled, size (4096)ip domain-name mgmt.msstate.edu
Switch(config)#ip name-server 130.18.80.13
Switch(config)#ip name-server 130.18.80.12
Switch(config)#vtp domain vtp01.mgmt.msstate.edu
Changin
 << g VTP domain name from NULL to vtp01.mgmt.msstate.edu
Switch(config)#vtp mode client
Setting device to VTP Client mode for VLANS.
Switch(config)#
Jun  6 07:35:58: %SYS-6-CLOCKUPDATE: System clock has been updated from 13:35:58 UTC Wed Jun 6 2018 to 07
 << :35:58 CST Wed Jun 6 2018, configured from console by console.
Jun  6 08:35:58: %SYS-6-CLOCKUPDATE: System clock has been updated from 07:35:58 CST Wed Jun 6 2018 to 08:35:58 CDT Wed Jun 6 2018, configured from console by console.crypto pki trustpoint TP
 << -self-signed-2494998912
Switch(ca-trustpoint)# enrollment selfsigned
Switch(ca-trustpoint)# subject-name cn=IOS-Self-Signed-Certificate-2494998912
Switch(ca-trustpoint)# revocation-check none
Switch(ca-trustpoint)#
Jun  6 08:36:00: %SW_VLAN-6-VTP_DOM
 << AIN_NAME_CHG: VTP domain name changed to vtp01.mgmt.msstate.edu. rsakeypair TP-self-signed-2494998912
Switch(ca-trustpoint)#crypto pki certificate chain TP-self-signed-2494998912
Switch(config-cert-chain)# certificate self-signed 01 nvram:IOS-Self-Sig#3
 << 232$e self-signed 01 nvram:IOS-Self-Sig#3232.         cer
Switch(config-cert-chain)#spanning-tree portfast bpduguard default
Switch(config)#spanning-tree extend system-id
Switch(config)#vlan i
 << nternal allocation policy ascending
Switch(config)#lldp run
Switch(config)#errdisable recovery cause all
Switch(config)#errdisable recovery interval 1800
Switch(config)#interface Vlan1
Switch(config-if)# no ip address
Switch(config-if)# no ip route-
 << cache
Switch(config-if)#interface Vlan92
Switch(config-if)#no ip http server
Switch(config)#no ip http secure-server
Switch(config)#logging facility local1
Switch(config)#logging 130.18.8.12
Switch(config)#access-list 1 permit 10.92.0.0 0.0.255.255
 << 
Switch(config)#access-list 1 permit 130.18.8.0 0.0.0.255
Switch(config)#access-list 1 permit 10.93.0.0 0.0.255.255
Switch(config)#access-list 1 permit 130.18.1.0 0.0.0.255
Switch(config)#snmp-server community sysnet RO 1
Switch(config)#snmp-server co
 << mmunity c2-b2=a2 RW 1
Switch(config)#snmp-server enable traps snm
Jun  6 08:36:04: %SYS-6-LOGGINGHOST_STARTSTOP: Logging to host 130.18.8.12 port 0 CLI Request Triggered
Jun  6 08:36:04: %SYS-6-LOGGINGHOST_STARTSTOP: Logging to host 130.18.8.12 port 51
 << 4 started - CLI initiatedp authentication linkdown linkup c$ enable traps snmp authentication linkdown linkup co         ldstart w
 << aps snmp authentication linkdown linkup coldstart wa         rmstart
Switch(config)#snmp-server enable traps transceiver all
Switch(config)#snmp-server enable traps tty
Switch(config)#snmp-server enable traps cluster
Switch(config)#snm
 << p-server enable traps config-copy
Switch(config)#snmp-server enable traps config
Switch(config)#snmp-server enable traps config-ctid
Switch(config)#snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-au
 << $ enable traps dot1x auth-fail-vlan guest-vlan no-aut         h-fail-vlaps dot1x auth-fail-vlan guest-vlan no-auth-fail-vla         n no-gues
 << uth-fail-vlan guest-vlan no-auth-fail-vlan no-guest         -vlan
snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-auth-fail-vlan no-gu                         ^est-vlan

% Invalid input 
 << detected at '^' marker.

Switch(config)#snmp-server enable traps entity
Switch(config)#snmp-server enable traps power-ethernet police
Switch(config)#snmp-server enable traps cpu threshold
Switch(config)#snmp-server enable traps rep
Switch(config)#sn
 << mp-server enable traps bridge newroot topologychange
Switch(config)#snmp-server enable traps stpx inconsistency root-inconsistency$ enable traps stpx inconsistency root-inconsistency          
 << loop-incoaps stpx inconsistency root-inconsistency loop-incon         sistency
Switch(config)#snmp-server enable traps syslog
Switch(config)#snmp-server enable traps vtp
Swi
 << tch(config)#snmp-server enable traps vlancreate
Switch(config)#snmp-server enable traps vlandelete
Switch(config)#snmp-server enable traps flash insertion removal
Switch(config)#snmp-server enable traps port-security
Switch(config)#snmp-server enable 
 << traps envmon fan shutdown supply temperatur$ enable traps envmon fan shutdown supply temperature          status
Switch(config)#snmp-server enable traps errdisable
Switch(config)#snm
 << p-server enable traps mac-notification change move threshol$ enable traps mac-notification change move threshold         
Switch(config)#snmp-server enable traps vlan-membership
Swit
 << ch(config)#snmp-server host 130.18.8.12 sysnet
Switch(config)#line con 0
Switch(config-line)#line vty 0 15
Switch(config-line)# access-class 1 in
Switch(config-line)# password W2w1cD0mIliG!
Switch(config-line)# login local
Switch(config-line)# trans
 << port input ssh
Switch(config-line)#ntp server 10.92.0.5
Switch(config)#
Switch(config)#end
Switch#
 << 
Jun  6 08:36:13: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
Switch#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
Expect: matched string 1: (config)#
 >> spanning-tree mode pvst

 >> no spanning-tree vlan 2-66,68-91,93-97,99-1000

 >> 

 >> end

Expect: searching for 1 strs:  :Configured
 << spanning-tree mode pvst
Switch(config)#no spanning-tree vlan 2-66,68-91,93-97,99-1000
Switch(config)#
Switch(config)#end
Switch#
 << 
Jun  6 08:36:20: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
Switch#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
Expect: matched string 1: (config)#
 >> hostname c3560s1c.dorm.mvrdl 

Expect: searching for 2 strs:  :# :>
 << hostname c3560s1c.dorm.mvrdl 
c3560s1c.dorm.mvrdl(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c3560s1c.dorm.mvrdl#
 << 
Jun  6 08:36:27: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c3560s1c.dorm.mvrdl#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c3560s1c.dorm.mvrdl(config)#
Expect: matched string 1: (config)#
 >> snmp-server contact 6F-2291

Expect: searching for 1 strs:  :#
 << snmp-server contact 6F-2291
c3560s1c.dorm.mvrdl(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c3560s1c.dorm.mvrdl#
 << 
Jun  6 08:36:33: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c3560s1c.dorm.mvrdl#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c3560s1c.dorm.mvrdl(config)#
Expect: matched string 1: (config)#
 >> interface vlan 92

Expect: searching for 1 strs:  :(config-if)#
 << interface vlan 92
c3560s1c.dorm.mvrdl(config-if)#
Expect: matched string 1: (config-if)#
 >> ip address 10.253.92.10 255.255.0.0

 >> ip broadcast-address 10.92.255.255

 >> end

Expect: searching for 1 strs:  :Configured
 << ip address 10.253.92.10 255.255.0.0
c3560s1c.dorm.mvrdl(config-if)#ip broadcast-address 10.92.255.255
c3560s1c.dorm.mvrdl(config-if)#end
c3560s1c.dorm.mvrdl#
 << 
Jun  6 08:36:39: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c3560s1c.dorm.mvrdl#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c3560s1c.dorm.mvrdl(config)#
Expect: matched string 1: (config)#
 >> interface Vlan92

Expect: searching for 1 strs:  :(config-if)#
 << interface Vlan92
c3560s1c.dorm.mvrdl(config-if)#
Expect: matched string 1: (config-if)#
 >> ip default-gateway 10.92.0.1

 >> end

Expect: searching for 1 strs:  :Configured
 << ip default-gateway 10.92.0.1
c3560s1c.dorm.mvrdl(config)#end
c3560s1c.dorm.mvrdl#
Jun  6 08:36:45: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c3560s1c.dorm.mvrdl#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c3560s1c.dorm.mvrdl(config)#
Expect: matched string 1: (config)#
 >> ip dhcp snooping

Expect: searching for 1 strs:  :#
 << ip dhcp snooping
c3560s1c.dorm.mvrdl(config)#
Expect: matched string 1: #
 >> ip dhcp snooping vlan 67

Expect: searching for 1 strs:  :#
 << ip dhcp snooping vlan 67
c3560s1c.dorm.mvrdl(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c3560s1c.dorm.mvrdl#
Jun  6 08:36:52: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c3560s1c.dorm.mvrdl#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c3560s1c.dorm.mvrdl(config)#
Expect: matched string 1: (config)#
 >> default interface range gi0/1 - 12 

 >> interface range gi0/1 - 12 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi0/1 - 12 
c3560s1c.dorm.mvrdl(config)#interface range gi0/1 - 12 
c3560s1c.dorm.mvrdl(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport access vlan 67

 >> switchport mode access

 >> spanning-tree portfast

 >> switchport port-security maximum 2

 >> switchport port-security

 >> switchport port-security aging time 15

 >> switchport port-security violation protect

 >> switchport port-security aging type inactivity

 >> power inline never

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport access vlan 67
c3560s1c.dorm.mvrdl(config-if-range)#switchport mode access
c3560s1c.dorm.mvrdl(config-if-range)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, concentr
 << ators, switches, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast will be configured in 12 interfaces due to the range command 
 but will only have effect when the interfac
 << es are in a non-trunking mode.
c3560s1c.dorm.mvrdl(config-if-range)#switchport port-security maximum 2
c3560s1c.dorm.mvrdl(config-if-range)#switchport port-security
c3560s1c.dorm.mvrdl(config-if-range)#switchport port-security aging time 15
c3560s1c.d
 << orm.mvrdl(config-if-range)#switchport port-security violation prote$port-security violation protec         t
c3560s1c.dorm.mvrdl(config-if-range)#switchport port-security aging type inac
 << $port-security aging type inact         ivity
c3560s1c.dorm.mvrdl(config-if-range)#power inline never
c3560s1c.dorm.mvrdl(config-if-range)#end
c3560s1c.dorm.mvrdl#
 << 
Jun  6 08:37:05: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c3560s1c.dorm.mvrdl#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c3560s1c.dorm.mvrdl(config)#
Expect: matched string 1: (config)#
 >> default interface gi0/1 

 >> interface gi0/1 

Expect: searching for 1 strs:  :(config-if)#
 << default interface gi0/1 
Interface GigabitEthernet0/1 set to default configuration
c3560s1c.dorm.mvrdl(config)#interface gi0/1 
c3560s1c.dorm.mvrdl(config-if)#
Expect: matched string 1: (config-if)#
 >> switchport access vlan 92

 >> switchport mode access

 >> spanning-tree portfast

 >> switchport port-security maximum 2

 >> switchport port-security

 >> switchport port-security aging time 15

 >> switchport port-security violation protect

 >> switchport port-security aging type inactivity

 >> power inline consumption 15400

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport access vlan 92
c3560s1c.dorm.mvrdl(config-if)#switchport mode access
c3560s1c.dorm.mvrdl(config-if)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, concentrators, switc
 << hes, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast has been configured on GigabitEthernet0/1 but will only
 have effect when the interface is in a non-trunking mode.
c3
 << 560s1c.dorm.mvrdl(config-if)#switchport port-security maximum 2
c3560s1c.dorm.mvrdl(config-if)#switchport port-security
c3560s1c.dorm.mvrdl(config-if)#switchport port-security aging time 15
c3560s1c.dorm.mvrdl(config-if)#switchport port-security violat
 << ion protect
c3560s1c.dorm.mvrdl(config-if)#switchport port-security aging type inactivity
c3560s1c.dorm.mvrdl(config-if)#power inline consumption 15400
%CAUTION: Interface Gi0/1: Misconfiguring the 'power inline
 consumption/allocation' command may ca
 << use damage to the switch and void
 your warranty. Take precaution not to oversubscribe the power supply.
 It is recommended to enable power policing if the switch supports it.
 Refer to documentation.

c3560s1c.dorm.mvrdl(config-if)#end
c3560s1c.dor
 << m.mvrdl#
 << 
Jun  6 08:37:17: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c3560s1c.dorm.mvrdl#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c3560s1c.dorm.mvrdl(config)#
Expect: matched string 1: (config)#
 >> default interface gi0/12 

 >> interface gi0/12 

Expect: searching for 1 strs:  :(config-if)#
 << default interface gi0/12 
Interface GigabitEthernet0/12 set to default configuration
c3560s1c.dorm.mvrdl(config)#interface gi0/12 
c3560s1c.dorm.mvrdl(config-if)#
Expect: matched string 1: (config-if)#
 >> switchport mode trunk

 >> switchport trunk native vlan 92

 >> ip dhcp snooping trust

 >> no keepalive

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport mode trunk
c3560s1c.dorm.mvrdl(config-if)#switchport trunk native vlan 92
c3560s1c.dorm.mvrdl(config-if)#ip dhcp snooping trust
c3560s1c.dorm.mvrdl(config-if)#no keepalive
c3560s1c.dorm.mvrdl(config-if)#end
c3560s1c.dorm.mvrdl#
 << 
Jun  6 08:37:28: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c3560s1c.dorm.mvrdl#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c3560s1c.dorm.mvrdl(config)#
Expect: matched string 1: (config)#
 >> default interface range gi0/13 - 16 

 >> interface range gi0/13 - 16 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi0/13 - 16 
c3560s1c.dorm.mvrdl(config)#interface range gi0/13 - 16 
c3560s1c.dorm.mvrdl(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport mode trunk

 >> switchport trunk native vlan 92

 >> ip dhcp snooping trust

 >> no keepalive

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport mode trunk
c3560s1c.dorm.mvrdl(config-if-range)#switchport trunk native vlan 92
c3560s1c.dorm.mvrdl(config-if-range)#ip dhcp snooping trust
c3560s1c.dorm.mvrdl(config-if-range)#no keepalive
c3560s1c.dorm.mvrdl(config-if-range)#end
c3560s1c
 << .dorm.mvrdl#
 << 
Jun  6 08:37:39: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c3560s1c.dorm.mvrdl#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c3560s1c.dorm.mvrdl(config)#
Expect: matched string 1: (config)#
 >> crypto key generate rsa

 >> no

 >> 2048

Expect: searching for 2 strs:  :OK :(config)#
 << crypto key generate rsa
The name for the keys will be: c3560s1c.dorm.mvrdl.mgmt.msstate.edu
Choose the size of the key modulus in the range of 360 to 4096 for your
  General Purpose Keys. Choosing a key modulus greater than 512 may take
  a few minute
 << s.

How many bits in the modulus [512]: no
% A decimal number between 360 and 4096.
How many bits in the modulus [512]: 2048
% Generating 2048 bit RSA keys, keys will be non-exportable...
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
[OK] (elapsed time was 9 seconds)

c3560s1c.dorm.mvrdl(config)#
Expect: matched string 1: OK
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c3560s1c.dorm.mvrdl#
Jun  6 08:38:02: %SSH-5-ENABLED: SSH 1.99 has been enabled
Jun  6 08:38:03: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> write mem

Expect: searching for 2 strs:  :# :>
 << 
c3560s1c.dorm.mvrdl#write mem
Building configuration...
[OK]
c3560s1c.dorm.mvrdl#
Expect: matched string 1: #
 >> 
Expect: searching for 2 strs:  :# :>
 << 
c3560s1c.dorm.mvrdl#
c3560s1c.dorm.mvrdl#
Expect: matched string 1: #
 >> sh run

Expect: searching for 2 strs:  :# :>
 << sh run
Building configuration...

Current configuration : 8230 bytes
!
! Last configuration change at 08:38:03 CDT Wed Jun 6 2018
! NVRAM config last updated at 08:38:05 CDT Wed Jun 6 2018
!
version 15.2
no service pad
service timestamps debug d
 << atetime localtime
service timestamps log datetime localtime
service password-encryption
!
hostname c3560s1c.dorm.mvrdl
!
boot-start-marker
boot-end-marker
!
logging buffered informational
enable secret 5 $1$RToH$C6O9v9A1.D0etvWgNiaut.
enable pa
 << ssword 7 133245055A0F207A260D243A1263
!
username root privilege 15 secret 5 $1$m6zn$Io810XcHVDHHC/Zfe9hhu/
no aaa new-model
clock timezone CST -6 0
clock summer-time CDT recurring
system mtu routing 1500
!
!
!
!
!
!
ip dhcp snooping vlan 67

 << ip dhcp snooping
ip domain-name mgmt.msstate.edu
ip name-server 130.18.80.13
ip name-server 130.18.80.12
!
!
!
!
!
!
!
crypto pki trustpoint TP-self-signed-2494998912
 enrollment selfsigned
 subject-name cn=IOS-Self-Signed-Certificate-2494998
 << 912
 revocation-check none
 rsakeypair TP-self-signed-2494998912
!
!
crypto pki certificate chain TP-self-signed-2494998912
 certificate self-signed 01
  	quit
!
spanning-tree mode pvst
spanning-tree portfast edge bpduguard default
spanning-tre
 << e extend system-id
no spanning-tree vlan 2-66,68-91,93-97,99-1000
errdisable recovery cause udld
errdisable recovery cause bpduguard
errdisable recovery cause security-violation
errdisable recovery cause channel-misconfig
errdisable recovery cause p
 << agp-flap
errdisable recovery cause dtp-flap
errdisable recovery cause link-flap
errdisable recovery cause sfp-config-mismatch
errdisable recovery cause gbic-invalid
errdisable recovery cause l2ptguard
errdisable recovery cause psecure-violation
err
 << disable recovery cause port-mode-failure
errdisable recovery cause dhcp-rate-limit
errdisable recovery cause pppoe-ia-rate-limit
errdisable recovery cause mac-limit
errdisable recovery cause vmps
errdisable recovery cause storm-control
errdisable re
 << covery cause inline-power
errdisable recovery cause arp-inspection
errdisable recovery cause loopback
errdisable recovery cause small-frame
errdisable recovery cause psp
errdisable recovery interval 1800
!
!
!
!
vlan internal allocation policy a
 << scending
!
lldp run
!
! 
!
!
!
!
!
!
!
!
!
interface GigabitEthernet0/1
 switchport access vlan 92
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging t
 << ime 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline consumption 15400
 spanning-tree portfast edge
!
interface GigabitEthernet0/2
 switchport access vlan 67
 switchport mode access
 switchport port-secur
 << ity maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast edge
!
interface GigabitEtherne
 << t0/3
 switchport access vlan 67
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-securit
 << y
 power inline never
 spanning-tree portfast edge
!
interface GigabitEthernet0/4
 switchport access vlan 67
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging t
 << ime 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast edge
!
interface GigabitEthernet0/5
 switchport access vlan 67
 switchport mode access
 switchport port-security maximum 
 << 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast edge
!
interface GigabitEthernet0/6
 switc
 << hport access vlan 67
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power in
 << line never
 spanning-tree portfast edge
!
interface GigabitEthernet0/7
 switchport access vlan 67
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 swi
 << tchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast edge
!
interface GigabitEthernet0/8
 switchport access vlan 67
 switchport mode access
 switchport port-security maximum 2
 switchpo
 << rt port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast edge
!
interface GigabitEthernet0/9
 switchport access
 <<  vlan 67
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never

 <<  spanning-tree portfast edge
!
interface GigabitEthernet0/10
 switchport access vlan 67
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport por
 << t-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast edge
!
interface GigabitEthernet0/11
 switchport access vlan 67
 switchport mode access
 switchport port-security maximum 2
 switchport port-se
 << curity violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast edge
!
interface GigabitEthernet0/12
 switchport trunk native vl
 << an 92
 switchport mode trunk
 no keepalive
 ip dhcp snooping trust
!
interface GigabitEthernet0/13
 switchport trunk native vlan 92
 switchport mode trunk
 ip dhcp snooping trust
!
interface GigabitEthernet0/14
 switchport trunk native vlan 92
 << 
 switchport mode trunk
 ip dhcp snooping trust
!
interface GigabitEthernet0/15
 switchport trunk native vlan 92
 switchport mode trunk
 ip dhcp snooping trust
!
interface GigabitEthernet0/16
 switchport trunk native vlan 92
 switchport mode tru
 << nk
 ip dhcp snooping trust
!
interface Vlan1
 no ip address
 no ip route-cache
 shutdown
!
interface Vlan92
 ip address 10.253.92.10 255.255.0.0
 ip broadcast-address 10.92.255.255
!
ip default-gateway 10.92.0.1
ip forward-protocol nd
no ip 
 << http server
no ip http secure-server
!
!
!
logging facility local1
logging host 130.18.8.12
access-list 1 permit 10.92.0.0 0.0.255.255
access-list 1 permit 130.18.8.0 0.0.0.255
access-list 1 permit 10.93.0.0 0.0.255.255
access-list 1 permit 130.
 << 18.1.0 0.0.0.255
!
snmp-server community sysnet RO 1
snmp-server community c2-b2=a2 RW 1
snmp-server contact 6F-2291
snmp-server enable traps snmp authentication linkdown linkup coldstart warmstart
snmp-server enable traps transceiver all
snmp-serv
 << er enable traps tty
snmp-server enable traps cluster
snmp-server enable traps config-copy
snmp-server enable traps config
snmp-server enable traps config-ctid
snmp-server enable traps entity
snmp-server enable traps power-ethernet police
snmp-serve
 << r enable traps cpu threshold
snmp-server enable traps rep
snmp-server enable traps bridge newroot topologychange
snmp-server enable traps stpx inconsistency root-inconsistency loop-inconsistency
snmp-server enable traps syslog
snmp-server enable trap
 << s vtp
snmp-server enable traps vlancreate
snmp-server enable traps vlandelete
snmp-server enable traps flash insertion removal
snmp-server enable traps port-security
snmp-server enable traps envmon fan shutdown supply temperature status
snmp-server 
 << enable traps errdisable
snmp-server enable traps mac-notification change move threshold
snmp-server enable traps vlan-membership
snmp-server host 130.18.8.12 sysnet 
no vstack
!
line con 0
line vty 0 4
 access-class 1 in
 password 7 1525591B55290
 << F74251A392B3446
 login local
 transport input ssh
line vty 5 15
 access-class 1 in
 password 7 1525591B55290F74251A392B3446
 login local
 transport input ssh
!
ntp server 10.92.0.5
!
end

c3560s1c.dorm.mvrdl#
Expect: matched string 1: #
 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c3560s1c.dorm.mvrdl(config)#
Expect: matched string 1: (config)#
 >> no service pad

 >> service timestamps debug datetime localtime

 >> service timestamps log datetime localtime

 >> service password-encryption

 >> logging buffered informational

 >> enable secret W2w1cD0mIliG!

 >> enable password W2w1cD0mIliG!

 >> username root privilege 15 secret W2w1cD0mIliG!

 >> no aaa new-model

 >> clock timezone CST -6

 >> clock summer-time CDT recurring

 >> system mtu routing 1500

 >> ip subnet-zero

 >> ip domain-name mgmt.msstate.edu

 >> ip name-server 130.18.80.13

 >> ip name-server 130.18.80.12

 >> vtp domain vtp01.mgmt.msstate.edu

 >> vtp mode client

 >> crypto pki trustpoint TP-self-signed-2494998912

 >>  enrollment selfsigned

 >>  subject-name cn=IOS-Self-Signed-Certificate-2494998912

 >>  revocation-check none

 >>  rsakeypair TP-self-signed-2494998912

 >> crypto pki certificate chain TP-self-signed-2494998912

 >>  certificate self-signed 01 nvram:IOS-Self-Sig#3232.cer

 >> spanning-tree portfast bpduguard default

 >> spanning-tree extend system-id

 >> vlan internal allocation policy ascending

 >> lldp run

 >> errdisable recovery cause all

 >> errdisable recovery interval 1800

 >> interface Vlan1

 >>  no ip address

 >>  no ip route-cache

 >> interface Vlan92

 >> no ip http server

 >> no ip http secure-server

 >> logging facility local1

 >> logging 130.18.8.12

 >> access-list 1 permit 10.92.0.0 0.0.255.255

 >> access-list 1 permit 130.18.8.0 0.0.0.255

 >> access-list 1 permit 10.93.0.0 0.0.255.255

 >> access-list 1 permit 130.18.1.0 0.0.0.255

 >> snmp-server community sysnet RO 1

 >> snmp-server community c2-b2=a2 RW 1

 >> snmp-server enable traps snmp authentication linkdown linkup coldstart warmstart

 >> snmp-server enable traps transceiver all

 >> snmp-server enable traps tty

 >> snmp-server enable traps cluster

 >> snmp-server enable traps config-copy

 >> snmp-server enable traps config

 >> snmp-server enable traps config-ctid

 >> snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-auth-fail-vlan no-guest-vlan

 >> snmp-server enable traps entity

 >> snmp-server enable traps power-ethernet police

 >> snmp-server enable traps cpu threshold

 >> snmp-server enable traps rep

 >> snmp-server enable traps bridge newroot topologychange

 >> snmp-server enable traps stpx inconsistency root-inconsistency loop-inconsistency

 >> snmp-server enable traps syslog

 >> snmp-server enable traps vtp

 >> snmp-server enable traps vlancreate

 >> snmp-server enable traps vlandelete

 >> snmp-server enable traps flash insertion removal

 >> snmp-server enable traps port-security

 >> snmp-server enable traps envmon fan shutdown supply temperature status

 >> snmp-server enable traps errdisable

 >> snmp-server enable traps mac-notification change move threshold

 >> snmp-server enable traps vlan-membership

 >> snmp-server host 130.18.8.12 sysnet

 >> line con 0

 >> line vty 0 15

 >>  access-class 1 in

 >>  password W2w1cD0mIliG!

 >>  login local

 >>  transport input ssh

 >> ntp server 10.92.0.5

 >> 

 >> end

Expect: searching for 1 strs:  :Configured
 << no service pad
c3560s1c.dorm.mvrdl(config)#service timestamps debug datetime localtime
c3560s1c.dorm.mvrdl(config)#service timestamps log datetime localtime
c3560s1c.dorm.mvrdl(config)#service password-encryption
c3560s1c.dorm.mvrdl(config)#logging bu
 << ffered informational
c3560s1c.dorm.mvrdl(config)#enable secret W2w1cD0mIliG!
The enable secret you have chosen is the same as your enable password.
This is not recommended.  Re-enter the enable secret.

c3560s1c.dorm.mvrdl(config)#enable password W2w
 << 1cD0mIliG!
The enable password you have chosen is the same as your enable secret.
This is not recommended.  Re-enter the enable password.

c3560s1c.dorm.mvrdl(config)#username root privilege 15 secret W2w1cD0mIliG!
c3560s1c.dorm.mvrdl(config)#no aaa 
 << new-model
c3560s1c.dorm.mvrdl(config)#clock timezone CST -6
c3560s1c.dorm.mvrdl(config)#clock summer-time CDT recurring
c3560s1c.dorm.mvrdl(config)#system mtu routing 1500
c3560s1c.dorm.mvrdl(config)#ip subnet-zero
c3560s1c.dorm.mvrdl(config)#ip doma
 << in-name mgmt.msstate.edu
c3560s1c.dorm.mvrdl(config)#ip name-server 130.18.80.13
c3560s1c.dorm.mvrdl(config)#ip name-server 130.18.80.12
c3560s1c.dorm.mvrdl(config)#vtp domain vtp01.mgmt.msstate.edu
Domain name already set to vtp01.mgmt.msstate.edu.

 << c3560s1c.dorm.mvrdl(config)#vtp mode client
Device mode already VTP Client for VLANS.
c3560s1c.dorm.mvrdl(config)#crypto pki trustpoint TP-self-signed-2494998912
c3560s1c.dorm.mvrdl(ca-trustpoint)# enrollment selfsigned
c3560s1c.dorm.mvrdl(ca-trustpoi
 << nt)# subject-name cn=IOS-Self-Signed-Certifica$me cn=IOS-Self-Signed-Certificat         e-2494998Self-Signed-Certificate-24949989         12
c3560s1c.dor
 << m.mvrdl(ca-trustpoint)# revocation-check none
c3560s1c.dorm.mvrdl(ca-trustpoint)# rsakeypair TP-self-signed-2494998912
c3560s1c.dorm.mvrdl(ca-trustpoint)#crypto pki certificate chain TP-self-signe$certificate ch
 << ain TP-self-signed         -24949989e chain TP-self-signed-249499891         2
c3560s1c.dorm.mvrdl(config-cert-chain)# certificate self-signed 01 nvram:IOS-$
 << e self-signed 01 nvram:IOS-S         elf-Sig#3ned 01 nvram:IOS-Self-Sig#32         32.cer
c3560s1c.dorm.mvrdl(config-cert-chain)#spanning-tree portfast bpduguard defau
 << $ee portfast bpduguard defaul         t
c3560s1c.dorm.mvrdl(config)#spanning-tree extend system-id
c3560s1c.dorm.mvrdl(config)#vlan internal allocation policy ascending
c3560s1c.dorm.mvrdl(config)#lldp run
c3560s1c.dorm.mvrdl(config)#er
 << rdisable recovery cause all
c3560s1c.dorm.mvrdl(config)#errdisable recovery interval 1800
c3560s1c.dorm.mvrdl(config)#interface Vlan1
c3560s1c.dorm.mvrdl(config-if)# no ip address
c3560s1c.dorm.mvrdl(config-if)# no ip route-cache
c3560s1c.dorm.mvrdl(
 << config-if)#
Jun  6 08:44:02: % Multiple self signed certificates in config
    certificate for trust point TP-self-signed-2494998912 ignored
interface Vlan92
c3560s1c.dorm.mvrdl(config-if)#no ip http server
c3560s1c.dorm.mvrdl(config)#no ip http secu
 << re-server
c3560s1c.dorm.mvrdl(config)#logging facility local1
c3560s1c.dorm.mvrdl(config)#logging 130.18.8.12
c3560s1c.dorm.mvrdl(config)#access-list 1 permit 10.92.0.0 0.0.255.255
c3560s1c.dorm.mvrdl(config)#access-list 1 permit 130.18.8.0 0.0.0.255
 << 
c3560s1c.dorm.mvrdl(config)#access-list 1 permit 10.93.0.0 0.0.255.255
c3560s1c.dorm.mvrdl(config)#access-list 1 permit 130.18.1.0 0.0.0.255
c3560s1c.dorm.mvrdl(config)#snmp-server community sysnet RO 1
c3560s1c.dorm.mvrdl(config)#snmp-server communit
 << y c2-b2=a2 RW 1
c3560s1c.dorm.mvrdl(config)#snmp-server enable traps snmp authentication link$ enable traps snmp authentication linkd         own linku
 << aps snmp authentication linkdown linkup          coldstaruthentication linkdown linkup coldstart          warmstarion linkdown linkup cold
 << start warmstart         
c3560s1c.dorm.mvrdl(config)#snmp-server enable traps transceiver all
c3560s1c.dorm.mvrdl(config)#snmp-server enable traps tty
c3560s1c.dorm.mvrdl(config)#snmp-server enable traps cluster
c3560s1c.dorm.mvrdl(config)#sn
 << mp-server enable traps config-copy
c3560s1c.dorm.mvrdl(config)#snmp-server enable traps config
c3560s1c.dorm.mvrdl(config)#snmp-server enable traps config-ctid
c3560s1c.dorm.mvrdl(config)#snmp-server enable traps dot1x auth-fail-vlan gue
 << $ enable traps dot1x auth-fail-vlan gues         t-vlan noaps dot1x auth-fail-vlan guest-vlan no-         auth-fail
 << uth-fail-vlan guest-vlan no-auth-fail-         vlan no-gvlan guest-vlan no-auth-fail-vlan no-gu         est-vlan
snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-auth-fai
 << l-vlan no-gu                         ^est-vlan

% Invalid input detected at '^' marker.

c3560s1c.dorm.mvrdl(config)#snmp-server enable traps entity
c3560s1c.dorm.mvrdl(config)#snmp-server enable traps power-ethernet police
c3560s1c.dorm.mvrdl(confi
 << g)#snmp-server enable traps cpu threshold
c3560s1c.dorm.mvrdl(config)#snmp-server enable traps rep
c3560s1c.dorm.mvrdl(config)#snmp-server enable traps bridge newroot topologyc$ enable traps bridge newroo
 << t topologych         ange
c3560s1c.dorm.mvrdl(config)#snmp-server enable traps stpx inconsistency root-$ enable traps stpx inconsistency root-i         nconsiste
 << aps stpx inconsistency root-inconsisten         cy loop-inconsistency root-inconsistency loop-in         consistency ro
 << ot-inconsistency loop-inconsistenc         y
c3560s1c.dorm.mvrdl(config)#snmp-server enable traps syslog
c3560s1c.dorm.mvrdl(config)#snmp-server enable traps vtp
c3560s1c.dorm.mvrdl(config)#snmp-server enable traps vlancreate
c3560s1c.dorm.mv
 << rdl(config)#snmp-server enable traps vlandelete
c3560s1c.dorm.mvrdl(config)#snmp-server enable traps flash insertion removal
c3560s1c.dorm.mvrdl(config)#snmp-server enable traps port-security
c3560s1c.dorm.mvrdl(config)#snmp-server enable traps envmon 
 << fan shutdown supp$ enable traps envmon fan shutdown suppl         y temperaaps envmon fan shutdown supply temperat         ure statu
 <<  fan shutdown supply temperature status         
c3560s1c.dorm.mvrdl(config)#snmp-server enable traps errdisable
c3560s1c.dorm.mvrdl(config)#snmp-server enable traps mac-notification change 
 << $ enable traps mac-notification change m         ove thresaps mac-notification change move thresh         old
c3560s1c.dorm.mvrdl(config)#snmp-server ena
 << ble traps vlan-membership
c3560s1c.dorm.mvrdl(config)#snmp-server host 130.18.8.12 sysnet
c3560s1c.dorm.mvrdl(config)#line con 0
c3560s1c.dorm.mvrdl(config-line)#line vty 0 15
c3560s1c.dorm.mvrdl(config-line)# access-class 1 in
c3560s1c.dorm.mvrdl(co
 << nfig-line)# password W2w1cD0mIliG!
c3560s1c.dorm.mvrdl(config-line)# login local
c3560s1c.dorm.mvrdl(config-line)# transport input ssh
c3560s1c.dorm.mvrdl(config-line)#ntp server 10.92.0.5
c3560s1c.dorm.mvrdl(config)#
c3560s1c.dorm.mvrdl(config)#end
 << 
c3560s1c.dorm.mvrdl#
 << 
Jun  6 08:44:14: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c3560s1c.dorm.mvrdl#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c3560s1c.dorm.mvrdl(config)#
Expect: matched string 1: (config)#
 >> spanning-tree mode pvst

 >> no spanning-tree vlan 2-66,68-91,93-97,99-1000

 >> 

 >> end

Expect: searching for 1 strs:  :Configured
 << spanning-tree mode pvst
c3560s1c.dorm.mvrdl(config)#no spanning-tree vlan 2-66,68-91,93-97,99-1000
c3560s1c.dorm.mvrdl(config)#
c3560s1c.dorm.mvrdl(config)#end
c3560s1c.dorm.mvrdl#
 << 
Jun  6 08:44:20: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c3560s1c.dorm.mvrdl#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c3560s1c.dorm.mvrdl(config)#
Expect: matched string 1: (config)#
 >> hostname c3560s1c.dorm.mvrdl 

Expect: searching for 2 strs:  :# :>
 << hostname c3560s1c.dorm.mvrdl 
c3560s1c.dorm.mvrdl(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c3560s1c.dorm.mvrdl#
 << 
Jun  6 08:44:27: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c3560s1c.dorm.mvrdl#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c3560s1c.dorm.mvrdl(config)#
Expect: matched string 1: (config)#
 >> snmp-server contact 6F-2291

Expect: searching for 1 strs:  :#
 << snmp-server contact 6F-2291
c3560s1c.dorm.mvrdl(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c3560s1c.dorm.mvrdl#
 << 
Jun  6 08:44:33: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c3560s1c.dorm.mvrdl#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c3560s1c.dorm.mvrdl(config)#
Expect: matched string 1: (config)#
 >> interface vlan 92

Expect: searching for 1 strs:  :(config-if)#
 << interface vlan 92
c3560s1c.dorm.mvrdl(config-if)#
Expect: matched string 1: (config-if)#
 >> ip address 10.253.92.10 255.255.0.0

 >> ip broadcast-address 10.92.255.255

 >> end

Expect: searching for 1 strs:  :Configured
 << ip address 10.253.92.10 255.255.0.0
c3560s1c.dorm.mvrdl(config-if)#ip broadcast-address 10.92.255.255
c3560s1c.dorm.mvrdl(config-if)#end
c3560s1c.dorm.mvrdl#
 << 
Jun  6 08:44:39: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c3560s1c.dorm.mvrdl#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c3560s1c.dorm.mvrdl(config)#
Expect: matched string 1: (config)#
 >> interface Vlan92

Expect: searching for 1 strs:  :(config-if)#
 << interface Vlan92
c3560s1c.dorm.mvrdl(config-if)#
Expect: matched string 1: (config-if)#
 >> ip default-gateway 10.92.0.1

 >> end

Expect: searching for 1 strs:  :Configured
 << ip default-gateway 10.92.0.1
c3560s1c.dorm.mvrdl(config)#end
c3560s1c.dorm.mvrdl#
Jun  6 08:44:45: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c3560s1c.dorm.mvrdl#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c3560s1c.dorm.mvrdl(config)#
Expect: matched string 1: (config)#
 >> ip dhcp snooping

Expect: searching for 1 strs:  :#
 << ip dhcp snooping
c3560s1c.dorm.mvrdl(config)#
Expect: matched string 1: #
 >> ip dhcp snooping vlan 67

Expect: searching for 1 strs:  :#
 << ip dhcp snooping vlan 67
c3560s1c.dorm.mvrdl(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c3560s1c.dorm.mvrdl#
Jun  6 08:44:52: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c3560s1c.dorm.mvrdl#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c3560s1c.dorm.mvrdl(config)#
Expect: matched string 1: (config)#
 >> default interface range gi0/1 - 12 

 >> interface range gi0/1 - 12 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi0/1 - 12 
c3560s1c.dorm.mvrdl(config)#interface range gi0/1 - 12 
c3560s1c.dorm.mvrdl(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport access vlan 67

 >> switchport mode access

 >> spanning-tree portfast

 >> switchport port-security maximum 2

 >> switchport port-security

 >> switchport port-security aging time 15

 >> switchport port-security violation protect

 >> switchport port-security aging type inactivity

 >> power inline never

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport access vlan 67
c3560s1c.dorm.mvrdl(config-if-range)#switchport mode access
c3560s1c.dorm.mvrdl(config-if-range)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, concentr
 << ators, switches, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast will be configured in 12 interfaces due to the range command 
 but will only have effect when the interfac
 << es are in a non-trunking mode.
c3560s1c.dorm.mvrdl(config-if-range)#switchport port-security maximum 2
c3560s1c.dorm.mvrdl(config-if-range)#switchport port-security
c3560s1c.dorm.mvrdl(config-if-range)#switchport port-security aging time 15
c3560s1c.d
 << orm.mvrdl(config-if-range)#switchport port-security violation prote$port-security violation protec         t
c3560s1c.dorm.mvrdl(config-if-range)#switchport port-security aging type inac
 << $port-security aging type inact         ivity
c3560s1c.dorm.mvrdl(config-if-range)#power inline never
c3560s1c.dorm.mvrdl(config-if-range)#end
c3560s1c.dorm.mvrdl#
 << 
Jun  6 08:45:05: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c3560s1c.dorm.mvrdl#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c3560s1c.dorm.mvrdl(config)#
Expect: matched string 1: (config)#
 >> default interface gi0/1 

 >> interface gi0/1 

Expect: searching for 1 strs:  :(config-if)#
 << default interface gi0/1 
Interface GigabitEthernet0/1 set to default configuration
c3560s1c.dorm.mvrdl(config)#interface gi0/1 
c3560s1c.dorm.mvrdl(config-if)#
Expect: matched string 1: (config-if)#
 >> switchport access vlan 92

 >> switchport mode access

 >> spanning-tree portfast

 >> switchport port-security maximum 2

 >> switchport port-security

 >> switchport port-security aging time 15

 >> switchport port-security violation protect

 >> switchport port-security aging type inactivity

 >> power inline consumption 15400

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport access vlan 92
c3560s1c.dorm.mvrdl(config-if)#switchport mode access
c3560s1c.dorm.mvrdl(config-if)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, concentrators, switc
 << hes, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast has been configured on GigabitEthernet0/1 but will only
 have effect when the interface is in a non-trunking mode.
c3
 << 560s1c.dorm.mvrdl(config-if)#switchport port-security maximum 2
c3560s1c.dorm.mvrdl(config-if)#switchport port-security
c3560s1c.dorm.mvrdl(config-if)#switchport port-security aging time 15
c3560s1c.dorm.mvrdl(config-if)#switchport port-security violat
 << ion protect
c3560s1c.dorm.mvrdl(config-if)#switchport port-security aging type inactivity
c3560s1c.dorm.mvrdl(config-if)#power inline consumption 15400
%CAUTION: Interface Gi0/1: Misconfiguring the 'power inline
 consumption/allocation' command may ca
 << use damage to the switch and void
 your warranty. Take precaution not to oversubscribe the power supply.
 It is recommended to enable power policing if the switch supports it.
 Refer to documentation.

c3560s1c.dorm.mvrdl(config-if)#end
c3560s1c.dor
 << m.mvrdl#
 << 
Jun  6 08:45:17: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c3560s1c.dorm.mvrdl#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c3560s1c.dorm.mvrdl(config)#
Expect: matched string 1: (config)#
 >> default interface gi0/12 

 >> interface gi0/12 

Expect: searching for 1 strs:  :(config-if)#
 << default interface gi0/12 
Interface GigabitEthernet0/12 set to default configuration
c3560s1c.dorm.mvrdl(config)#interface gi0/12 
c3560s1c.dorm.mvrdl(config-if)#
Expect: matched string 1: (config-if)#
 >> switchport mode trunk

 >> switchport trunk native vlan 92

 >> ip dhcp snooping trust

 >> no keepalive

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport mode trunk
c3560s1c.dorm.mvrdl(config-if)#switchport trunk native vlan 92
c3560s1c.dorm.mvrdl(config-if)#ip dhcp snooping trust
c3560s1c.dorm.mvrdl(config-if)#no keepalive
c3560s1c.dorm.mvrdl(config-if)#end
c3560s1c.dorm.mvrdl#
 << 
Jun  6 08:45:28: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c3560s1c.dorm.mvrdl#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c3560s1c.dorm.mvrdl(config)#
Expect: matched string 1: (config)#
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c3560s1c.dorm.mvrdl#
 << 
Jun  6 08:45:37: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c3560s1c.dorm.mvrdl#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c3560s1c.dorm.mvrdl(config)#
Expect: matched string 1: (config)#
 >> crypto key generate rsa

 >> no

 >> 2048

Expect: searching for 2 strs:  :OK :(config)#
 << crypto key generate rsa
% You already have RSA keys defined named c3560s1c.dorm.mvrdl.mgmt.msstate.edu.
% Do you really want to replace them? [yes/no]: no
c3560s1c.dorm.mvrdl(config)#2048
                            ^
% Invalid input detected at '^' 
Expect: matched string 2: (config)#
 >> end

Expect: searching for 1 strs:  :Configured
 << marker.

c3560s1c.dorm.mvrdl(config)#end
c3560s1c.dorm.mvrdl#
 << 
Jun  6 08:45:51: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> write mem

Expect: searching for 2 strs:  :# :>
 << 
c3560s1c.dorm.mvrdl#write mem
Building configuration...

Expect: matched string 1: #
 >> 
Expect: searching for 2 strs:  :# :>
 << [OK]
c3560s1c.dorm.mvrdl#
c3560s1c.dorm.mvrdl#
c3560s1c.dorm.mvrdl#
Expect: matched string 1: #
 >> sh run

Expect: searching for 2 strs:  :# :>
 << sh run
Building configuration...

Current configuration : 8230 bytes
!
! Last configuration change at 08:45:51 CDT Wed Jun 6 2018
! NVRAM config last updated at 08:45:54 CDT Wed Jun 6 2018
!
version 15.2
no service pad
service timestamps debug d
 << atetime localtime
service timestamps log datetime localtime
service password-encryption
!
hostname c3560s1c.dorm.mvrdl
!
boot-start-marker
boot-end-marker
!
logging buffered informational
enable secret 5 $1$Gyqa$fTVSwMocP.ZvLlcAFTT64.
enable pa
 << ssword 7 113E4B1246112F5C0903272D0F72
!
username root privilege 15 secret 5 $1$HxfP$Sx69UybZMPYeh7QXlIzjp.
no aaa new-model
clock timezone CST -6 0
clock summer-time CDT recurring
system mtu routing 1500
!
!
!
!
!
!
ip dhcp snooping vlan 67

 << ip dhcp snooping
ip domain-name mgmt.msstate.edu
ip name-server 130.18.80.13
ip name-server 130.18.80.12
!
!
!
!
!
!
!
crypto pki trustpoint TP-self-signed-2494998912
 enrollment selfsigned
 subject-name cn=IOS-Self-Signed-Certificate-2494998
 << 912
 revocation-check none
 rsakeypair TP-self-signed-2494998912
!
!
crypto pki certificate chain TP-self-signed-2494998912
 certificate self-signed 01
  	quit
!
spanning-tree mode pvst
spanning-tree portfast edge bpduguard default
spanning-tre
 << e extend system-id
no spanning-tree vlan 2-66,68-91,93-97,99-1000
errdisable recovery cause udld
errdisable recovery cause bpduguard
errdisable recovery cause security-violation
errdisable recovery cause channel-misconfig
errdisable recovery cause p
 << agp-flap
errdisable recovery cause dtp-flap
errdisable recovery cause link-flap
errdisable recovery cause sfp-config-mismatch
errdisable recovery cause gbic-invalid
errdisable recovery cause l2ptguard
errdisable recovery cause psecure-violation
err
 << disable recovery cause port-mode-failure
errdisable recovery cause dhcp-rate-limit
errdisable recovery cause pppoe-ia-rate-limit
errdisable recovery cause mac-limit
errdisable recovery cause vmps
errdisable recovery cause storm-control
errdisable re
 << covery cause inline-power
errdisable recovery cause arp-inspection
errdisable recovery cause loopback
errdisable recovery cause small-frame
errdisable recovery cause psp
errdisable recovery interval 1800
!
!
!
!
vlan internal allocation policy a
 << scending
!
lldp run
!
! 
!
!
!
!
!
!
!
!
!
interface GigabitEthernet0/1
 switchport access vlan 92
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging t
 << ime 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline consumption 15400
 spanning-tree portfast edge
!
interface GigabitEthernet0/2
 switchport access vlan 67
 switchport mode access
 switchport port-secur
 << ity maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast edge
!
interface GigabitEtherne
 << t0/3
 switchport access vlan 67
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-securit
 << y
 power inline never
 spanning-tree portfast edge
!
interface GigabitEthernet0/4
 switchport access vlan 67
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging t
 << ime 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast edge
!
interface GigabitEthernet0/5
 switchport access vlan 67
 switchport mode access
 switchport port-security maximum 
 << 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast edge
!
interface GigabitEthernet0/6
 switc
 << hport access vlan 67
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power in
 << line never
 spanning-tree portfast edge
!
interface GigabitEthernet0/7
 switchport access vlan 67
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 swi
 << tchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast edge
!
interface GigabitEthernet0/8
 switchport access vlan 67
 switchport mode access
 switchport port-security maximum 2
 switchpo
 << rt port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast edge
!
interface GigabitEthernet0/9
 switchport access
 <<  vlan 67
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never

 <<  spanning-tree portfast edge
!
interface GigabitEthernet0/10
 switchport access vlan 67
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport por
 << t-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast edge
!
interface GigabitEthernet0/11
 switchport access vlan 67
 switchport mode access
 switchport port-security maximum 2
 switchport port-se
 << curity violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast edge
!
interface GigabitEthernet0/12
 switchport trunk native vl
 << an 92
 switchport mode trunk
 no keepalive
 ip dhcp snooping trust
!
interface GigabitEthernet0/13
 switchport trunk native vlan 92
 switchport mode trunk
 ip dhcp snooping trust
!
interface GigabitEthernet0/14
 switchport trunk native vlan 92
 << 
 switchport mode trunk
 ip dhcp snooping trust
!
interface GigabitEthernet0/15
 switchport trunk native vlan 92
 switchport mode trunk
 ip dhcp snooping trust
!
interface GigabitEthernet0/16
 switchport trunk native vlan 92
 switchport mode tru
 << nk
 ip dhcp snooping trust
!
interface Vlan1
 no ip address
 no ip route-cache
 shutdown
!
interface Vlan92
 ip address 10.253.92.10 255.255.0.0
 ip broadcast-address 10.92.255.255
!
ip default-gateway 10.92.0.1
ip forward-protocol nd
no ip 
 << http server
no ip http secure-server
!
!
!
logging facility local1
logging host 130.18.8.12
access-list 1 permit 10.92.0.0 0.0.255.255
access-list 1 permit 130.18.8.0 0.0.0.255
access-list 1 permit 10.93.0.0 0.0.255.255
access-list 1 permit 130.
 << 18.1.0 0.0.0.255
!
snmp-server community sysnet RO 1
snmp-server community c2-b2=a2 RW 1
snmp-server contact 6F-2291
snmp-server enable traps snmp authentication linkdown linkup coldstart warmstart
snmp-server enable traps transceiver all
snmp-serv
 << er enable traps tty
snmp-server enable traps cluster
snmp-server enable traps config-copy
snmp-server enable traps config
snmp-server enable traps config-ctid
snmp-server enable traps entity
snmp-server enable traps power-ethernet police
snmp-serve
 << r enable traps cpu threshold
snmp-server enable traps rep
snmp-server enable traps bridge newroot topologychange
snmp-server enable traps stpx inconsistency root-inconsistency loop-inconsistency
snmp-server enable traps syslog
snmp-server enable trap
 << s vtp
snmp-server enable traps vlancreate
snmp-server enable traps vlandelete
snmp-server enable traps flash insertion removal
snmp-server enable traps port-security
snmp-server enable traps envmon fan shutdown supply temperature status
snmp-server 
 << enable traps errdisable
snmp-server enable traps mac-notification change move threshold
snmp-server enable traps vlan-membership
snmp-server host 130.18.8.12 sysnet 
no vstack
!
line con 0
line vty 0 4
 access-class 1 in
 password 7 0738735B1F0A3
 << D551A3B0705236B
 login local
 transport input ssh
line vty 5 15
 access-class 1 in
 password 7 0738735B1F0A3D551A3B0705236B
 login local
 transport input ssh
!
ntp server 10.92.0.5
!
end

c3560s1c.dorm.mvrdl#
Expect: matched string 1: #
