trying to use serial port: /dev/ttyUSB0
 >> 
 >> 

Expect: searching for 4 strs:  :[yes/no] :Press RETURN to get started. :# :Switch>
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

...

 >> 

Expect: searching for 2 strs:  :# :>
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

...

 >> 

Expect: searching for 4 strs:  :[yes/no] :Press RETURN to get started. :# :Switch>
 << 
 << Switch>
Expect: matched string 4: Switch>
 >> term len 0

Expect: searching for 2 strs:  :# :>
 << term len 0
Switch>
Expect: matched string 2: >
 >> show version

Expect: searching for 2 strs:  :# :>
 << show version
Cisco IOS Software, C2960X Software (C2960X-UNIVERSALK9-M), Version 15.2(2)E7, RELEASE SOFTWARE (fc3)
Technical Support: http://www.cisco.com/techsupport
Copyright (c) 1986-2017 by Cisco Systems, Inc.
Compiled Wed 12-Jul-17 13:06 by prod_
 << rel_team

ROM: Bootstrap program is C2960X boot loader
BOOTLDR: C2960X Boot Loader (C2960X-HBOOT-M) Version 15.2(3r)E1, RELEASE SOFTWARE (fc1)

Switch uptime is 1 day, 18 hours, 40 minutes
System returned to ROM by power-on
System restarted at 19:2
 << 6:39 UTC Mon Jun 4 2018
System image file is "flash:/c2960x-universalk9-mz.152-2.E7/c2960x-universalk9-mz.152-2.E7.bin"
Last reload reason: power-on



This product contains cryptographic features and is subject to United
States and local country l
 << aws governing import, export, transfer and
use. Delivery of Cisco cryptographic products does not imply
third-party authority to import, export, distribute or use encryption.
Importers, exporters, distributors and users are responsible for
compliance 
 << with U.S. and local country laws. By using this product you
agree to comply with applicable laws and regulations. If you are unable
to comply with U.S. and local laws, return this product immediately.

A summary of U.S. laws governing Cisco cryptograp
 << hic products may be found at:
http://www.cisco.com/wwl/export/crypto/tool/stqrg.html

If you require further assistance please contact us by sending email to
export@cisco.com.

cisco WS-C2960X-48FPS-L (APM86XXX) processor (revision U0) with 524288K 
 << bytes of memory.
Processor board ID FCW2202B4J4
Last reset from power-on
1 Virtual Ethernet interface
1 FastEthernet interface
104 Gigabit Ethernet interfaces
The password-recovery mechanism is enabled.

512K bytes of flash-simulated non-volatile 
 << configuration memory.
Base ethernet MAC Address       : 00:BF:77:B3:0F:80
Motherboard assembly number     : 73-16691-06
Power supply part number        : 341-0527-03
Motherboard serial number       : FOC22022F9S
Power supply serial number      : DCB2
 << 14462KS
Model revision number           : U0
Motherboard revision number     : C0
Model number                    : WS-C2960X-48FPS-L
Daughterboard assembly number   : 73-14200-03
Daughterboard serial number     : FOC220121G1
System serial number   
 <<          : FCW2202B4J4
Top Assembly Part Number        : 68-100469-03
Top Assembly Revision Number    : D0
Version ID                      : V06
CLEI Code Number                : CMMLN00ARF
Daughterboard revision number   : B0
Hardware Board Revisio
 << n Number  : 0x19


Switch Ports Model                     SW Version            SW Image                 
------ ----- -----                     ----------            ----------               
*    1 52    WS-C2960X-48FPS-L         15.2(2)E7         
 <<     C2960X-UNIVERSALK9-M     
     2 52    WS-C2960X-48FPS-L         15.2(2)E7             C2960X-UNIVERSALK9-M     


Switch 02
---------
Switch Uptime                   : 1 day, 18 hours, 40 minutes 
Base ethernet MAC Address       : 00:BF:77:B3:
 << 2B:80
Motherboard assembly number     : 73-16691-06
Power supply part number        : 341-0527-03
Motherboard serial number       : FOC22022FEL
Power supply serial number      : DCB214462LG
Model revision number           : U0
Motherboard revision n
 << umber     : C0
Model number                    : WS-C2960X-48FPS-L
Daughterboard assembly number   : 73-14200-03
Daughterboard serial number     : FOC220129L9
System serial number            : FCW2202B4HD
Top assembly part number        : 68-100469-0
 << 3
Top assembly revision number    : D0
Version ID                      : V06
CLEI Code Number                : CMMLN00ARF
Daughterboard revision number   : B0

Configuration register is 0xF

Switch>
Expect: matched string 2: >
 >> enable

Expect: searching for 2 strs:  :Password: :#
 << enable
Switch#
Expect: matched string 2: #
 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
Expect: matched string 1: (config)#
 >> no service pad

 >> service timestamps debug datetime localtime

 >> service timestamps log datetime localtime

 >> service password-encryption

 >> boot-start-marker

 >> boot-end-marker

 >> enable secret W2w1cD0mIliG!

 >> enable password W2w1cD0mIliG!

 >> username root privilege 15 secret W2w1cD0mIliG!

 >> no aaa new-model

 >> clock timezone CST -6 0

 >> clock summer-time CDT recurring

 >> authentication mac-move permit

 >> ip domain-name mgmt.msstate.edu

 >> ip name-server 130.18.80.12

 >> vtp domain vtp01.mgmt.msstate.edu

 >> vtp mode client

 >> crypto pki trustpoint TP-self-signed-2494998912

 >>  enrollment selfsigned

 >>  subject-name cn=IOS-Self-Signed-Certificate-2494998912

 >>  revocation-check none

 >>  rsakeypair TP-self-signed-2494998912

 >> crypto pki certificate chain TP-self-signed-2494998912

 >>  certificate self-signed 01 nvram:IOS-Self-Sig#3232.cer

 >> spanning-tree portfast bpduguard default

 >> spanning-tree extend system-id

 >> vlan internal allocation policy ascending

 >> lldp run

 >> errdisable recovery cause all

 >> errdisable recovery interval 1800

 >> interface FastEthernet0

 >>  no ip address

 >>  shutdown

 >> interface Vlan1

 >>  no ip address

 >>  no ip route-cache

 >>  shutdown

 >> interface Vlan92

 >> no ip http server

 >> no ip http secure-server

 >> logging facility local1

 >> logging host 130.18.8.12

 >> access-list 1 permit 10.92.0.0 0.0.255.255

 >> access-list 1 permit 130.18.8.0 0.0.0.255

 >> access-list 1 permit 10.93.0.0 0.0.255.255

 >> access-list 1 permit 130.18.1.0 0.0.0.255

 >> snmp-server community sysnet RO 1

 >> snmp-server community c2-b2=a2 RW 1

 >> snmp-server enable traps snmp authentication linkdown linkup coldstart warmstart

 >> snmp-server enable traps transceiver all

 >> snmp-server enable traps tty

 >> snmp-server enable traps cluster

 >> snmp-server enable traps config-copy

 >> snmp-server enable traps config

 >> snmp-server enable traps config-ctid

 >> snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-auth-fail-vlan no-guest-vlan

 >> snmp-server enable traps entity

 >> snmp-server enable traps power-ethernet police

 >> snmp-server enable traps cpu threshold

 >> snmp-server enable traps rep

 >> snmp-server enable traps bridge newroot topologychange

 >> snmp-server enable traps stpx inconsistency root-inconsistency loop-inconsistency

 >> snmp-server enable traps syslog

 >> snmp-server enable traps vtp

 >> snmp-server enable traps vlancreate

 >> snmp-server enable traps vlandelete

 >> snmp-server enable traps flash insertion removal

 >> snmp-server enable traps port-security

 >> snmp-server enable traps envmon fan shutdown supply temperature status

 >> snmp-server enable traps errdisable

 >> snmp-server enable traps mac-notification change move threshold

 >> snmp-server enable traps vlan-membership

 >> snmp-server host 130.18.8.12 sysnet 

 >> line con 0

 >> line vty 0 15

 >>  access-class 1 in

 >>  password W2w1cD0mIliG!

 >>  login local

 >>  transport input ssh

 >> ntp server 10.92.0.5

 >> 

 >> end

Expect: searching for 1 strs:  :Configured
 << no service pad
Switch(config)#service timestamps debug datetime localtime
Switch(config)#service timestamps log datetime localtime
Switch(config)#service password-encryption
Switch(config)#boot-start-marker
Switch(config)#boot-end-marker
Switch(conf
 << ig)#enable secret W2w1cD0mIliG!
Switch(config)#enable password W2w1cD0mIliG!
The enable password you have chosen is the same as your enable secret.
This is not recommended.  Re-enter the enable password.

Switch(config)#username root privilege 15 sec
 << ret W2w1cD0mIliG!
Switch(config)#no aaa new-model
Switch(config)#clock timezone CST -6 0
Switch(config)#clock summer-time CDT recurring
Switch(config)#authentication mac-move permit
Switch(config)#ip domain-name mgmt.msstate.edu
Switch(config)#ip na
 << me-server 130.18.80.12
Switch(config)#vtp domain vtp01.mgmt.msstate.edu
Changing VTP domain name from NULL to vtp01.mgmt.msstate.edu
Switch(config)#vtp mode client
Setting device to VTP Client mode for VLANS.
Switch(config)#crypto pki trustpoint TP-s
 << elf-signed-2494998912
Switch(ca-trustpoint)#
Jun  6 08:08:41: %SYS-6-CLOCKUPDATE: System clock has been updated from 14:08:41 UTC Wed Jun 6 2018 to 08:08:41 CST Wed Jun 6 2018, configured from console by console.
Jun  6 09:08:41: %SYS-6-CLOCKUPDATE: Sy
 << stem clock has been updated from 08:08:41 CST Wed Jun 6 2018 to 09:08:41 CDT Wed Jun 6 2018, configured from console by console.
Jun  6 09:08:42: %SW_VLAN-6-VTP_DOMAIN_NAME_CHG: VTP domain name changed to vtp01.mgmt.msstate.edu.
Jun  6 09:08:42: %SW_VLA
 << N-4-VTP_USER_NOTIFICATION: VTP pro enrollment selfsigned
Switch(ca-trustpoint)# subject-name cn=IOS-Self-Signed-Certificate-2494998912
Switch(ca-trustpoint)# revocation-check none
Switch(ca-trustpoint)# rsakeypair TP-self-signed-2494998912
Switch(ca-t
 << rustpoint)#tocol user notification: MD5 digest checksum mismatch on receipt of equal revision summary on trunk: St2  (Switch-2)
 (Switch-2)crypto pki certificate chain TP-self-signed-2494998912
Switch(config-cert-chain)# certificate self-signed 01 nvram
 << :IOS-Self-Sig#3232$e self-signed 01 nvram:IOS-Self-Sig#3232.         cer
Switch(config-cert-chain)#spanning-tree portfast bpduguard default
Switch(config)#spanning-tree extend system-id
Switch
 << (config)#vlan internal allocation policy ascending
Switch(config)#
Jun  6 09:08:42: %SW_VLAN-6-VTP_DOMAIN_NAME_CHG: VTP domain name changed to vtp01.mgmt.msstate.edu. (Switch-2)lldp run
Switch(config)#errdisable recovery cause all
Switch(config)#errdi
 << sable recovery interval 1800
Switch(config)#interface FastEthernet0
Switch(config-if)# no ip address
Switch(config-if)# shutdown
Switch(config-if)#interface Vlan1
Switch(config-if)# no ip address
Switch(config-if)# no ip route-cache
Switch(config-i
 << f)# shutdown
Switch(config-if)#interface Vlan92
Switch(config-if)#no ip http server
Switch(config)#no ip http secure-server
Switch(config)#logging facility local1
Switch(config)#logging host 130.18.8.12
Switch(config)#access-list 1 permit 10.92.0.0 
 << 0.0.255.255
Switch(config)#access-list 1 permit 130.18.8.0 0.0.0.255
Switch(config)#access-list 1 permit 10.93.0.0 0.0.255.255
Switch(config)#access-list 1 permit 130.18.1.0 0.0.0.255
Switch(config)#
Jun  6 09:08:48: %SYS-6-LOGGINGHOST_STARTSTOP: Log
 << ging to host 130.18.8.12 port 0 CLI Request Triggered
Jun  6 09:08:48: %SYS-6-LOGGINGHOST_STARTSTOP: Logging to host 130.18.8.12 port 514 started - CLI initiatedsnmp-server community sysnet RO 1
Switch(config)#snmp-server community c2-b2=a2 RW 1
Switch
 << (config)#snmp-server enable traps snmp authentication linkdown linkup c$ enable traps snmp authentication linkdown linkup co         ldstart w
 << aps snmp authentication linkdown linkup coldstart wa         rmstart
Switch(config)#snmp-server enable traps transceiver all
Switch(config)#
Jun  6 09:08:48: %LINK-5-CHANGED: Interface FastEthernet0, changed state to adminis
 << tratively down
Jun  6 09:08:49: %LINK-5-CHANGED: Interface Vlan1, changed state to administratively downsnmp-server enable traps tty
Switch(config)#snmp-server enable traps cluster
Switch(config)#snmp-server enable traps config-copy
Switch(config)#snm
 << p-server enable traps config
Switch(config)#snmp-server enable traps config-ctid
Switch(config)#snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-au$ enable traps dot1x auth-fail-vl
 << an guest-vlan no-aut         h-fail-vlaps dot1x auth-fail-vlan guest-vlan no-auth-fail-vla         n no-guesuth-fail
 << -vlan guest-vlan no-auth-fail-vlan no-guest         -vlan
snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-auth-fail-vlan no-gu                         ^est-vlan

% Invalid input detected at '^' marker.

Switch(config)#snmp-server
 <<  enable traps entity
Switch(config)#snmp-server enable traps power-ethernet police
Switch(config)#snmp-server enable traps cpu threshold
Switch(config)#snmp-server enable traps rep
                                        ^
% Invalid input detected at
 <<  '^' marker.

Switch(config)#snmp-server enable traps bridge newroot topologychange
Switch(config)#snmp-server enable traps stpx inconsistency root-inconsistency$ enable traps stpx inconsist
 << ency root-inconsistency          loop-incoaps stpx inconsistency root-inconsistency loop-incon         sistency
Switch(config)#snmp-server enable traps syslog
Switch(config)#
 << snmp-server enable traps vtp
Switch(config)#snmp-server enable traps vlancreate
Switch(config)#snmp-server enable traps vlandelete
Switch(config)#snmp-server enable traps flash insertion removal
Switch(config)#snmp-server enable traps port-security
S
 << witch(config)#snmp-server enable traps envmon fan shutdown supply temperatur$ enable traps envmon fan shutdown supply temperature          status
Switch(config)#snmp-server enable tra
 << ps errdisable
Switch(config)#snmp-server enable traps mac-notification change move threshol$ enable traps mac-notification change move threshold         
Switch(config)#snmp-server e
 << nable traps vlan-membership
Switch(config)#snmp-server host 130.18.8.12 sysnet 
Switch(config)#line con 0
Switch(config-line)#line vty 0 15
Switch(config-line)# access-class 1 in
Switch(config-line)# password W2w1cD0mIliG!
Switch(config-line)# login
 <<  local
Switch(config-line)# transport input ssh
Switch(config-line)#ntp server 10.92.0.5
Switch(config)#
Switch(config)#end
Switch#
 << 
Jun  6 09:08:57: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
Switch#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
Expect: matched string 1: (config)#
 >> spanning-tree mode pvst

 >> no spanning-tree vlan 2-66,68-91,93-97,99-1000

 >> 

 >> end

Expect: searching for 1 strs:  :Configured
 << spanning-tree mode pvst
Switch(config)#no spanning-tree vlan 2-66,68-91,93-97,99-1000
Switch(config)#
Switch(config)#end
Switch#
 << 
Jun  6 09:09:03: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
Switch#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
Expect: matched string 1: (config)#
 >> hostname c29s1ps.r104b.mvrdl 

Expect: searching for 2 strs:  :# :>
 << hostname c29s1ps.r104b.mvrdl 
c29s1ps.r104b.mvrdl(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s1ps.r104b.mvrdl#
 << 
Jun  6 09:09:13: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1ps.r104b.mvrdl#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1ps.r104b.mvrdl(config)#
Expect: matched string 1: (config)#
 >> snmp-server contact 6F-2270-6F-2271

Expect: searching for 1 strs:  :#
 << snmp-server contact 6F-2270-6F-2271
c29s1ps.r104b.mvrdl(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s1ps.r104b.mvrdl#
 << 
Jun  6 09:09:19: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1ps.r104b.mvrdl#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1ps.r104b.mvrdl(config)#
Expect: matched string 1: (config)#
 >> interface vlan 92

Expect: searching for 1 strs:  :(config-if)#
 << interface vlan 92
c29s1ps.r104b.mvrdl(config-if)#
Expect: matched string 1: (config-if)#
 >> ip address 10.253.92.12 255.255.0.0

 >> ip broadcast-address 10.92.255.255

 >> end

Expect: searching for 1 strs:  :Configured
 << ip address 10.253.92.12 255.255.0.0
c29s1ps.r104b.mvrdl(config-if)#ip broadcast-address 10.92.255.255
c29s1ps.r104b.mvrdl(config-if)#end
c29s1ps.r104b.mvrdl#
 << 
Jun  6 09:09:25: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1ps.r104b.mvrdl#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1ps.r104b.mvrdl(config)#
Expect: matched string 1: (config)#
 >> interface Vlan92

Expect: searching for 1 strs:  :(config-if)#
 << interface Vlan92
c29s1ps.r104b.mvrdl(config-if)#
Expect: matched string 1: (config-if)#
 >> ip default-gateway 10.92.0.1

 >> end

Expect: searching for 1 strs:  :Configured
 << ip default-gateway 10.92.0.1
c29s1ps.r104b.mvrdl(config)#end
c29s1ps.r104b.mvrdl#
 << 
Jun  6 09:09:31: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

...

 >> ip dhcp snooping

Expect: searching for 1 strs:  :#
 << 
 << 
 << 
 << 
 << 
 << 
Jun  6 09:09:51: %PNP-6-PNP_DISCOVERY_STOPPED: PnP Discovery stopped (Aborted by non-PnP bootstrapping)
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

Jun  6 09:09:51: %PNP-6-PNP_DISCOVERY_STOPPED: PnP Discovery stopped (Aborted by non-PnP bootstrapping)
...

 >> ip dhcp snooping vlan 67

Expect: searching for 1 strs:  :#
 << ip dhcp snooping vlan 67
c29s1ps.r104b.mvrdl(config)#
Expect: matched string 1: #
 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << configure terminal
                                    ^
% Invalid input detected at '^' marker.

c29s1ps.r104b.mvrdl(config)#
Expect: matched string 1: (config)#
 >> default interface range gi1/0/1 - 48 

 >> interface range gi1/0/1 - 48 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi1/0/1 - 48 
c29s1ps.r104b.mvrdl(config)#interface range gi1/0/1 - 48 
c29s1ps.r104b.mvrdl(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport access vlan 67

 >> switchport mode access

 >> spanning-tree portfast

 >> switchport port-security maximum 2

 >> switchport port-security

 >> switchport port-security aging time 15

 >> switchport port-security violation protect

 >> switchport port-security aging type inactivity

 >> power inline never

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport access vlan 67
c29s1ps.r104b.mvrdl(config-if-range)#switchport mode access
c29s1ps.r104b.mvrdl(config-if-range)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, concentr
 << ators, switches, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast will be configured in 48 interfaces due to the range command 
 but will only have effect when the interfac
 << es are in a non-trunking mode.
c29s1ps.r104b.mvrdl(config-if-range)#switchport port-security maximum 2
c29s1ps.r104b.mvrdl(config-if-range)#switchport port-security
c29s1ps.r104b.mvrdl(config-if-range)#switchport port-security aging time 15
c29s1ps.r1
 << 04b.mvrdl(config-if-range)#switchport port-security violation prote$port-security violation protec         t
c29s1ps.r104b.mvrdl(config-if-range)#switchport port-security aging type inac
 << $port-security aging type inact         ivity
c29s1ps.r104b.mvrdl(config-if-range)#power inline never

 << c29s1ps.r104b.mvrdl(config-if-range)#end
c29s1ps.r104b.mvrdl#
 << 
Jun  6 09:10:12: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1ps.r104b.mvrdl#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1ps.r104b.mvrdl(config)#
Expect: matched string 1: (config)#
 >> default interface range gi1/0/1 - 6 

 >> interface range gi1/0/1 - 6 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi1/0/1 - 6 
c29s1ps.r104b.mvrdl(config)#interface range gi1/0/1 - 6 
c29s1ps.r104b.mvrdl(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport access vlan 92

 >> switchport mode access

 >> spanning-tree portfast

 >> power inline consumption 15400

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport access vlan 92
c29s1ps.r104b.mvrdl(config-if-range)#switchport mode access
c29s1ps.r104b.mvrdl(config-if-range)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, concentr
 << ators, switches, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast will be configured in 6 interfaces due to the range command 
 but will only have effect when the interface
 << s are in a non-trunking mode.
c29s1ps.r104b.mvrdl(config-if-range)#power inline consumption 15400
%CAUTION: Interface Gi1/0/1: Misconfiguring the 'power inline
 consumption/allocation' command may cause damage to the switch and void
 your warranty. Ta
 << ke precaution not to oversubscribe the power supply.
 It is recommended to enable power policing if the switch supports it.
 Refer to documentation.

%CAUTION: Interface Gi1/0/2: Misconfiguring the 'power inline
 consumption/allocation' command may c
 << ause damage to the switch and void
 your warranty. Take precaution not to oversubscribe the power supply.
 It is recommended to enable power policing if the switch supports it.
 Refer to documentation.

%CAUTION: Interface Gi1/0/3: Misconfiguring the
 <<  'power inline
 consumption/allocation' command may cause damage to the switch and void
 your warranty. Take precaution not to oversubscribe the power supply.
 It is recommended to enable power policing if the switch supports it.
 Refer to documentati
 << on.

%CAUTION: Interface Gi1/0/4: Misconfiguring the 'power inline
 consumption/allocation' command may cause damage to the switch and void
 your warranty. Take precaution not to oversubscribe the power supply.
 It is recommended to enable power poli
 << cing if the switch supports it.
 Refer to documentation.

%CAUTION: Interface Gi1/0/5: Misconfiguring the 'power inline
 consumption/allocation' command may cause damage to the switch and void
 your warranty. Take precaution not to oversubscribe the 
 << power supply.
 It is recommended to enable power policing if the switch supports it.
 Refer to documentation.

%CAUTION: Interface Gi1/0/6: Misconfiguring the 'power inline
 consumption/allocation' command may cause damage to the switch and void
 yo
 << ur warranty. Take precaution not to oversubscribe the power supply.
 It is recommended to enable power policing if the switch supports it.
 Refer to documentation.

c29s1ps.r104b.mvrdl(config-if-range)#end
c29s1ps.r104b.mvrdl#
 << 
Jun  6 09:10:26: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1ps.r104b.mvrdl#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1ps.r104b.mvrdl(config)#
Expect: matched string 1: (config)#
 >> default interface range gi1/0/47 - 48 

 >> interface range gi1/0/47 - 48 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi1/0/47 - 48 
c29s1ps.r104b.mvrdl(config)#interface range gi1/0/47 - 48 
c29s1ps.r104b.mvrdl(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport mode trunk

 >> switchport trunk native vlan 92

 >> ip dhcp snooping trust

 >> no keepalive

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport mode trunk
c29s1ps.r104b.mvrdl(config-if-range)#switchport trunk native vlan 92
c29s1ps.r104b.mvrdl(config-if-range)#ip dhcp snooping trust
c29s1ps.r104b.mvrdl(config-if-range)#no keepalive
c29s1ps.r104b.mvrdl(config-if-range)#end
c29s1ps.
 << r104b.mvrdl#
 << 
Jun  6 09:10:38: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1ps.r104b.mvrdl#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1ps.r104b.mvrdl(config)#
Expect: matched string 1: (config)#
 >> default interface range gi1/0/49 - 52 

 >> interface range gi1/0/49 - 52 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi1/0/49 - 52 
c29s1ps.r104b.mvrdl(config)#interface range gi1/0/49 - 52 
c29s1ps.r104b.mvrdl(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport mode trunk

 >> switchport trunk native vlan 92

 >> ip dhcp snooping trust

 >> no keepalive

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport mode trunk
c29s1ps.r104b.mvrdl(config-if-range)#switchport trunk native vlan 92
c29s1ps.r104b.mvrdl(config-if-range)#ip dhcp snooping trust
c29s1ps.r104b.mvrdl(config-if-range)#no keepalive
c29s1ps.r104b.mvrdl(config-if-range)#end
c29s1ps.
 << r104b.mvrdl#
 << 
Jun  6 09:10:49: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1ps.r104b.mvrdl#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1ps.r104b.mvrdl(config)#
Expect: matched string 1: (config)#
 >> crypto key generate rsa

 >> no

 >> 2048

Expect: searching for 2 strs:  :OK :(config)#
 << crypto key generate rsa
The name for the keys will be: c29s1ps.r104b.mvrdl.mgmt.msstate.edu
Choose the size of the key modulus in the range of 360 to 4096 for your
  General Purpose Keys. Choosing a key modulus greater than 512 may take
  a few minute
 << s.

How many bits in the modulus [512]: no
% A decimal number between 360 and 4096.
How many bits in the modulus [512]: 2048
% Generating 2048 bit RSA keys, keys will be non-exportable...
 << 
 << 
 << 
 << 
[OK] (elapsed time was 4 seconds)

c29s1ps.r104b.mvrdl(config)#
Jun  6 09:11:07: %SSH-5-ENABLED: SSH 1.99 has been enabled
Expect: matched string 1: OK
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s1ps.r104b.mvrdl#
 << 
Jun  6 09:11:09: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> write mem

Expect: searching for 2 strs:  :# :>
 << 
c29s1ps.r104b.mvrdl#write mem
Building configuration...

Expect: matched string 1: #
 >> 
Expect: searching for 2 strs:  :# :>
 << [OK]
c29s1ps.r104b.mvrdl#
c29s1ps.r104b.mvrdl#
c29s1ps.r104b.mvrdl#
Expect: matched string 1: #
 >> sh run

Expect: searching for 2 strs:  :# :>
 << sh run
Building configuration...

 << 
Current configuration : 20309 bytes
!
! Last configuration change at 09:11:09 CDT Wed Jun 6 2018
! NVRAM config last updated at 09:11:12 CDT Wed Jun 6 2018
!
version 15.2
no service pad
service timestamps debug datetime localtime
service timesta
 << mps log datetime localtime
service password-encryption
!
hostname c29s1ps.r104b.mvrdl
!
boot-start-marker
boot-end-marker
!
enable secret 5 $1$7fcQ$52MOUy4tpsPeLkfdLSMrj/
enable password 7 053C5418704F6A59142C1B1B2C4D
!
username root privilege 
 << 15 secret 5 $1$LTic$A/Wf0jKTDtqphgU7MM1ul/
no aaa new-model
clock timezone CST -6 0
clock summer-time CDT recurring
switch 1 provision ws-c2960x-48fps-l
switch 2 provision ws-c2960x-48fps-l
!
!
ip dhcp snooping vlan 67
ip dhcp snooping
ip domain
 << -name mgmt.msstate.edu
ip name-server 130.18.80.12
!
!
!
!
!
authentication mac-move permit
!
!
crypto pki trustpoint TP-self-signed-2494998912
 enrollment selfsigned
 subject-name cn=IOS-Self-Signed-Certificate-2494998912
 revocation-check n
 << one
 rsakeypair TP-self-signed-2494998912
!
!
crypto pki certificate chain TP-self-signed-2494998912
 certificate self-signed 01
  	quit
!
spanning-tree mode pvst
spanning-tree portfast bpduguard default
spanning-tree extend system-id
no spanni
 << ng-tree vlan 2-66,68-91,93-97,99-1000
errdisable recovery cause udld
errdisable recovery cause bpduguard
errdisable recovery cause security-violation
errdisable recovery cause channel-misconfig
errdisable recovery cause pagp-flap
errdisable recovery
 <<  cause dtp-flap
errdisable recovery cause link-flap
errdisable recovery cause sfp-config-mismatch
errdisable recovery cause gbic-invalid
errdisable recovery cause psecure-violation
errdisable recovery cause port-mode-failure
errdisable recovery caus
 << e dhcp-rate-limit
errdisable recovery cause pppoe-ia-rate-limit
errdisable recovery cause mac-limit
errdisable recovery cause vmps
errdisable recovery cause storm-control
errdisable recovery cause inline-power
errdisable recovery cause arp-inspectio
 << n
errdisable recovery cause loopback
errdisable recovery cause small-frame
errdisable recovery cause psp
errdisable recovery interval 1800
!
!
!
!
vlan internal allocation policy ascending
!
lldp run
!
! 
!
!
!
!
!
!
!
!
interface Fa
 << stEthernet0
 no ip address
 shutdown
!
interface GigabitEthernet1/0/1
 switchport access vlan 92
 switchport mode access
 power inline consumption 15400
 spanning-tree portfast
!
interface GigabitEthernet1/0/2
 switchport access vlan 92
 switc
 << hport mode access
 power inline consumption 15400
 spanning-tree portfast
!
interface GigabitEthernet1/0/3
 switchport access vlan 92
 switchport mode access
 power inline consumption 15400
 spanning-tree portfast
!
interface GigabitEthernet1/0/
 << 4
 switchport access vlan 92
 switchport mode access
 power inline consumption 15400
 spanning-tree portfast
!
interface GigabitEthernet1/0/5
 switchport access vlan 92
 switchport mode access
 power inline consumption 15400
 spanning-tree portf
 << ast
!
interface GigabitEthernet1/0/6
 switchport access vlan 92
 switchport mode access
 power inline consumption 15400
 spanning-tree portfast
!
interface GigabitEthernet1/0/7
 switchport access vlan 67
 switchport mode access
 switchport port
 << -security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEther
 << net1/0/8
 switchport access vlan 67
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-se
 << curity
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/9
 switchport access vlan 67
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security agin
 << g time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/10
 switchport access vlan 67
 switchport mode access
 switchport port-security maximum
 <<  2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/11
 switc
 << hport access vlan 67
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power i
 << nline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/12
 switchport access vlan 67
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 swi
 << tchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/13
 switchport access vlan 67
 switchport mode access
 switchport port-security maximum 2
 switchport
 <<  port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/14
 switchport access vl
 << an 67
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 s
 << panning-tree portfast
!
interface GigabitEthernet1/0/15
 switchport access vlan 67
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-se
 << curity aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/16
 switchport access vlan 67
 switchport mode access
 switchport port-security maximum 2
 switchport port-security 
 << violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/17
 switchport access vlan 67
 switchp
 << ort mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree po
 << rtfast
!
interface GigabitEthernet1/0/18
 switchport access vlan 67
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging ty
 << pe inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/19
 switchport access vlan 67
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  prot
 << ect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/20
 switchport access vlan 67
 switchport mode access
 << 
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
inte
 << rface GigabitEthernet1/0/21
 switchport access vlan 67
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity

 <<  switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/22
 switchport access vlan 67
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchpor
 << t port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/23
 switchport access vlan 67
 switchport mode access
 switchport p
 << ort-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEt
 << hernet1/0/24
 switchport access vlan 67
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport por
 << t-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/25
 switchport access vlan 67
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security
 <<  aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/26
 switchport access vlan 67
 switchport mode access
 switchport port-security ma
 << ximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/27
 
 << switchport access vlan 67
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 po
 << wer inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/28
 switchport access vlan 67
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 << 
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/29
 switchport access vlan 67
 switchport mode access
 switchport port-security maximum 2
 switc
 << hport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/30
 switchport acce
 << ss vlan 67
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline neve
 << r
 spanning-tree portfast
!
interface GigabitEthernet1/0/31
 switchport access vlan 67
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport po
 << rt-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/32
 switchport access vlan 67
 switchport mode access
 switchport port-security maximum 2
 switchport port-secu
 << rity violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/33
 switchport access vlan 67
 sw
 << itchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tr
 << ee portfast
!
interface GigabitEthernet1/0/34
 switchport access vlan 67
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security agi
 << ng type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/35
 switchport access vlan 67
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation 
 <<  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/36
 switchport access vlan 67
 switchport mode a
 << ccess
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
 << 
interface GigabitEthernet1/0/37
 switchport access vlan 67
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactiv
 << ity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/38
 switchport access vlan 67
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 swit
 << chport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/39
 switchport access vlan 67
 switchport mode access
 switchp
 << ort port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface Giga
 << bitEthernet1/0/40
 switchport access vlan 67
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchpor
 << t port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/41
 switchport access vlan 67
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-sec
 << urity aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/42
 switchport access vlan 67
 switchport mode access
 switchport port-securi
 << ty maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/
 << 43
 switchport access vlan 67
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 << 
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/44
 switchport access vlan 67
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging tim
 << e 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/45
 switchport access vlan 67
 switchport mode access
 switchport port-security maximum 2
 
 << switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline never
 spanning-tree portfast
!
interface GigabitEthernet1/0/46
 switchport
 <<  access vlan 67
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 power inline
 <<  never
 spanning-tree portfast
!
interface GigabitEthernet1/0/47
 switchport trunk native vlan 92
 switchport mode trunk
 no keepalive
 ip dhcp snooping trust
!
interface GigabitEthernet1/0/48
 switchport trunk native vlan 92
 switchport mode t
 << runk
 no keepalive
 ip dhcp snooping trust
!
interface GigabitEthernet1/0/49
 switchport trunk native vlan 92
 switchport mode trunk
 ip dhcp snooping trust
!
interface GigabitEthernet1/0/50
 switchport trunk native vlan 92
 switchport mode tru
 << nk
 ip dhcp snooping trust
!
interface GigabitEthernet1/0/51
 switchport trunk native vlan 92
 switchport mode trunk
 ip dhcp snooping trust
!
interface GigabitEthernet1/0/52
 switchport trunk native vlan 92
 switchport mode trunk
 ip dhcp snoo
 << ping trust
!
interface GigabitEthernet2/0/1
!
interface GigabitEthernet2/0/2
!
interface GigabitEthernet2/0/3
!
interface GigabitEthernet2/0/4
!
interface GigabitEthernet2/0/5
!
interface GigabitEthernet2/0/6
!
interface GigabitEthernet2/0/7
 << 
!
interface GigabitEthernet2/0/8
!
interface GigabitEthernet2/0/9
!
interface GigabitEthernet2/0/10
!
interface GigabitEthernet2/0/11
!
interface GigabitEthernet2/0/12
!
interface GigabitEthernet2/0/13
!
interface GigabitEthernet2/0/14
!

 << interface GigabitEthernet2/0/15
!
interface GigabitEthernet2/0/16
!
interface GigabitEthernet2/0/17
!
interface GigabitEthernet2/0/18
!
interface GigabitEthernet2/0/19
!
interface GigabitEthernet2/0/20
!
interface GigabitEthernet2/0/21
!
int
 << erface GigabitEthernet2/0/22
!
interface GigabitEthernet2/0/23
!
interface GigabitEthernet2/0/24
!
interface GigabitEthernet2/0/25
!
interface GigabitEthernet2/0/26
!
interface GigabitEthernet2/0/27
!
interface GigabitEthernet2/0/28
!
interf
 << ace GigabitEthernet2/0/29
!
interface GigabitEthernet2/0/30
!
interface GigabitEthernet2/0/31
!
interface GigabitEthernet2/0/32
!
interface GigabitEthernet2/0/33
!
interface GigabitEthernet2/0/34
!
interface GigabitEthernet2/0/35
!
interface
 <<  GigabitEthernet2/0/36
!
interface GigabitEthernet2/0/37
!
interface GigabitEthernet2/0/38
!
interface GigabitEthernet2/0/39
!
interface GigabitEthernet2/0/40
!
interface GigabitEthernet2/0/41
!
interface GigabitEthernet2/0/42
!
interface Gi
 << gabitEthernet2/0/43
!
interface GigabitEthernet2/0/44
!
interface GigabitEthernet2/0/45
!
interface GigabitEthernet2/0/46
!
interface GigabitEthernet2/0/47
!
interface GigabitEthernet2/0/48
!
interface GigabitEthernet2/0/49
!
interface Gigab
 << itEthernet2/0/50
!
interface GigabitEthernet2/0/51
!
interface GigabitEthernet2/0/52
!
interface Vlan1
 no ip address
 no ip route-cache
 shutdown
!
interface Vlan92
 ip address 10.253.92.12 255.255.0.0
 ip broadcast-address 10.92.255.255
!
 << 
ip default-gateway 10.92.0.1
no ip http server
no ip http secure-server
!
!
logging facility local1
logging host 130.18.8.12
access-list 1 permit 10.92.0.0 0.0.255.255
access-list 1 permit 130.18.8.0 0.0.0.255
access-list 1 permit 10.93.0.0 0.0.
 << 255.255
access-list 1 permit 130.18.1.0 0.0.0.255
!
snmp-server community sysnet RO 1
snmp-server community c2-b2=a2 RW 1
snmp-server contact 6F-2270-6F-2271
snmp-server enable traps snmp authentication linkdown linkup coldstart warmstart
snmp-serv
 << er enable traps transceiver all
snmp-server enable traps tty
snmp-server enable traps cluster
snmp-server enable traps config-copy
snmp-server enable traps config
snmp-server enable traps config-ctid
snmp-server enable traps entity
snmp-server enab
 << le traps power-ethernet police
snmp-server enable traps cpu threshold
snmp-server enable traps bridge newroot topologychange
snmp-server enable traps stpx inconsistency root-inconsistency loop-inconsistency
snmp-server enable traps syslog
snmp-server
 <<  enable traps vtp
snmp-server enable traps vlancreate
snmp-server enable traps vlandelete
snmp-server enable traps flash insertion removal
snmp-server enable traps port-security
snmp-server enable traps envmon fan shutdown supply temperature status

 << snmp-server enable traps errdisable
snmp-server enable traps mac-notification change move threshold
snmp-server enable traps vlan-membership
snmp-server host 130.18.8.12 sysnet 
no vstack
!
line con 0
line vty 0 4
 access-class 1 in
 password 7 0
 << 738735B1F0A3D551A3B0705236B
 login local
 transport input ssh
line vty 5 15
 access-class 1 in
 password 7 0738735B1F0A3D551A3B0705236B
 login local
 transport input ssh
!
ntp server 10.92.0.5
end

c29s1ps.r104b.mvrdl#
Expect: matched string 1: #
