trying to use serial port: /dev/ttyUSB0
 >> 
 >> 

Expect: searching for 4 strs:  :[yes/no] :Press RETURN to get started. :# :Switch>
 << 
Switch>
Switch>
Switch>
Switch>
Expect: matched string 4: Switch>
 >> term len 0

Expect: searching for 2 strs:  :# :>
 << term len 0
Switch>
Expect: matched string 2: >
 >> show version

Expect: searching for 2 strs:  :# :>
 << show version
Cisco IOS Software, C2960X Software (C2960X-UNIVERSALK9-M), Version 15.2(2)E3, RELEASE SOFTWARE (fc3)
Technical Support: http://www.cisco.com/techsupport
Copyright (c) 1986-2015 by Cisco Systems, Inc.
Compiled Wed 26-Aug-15 07:12 by prod_
 << rel_team

ROM: Bootstrap program is C2960X boot loader
BOOTLDR: C2960X Boot Loader (C2960X-HBOOT-M) Version 15.0(2r)EX, RELEASE SOFTWARE (fc1)

Switch uptime is 25 minutes
System returned to ROM by power-on
System restarted at 15:54:38 UTC Fri Jun 
 << 22 2018
System image file is "flash:/c2960x-universalk9-mz.152-2.E3.bin"
Last reload reason: Reload command



This product contains cryptographic features and is subject to United
States and local country laws governing import, export, transfer an
 << d
use. Delivery of Cisco cryptographic products does not imply
third-party authority to import, export, distribute or use encryption.
Importers, exporters, distributors and users are responsible for
compliance with U.S. and local country laws. By usin
 << g this product you
agree to comply with applicable laws and regulations. If you are unable
to comply with U.S. and local laws, return this product immediately.

A summary of U.S. laws governing Cisco cryptographic products may be found at:
http://www
 << .cisco.com/wwl/export/crypto/tool/stqrg.html

If you require further assistance please contact us by sending email to
export@cisco.com.

cisco WS-C2960X-48TS-L (APM86XXX) processor (revision B0) with 524288K bytes of memory.
Processor board ID FOC18
 << 02V3AB
Last reset from power-on
1 Virtual Ethernet interface
1 FastEthernet interface
52 Gigabit Ethernet interfaces
The password-recovery mechanism is enabled.

512K bytes of flash-simulated non-volatile configuration memory.
Base ethernet MAC Ad
 << dress       : 58:0A:20:45:2F:00
Motherboard assembly number     : 73-14192-04
Power supply part number        : 341-0537-02
Motherboard serial number       : FOC180181CJ
Power supply serial number      : LIT17510417
Model revision number           : 
 << B0
Motherboard revision number     : A0
Model number                    : WS-C2960X-48TS-L
Daughterboard assembly number   : 73-14200-03
Daughterboard serial number     : FOC18021NXB
System serial number            : FOC1802V3AB
Top Assembly Part Nu
 << mber        : 800-37657-02
Top Assembly Revision Number    : C0
Version ID                      : V02
CLEI Code Number                : CMMNF00ARA
Daughterboard revision number   : A0
Hardware Board Revision Number  : 0x05


Switch Ports Model    
 <<                  SW Version            SW Image                 
------ ----- -----                     ----------            ----------               
*    1 52    WS-C2960X-48TS-L          15.2(2)E3             C2960X-UNIVERSALK9-M     


Configura
 << tion register is 0xF

Switch>
Expect: matched string 2: >
 >> enable

Expect: searching for 2 strs:  :Password: :#
 << enable
Switch#
Expect: matched string 2: #
 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
Expect: matched string 1: (config)#
 >> no service pad

 >> service timestamps debug datetime localtime

 >> service timestamps log datetime localtime

 >> service password-encryption

 >> boot-start-marker

 >> boot-end-marker

 >> enable secret W2w1cD0mIliG!

 >> enable password W2w1cD0mIliG!

 >> username root privilege 15 secret W2w1cD0mIliG!

 >> no aaa new-model

 >> clock timezone CST -6 0

 >> clock summer-time CDT recurring

 >> authentication mac-move permit

 >> ip domain-name mgmt.msstate.edu

 >> ip name-server 130.18.80.12

 >> vtp domain vtp01.mgmt.msstate.edu

 >> vtp mode client

 >> crypto pki trustpoint TP-self-signed-2494998912

 >>  enrollment selfsigned

 >>  subject-name cn=IOS-Self-Signed-Certificate-2494998912

 >>  revocation-check none

 >>  rsakeypair TP-self-signed-2494998912

 >> crypto pki certificate chain TP-self-signed-2494998912

 >>  certificate self-signed 01 nvram:IOS-Self-Sig#3232.cer

 >> spanning-tree portfast bpduguard default

 >> spanning-tree extend system-id

 >> vlan internal allocation policy ascending

 >> lldp run

 >> errdisable recovery cause all

 >> errdisable recovery interval 1800

 >> interface FastEthernet0

 >>  no ip address

 >>  shutdown

 >> interface Vlan1

 >>  no ip address

 >>  no ip route-cache

 >>  shutdown

 >> interface Vlan92

 >> no ip http server

 >> no ip http secure-server

 >> logging facility local1

 >> logging host 130.18.8.12

 >> access-list 1 permit 10.92.0.0 0.0.255.255

 >> access-list 1 permit 130.18.8.0 0.0.0.255

 >> access-list 1 permit 10.93.0.0 0.0.255.255

 >> access-list 1 permit 130.18.1.0 0.0.0.255

 >> snmp-server community sysnet RO 1

 >> snmp-server community c2-b2=a2 RW 1

 >> snmp-server enable traps snmp authentication linkdown linkup coldstart warmstart

 >> snmp-server enable traps transceiver all

 >> snmp-server enable traps tty

 >> snmp-server enable traps cluster

 >> snmp-server enable traps config-copy

 >> snmp-server enable traps config

 >> snmp-server enable traps config-ctid

 >> snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-auth-fail-vlan no-guest-vlan

 >> snmp-server enable traps entity

 >> snmp-server enable traps power-ethernet police

 >> snmp-server enable traps cpu threshold

 >> snmp-server enable traps rep

 >> snmp-server enable traps bridge newroot topologychange

 >> snmp-server enable traps stpx inconsistency root-inconsistency loop-inconsistency

 >> snmp-server enable traps syslog

 >> snmp-server enable traps vtp

 >> snmp-server enable traps vlancreate

 >> snmp-server enable traps vlandelete

 >> snmp-server enable traps flash insertion removal

 >> snmp-server enable traps port-security

 >> snmp-server enable traps envmon fan shutdown supply temperature status

 >> snmp-server enable traps errdisable

 >> snmp-server enable traps mac-notification change move threshold

 >> snmp-server enable traps vlan-membership

 >> snmp-server host 130.18.8.12 sysnet 

 >> line con 0

 >> line vty 0 15

 >>  access-class 1 in

 >>  password W2w1cD0mIliG!

 >>  login local

 >>  transport input ssh

 >> ntp server 10.92.0.5

 >> 

 >> end

Expect: searching for 1 strs:  :Configured
 << no service pad
Switch(config)#service timestamps debug datetime localtime
Switch(config)#service timestamps log datetime localtime
Switch(config)#service password-encryption
Switch(config)#boot-start-marker
Switch(config)#boot-end-marker
Switch(conf
 << ig)#enable secret W2w1cD0mIliG!
Switch(config)#enable password W2w1cD0mIliG!
The enable password you have chosen is the same as your enable secret.
This is not recommended.  Re-enter the enable password.

Switch(config)#username root privilege 15 sec
 << ret W2w1cD0mIliG!
Switch(config)#no aaa new-model
Switch(config)#clock timezone CST -6 0
Switch(config)#clock summer-time CDT recurring
Switch(config)#authentication mac-move permit
Switch(config)#ip domain-name mgmt.msstate.edu
Switch(config)#ip na
 << me-server 130.18.80.12
Switch(config)#vtp domain vtp01.mgmt.msstate.edu
Domain name already set to vtp01.mgmt.msstate.edu.
Switch(config)#vtp mode client
Device mode already VTP Client for VLANS.
Switch(config)#crypto pki trustpoint TP-self-signed-24
 << 94998912
Switch(ca-trustpoint)#
Jun 22 10:21:20: %SYS-6-CLOCKUPDATE: System clock has been updated from 16:21:20 UTC Fri Jun 22 2018 to 10:21:20 CST Fri Jun 22 2018, configured from console by console.
Jun 22 11:21:21: %SYS-6-CLOCKUPDATE: System clock 
 << has been updated from 10:21:21 CST Fri Jun 22 2018 to 11:21:21 CDT Fri Jun 22 2018, configured from console by console. enrollment selfsigned
Switch(ca-trustpoint)# subject-name cn=IOS-Self-Signed-Certificate-2494998912
Switch(ca-trustpoint)# revocation
 << -check none
Switch(ca-trustpoint)# rsakeypair TP-self-signed-2494998912
Switch(ca-trustpoint)#crypto pki certificate chain TP-self-signed-2494998912
Switch(config-cert-chain)# certificate self-signed 01 nvram:IOS-Self-Sig#3232
 << $e self-signed 01 nvram:IOS-Self-Sig#3232.         cer
Switch(config-cert-chain)#spanning-tree portfast bpduguard default
Switch(config)#spanning-tree extend system-id
Switch(config)#vlan internal allocation policy asc
 << ending
Switch(config)#lldp run
Switch(config)#errdisable recovery cause all
Switch(config)#errdisable recovery interval 1800
Switch(config)#interface FastEthernet0
Switch(config-if)# no ip address
Switch(config-if)# shutdown
Switch(config-if)#inter
 << face Vlan1
Switch(config-if)# no ip address
Switch(config-if)# no ip route-cache
Switch(config-if)# shutdown
Switch(config-if)#interface Vlan92
Switch(config-if)#no ip http server
Switch(config)#no ip http secure-server
Switch(config)#logging facil
 << ity local1
Switch(config)#logging host 130.18.8.12
Switch(config)#access-list 1 permit 10.92.0.0 0.0.255.255
Switch(config)#access-list 1 permit 130.18.8.0 0.0.0.255
Switch(config)#access-list 1 permit 10.93.0.0 0.0.255.255
Switch(config)#access-list
 <<  1 permit 130.18.1.0 0.0.0.255
Switch(config)#
Jun 22 11:21:27: %SYS-6-LOGGINGHOST_STARTSTOP: Logging to host 130.18.8.12 port 0 CLI Request Triggered
Jun 22 11:21:27: %SYS-6-LOGGINGHOST_STARTSTOP: Logging to host 130.18.8.12 port 514 started - CLI ini
 << tiatedsnmp-server community sysnet RO 1
Switch(config)#snmp-server community c2-b2=a2 RW 1
Switch(config)#snmp-server enable traps snmp authentication linkdown linkup c$ enable traps snmp aut
 << hentication linkdown linkup co         ldstart waps snmp authentication linkdown linkup coldstart wa         rmstart
Switch(config)#snmp-server enable traps transceiver all
S
 << witch(config)#snmp-server enable traps tty
Switch(config)#
Jun 22 11:21:27: %LINK-5-CHANGED: Interface FastEthernet0, changed state to administratively down
Jun 22 11:21:28: %LINK-5-CHANGED: Interface Vlan1, changed state to administratively downsnmp-s
 << erver enable traps cluster
Switch(config)#snmp-server enable traps config-copy
Switch(config)#snmp-server enable traps config
Switch(config)#snmp-server enable traps config-ctid
Switch(config)#snmp-server enable traps dot1x auth-fail-vlan guest-vlan n
 << o-au$ enable traps dot1x auth-fail-vlan guest-vlan no-aut         h-fail-vlaps dot1x auth-fail-vlan guest-vlan no-auth-fail
 << -vla         n no-guesuth-fail-vlan guest-vlan no-auth-fail-vlan no-guest         -vlan
snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-auth-fail-vlan no-gu        
 <<                  ^est-vlan

% Invalid input detected at '^' marker.

Switch(config)#snmp-server enable traps entity
Switch(config)#snmp-server enable traps power-ethernet police
Switch(config)#snmp-server enable traps cpu threshold
Switch(config)#s
 << nmp-server enable traps rep
                                        ^
% Invalid input detected at '^' marker.

Switch(config)#snmp-server enable traps bridge newroot topologychange
Switch(config)#snmp-server enable traps stpx inconsistency root-incon
 << sistency$ enable traps stpx inconsistency root-inconsistency          loop-incoaps stpx inconsistency root-inconsistency lo
 << op-incon         sistency
Switch(config)#snmp-server enable traps syslog
Switch(config)#snmp-server enable traps vtp
Switch(config)#snmp-server enable traps vlancreate
Switch(config)#snmp-server enable traps vlandelete
Switch(config)#snmp-se
 << rver enable traps flash insertion removal
Switch(config)#snmp-server enable traps port-security
Switch(config)#snmp-server enable traps envmon fan shutdown supply temperatur$ enable traps env
 << mon fan shutdown supply temperature          status
Switch(config)#snmp-server enable traps errdisable
Switch(config)#snmp-server enable traps mac-notification change move threshol$ 
 << enable traps mac-notification change move threshold         
Switch(config)#snmp-server enable traps vlan-membership
Switch(config)#snmp-server host 130.18.8.12 sysnet 
Switch(config)#line con 0
Switch(config-line)#line vty 0 15
Switch(confi
 << g-line)# access-class 1 in
Switch(config-line)# password W2w1cD0mIliG!
Switch(config-line)# login local
Switch(config-line)# transport input ssh
Switch(config-line)#ntp server 10.92.0.5
Switch(config)#
Switch(config)#end
Switch#
 << 
Jun 22 11:21:36: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
Switch#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
Expect: matched string 1: (config)#
 >> spanning-tree mode mst

 >> spanning-tree etherchannel guard misconfig

 >> spanning-tree mst configuration

 >>  name msstate

 >>  revision 1

 >>  instance 1 vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 63, 70

 >>  instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 160

 >>  instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 230, 232, 242, 246

 >>  instance 1 vlan 256, 611-612, 654, 741, 996, 999

 >>  instance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037, 2039-2040

 >>  instance 2 vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096, 2104, 2110, 2126

 >>  instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 2189, 2194, 2202

 >>  instance 2 vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 2654, 2999

 >>  instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176, 196

 >>  instance 3 vlan 244, 248, 927

 >>  instance 4 vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072, 2108, 2113, 2128

 >>  instance 4 vlan 2144, 2176, 2196, 2244, 2248, 2927

 >>  instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 228

 >>  instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216, 2228

 >>  instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116, 124

 >>  instance 7 vlan 172, 186, 192, 204-208, 210, 240-241, 251-252, 630, 928

 >>  instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082, 2084

 >>  instance 8 vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208, 2210

 >>  instance 8 vlan 2240-2241, 2251-2252, 2630, 2928

 >>  instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102, 112

 >>  instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 500, 505, 510-511

 >>  instance 9 vlan 522, 551-570, 603, 629, 633, 742, 802, 926, 929

 >>  instance 10 vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 2057, 2062, 2068

 >>  instance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148, 2158

 >>  instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522, 2603, 2629, 2633

 >>  instance 10 vlan 2802, 2926, 2929

 >>  instance 11 vlan 8, 43, 52, 146, 156-157, 180, 200, 218

 >>  instance 12 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180, 2200, 2218

 >> 

 >> end

Expect: searching for 1 strs:  :Configured
 << spanning-tree mode mst
Switch(config)#spanning-tree etherchannel guard misconfig
Switch(config)#spanning-tree mst configuration
Switch(config-mst)# name msstate
Switch(config-mst)# revision 1
Switch(config-mst)# instance 1 vlan 2, 7, 11, 20, 22, 24, 
 << 31, 35, 37, 39-40, $ vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40, 5         0, 60, 63, 11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 
 << 63,          70
Switch(config-mst)# instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 1$ vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 14         0, 152, 1
 << 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 16         0
Switch(config-mst)# instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 23$ vlan 162-1
 << 63, 168, 189, 194, 202, 220, 222, 230         , 232, 24163, 168, 189, 194, 202, 220, 222, 230, 232, 242         , 246
Switch(config-mst)# instance 1 vlan 256, 611-612, 654, 741, 9
 << 96, 999
Switch(config-mst)# instance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031,$ vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031,          2035, 203
 << , 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037         , 2039-2011, 2020, 2022, 2024, 2031, 2035, 2037, 2039-204         0
Switch(config-mst)# instance 2 v
 << lan 2050, 2060, 2063, 2070, 2080, 2086, 2096,$ vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096,          2104, 211, 2060, 2063, 2070,
 <<  2080, 2086, 2096, 2104, 2110         , 2126
Switch(config-mst)# instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, $ vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 2         
 << 189, 2194, 2140, 2152, 2160, 2162-2163, 2168, 2189, 2194,          2202
Switch(config-mst)# instance 2 vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 
 << $ vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 2         654, 2999
Switch(config-mst)# instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128$ vlan 42, 51, 59, 64
 << , 66, 69, 72, 108, 113, 128,          144, 17651, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176,          196
Switch(config-mst)# instance 3 vlan 244, 248, 927
Switch(config-mst)# 
 << instance 4 vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072,$ vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072,          2108, 211, 2051,
 <<  2059, 2064, 2066, 2069, 2072, 2108, 2113         , 2128
Switch(config-mst)# instance 4 vlan 2144, 2176, 2196, 2244, 2248, 2927
Switch(config-mst)# instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 2
 << $ vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 22         8
Switch(config-mst)# instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-$ vlan 2016, 2048, 2058, 2088, 
 << 2121, 2131, 2133-2         134, 2216, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216,          2228
Switch(config-mst)# instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97,
 << $ vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97,          114, 116,3-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116,          1
 << 24
Switch(config-mst)# instance 7 vlan 172, 186, 192, 204-208, 210, 240-241, 251$ vlan 172, 186, 192, 204-208, 210, 240-241, 251-         252, 630,
 << 186, 192, 204-208, 210, 240-241, 251-252, 630,          928
Switch(config-mst)# instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, $ vlan 2009, 2033-2034, 2038, 2054
 << , 2056, 2071, 2         075, 2082, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082,          2084
Switch(config-mst)# instance 8 vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192,
 << $ vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192,          2204-2208, 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208,          221
 << 0
Switch(config-mst)# instance 8 vlan 2240-2241, 2251-2252, 2630, 2928
Switch(config-mst)# instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 9$ vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 
 << 98         -99, 102,12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102,          112
Switch(config-mst)# instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 50
 << $ vlan 130, 132, 147-148, 158, 212, 226, 236, 500         , 505, 51132, 147-148, 158, 212, 226, 236, 500, 505, 510         -511
Switch(config-mst
 << )# instance 9 vlan 522, 551-570, 603, 629, 633, 742, 802, 92$ vlan 522, 551-570, 603, 629, 633, 742, 802, 926         , 929
Switch(config-mst)# instance 10 vlan 2004-2005, 2012, 2018-2019
 << , 2032, 2044, $0 vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 2         057, 20624-2005, 2012, 2018-2019, 2032, 2044, 2057, 2062,  
 <<         2068
Switch(config-mst)# instance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132,$0 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132,          2147-2148
 << 6, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148,          2158
Switch(config-mst)# instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522,$0 vlan 221
 << 2, 2236, 2500, 2505, 2510-2511, 2522,          2603, 2622, 2236, 2500, 2505, 2510-2511, 2522, 2603, 2629         , 2633
Switch(config-mst)# instance 10 vlan 2802, 2926, 2929
Swit
 << ch(config-mst)# instance 11 vlan 8, 43, 52, 146, 156-157, 180, 200, 218
Switch(config-mst)# instance 12 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180,$2 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180
 << ,          2200, 2218, 2043, 2052, 2146, 2156-2157, 2180, 2200, 2218         
Switch(config-mst)#
Switch(config-mst)#end
Switch#
Jun 22 11:21:51: %SYS-5-CONFIG_I: Configured fr
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << om console by console
Switch#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
Expect: matched string 1: (config)#
 >> hostname c29s2.b605.stoneblvd 

Expect: searching for 2 strs:  :# :>
 << hostname c29s2.b605.stoneblvd 
c29s2.b605.stoneblvd(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s2.b605.stoneblvd#
 << 
Jun 22 11:21:56: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s2.b605.stoneblvd#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s2.b605.stoneblvd(config)#
Expect: matched string 1: (config)#
 >> snmp-server contact 6F-1906

Expect: searching for 1 strs:  :#
 << snmp-server contact 6F-1906
c29s2.b605.stoneblvd(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s2.b605.stoneblvd#
 << 
Jun 22 11:22:02: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s2.b605.stoneblvd#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s2.b605.stoneblvd(config)#
Expect: matched string 1: (config)#
 >> interface vlan 92

Expect: searching for 1 strs:  :(config-if)#
 << interface vlan 92
c29s2.b605.stoneblvd(config-if)#
Expect: matched string 1: (config-if)#
 >> ip address 10.92.4.166 255.255.0.0

 >> ip broadcast-address 10.92.255.255

 >> end

Expect: searching for 1 strs:  :Configured
 << ip address 10.92.4.166 255.255.0.0
c29s2.b605.stoneblvd(config-if)#ip broadcast-address 10.92.255.255
c29s2.b605.stoneblvd(config-if)#end
c29s2.b605.stoneblvd#
 << 
Jun 22 11:22:08: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s2.b605.stoneblvd#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s2.b605.stoneblvd(config)#
Expect: matched string 1: (config)#
 >> interface Vlan92

Expect: searching for 1 strs:  :(config-if)#
 << interface Vlan92
c29s2.b605.stoneblvd(config-if)#
Expect: matched string 1: (config-if)#
 >> ip default-gateway 10.92.0.1

 >> end

Expect: searching for 1 strs:  :Configured
 << ip default-gateway 10.92.0.1
c29s2.b605.stoneblvd(config)#end
c29s2.b605.stoneblvd#
Jun 22 11:22:14: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s2.b605.stoneblvd#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s2.b605.stoneblvd(config)#
Expect: matched string 1: (config)#
 >> ip dhcp snooping

Expect: searching for 1 strs:  :#
 << ip dhcp snooping
c29s2.b605.stoneblvd(config)#
Expect: matched string 1: #
 >> ip dhcp snooping vlan 60

Expect: searching for 1 strs:  :#
 << ip dhcp snooping vlan 60
c29s2.b605.stoneblvd(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s2.b605.stoneblvd#
Jun 22 11:22:21: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s2.b605.stoneblvd#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s2.b605.stoneblvd(config)#
Expect: matched string 1: (config)#
 >> default interface range gi1/0/1 - 48 

 >> interface range gi1/0/1 - 48 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi1/0/1 - 48 
c29s2.b605.stoneblvd(config)#interface range gi1/0/1 - 48 
c29s2.b605.stoneblvd(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport access vlan 60

 >> switchport mode access

 >> spanning-tree portfast

 >> switchport port-security maximum 2

 >> switchport port-security

 >> switchport port-security aging time 15

 >> switchport port-security violation protect

 >> switchport port-security aging type inactivity

 >> power inline never

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport access vlan 60
c29s2.b605.stoneblvd(config-if-range)#switchport mode access
c29s2.b605.stoneblvd(config-if-range)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, concen
 << trators, switches, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast will be configured in 48 interfaces due to the range command 
 but will only have effect when the interf
 << aces are in a non-trunking mode.
c29s2.b605.stoneblvd(config-if-range)#switchport port-security maximum 2
c29s2.b605.stoneblvd(config-if-range)#switchport port-security
c29s2.b605.stoneblvd(config-if-range)#switchport port-security aging time 15
c29s2
 << .b605.stoneblvd(config-if-range)#switchport port-security violation prot$port-security violation prote         ct
c29s2.b605.stoneblvd(config-if-range)#switchport port-security aging type ina
 << $port-security aging type inac         tivity
c29s2.b605.stoneblvd(config-if-range)#power inline never
                                            ^
% Invalid input detected at '^' marker.

c29s2.b605.stoneblvd(config
 << -if-range)#end
c29s2.b605.stoneblvd#
 << 
Jun 22 11:22:29: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s2.b605.stoneblvd#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s2.b605.stoneblvd(config)#
Expect: matched string 1: (config)#
 >> default interface range gi1/0/47 - 48 

 >> interface range gi1/0/47 - 48 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi1/0/47 - 48 
c29s2.b605.stoneblvd(config)#interface range gi1/0/47 - 48 
c29s2.b605.stoneblvd(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport mode trunk

 >> switchport trunk native vlan 92

 >> ip dhcp snooping trust

 >> no keepalive

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport mode trunk
c29s2.b605.stoneblvd(config-if-range)#switchport trunk native vlan 92
c29s2.b605.stoneblvd(config-if-range)#ip dhcp snooping trust
c29s2.b605.stoneblvd(config-if-range)#no keepalive
c29s2.b605.stoneblvd(config-if-range)#end
c29s
 << 2.b605.stoneblvd#
 << 
Jun 22 11:22:36: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s2.b605.stoneblvd#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s2.b605.stoneblvd(config)#
Expect: matched string 1: (config)#
 >> default interface range gi1/0/49 - 52 

 >> interface range gi1/0/49 - 52 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi1/0/49 - 52 
c29s2.b605.stoneblvd(config)#interface range gi1/0/49 - 52 
c29s2.b605.stoneblvd(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport mode trunk

 >> switchport trunk native vlan 92

 >> ip dhcp snooping trust

 >> no keepalive

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport mode trunk
c29s2.b605.stoneblvd(config-if-range)#switchport trunk native vlan 92
c29s2.b605.stoneblvd(config-if-range)#ip dhcp snooping trust
c29s2.b605.stoneblvd(config-if-range)#no keepalive
c29s2.b605.stoneblvd(config-if-range)#end
c29s
 << 2.b605.stoneblvd#
 << 
Jun 22 11:22:42: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s2.b605.stoneblvd#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s2.b605.stoneblvd(config)#
Expect: matched string 1: (config)#
 >> crypto key generate rsa

 >> no

 >> 2048

Expect: searching for 2 strs:  :OK :(config)#
 << crypto key generate rsa
The name for the keys will be: c29s2.b605.stoneblvd.mgmt.msstate.edu
Choose the size of the key modulus in the range of 360 to 4096 for your
  General Purpose Keys. Choosing a key modulus greater than 512 may take
  a few minut
 << es.

How many bits in the modulus [512]: no
% A decimal number between 360 and 4096.
How many bits in the modulus [512]: 2048
% Generating 2048 bit RSA keys, keys will be non-exportable...
 << 
 << 
 << 
 << 
 << 
 << 
[OK] (elapsed time was 6 seconds)

c29s2.b605.stoneblvd(config)#
Jun 22 11:22:52: %SSH-5-ENABLED: SSH 1.99 has been enabled
Expect: matched string 1: OK
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s2.b605.stoneblvd#
 << 
Jun 22 11:22:55: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> write mem

Expect: searching for 2 strs:  :# :>
 << 
c29s2.b605.stoneblvd#write mem
Building configuration...
[OK]
c29s2.b605.stoneblvd#
Expect: matched string 1: #
 >> 
Expect: searching for 2 strs:  :# :>
 << 
c29s2.b605.stoneblvd#
c29s2.b605.stoneblvd#
Expect: matched string 1: #
 >> sh run

Expect: searching for 2 strs:  :# :>
 << sh run
Building configuration...

Current configuration : 20575 bytes
!
! Last configuration change at 11:22:55 CDT Fri Jun 22 2018
! NVRAM config last updated at 11:22:58 CDT Fri Jun 22 2018
!
version 15.2
no service pad
service timestamps debu
 << g datetime localtime
service timestamps log datetime localtime
service password-encryption
!
hostname c29s2.b605.stoneblvd
!
boot-start-marker
boot-end-marker
!
enable secret 5 $1$5bb6$eiGl9kjbAo982i3PyczgB1
enable password 7 046C59115E22681E043
 << 0091E354A
!
username root privilege 15 secret 5 $1$EWlE$W/TzyRFaWJevWPajnoBhK1
no aaa new-model
clock timezone CST -6 0
clock summer-time CDT recurring
switch 1 provision ws-c2960x-48ts-l
!
!
ip dhcp snooping vlan 60
ip dhcp snooping
ip domain-
 << name mgmt.msstate.edu
ip name-server 130.18.80.12
!
!
!
!
!
authentication mac-move permit
!
!
crypto pki trustpoint TP-self-signed-2494998912
 enrollment selfsigned
 subject-name cn=IOS-Self-Signed-Certificate-2494998912
 revocation-check no
 << ne
 rsakeypair TP-self-signed-2494998912
!
!
crypto pki certificate chain TP-self-signed-2494998912
 certificate self-signed 01
  	quit
!
spanning-tree mode mst
spanning-tree portfast bpduguard default
spanning-tree extend system-id
!
spanning
 << -tree mst configuration
 name msstate
 revision 1
 instance 1 vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 63, 70
 instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 160
 instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 
 << 230, 232, 242, 246
 instance 1 vlan 256, 611-612, 654, 741, 996, 999
 instance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037, 2039-2040
 instance 2 vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096, 2104, 2110, 2126
 instance 2 vlan 2136, 21
 << 40, 2152, 2160, 2162-2163, 2168, 2189, 2194, 2202
 instance 2 vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 2654, 2999
 instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176, 196
 instance 3 vlan 244, 248, 927
 instance 4 vlan 2042, 2051
 << , 2059, 2064, 2066, 2069, 2072, 2108, 2113, 2128
 instance 4 vlan 2144, 2176, 2196, 2244, 2248, 2927
 instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 228
 instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216, 2228
 instance 7 vl
 << an 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116, 124
 instance 7 vlan 172, 186, 192, 204-208, 210, 240-241, 251-252, 630, 928
 instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082, 2084
 instance 8 vlan 2097, 2114, 2116, 2124, 2172
 << , 2186, 2192, 2204-2208, 2210
 instance 8 vlan 2240-2241, 2251-2252, 2630, 2928
 instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102, 112
 instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 500, 505, 510-511
 instance 9 vlan 522, 55
 << 1-570, 603, 629, 633, 742, 802, 926, 929
 instance 10 vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 2057, 2062, 2068
 instance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148, 2158
 instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522, 26
 << 03, 2629, 2633
 instance 10 vlan 2802, 2926, 2929
 instance 11 vlan 8, 43, 52, 146, 156-157, 180, 200, 218
 instance 12 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180, 2200, 2218
!
errdisable recovery cause udld
errdisable recovery cause bpduguard
er
 << rdisable recovery cause security-violation
errdisable recovery cause channel-misconfig
errdisable recovery cause pagp-flap
errdisable recovery cause dtp-flap
errdisable recovery cause link-flap
errdisable recovery cause sfp-config-mismatch
errdisabl
 << e recovery cause gbic-invalid
errdisable recovery cause psecure-violation
errdisable recovery cause port-mode-failure
errdisable recovery cause dhcp-rate-limit
errdisable recovery cause pppoe-ia-rate-limit
errdisable recovery cause mac-limit
errdisa
 << ble recovery cause vmps
errdisable recovery cause storm-control
errdisable recovery cause inline-power
errdisable recovery cause arp-inspection
errdisable recovery cause loopback
errdisable recovery cause small-frame
errdisable recovery cause psp
e
 << rrdisable recovery interval 1800
!
!
!
!
vlan internal allocation policy ascending
!
lldp run
!
! 
!
!
!
!
!
!
!
!
interface FastEthernet0
 no ip address
 shutdown
!
interface GigabitEthernet1/0/1
 switchport access vlan 60
 switch
 << port mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface
 <<  GigabitEthernet1/0/2
 switchport access vlan 60
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switc
 << hport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/3
 switchport access vlan 60
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 1
 << 5
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/4
 switchport access vlan 60
 switchport mode access
 switchport port-security maximum 2
 switchport port-security 
 << violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/5
 switchport access vlan 60
 switchport mode access
 swit
 << chport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/6

 <<  switchport access vlan 60
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 s
 << panning-tree portfast
!
interface GigabitEthernet1/0/7
 switchport access vlan 60
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-sec
 << urity aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/8
 switchport access vlan 60
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 sw
 << itchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/9
 switchport access vlan 60
 switchport mode access
 switchport port-security ma
 << ximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/10
 switchport access vla
 << n 60
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
 << 
!
interface GigabitEthernet1/0/11
 switchport access vlan 60
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inac
 << tivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/12
 switchport access vlan 60
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-securi
 << ty aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/13
 switchport access vlan 60
 switchport mode access
 switchport port-security maximum 2
 switchpor
 << t port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/14
 switchport access vlan 60
 switchport m
 << ode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface Gigab
 << itEthernet1/0/15
 switchport access vlan 60
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport
 <<  port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/16
 switchport access vlan 60
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 
 << switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/17
 switchport access vlan 60
 switchport mode access
 switchport port-security maximum 2
 switchport port-security vio
 << lation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/18
 switchport access vlan 60
 switchport mode access
 switch
 << port port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/19
 
 << switchport access vlan 60
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 sp
 << anning-tree portfast
!
interface GigabitEthernet1/0/20
 switchport access vlan 60
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-sec
 << urity aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/21
 switchport access vlan 60
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 s
 << witchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/22
 switchport access vlan 60
 switchport mode access
 switchport port-security 
 << maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/23
 switchport access v
 << lan 60
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfas
 << t
!
interface GigabitEthernet1/0/24
 switchport access vlan 60
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type in
 << activity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/25
 switchport access vlan 60
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-secu
 << rity aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/26
 switchport access vlan 60
 switchport mode access
 switchport port-security maximum 2
 switchp
 << ort port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/27
 switchport access vlan 60
 switchport
 <<  mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface Gig
 << abitEthernet1/0/28
 switchport access vlan 60
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchpo
 << rt port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/29
 switchport access vlan 60
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 << 
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/30
 switchport access vlan 60
 switchport mode access
 switchport port-security maximum 2
 switchport port-security v
 << iolation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/31
 switchport access vlan 60
 switchport mode access
 swit
 << chport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/32
 << 
 switchport access vlan 60
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 
 << spanning-tree portfast
!
interface GigabitEthernet1/0/33
 switchport access vlan 60
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-s
 << ecurity aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/34
 switchport access vlan 60
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect

 <<  switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/35
 switchport access vlan 60
 switchport mode access
 switchport port-securit
 << y maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/36
 switchport access
 <<  vlan 60
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portf
 << ast
!
interface GigabitEthernet1/0/37
 switchport access vlan 60
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type 
 << inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/38
 switchport access vlan 60
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-se
 << curity aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/39
 switchport access vlan 60
 switchport mode access
 switchport port-security maximum 2
 switc
 << hport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/40
 switchport access vlan 60
 switchpo
 << rt mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface G
 << igabitEthernet1/0/41
 switchport access vlan 60
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switch
 << port port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/42
 switchport access vlan 60
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 1
 << 5
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/43
 switchport access vlan 60
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 <<  violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/44
 switchport access vlan 60
 switchport mode access
 sw
 << itchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/4
 << 5
 switchport access vlan 60
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 << 
 spanning-tree portfast
!
interface GigabitEthernet1/0/46
 switchport access vlan 60
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation  protect
 switchport port-security aging time 15
 switchport port
 << -security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/47
 switchport trunk native vlan 92
 switchport mode trunk
 no keepalive
 ip dhcp snooping trust
!
interface GigabitEthernet1/0/48

 <<  switchport trunk native vlan 92
 switchport mode trunk
 no keepalive
 ip dhcp snooping trust
!
interface GigabitEthernet1/0/49
 switchport trunk native vlan 92
 switchport mode trunk
 ip dhcp snooping trust
!
interface GigabitEthernet1/0/50
 s
 << witchport trunk native vlan 92
 switchport mode trunk
 ip dhcp snooping trust
!
interface GigabitEthernet1/0/51
 switchport trunk native vlan 92
 switchport mode trunk
 ip dhcp snooping trust
!
interface GigabitEthernet1/0/52
 switchport trunk n
 << ative vlan 92
 switchport mode trunk
 ip dhcp snooping trust
!
interface Vlan1
 no ip address
 no ip route-cache
 shutdown
!
interface Vlan92
 ip address 10.92.4.166 255.255.0.0
 ip broadcast-address 10.92.255.255
!
ip default-gateway 10.92.0
 << .1
no ip http server
no ip http secure-server
!
!
logging facility local1
logging host 130.18.8.12
access-list 1 permit 10.92.0.0 0.0.255.255
access-list 1 permit 130.18.8.0 0.0.0.255
access-list 1 permit 10.93.0.0 0.0.255.255
access-list 1 perm
 << it 130.18.1.0 0.0.0.255
!
snmp-server community sysnet RO 1
snmp-server community c2-b2=a2 RW 1
snmp-server contact 6F-1906
snmp-server enable traps snmp authentication linkdown linkup coldstart warmstart
snmp-server enable traps transceiver all
sn
 << mp-server enable traps tty
snmp-server enable traps cluster
snmp-server enable traps config-copy
snmp-server enable traps config
snmp-server enable traps config-ctid
snmp-server enable traps entity
snmp-server enable traps power-ethernet police
snm
 << p-server enable traps cpu threshold
snmp-server enable traps bridge newroot topologychange
snmp-server enable traps stpx inconsistency root-inconsistency loop-inconsistency
snmp-server enable traps syslog
snmp-server enable traps vtp
snmp-server enab
 << le traps vlancreate
snmp-server enable traps vlandelete
snmp-server enable traps flash insertion removal
snmp-server enable traps port-security
snmp-server enable traps envmon fan shutdown supply temperature status
snmp-server enable traps errdisable
 << 
snmp-server enable traps mac-notification change move threshold
snmp-server enable traps vlan-membership
snmp-server host 130.18.8.12 sysnet 
!
!
line con 0
line vty 0 4
 access-class 1 in
 password 7 0738735B1F0A3D551A3B0705236B
 login local

 <<  transport input ssh
line vty 5 15
 access-class 1 in
 password 7 0738735B1F0A3D551A3B0705236B
 login local
 transport input ssh
!
ntp server 10.92.0.5
end

c29s2.b605.stoneblvd#
Expect: matched string 1: #
 >> show interface status

Expect: searching for 2 strs:  :# :>
 << show interface status

Port      Name               Status       Vlan       Duplex  Speed Type 
Gi1/0/1                      notconnect   60           auto   auto 10/100/1000BaseTX
Gi1/0/2                      notconnect   60           auto   auto 10/
 << 100/1000BaseTX
Gi1/0/3                      notconnect   60           auto   auto 10/100/1000BaseTX
Gi1/0/4                      notconnect   60           auto   auto 10/100/1000BaseTX
Gi1/0/5                      notconnect   60           auto   auto 
 << 10/100/1000BaseTX
Gi1/0/6                      notconnect   60           auto   auto 10/100/1000BaseTX
Gi1/0/7                      notconnect   60           auto   auto 10/100/1000BaseTX
Gi1/0/8                      notconnect   60           auto   au
 << to 10/100/1000BaseTX
Gi1/0/9                      notconnect   60           auto   auto 10/100/1000BaseTX
Gi1/0/10                     notconnect   60           auto   auto 10/100/1000BaseTX
Gi1/0/11                     notconnect   60           auto  
 <<  auto 10/100/1000BaseTX
Gi1/0/12                     notconnect   60           auto   auto 10/100/1000BaseTX
Gi1/0/13                     notconnect   60           auto   auto 10/100/1000BaseTX
Gi1/0/14                     notconnect   60           aut
 << o   auto 10/100/1000BaseTX
Gi1/0/15                     notconnect   60           auto   auto 10/100/1000BaseTX
Gi1/0/16                     notconnect   60           auto   auto 10/100/1000BaseTX
Gi1/0/17                     notconnect   60           
 << auto   auto 10/100/1000BaseTX
Gi1/0/18                     notconnect   60           auto   auto 10/100/1000BaseTX
Gi1/0/19                     notconnect   60           auto   auto 10/100/1000BaseTX
Gi1/0/20                     notconnect   60        
 <<    auto   auto 10/100/1000BaseTX
Gi1/0/21                     notconnect   60           auto   auto 10/100/1000BaseTX
Gi1/0/22                     notconnect   60           auto   auto 10/100/1000BaseTX
Gi1/0/23                     notconnect   60     
 <<       auto   auto 10/100/1000BaseTX
Gi1/0/24                     notconnect   60           auto   auto 10/100/1000BaseTX
Gi1/0/25                     notconnect   60           auto   auto 10/100/1000BaseTX
Gi1/0/26                     notconnect   60  
 <<          auto   auto 10/100/1000BaseTX
Gi1/0/27                     notconnect   60           auto   auto 10/100/1000BaseTX
Gi1/0/28                     notconnect   60           auto   auto 10/100/1000BaseTX
Gi1/0/29                     notconnect   6
 << 0           auto   auto 10/100/1000BaseTX
Gi1/0/30                     notconnect   60           auto   auto 10/100/1000BaseTX
Gi1/0/31                     notconnect   60           auto   auto 10/100/1000BaseTX
Gi1/0/32                     notconnect 
 <<   60           auto   auto 10/100/1000BaseTX
Gi1/0/33                     notconnect   60           auto   auto 10/100/1000BaseTX
Gi1/0/34                     notconnect   60           auto   auto 10/100/1000BaseTX
Gi1/0/35                     notconne
 << ct   60           auto   auto 10/100/1000BaseTX
Gi1/0/36                     notconnect   60           auto   auto 10/100/1000BaseTX
Gi1/0/37                     notconnect   60           auto   auto 10/100/1000BaseTX
Gi1/0/38                     notco
 << nnect   60           auto   auto 10/100/1000BaseTX
Gi1/0/39                     notconnect   60           auto   auto 10/100/1000BaseTX
Gi1/0/40                     notconnect   60           auto   auto 10/100/1000BaseTX
Gi1/0/41                     no
 << tconnect   60           auto   auto 10/100/1000BaseTX
Gi1/0/42                     notconnect   60           auto   auto 10/100/1000BaseTX
Gi1/0/43                     notconnect   60           auto   auto 10/100/1000BaseTX
Gi1/0/44                    
 <<  notconnect   60           auto   auto 10/100/1000BaseTX
Gi1/0/45                     notconnect   60           auto   auto 10/100/1000BaseTX
Gi1/0/46                     notconnect   60           auto   auto 10/100/1000BaseTX
Gi1/0/47                 
 <<     notconnect   1            auto   auto 10/100/1000BaseTX
Gi1/0/48                     notconnect   1            auto   auto 10/100/1000BaseTX
Gi1/0/49                     notconnect   1            auto   auto Not Present
Gi1/0/50                    
 <<  notconnect   1            auto   auto Not Present
Gi1/0/51                     notconnect   1            auto   auto Not Present
Gi1/0/52                     notconnect   1            auto   auto Not Present
Fa0                          disabled     r
 << outed       auto   auto 10/100BaseTX
c29s2.b605.stoneblvd#
Expect: matched string 1: #
