trying to use serial port: /dev/ttyUSB0
 >> 
 >> 

Expect: searching for 4 strs:  :[yes/no] :Press RETURN to get started. :# :Switch>
 << 
c29s2.m2.lambdachialpha#
c29s2.m2.lambdachialpha#
c29s2.m2.lambdachialpha#
c29s2.m2.lambdachialpha#
Expect: matched string 3: #
 >> term len 0

Expect: searching for 2 strs:  :# :>
 << term len 0
c29s2.m2.lambdachialpha#
Expect: matched string 1: #
 >> show version

Expect: searching for 2 strs:  :# :>
 << show version
Cisco IOS Software, C2960 Software (C2960-LANBASEK9-M), Version 12.2(55)SE10, RELEASE SOFTWARE (fc2)
Technical Support: http://www.cisco.com/techsupport
Copyright (c) 1986-2015 by Cisco Systems, Inc.
Compiled Wed 11-Feb-15 11:46 by prod_r
 << el_team
Image text-base: 0x00003000, data-base: 0x01900000

ROM: Bootstrap program is C2960 boot loader
BOOTLDR: C2960 Boot Loader (C2960-HBOOT-M) Version 12.2(44)SE5, RELEASE SOFTWARE (fc1)

c29s2.m2.lambdachialpha uptime is 14 minutes
System retu
 << rned to ROM by power-on
System image file is "flash:/c2960-lanbasek9-mz.122-55.SE10.bin"


This product contains cryptographic features and is subject to United
States and local country laws governing import, export, transfer and
use. Delivery of Ci
 << sco cryptographic products does not imply
third-party authority to import, export, distribute or use encryption.
Importers, exporters, distributors and users are responsible for
compliance with U.S. and local country laws. By using this product you
ag
 << ree to comply with applicable laws and regulations. If you are unable
to comply with U.S. and local laws, return this product immediately.

A summary of U.S. laws governing Cisco cryptographic products may be found at:
http://www.cisco.com/wwl/export/
 << crypto/tool/stqrg.html

If you require further assistance please contact us by sending email to
export@cisco.com.

cisco WS-C2960-24TC-L (PowerPC405) processor (revision B0) with 65536K bytes of memory.
Processor board ID FOC1104ZC4Q
Last reset fro
 << m power-on
2 Virtual Ethernet interfaces
24 FastEthernet interfaces
2 Gigabit Ethernet interfaces
The password-recovery mechanism is enabled.

64K bytes of flash-simulated non-volatile configuration memory.
Base ethernet MAC Address       : 00:1B:0
 << C:C3:3D:00
Motherboard assembly number     : 73-9832-06
Power supply part number        : 341-0097-02
Motherboard serial number       : FOC11042T27
Power supply serial number      : AZS11040057
Model revision number           : B0
Motherboard revisi
 << on number     : C0
Model number                    : WS-C2960-24TC-L
System serial number            : FOC1104ZC4Q
Top Assembly Part Number        : 800-26671-02
Top Assembly Revision Number    : C0
Version ID                      : V02
CLEI Code Nu
 << mber                : COM3K00BRA
Hardware Board Revision Number  : 0x01


Switch Ports Model              SW Version            SW Image                 
------ ----- -----              ----------            ----------               
*    1 26    WS
 << -C2960-24TC-L    12.2(55)SE10          C2960-LANBASEK9-M        


Configuration register is 0xF

c29s2.m2.lambdachialpha#
Expect: matched string 1: #
 >> enable

Expect: searching for 2 strs:  :Password: :#
 << enable
c29s2.m2.lambdachialpha#
Expect: matched string 2: #
 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s2.m2.lambdachial(config)#
Expect: matched string 1: (config)#
 >> no service pad

 >> service timestamps debug datetime localtime

 >> service timestamps log datetime localtime

 >> service password-encryption

 >> boot-start-marker

 >> boot-end-marker

 >> enable secret W2w1cD0mIliG!

 >> enable password W2w1cD0mIliG!

 >> username root privilege 15 secret W2w1cD0mIliG!

 >> no aaa new-model

 >> clock timezone CST -6 0

 >> clock summer-time CDT recurring

 >> authentication mac-move permit

 >> ip domain-name mgmt.msstate.edu

 >> ip name-server 130.18.80.12

 >> vtp domain vtp01.mgmt.msstate.edu

 >> vtp mode client

 >> crypto pki trustpoint TP-self-signed-2494998912

 >>  enrollment selfsigned

 >>  subject-name cn=IOS-Self-Signed-Certificate-2494998912

 >>  revocation-check none

 >>  rsakeypair TP-self-signed-2494998912

 >> crypto pki certificate chain TP-self-signed-2494998912

 >>  certificate self-signed 01 nvram:IOS-Self-Sig#3232.cer

 >> spanning-tree portfast bpduguard default

 >> spanning-tree extend system-id

 >> vlan internal allocation policy ascending

 >> lldp run

 >> errdisable recovery cause all

 >> errdisable recovery interval 1800

 >> interface Vlan1

 >>  no ip address

 >>  no ip route-cache

 >>  shutdown

 >> interface Vlan92

 >> ip http server

 >> ip http secure-server

 >> logging facility local1

 >> logging host 130.18.8.12

 >> access-list 1 permit 10.92.0.0 0.0.255.255

 >> access-list 1 permit 130.18.8.0 0.0.0.255

 >> access-list 1 permit 10.93.0.0 0.0.255.255

 >> access-list 1 permit 130.18.1.0 0.0.0.255

 >> snmp-server community sysnet RO 1

 >> snmp-server community c2-b2=a2 RW 1

 >> snmp-server enable traps snmp authentication linkdown linkup coldstart warmstart

 >> snmp-server enable traps transceiver all

 >> snmp-server enable traps tty

 >> snmp-server enable traps cluster

 >> snmp-server enable traps config-copy

 >> snmp-server enable traps config

 >> snmp-server enable traps config-ctid

 >> snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-auth-fail-vlan no-guest-vlan

 >> snmp-server enable traps entity

 >> snmp-server enable traps power-ethernet police

 >> snmp-server enable traps cpu threshold

 >> snmp-server enable traps rep

 >> snmp-server enable traps bridge newroot topologychange

 >> snmp-server enable traps stpx inconsistency root-inconsistency loop-inconsistency

 >> snmp-server enable traps syslog

 >> snmp-server enable traps vtp

 >> snmp-server enable traps vlancreate

 >> snmp-server enable traps vlandelete

 >> snmp-server enable traps flash insertion removal

 >> snmp-server enable traps port-security

 >> snmp-server enable traps envmon fan shutdown supply temperature status

 >> snmp-server enable traps errdisable

 >> snmp-server enable traps mac-notification change move threshold

 >> snmp-server enable traps vlan-membership

 >> snmp-server host 130.18.8.12 

 >> line con 0

 >> line vty 0 15

 >>  access-class 1 in

 >>  password W2w1cD0mIliG!

 >>  login local

 >>  transport input ssh

 >> ntp server 10.92.0.5

 >> 

 >> end

Expect: searching for 1 strs:  :Configured
 << no service pad
c29s2.m2.lambdachial(config)#service timestamps debug datetime localtime
c29s2.m2.lambdachial(config)#service timestamps log datetime localtime
c29s2.m2.lambdachial(config)#service password-encryption
c29s2.m2.lambdachial(config)#boot-s
 << tart-marker
c29s2.m2.lambdachial(config)#boot-end-marker
c29s2.m2.lambdachial(config)#enable secret W2w1cD0mIliG!
The enable secret you have chosen is the same as your enable password.
This is not recommended.  Re-enter the enable secret.

c29s2.m2.
 << lambdachial(config)#enable password W2w1cD0mIliG!
The enable password you have chosen is the same as your enable secret.
This is not recommended.  Re-enter the enable password.

c29s2.m2.lambdachial(config)#username root privilege 15 secret W2w1cD0mIl
 << iG!
c29s2.m2.lambdachial(config)#no aaa new-model
c29s2.m2.lambdachial(config)#clock timezone CST -6 0
c29s2.m2.lambdachial(config)#clock summer-time CDT recurring
c29s2.m2.lambdachial(config)#authentication mac-move permit
c29s2.m2.lambdachial(confi
 << g)#ip domain-name mgmt.msstate.edu
c29s2.m2.lambdachial(config)#ip name-server 130.18.80.12
c29s2.m2.lambdachial(config)#vt
*Feb 28 18:15:03: %SYS-6-CLOCKUPDATE: System clock has been updated from 18:15:03 CST Sun Feb 28 1993 to 18:15:03 CST Sun Feb 28
 <<  1993, configured from console by console.
*Feb 28 18:15:04: %SYS-6-CLOCKUPDATE: System clock has been updated from 18:15:04 CST Sun Feb 28 1993 to 18:15:04 CST Sun Feb 28 1993, configured from console by console.p domain vtp01.mgmt.msstate.edu
Domain n
 << ame already set to vtp01.mgmt.msstate.edu.
c29s2.m2.lambdachial(config)#vtp mode client
Device mode already VTP Client for VLANS.
c29s2.m2.lambdachial(config)#crypto pki trustpoint TP-self-signed-2494998912
c29s2.m2.lambdachial(ca-trustpoint)# enrollm
 << ent selfsigned
c29s2.m2.lambdachial(ca-trustpoint)# subject-name cn=IOS-Self-Signed-Certific$me cn=IOS-Self-Signed-Certifica         te-249499Self-Signed-Certificat
 << e-2494998         912
c29s2.m2.lambdachial(ca-trustpoint)# revocation-check none
c29s2.m2.lambdachial(ca-trustpoint)# rsakeypair TP-self-signed-2494998912
c29s2.m2.lambdachial(ca-trustpoint)#crypto pki certificate chain TP-self-sign
 << $certificate chain TP-self-signe         d-2494998e chain TP-self-signed-24949989         12
c29s2.m2.lambdachial(config-cert-chain)# certificate self-signed 01 nvram
 << :IOS$e self-signed 01 nvram:IOS-         Self-Sig#ned 01 nvram:IOS-Self-Sig#3         232.cer
c29s2.m2.lambdachial(config-cert-chain)#spanning-tree portfast bpdugu
 << ard defa$ee portfast bpduguard defau         lt
c29s2.m2.lambdachial(config)#spanning-tree extend system-id
c29s2.m2.lambdachial(config)#vlan internal allocation policy ascending
c29s2.m2.lambdachial(config
 << )#lldp run
c29s2.m2.lambdachial(config)#errdisable recovery cause all
c29s2.m2.lambdachial(config)#errdisable recovery interval 1800
c29s2.m2.lambdachial(config)#interface Vlan1
c29s2.m2.lambdachial(config-if)# no ip address
c29s2.m2.lambdachial(conf
 << ig-if)# no ip route-cache
c29s2.m2.lambdachial(config-if)# shutdown
c29s2.m2.lambdachial(config-if)#interface Vlan92
c29s2.m2.lambdachial(config-if)#ip http server
c29s2.m2.lambdachial(config)#ip http secure-server
c29s2.m2.lambdachial(config)#loggin
 << g facility local1
c29s2.m2.lambdachial(config)#logging host 130.18.8.12
c29s2.m2.lambdachial(config)#access-list 1 permit 10.92.0.0 0.0.255.255
c29s2.m2.lambdachial(config)#access-list 1 permit 130.18.8.0 0.0.0.255
c29s2.m2.lambdachial(config)#access-
 << list 1 permit 10.93.0.0 0.0.255.255
c29s2.m2.lambdachial(config)#access-list 1 permit 130.18.1.0 0.0.0.255
c29s2.m2.lambdachial(config)#snmp-serv
*Feb 28 18:15:09: %PKI-4-NOAUTOSAVE: Configuration was modified.  Issue "write memory" to save new certifi
 << cateer community sysnet RO 1
c29s2.m2.lambdachial(config)#snmp-server community c2-b2=a2 RW 1
c29s2.m2.lambdachial(config)#snmp-server enable traps snmp authentication lin$ enable traps snmp authentication
 <<  link         down linkaps snmp authentication linkdown linku         p coldstauthentication linkdown linkup coldstar         t warmst
 << aion linkdown linkup coldstart warmstar         t
c29s2.m2.lambdachial(config)#snmp-server enable traps transceiver all
c29s2.m2.lambdachial(config)#snmp-server enable traps tty
c29s2.m2.lambdachi
 << al(config)#snmp-server enable traps cluster
c29s2.m2.lambdachial(config)#snmp-server enable traps config-copy
c29s2.m2.lambdachial(config)#snmp-server enable traps config
c29s2.m2.lambdachial(config)#snmp-server enable traps config-ctid
c29s2.m2.lambd
 << achial(config)#snmp-server enable traps dot1x auth-fail-vlan gu$ enable traps dot1x auth-fail-vlan gue         st-vlan naps dot1x auth-fail-vlan guest-
 << vlan no         -auth-faiuth-fail-vlan guest-vlan no-auth-fail         -vlan no-vlan guest-vlan no-auth-fail-vlan no-g         uest-vla
 << n
c29s2.m2.lambdachial(config)#snmp-server enable traps entity
c29s2.m2.lambdachial(config)#snmp-server enable traps power-ethernet police
c29s2.m2.lambdachial(config)#snmp-server enable traps cpu threshold
c29s2.m2.lambdachial(config)#snmp-server ena
 << ble traps rep
c29s2.m2.lambdachial(config)#snmp-server enable traps bridge newroot topology$ enable traps bridge newroot topologyc         hange
c29s2.m2.lambdachial(config)#snmp-server enable tra
 << ps stpx inconsistency root$ enable traps stpx inconsistency root-         inconsistaps stpx inconsistency root-inconsiste         ncy loop-
 << nconsistency root-inconsistency loop-i         nconsistecy root-inconsistency loop-inconsisten         cy
c29s2.m2.lambdachial(config)#snmp-serve
 << r enable traps syslog
c29s2.m2.lambdachial(config)#snmp-server enable traps vtp
c29s2.m2.lambdachial(config)#snmp-server enable traps vlancreate
c29s2.m2.lambdachial(config)#snmp-server enable traps vlandelete
c29s2.m2.lambdachial(config)#snmp-server 
 << enable traps flash insertion removal
c29s2.m2.lambdachial(config)#snmp-server enable traps port-security
c29s2.m2.lambdachial(config)#snmp-server enable traps envmon fan shutdown sup$ enable traps envmon f
 << an shutdown supp         ly temperaps envmon fan shutdown supply tempera         ture stat fan shutdown supply temperature statu         
 << s
c29s2.m2.lambdachial(config)#snmp-server enable traps errdisable
c29s2.m2.lambdachial(config)#snmp-server enable traps mac-notification change$ enable traps mac-notification change          m
 << ove threaps mac-notification change move thres         hold
c29s2.m2.lambdachial(config)#snmp-server enable traps vlan-membership
c29s2.m2.lambdachial(config)#snmp-server host 130.18.8.12 
% Incom
 << plete command.

c29s2.m2.lambdachial(config)#line con 0
c29s2.m2.lambdachial(config-line)#line vty 0 15
c29s2.m2.lambdachial(config-line)# access-class 1 in
c29s2.m2.lambdachial(config-line)# password W2w1cD0mIliG!
c29s2.m2.lambdachial(config-line)#
 <<  login local
c29s2.m2.lambdachial(config-line)# transport input ssh
c29s2.m2.lambdachial(config-line)#ntp server 10.92.0.5
c29s2.m2.lambdachial(config)#
c29s2.m2.lambdachial(config)#end
c29s2.m2.lambdachialpha#
 << 
*Feb 28 18:15:18: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s2.m2.lambdachialpha#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s2.m2.lambdachial(config)#
Expect: matched string 1: (config)#
 >> spanning-tree mode mst

 >> spanning-tree etherchannel guard misconfig

 >> spanning-tree mst configuration

 >>  name msstate

 >>  revision 1

 >>  instance 1 vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 63, 70

 >>  instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 160

 >>  instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 230, 232, 242, 246

 >>  instance 1 vlan 256, 611-612, 654, 741, 996, 999

 >>  instance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037, 2039-2040

 >>  instance 2 vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096, 2104, 2110, 2126

 >>  instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 2189, 2194, 2202

 >>  instance 2 vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 2654, 2999

 >>  instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176, 196

 >>  instance 3 vlan 244, 248, 927

 >>  instance 4 vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072, 2108, 2113, 2128

 >>  instance 4 vlan 2144, 2176, 2196, 2244, 2248, 2927

 >>  instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 228

 >>  instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216, 2228

 >>  instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116, 124

 >>  instance 7 vlan 172, 186, 192, 204-208, 210, 240-241, 251-252, 630, 928

 >>  instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082, 2084

 >>  instance 8 vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208, 2210

 >>  instance 8 vlan 2240-2241, 2251-2252, 2630, 2928

 >>  instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102, 112

 >>  instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 500, 505, 510-511

 >>  instance 9 vlan 522, 551-570, 603, 629, 633, 742, 802, 926, 929

 >>  instance 10 vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 2057, 2062, 2068

 >>  instance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148, 2158

 >>  instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522, 2603, 2629, 2633

 >>  instance 10 vlan 2802, 2926, 2929

 >>  instance 11 vlan 8, 43, 52, 146, 156-157, 180, 200, 218

 >>  instance 12 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180, 2200, 2218

 >> 

 >> end

Expect: searching for 1 strs:  :Configured
 << spanning-tree mode mst
c29s2.m2.lambdachial(config)#spanning-tree etherchannel guard misconfig
c29s2.m2.lambdachial(config)#spanning-tree mst configuration
c29s2.m2.lambdachial(config-mst)# name msstate
c29s2.m2.lambdachial(config-mst)# revision 1
c2
 << 9s2.m2.lambdachial(config-mst)# instance 1 vlan 2, 7, 11, 20, 22, 24, 31, 3$ vlan 2, 7, 11, 20, 22, 24, 31, 35         , 37, 39-, 11, 20, 22, 24, 31, 35, 37, 3
 << 9-4         0, 50, 6022, 24, 31, 35, 37, 39-40, 50, 60,          63, 70
c29s2.m2.lambdachial(config-mst)# instance 1 vlan 78, 80, 86, 91, 96, 104, 11
 << $ vlan 78, 80, 86, 91, 96, 104, 110         , 126, 1380, 86, 91, 96, 104, 110, 126, 136         , 140, 15, 96, 104, 110, 126, 136, 140, 152         
 << , 160
c29s2.m2.lambdachial(config-mst)# instance 1 vlan 162-163, 168, 189, 194, 202$ vlan 162-163, 168, 189, 194, 202,          220, 222163, 168, 189, 1
 << 94, 202, 220, 222,          230, 23289, 194, 202, 220, 222, 230, 232,          242, 246
c29s2.m2.lambdachial(config-mst)# instance 1 vlan 256, 611-612, 654, 741, 996
 << $ vlan 256, 611-612, 654, 741, 996,          999
c29s2.m2.lambdachial(config-mst)# instance 2 vlan 2002, 2007, 2011, 2020, 202$ vlan 2002, 2007, 2011, 2020, 2022         , 2024,
 <<  2, 2007, 2011, 2020, 2022, 2024, 20         31, 2035,11, 2020, 2022, 2024, 2031, 2035,          2037, 20320
 << 22, 2024, 2031, 2035, 2037, 2039         -2040
c29s2.m2.lambdachial(config-mst)# instance 2 vlan 2050, 2060, 2063, 2070, 208$ vlan 2050, 2060, 2063, 2070, 2080         , 2086, 2
 << , 2060, 2063, 2070, 2080, 2086, 20         96, 2104,63, 2070, 2080, 2086, 2096, 2104,          2110, 2122080, 2086, 2096, 2
 << 104, 2110, 2126         
c29s2.m2.lambdachial(config-mst)# instance 2 vlan 2136, 2140, 2152, 2160, 216$ vlan 2136, 2140, 2152, 2160, 2162         -2163, 21
 << , 2140, 2152, 2160, 2162-2163, 216         8, 2189, 52, 2160, 2162-2163, 2168, 2189, 2         194, 2202
c29s2.m2.lambdachial(config-mst)# instance 2 vlan 2220, 2222, 2232, 2242, 224
 << $ vlan 2220, 2222, 2232, 2242, 2246         , 2611-26, 2222, 2232, 2242, 2246, 2611-261         2, 2654, 32, 224
 << 2, 2246, 2611-2612, 2654, 2         999
c29s2.m2.lambdachial(config-mst)# instance 3 vlan 42, 51, 59, 64, 66, 69, 72,$ vlan 42, 51, 59, 64, 66, 69, 72,          108, 113,
 << 51, 59, 64, 66, 69, 72, 108, 113,          128, 144,, 66, 69, 72, 108, 113, 128, 144,          176, 196
c29s2.m2.lambdachial(config-mst)# instance 3 vlan 244, 248, 927
c29
 << s2.m2.lambdachial(config-mst)# instance 4 vlan 2042, 2051, 2059, 2064, 206$ vlan 2042, 2051, 2059, 2064, 2066         , 2069, 2, 2051, 2059, 2064, 2066, 2069, 
 << 20         72, 2108,59, 2064, 2066, 2069, 2072, 2108,          2113, 2122066, 2069, 2072, 2108, 2113, 2128         
c29s2.m2.lambdachial(conf
 << ig-mst)# instance 4 vlan 2144, 2176, 2196, 2244, 224$ vlan 2144, 2176, 2196, 2244, 2248         , 2927
c29s2.m2.lambdachial(config-mst)# instance 5 vlan 16, 48, 58, 88, 121, 131, 1
 << $ vlan 16, 48, 58, 88, 121, 131, 13         3-134, 2148, 58, 88, 121, 131, 133-134, 216         , 228
c29s2.m2.lambdachial(config-mst)# instance 6 vlan 2016, 2048, 2058, 
 << 2088, 212$ vlan 2016, 2048, 2058, 2088, 2121         , 2131, 2, 2048, 2058, 2088, 2121, 2131, 21         33-2134, 
 << 58, 2088, 2121, 2131, 2133-2134, 2         216, 2228
c29s2.m2.lambdachial(config-mst)# instance 7 vlan 9, 33-34, 38, 54, 56, 71, 7$ vlan 9, 33-34, 38, 54, 56, 71, 75         , 82, 84,
 << 3-34, 38, 54, 56, 71, 75, 82, 84,          97, 114, 54, 56, 71, 75, 82, 84, 97, 114, 1         16, 124
c29s2.m2.lambdachial(config-mst)# instance 7 vlan
 <<  172, 186, 192, 204-208, 210$ vlan 172, 186, 192, 204-208, 210,          240-241,186, 192, 204-208, 210, 240-241,          251-252, 
 << 204-208, 210, 240-241, 251-252, 6         30, 928
c29s2.m2.lambdachial(config-mst)# instance 8 vlan 2009, 2033-2034, 2038, 2054$ vlan 2009, 2033-2034, 2038, 2054,         
 <<  2056, 20, 2033-2034, 2038, 2054, 2056, 207         1, 2075, 4, 2038, 2054, 2056, 2071, 2075, 2         082, 2084
c29s2.m2.lambdachial(config-mst)# 
 << instance 8 vlan 2097, 2114, 2116, 2124, 217$ vlan 2097, 2114, 2116, 2124, 2172         , 2186, 2, 2114, 2116, 2124, 2172, 2186, 21         92, 2204-
 << 16, 2124, 2172, 2186, 2192, 2204-2         208, 2210
c29s2.m2.lambdachial(config-mst)# instance 8 vlan 2240-2241, 2251-2252, 2630,$ vlan 2240-2241, 2251-2252, 2
 << 630,          2928
c29s2.m2.lambdachial(config-mst)# instance 9 vlan 4-5, 12, 18-19, 32, 44, 57,$ vlan 4-5, 12, 18-19, 32, 44, 57,          62, 68, 71
 << 2, 18-19, 32, 44, 57, 62, 68, 76         , 98-99, , 32, 44, 57, 62, 68, 76, 98-99, 1         02, 112
c29s2.m2.lambdachial(config-mst)# instance 9 vlan 130, 132, 147-148, 158, 212
 << $ vlan 130, 132, 147-148, 158, 212,          226, 236132, 147-148, 158, 212, 226, 236,          500, 505148, 158, 212, 226,
 <<  236, 500, 505,          510-511
c29s2.m2.lambdachial(config-mst)# instance 9 vlan 522, 551-570, 603, 629, 633$ vlan 522, 551-570, 603, 629, 633,          742, 802
 << 551-570, 603, 629, 633, 742, 802,          926, 929
c29s2.m2.lambdachial(config-mst)# instance 10 vlan 2004-2005, 2012, 2018-2019$0 vlan 2004-2005, 2012, 2018-2019,          2032,
 <<  204-2005, 2012, 2018-2019, 2032, 204         4, 2057, 12, 2018-2019, 2032, 2044, 2057, 2         062, 2068
c29s2.m2.lambdachial(config-mst)# instance
 <<  10 vlan 2076, 2098-2099, 2102, 211$0 vlan 2076, 2098-2099, 2102, 2112         , 2130, 26, 2098-2099, 2102, 2112, 2130, 21         32, 2147-
 << 99, 2102, 2112, 2130, 2132, 2147-2         148, 2158
c29s2.m2.lambdachial(config-mst)# instance 10 vlan 2212, 2236, 2500, 2505, 25$0 vlan 2212, 2236, 2500, 2505, 251   
 <<       0-2511, 22, 2236, 2500, 2505, 2510-2511, 25         22, 2603,500, 2505, 2510-2511, 2522, 2603,          2629, 263
 <<  2510-2511, 2522, 2603, 2629, 2633         
c29s2.m2.lambdachial(config-mst)# instance 10 vlan 2802, 2926, 2929
c29s2.m2.lambdachial(config-mst)# instance 11 vlan 8, 43, 52, 146, 156-157, 1
 << $1 vlan 8, 43, 52, 146, 156-157, 18         0, 200, 243, 52, 146, 156-157, 180, 200, 21         8
c29s2.m2.lambdachial(config-mst)# instance 12 vlan 2008, 2043, 2052, 2146, 21
 << $2 vlan 2008, 2043, 2052, 2146, 215         6-2157, 28, 2043, 2052, 2146, 2156-2157, 21         80, 2200,052, 2146, 
 << 2156-2157, 2180, 2200,          2218
c29s2.m2.lambdachial(config-mst)#
c29s2.m2.lambdachial(config-mst)#end
c29s2.m2.lambdachialpha#
 << 
*Feb 28 18:15:36: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s2.m2.lambdachialpha#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s2.m2.lambdachial(config)#
Expect: matched string 1: (config)#
 >> hostname c29s2.m2.lambdachialpha 

Expect: searching for 2 strs:  :# :>
 << hostname c29s2.m2.lambdachialpha 
c29s2.m2.lambdachial(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s2.m2.lambdachialpha#
 << 
*Feb 28 18:15:42: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s2.m2.lambdachialpha#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s2.m2.lambdachial(config)#
Expect: matched string 1: (config)#
 >> snmp-server contact 6F-0983

Expect: searching for 1 strs:  :#
 << snmp-server contact 6F-0983
c29s2.m2.lambdachial(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s2.m2.lambdachialpha#
 << 
*Feb 28 18:15:48: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s2.m2.lambdachialpha#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s2.m2.lambdachial(config)#
Expect: matched string 1: (config)#
 >> interface vlan 92

Expect: searching for 1 strs:  :(config-if)#
 << interface vlan 92
c29s2.m2.lambdachial(config-if)#
Expect: matched string 1: (config-if)#
 >> ip address 10.92.3.14 255.255.0.0

 >> ip broadcast-address 10.92.255.255

 >> end

Expect: searching for 1 strs:  :Configured
 << ip address 10.92.3.14 255.255.0.0
c29s2.m2.lambdachial(config-if)#ip broadcast-address 10.92.255.255
c29s2.m2.lambdachial(config-if)#end
c29s2.m2.lambdachialpha#
 << 
*Feb 28 18:15:55: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s2.m2.lambdachialpha#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s2.m2.lambdachial(config)#
Expect: matched string 1: (config)#
 >> interface Vlan92

Expect: searching for 1 strs:  :(config-if)#
 << interface Vlan92
c29s2.m2.lambdachial(config-if)#
Expect: matched string 1: (config-if)#
 >> ip default-gateway 10.92.0.1

 >> end

Expect: searching for 1 strs:  :Configured
 << ip default-gateway 10.92.0.1
c29s2.m2.lambdachial(config)#end
c29s2.m2.lambdachialpha#
*Feb 28 18:16:01: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s2.m2.lambdachialpha#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s2.m2.lambdachial(config)#
Expect: matched string 1: (config)#
 >> ip dhcp snooping

Expect: searching for 1 strs:  :#
 << ip dhcp snooping
c29s2.m2.lambdachial(config)#
Expect: matched string 1: #
 >> ip dhcp snooping vlan 102

Expect: searching for 1 strs:  :#
 << ip dhcp snooping vlan 102
c29s2.m2.lambdachial(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s2.m2.lambdachialpha#
*Feb 28 18:16:08: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s2.m2.lambdachialpha#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s2.m2.lambdachial(config)#
Expect: matched string 1: (config)#
 >> default interface range fa0/1 - 24 

 >> interface range fa0/1 - 24 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range fa0/1 - 24 

 << 
 << 
 << c29s2.m2.lambdachial(config)#interface range fa0/1 - 24 
c29s2.m2.lambdachial(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport access vlan 102

 >> switchport mode access

 >> spanning-tree portfast

 >> switchport port-security maximum 2

 >> switchport port-security

 >> switchport port-security aging time 15

 >> switchport port-security violation protect

 >> switchport port-security aging type inactivity

 >> power inline never

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport access vlan 102
c29s2.m2.lambdachial(config-if-range)#switchport mode access
c29s2.m2.lambdachial(config-if-range)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, conce
 << ntrators, switches, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast will be configured in 24 interfaces due to the range command 
 but will only have effect when the inter
 << faces are in a non-trunking mode.
c29s2.m2.lambdachial(config-if-range)#switchport port-security maximum 2
c29s2.m2.lambdachial(config-if-range)#switchport port-security
c29s2.m2.lambdachial(config-if-range)#switchport port-security aging time 15
c29s
 << 2.m2.lambdachial(config-if-range)#switchport port-security violation prot$port-security violation prote         ct
c29s2.m2.lambdachial(config-if-range)#switchport port-security aging type ina
 << $port-security aging type inac         tivity
c29s2.m2.lambdachial(config-if-range)#power inline never
                                       ^
% Invalid input detected at '^' marker.

c29s2.m2.lambdachial(config-if-
 << range)#end
c29s2.m2.lambdachialpha#
 << 
*Feb 28 18:16:26: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s2.m2.lambdachialpha#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s2.m2.lambdachial(config)#
Expect: matched string 1: (config)#
 >> default interface range gi0/1 - 2 

 >> interface range gi0/1 - 2 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi0/1 - 2 
c29s2.m2.lambdachial(config)#interface range gi0/1 - 2 
c29s2.m2.lambdachial(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport mode trunk

 >> switchport trunk native vlan 92

 >> ip dhcp snooping trust

 >> no keepalive

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport mode trunk
c29s2.m2.lambdachial(config-if-range)#switchport trunk native vlan 92
c29s2.m2.lambdachial(config-if-range)#ip dhcp snooping trust
c29s2.m2.lambdachial(config-if-range)#no keepalive
c29s2.m2.lambdachial(config-if-range)#end
c29s
 << 2.m2.lambdachialpha#
 << 
*Feb 28 18:16:37: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s2.m2.lambdachialpha#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s2.m2.lambdachial(config)#
Expect: matched string 1: (config)#
 >> crypto key generate rsa

 >> no

 >> 2048

Expect: searching for 2 strs:  :OK :(config)#
 << crypto key generate rsa
% You already have RSA keys defined named c29s2.m2.lambdachialpha.mgmt.msstate.edu.
% Do you really want to replace them? [yes/no]: no
c29s2.m2.lambdachial(config)#2048
                             ^
% Invalid input detected a
Expect: matched string 2: (config)#
 >> end

Expect: searching for 1 strs:  :Configured
 << t '^' marker.

c29s2.m2.lambdachial(config)#end
c29s2.m2.lambdachialpha#
 << 
*Feb 28 18:16:52: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> write mem

Expect: searching for 2 strs:  :# :>
 << 
c29s2.m2.lambdachialpha#write mem
Building configuration...
[OK]
c29s2.m2.lambdachialpha#
Expect: matched string 1: #
 >> 
Expect: searching for 2 strs:  :# :>
 << 
c29s2.m2.lambdachialpha#
c29s2.m2.lambdachialpha#
Expect: matched string 1: #
 >> sh run

Expect: searching for 2 strs:  :# :>
 << sh run
Building configuration...

Current configuration : 14536 bytes
!
version 12.2
no service pad
service timestamps debug datetime localtime
service timestamps log datetime localtime
service password-encryption
!
hostname c29s2.m2.lambdachia
 << lpha
!
boot-start-marker
boot-end-marker
!
enable secret 5 $1$wOt3$pOuS62xqSm6GX25sG55qO1
enable password 7 113E4B1246112F5C0903272D0F72
!
username root privilege 15 secret 5 $1$goJL$aJnSEow/VGokeN.sLTcOy1
!
!
no aaa new-model
clock timezone C
 << ST -6
clock summer-time CDT recurring
system mtu routing 1500
authentication mac-move permit
!
!
ip dhcp snooping vlan 102
ip dhcp snooping
ip domain-name mgmt.msstate.edu
ip name-server 130.18.80.12
!
!
crypto pki trustpoint TP-self-signed-21
 << 4121728
 enrollment selfsigned
 subject-name cn=IOS-Self-Signed-Certificate-214121728
 revocation-check none
 rsakeypair TP-self-signed-214121728
!
!
crypto pki certificate chain TP-self-signed-214121728
 certificate self-signed 01
  30820260 308
 << 201C9 A0030201 02020101 300D0609 2A864886 F70D0101 04050030 
  30312E30 2C060355 04031325 494F532D 53656C66 2D536967 6E65642D 43657274 
  69666963 6174652D 32313431 32313732 38301E17 0D393330 33303130 30313530 
  395A170D 32303031 30313030 30303030 5A3
 << 03031 2E302C06 03550403 1325494F 
  532D5365 6C662D53 69676E65 642D4365 72746966 69636174 652D3231 34313231 
  37323830 819F300D 06092A86 4886F70D 01010105 0003818D 00308189 02818100 
  DF41AF7A B132B196 65BCBB03 C70F7ADF 816E242F 4E567510 0AF54389 632
 << 2BBE6 
  1EAEE1C3 473BE375 E0A68D20 8B1BCB3A C1E8AD44 63931A37 3C2896FA 1B49B259 
  9F4A0511 A0869FD8 2F93B45D E6F267A5 079C2510 8BF306A5 F2AB697C F00DD845 
  489647D1 1FD47AC3 9B9D2693 16B0C04F E76C564E A2755EBD 0BD71486 3A10AB83 
  02030100 01A38189
 <<  30818630 0F060355 1D130101 FF040530 030101FF 30330603 
  551D1104 2C302A82 28633239 73322E6D 322E6C61 6D626461 63686961 6C706861 
  2E6D676D 742E6D73 73746174 652E6564 75301F06 03551D23 04183016 80142612 
  4AA0897E 90A32592 2A2109C1 D9A3031B FE1C301D
 <<  0603551D 0E041604 1426124A 
  A0897E90 A325922A 2109C1D9 A3031BFE 1C300D06 092A8648 86F70D01 01040500 
  03818100 810169F4 4FC319CD 6880C401 77EE4CDA 81D79A44 12807AC7 31893258 
  D5442895 B99BC037 4DF6318A 821C6BD4 113E80A8 9D6329C3 3A1F368C 0E507494
 <<  
  1D1A7DFF C9B79A02 8FDFE13F 5DAAFBF1 7000D99C A1CA9F2D 55BFFAD0 4109716B 
  0555F1DD CC737619 474D8D45 1002D3DA 638B232A 3CF0A358 565B3999 7A1DD4EC 88F8E6C4
  quit
!
!
!
errdisable recovery cause udld
errdisable recovery cause bpduguard
errdis
 << able recovery cause security-violation
errdisable recovery cause channel-misconfig (STP)
errdisable recovery cause pagp-flap
errdisable recovery cause dtp-flap
errdisable recovery cause link-flap
errdisable recovery cause sfp-config-mismatch
errdisa
 << ble recovery cause gbic-invalid
errdisable recovery cause psecure-violation
errdisable recovery cause port-mode-failure
errdisable recovery cause dhcp-rate-limit
errdisable recovery cause pppoe-ia-rate-limit
errdisable recovery cause mac-limit
errdi
 << sable recovery cause vmps
errdisable recovery cause storm-control
errdisable recovery cause inline-power
errdisable recovery cause arp-inspection
errdisable recovery cause loopback
errdisable recovery cause small-frame
errdisable recovery interval 1
 << 800
!
spanning-tree mode mst
spanning-tree portfast bpduguard default
spanning-tree extend system-id
!
spanning-tree mst configuration
 name msstate
 revision 1
 instance 1 vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 63, 70
 instance 1
 <<  vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 160
 instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 230, 232, 242, 246
 instance 1 vlan 256, 611-612, 654, 741, 996, 999
 instance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031, 2035, 20
 << 37, 2039-2040
 instance 2 vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096, 2104, 2110, 2126
 instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 2189, 2194, 2202
 instance 2 vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 2654, 2999
 instance 3 vlan 
 << 42, 51, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176, 196
 instance 3 vlan 244, 248, 927
 instance 4 vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072, 2108, 2113, 2128
 instance 4 vlan 2144, 2176, 2196, 2244, 2248, 2927
 instance 5 vlan 16, 48, 58, 88, 12
 << 1, 131, 133-134, 216, 228
 instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216, 2228
 instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116, 124
 instance 7 vlan 172, 186, 192, 204-208, 210, 240-241, 251-252, 630, 928
 ins
 << tance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082, 2084
 instance 8 vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208, 2210
 instance 8 vlan 2240-2241, 2251-2252, 2630, 2928
 instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76,
 <<  98-99, 102, 112
 instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 500, 505, 510-511
 instance 9 vlan 522, 551-570, 603, 629, 633, 742, 802, 926, 929
 instance 10 vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 2057, 2062, 2068
 instance 10 vlan 20
 << 76, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148, 2158
 instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522, 2603, 2629, 2633
 instance 10 vlan 2802, 2926, 2929
 instance 11 vlan 8, 43, 52, 146, 156-157, 180, 200, 218
 instance 12 vlan 2008, 2043
 << , 2052, 2146, 2156-2157, 2180, 2200, 2218
!
!
vlan internal allocation policy ascending
lldp run
!
!
!
interface FastEthernet0/1
 switchport access vlan 102
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 << 
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface FastEthernet0/2
 switchport access vlan 102
 switchport mode access
 switchpor
 << t port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface FastEthernet0/3
 switchport
 <<  access vlan 102
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tre
 << e portfast
!
interface FastEthernet0/4
 switchport access vlan 102
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchpo
 << rt port-security aging type inactivity
 spanning-tree portfast
!
interface FastEthernet0/5
 switchport access vlan 102
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 
 << switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface FastEthernet0/6
 switchport access vlan 102
 switchport mode access
 switchport port-security maximum 2
 switchport port
 << -security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface FastEthernet0/7
 switchport access vlan 102
 switchport mode access

 <<  switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface FastEthernet0/8
 
 << switchport access vlan 102
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 sp
 << anning-tree portfast
!
interface FastEthernet0/9
 switchport access vlan 102
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 << 
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface FastEthernet0/10
 switchport access vlan 102
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging
 <<  time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface FastEthernet0/11
 switchport access vlan 102
 switchport mode access
 switchport port-security maximum 2
 swi
 << tchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface FastEthernet0/12
 switchport access vlan 102
 switchport 
 << mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface FastE
 << thernet0/13
 switchport access vlan 102
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type i
 << nactivity
 spanning-tree portfast
!
interface FastEthernet0/14
 switchport access vlan 102
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security vio
 << lation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface FastEthernet0/15
 switchport access vlan 102
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port
 << -security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface FastEthernet0/16
 switchport access vlan 102
 switchport mode access
 switchport port-security 
 << maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface FastEthernet0/17
 switchport access vlan 10
 << 2
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!

 << interface FastEthernet0/18
 switchport access vlan 102
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-securi
 << ty aging type inactivity
 spanning-tree portfast
!
interface FastEthernet0/19
 switchport access vlan 102
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport po
 << rt-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface FastEthernet0/20
 switchport access vlan 102
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 
 << switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface FastEthernet0/21
 switchport access vlan 102
 switchport mode access
 switchport
 <<  port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface FastEthernet0/22
 switchport
 <<  access vlan 102
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tre
 << e portfast
!
interface FastEthernet0/23
 switchport access vlan 102
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 switchport port-security violation protect
 switchp
 << ort port-security aging type inactivity
 spanning-tree portfast
!
interface FastEthernet0/24
 switchport access vlan 102
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 switchport port-security aging time 15
 << 
 switchport port-security violation protect
 switchport port-security aging type inactivity
 spanning-tree portfast
!
interface GigabitEthernet0/1
 switchport trunk native vlan 92
 switchport mode trunk
 ip dhcp snooping trust
!
interface Gigabi
 << tEthernet0/2
 switchport trunk native vlan 92
 switchport mode trunk
 ip dhcp snooping trust
!
interface Vlan1
 no ip address
 no ip route-cache
 shutdown
!
interface Vlan92
 ip address 10.92.3.14 255.255.0.0
 ip broadcast-address 10.92.255.25
 << 5
!
ip default-gateway 10.92.0.1
ip http server
ip http secure-server
logging facility local1
logging 130.18.8.12
access-list 1 permit 10.92.0.0 0.0.255.255
access-list 1 permit 130.18.8.0 0.0.0.255
access-list 1 permit 10.93.0.0 0.0.255.255
acc
 << ess-list 1 permit 130.18.1.0 0.0.0.255
snmp-server community sysnet RO 1
snmp-server community c2-b2=a2 RW 1
snmp-server contact 6F-0983
snmp-server enable traps snmp authentication linkdown linkup coldstart warmstart
snmp-server enable traps transce
 << iver all
snmp-server enable traps tty
snmp-server enable traps cluster
snmp-server enable traps entity
snmp-server enable traps cpu threshold
snmp-server enable traps rep
snmp-server enable traps vtp
snmp-server enable traps vlancreate
snmp-server
 <<  enable traps vlandelete
snmp-server enable traps flash insertion removal
snmp-server enable traps port-security
snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-auth-fail-vlan no-guest-vlan
snmp-server enable traps envmon fan shutdown supp
 << ly temperature status
snmp-server enable traps power-ethernet police
snmp-server enable traps config-copy
snmp-server enable traps config
snmp-server enable traps config-ctid
snmp-server enable traps bridge newroot topologychange
snmp-server enable 
 << traps stpx inconsistency root-inconsistency loop-inconsistency
snmp-server enable traps syslog
snmp-server enable traps mac-notification change move threshold
snmp-server enable traps vlan-membership
snmp-server enable traps errdisable
!
line con 0
 << 
line vty 0 4
 access-class 1 in
 password 7 06315D361D4D2D49083E1E022B45
 login local
 transport input ssh
line vty 5 15
 access-class 1 in
 password 7 06315D361D4D2D49083E1E022B45
 login local
 transport input ssh
!
ntp server 10.92.0.5
end
 << 

c29s2.m2.lambdachialpha#
Expect: matched string 1: #
 >> show interface status

Expect: searching for 2 strs:  :# :>
 << show interface status

Port      Name               Status       Vlan       Duplex  Speed Type
Fa0/1                        notconnect   102          auto   auto 10/100BaseTX
Fa0/2                        notconnect   102          auto   auto 10/100Bas
 << eTX
Fa0/3                        notconnect   102          auto   auto 10/100BaseTX
Fa0/4                        notconnect   102          auto   auto 10/100BaseTX
Fa0/5                        notconnect   102          auto   auto 10/100BaseTX
Fa0/6  
 <<                       notconnect   102          auto   auto 10/100BaseTX
Fa0/7                        notconnect   102          auto   auto 10/100BaseTX
Fa0/8                        notconnect   102          auto   auto 10/100BaseTX
Fa0/9              
 <<           notconnect   102          auto   auto 10/100BaseTX
Fa0/10                       notconnect   102          auto   auto 10/100BaseTX
Fa0/11                       notconnect   102          auto   auto 10/100BaseTX
Fa0/12                       no
 << tconnect   102          auto   auto 10/100BaseTX
Fa0/13                       notconnect   102          auto   auto 10/100BaseTX
Fa0/14                       notconnect   102          auto   auto 10/100BaseTX
Fa0/15                       notconnect   1
 << 02          auto   auto 10/100BaseTX
Fa0/16                       notconnect   102          auto   auto 10/100BaseTX
Fa0/17                       notconnect   102          auto   auto 10/100BaseTX
Fa0/18                       notconnect   102          
 << auto   auto 10/100BaseTX
Fa0/19                       notconnect   102          auto   auto 10/100BaseTX
Fa0/20                       notconnect   102          auto   auto 10/100BaseTX
Fa0/21                       notconnect   102          auto   auto 
 << 10/100BaseTX
Fa0/22                       notconnect   102          auto   auto 10/100BaseTX
Fa0/23                       notconnect   102          auto   auto 10/100BaseTX
Fa0/24                       notconnect   102          auto   auto 10/100BaseTX
 << 
Gi0/1                        notconnect   1            auto   auto Not Present
Gi0/2                        notconnect   1            auto   auto Not Present
c29s2.m2.lambdachialpha#
Expect: matched string 1: #
