trying to use serial port: /dev/ttyUSB0
 >> 
 >> 

Expect: searching for 4 strs:  :[yes/no] :Press RETURN to get started. :# :Switch>
 << 


         --- System Configuration Dialog ---

Enable secret warning
----------------------------------
In order to access the device manager, an enable secret is required
If you enter the initial configuration dialog, you will be prompted for t
 << he enable secret
If you choose not to enter the intial configuration dialog, or if you exit setup without setting the enable secret,
please set an enable secret using the following CLI in configuration mode-
enable secret 0 <cleartext password>
------
 << ----------------------------
Would you like to enter the initial configuration dialog? [yes/no]: 
% Please answer 'yes' or 'no'.
Would you like to enter the initial configuration dialog? [yes/no]: 
% Please answer 'yes' or 'no'.
Would you like to ent
Expect: matched string 1: [yes/no]
 >> 

 >> no

 >> term len 0

Expect: searching for 2 strs:  :# :>
 << er the initial configuration dialog? [yes/no]: 
% Please answer 'yes' or 'no'.
Would you like to enter the initial configuration dialog? [yes/no]: 
% Please answer 'yes' or 'no'.
Would you like to enter the initial configuration dialog? [yes/no]: 
% 
 << Please answer 'yes' or 'no'.
Would you like to enter the initial configuration dialog? [yes/no]: no
Switch>term len 0
Switch>
Expect: matched string 2: >
 >> show version

Expect: searching for 2 strs:  :# :>
 << show version
Cisco IOS Software, C2960S Software (C2960S-UNIVERSALK9-M), Version 15.0(2)SE8, RELEASE SOFTWARE (fc1)
Technical Support: http://www.cisco.com/techsupport
Copyright (c) 1986-2015 by Cisco Systems, Inc.
Compiled Wed 13-May-15 23:10 by prod
 << _rel_team

ROM: Bootstrap program is C2960S board boot loader
BOOTLDR: C2960S Boot Loader (C2960S-HBOOT-M) Version 12.2(55r)SE, RELEASE SOFTWARE (fc1)

Switch uptime is 27 minutes
System returned to ROM by power-on
System image file is "flash:/c296
 << 0s-universalk9-mz.150-2.SE8.bin"


This product contains cryptographic features and is subject to United
States and local country laws governing import, export, transfer and
use. Delivery of Cisco cryptographic products does not imply
third-party au
 << thority to import, export, distribute or use encryption.
Importers, exporters, distributors and users are responsible for
compliance with U.S. and local country laws. By using this product you
agree to comply with applicable laws and regulations. If yo
 << u are unable
to comply with U.S. and local laws, return this product immediately.

A summary of U.S. laws governing Cisco cryptographic products may be found at:
http://www.cisco.com/wwl/export/crypto/tool/stqrg.html

If you require further assistan
 << ce please contact us by sending email to
export@cisco.com.

cisco WS-C2960S-48TS-L (PowerPC) processor (revision J0) with 131072K bytes of memory.
Processor board ID FOC1720Y0J9
Last reset from power-on
1 Virtual Ethernet interface
1 FastEthernet i
 << nterface
52 Gigabit Ethernet interfaces
The password-recovery mechanism is enabled.

512K bytes of flash-simulated non-volatile configuration memory.
Base ethernet MAC Address       : D0:C7:89:D8:D5:00
Motherboard assembly number     : 73-11909-09

 << Power supply part number        : 341-0327-04
Motherboard serial number       : FOC17195PV5
Power supply serial number      : LIT17151XRP
Model revision number           : J0
Motherboard revision number     : A0
Model number                    : WS-C
 << 2960S-48TS-L
Daughterboard assembly number   : 73-11933-04
Daughterboard serial number     : FOC17192DNS
System serial number            : FOC1720Y0J9
Top Assembly Part Number        : 800-30950-06
Top Assembly Revision Number    : A0
Version ID    
 <<                   : V06
CLEI Code Number                : COMGF00ARF
Daughterboard revision number   : A0
Hardware Board Revision Number  : 0x01


Switch Ports Model              SW Version            SW Image                 
------ ----- -----   
 <<            ----------            ----------               
*    1 52    WS-C2960S-48TS-L   15.0(2)SE8            C2960S-UNIVERSALK9-M     


Configuration register is 0xF

Switch>
Expect: matched string 2: >
 >> enable

Expect: searching for 2 strs:  :Password: :#
 << enable
Switch#
Expect: matched string 2: #
 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
Expect: matched string 1: (config)#
 >> no service pad

 >> service timestamps debug datetime localtime

 >> service timestamps log datetime localtime

 >> service password-encryption

 >> boot-start-marker

 >> boot-end-marker

 >> enable secret W2w1cD0mIliG!

 >> enable password W2w1cD0mIliG!

 >> username root privilege 15 secret W2w1cD0mIliG!

 >> no aaa new-model

 >> clock timezone CST -6

 >> clock summer-time CDT recurring

 >> authentication mac-move permit

 >> ip domain-name mgmt.msstate.edu

 >> ip name-server 130.18.80.12

 >> vtp domain vtp01.mgmt.msstate.edu

 >> vtp mode client

 >> crypto pki trustpoint TP-self-signed-2494998912

 >>  enrollment selfsigned

 >>  subject-name cn=IOS-Self-Signed-Certificate-2494998912

 >>  revocation-check none

 >>  rsakeypair TP-self-signed-2494998912

 >> crypto pki certificate chain TP-self-signed-2494998912

 >>  certificate self-signed 01 nvram:IOS-Self-Sig#3232.cer

 >> spanning-tree portfast bpduguard default

 >> spanning-tree extend system-id

 >> vlan internal allocation policy ascending

 >> lldp run

 >> errdisable recovery cause all

 >> errdisable recovery interval 1800

 >> interface FastEthernet0

 >>  no ip address

 >>  shutdown

 >> interface Vlan1

 >>  no ip address

 >>  no ip route-cache

 >>  shutdown

 >> interface Vlan92

 >> no ip http server

 >> no ip http secure-server

 >> ip sla enable reaction-alerts

 >> logging facility local1

 >> logging host 130.18.8.12

 >> access-list 1 permit 10.92.0.0 0.0.255.255

 >> access-list 1 permit 130.18.8.0 0.0.0.255

 >> access-list 1 permit 10.93.0.0 0.0.255.255

 >> access-list 1 permit 130.18.1.0 0.0.0.255

 >> snmp-server community sysnet RO 1

 >> snmp-server community c2-b2=a2 RW 1

 >> snmp-server enable traps snmp authentication linkdown linkup coldstart warmstart

 >> snmp-server enable traps transceiver all

 >> snmp-server enable traps tty

 >> snmp-server enable traps cluster

 >> snmp-server enable traps config-copy

 >> snmp-server enable traps config

 >> snmp-server enable traps config-ctid

 >> snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-auth-fail-vlan no-guest-vlan

 >> snmp-server enable traps entity

 >> snmp-server enable traps power-ethernet group 1

 >> snmp-server enable traps power-ethernet police

 >> snmp-server enable traps cpu threshold

 >> snmp-server enable traps rep

 >> snmp-server enable traps rtr

 >> snmp-server enable traps bridge newroot topologychange

 >> snmp-server enable traps stpx inconsistency root-inconsistency loop-inconsistency

 >> snmp-server enable traps syslog

 >> snmp-server enable traps vtp

 >> snmp-server enable traps vlancreate

 >> snmp-server enable traps vlandelete

 >> snmp-server enable traps flash insertion removal

 >> snmp-server enable traps port-security

 >> snmp-server enable traps envmon fan shutdown supply temperature status

 >> snmp-server enable traps errdisable

 >> snmp-server enable traps mac-notification change move threshold

 >> snmp-server enable traps vlan-membership

 >> snmp-server host 130.18.8.12 sysnet 

 >> line con 0

 >> line vty 0 15

 >>  access-class 1 in

 >>  password W2w1cD0mIliG!

 >>  login local

 >>  transport input ssh

 >> ntp clock-period 22519226

 >> ntp server 10.92.0.5

 >> 

 >> end

Expect: searching for 1 strs:  :Configured
 << no service pad
Switch(config)#service timestamps debug datetime localtime
Switch(config)#service timestamps log datetime localtime
Switch(config)#service password-encryption
Switch(config)#boot-start-marker
Switch(config)#boot-end-marker
Switch(conf
 << ig)#enable secret W2w1cD0mIliG!
Switch(config)#enable password W2w1cD0mIliG!
The enable password you have chosen is the same as your enable secret.
This is not recommended.  Re-enter the enable password.

Switch(config)#username root privilege 15 sec
 << ret W2w1cD0mIliG!
Switch(config)#no aaa new-model
Switch(config)#clock timezone CST -6
Switch(config)#clock summer-time CDT recurring
Switch(config)#authentication mac-move permit
Switch(config)#ip domain-name mgmt.msstate.edu
Switch(config)#ip name
 << -server 130.18.80.12
Switch(config)#vtp domain vtp01.mgmt.msstate.edu
Domain name already set to vtp01.mgmt.msstate.edu.
Switch(config)#vtp mode client
Device mode already VTP Client for VLANS.
Switch(config)#
*Jan  1 18:30:26: %SYS-6-CLOCKUPDATE: S
 << ystem clock has been updated from 00:30:26 UTC Mon Jan 2 2006 to 18:30:26 CST Sun Jan 1 2006, configured from console by console.
*Jan  1 18:30:26: %SYS-6-CLOCKUPDATE: System clock has been updated from 18:30:26 CST Sun Jan 1 2006 to 18:30:26 CST Sun Jan
 <<  1 2006, configured from console by console.crypto pki trustpoint TP-self-signed-2494998912
Switch(ca-trustpoint)# enrollment selfsigned
Switch(ca-trustpoint)# subject-name cn=IOS-Self-Signed-Certificate-2494998912
Switch(ca-trustpoint)# revocation-che
 << ck none
Switch(ca-trustpoint)# rsakeypair TP-self-signed-2494998912
Switch(ca-trustpoint)#crypto pki certificate chain TP-self-signed-2494998912
Switch(config-cert-chain)# certificate self-signed 01 nvram:IOS-Self-Sig#3232
 << $e self-signed 01 nvram:IOS-Self-Sig#3232.         cer
Switch(config-cert-chain)#spanning-tree portfast bpduguard default
Switch(config)#spanning-tree extend system-id
Switch(config)#vlan internal allocation policy ascendi
 << ng
Switch(config)#lldp run
Switch(config)#errdisable recovery cause all
Switch(config)#errdisable recovery interval 1800
Switch(config)#interface FastEthernet0
Switch(config-if)# no ip address
Switch(config-if)# shutdown
Switch(config-if)#interface
 <<  Vlan1
Switch(config-if)# no ip address
Switch(config-if)# no ip route-cache
Switch(config-if)# shutdown
Switch(config-if)#interface Vlan92
Switch(config-if)#no ip http server
Switch(config)#no ip http secure-server
Switch(config)#ip sla enable rea
 << ction-alerts
                      ^
% Invalid input detected at '^' marker.

Switch(config)#logging facility local1
Switch(config)#logging host 130.18.8.12
Switch(config)#access-list 1 permit 10.92.0.0 0.0.255.255
Switch(config)#access-list 1 perm
 << it 130.18.8.0 0.0.0.255
Switch(config)#
*Jan  1 18:30:32: %LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan92, changed state to down
*Jan  1 18:30:33: %LINK-5-CHANGED: Interface FastEthernet0, changed state to administratively downaccess-list 1 perm
 << it 10.93.0.0 0.0.255.255
Switch(config)#access-list 1 permit 130.18.1.0 0.0.0.255
Switch(config)#snmp-server community sysnet RO 1
Switch(config)#snmp-server community c2-b2=a2 RW 1
Switch(config)#snmp-server enable traps snmp authentication linkdown 
 << linkup c$ enable traps snmp authentication linkdown linkup co         ld
*Jan  1 18:30:34: %LINK-5-CHANGED: Interface Vlan1, changed state to administratively downstart w
 << aps snmp authentication linkdown linkup coldstart wa         rmstart
Switch(config)#snmp-server enable traps transceiver all
Switch(config)#snmp-server enable traps tty
Switch(config)#snmp-server
 <<  enable traps cluster
Switch(config)#snmp-server enable traps config-copy
Switch(config)#
*Jan  1 18:30:34: %SYS-6-LOGGINGHOST_STARTSTOP: Logging to host 130.18.8.12 port 514 started - CLI initiatedsnmp-server enable traps config
Switch(config)#snmp-s
 << erver enable traps config-ctid
Switch(config)#snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-au$ enable traps dot1x auth-fail-vlan guest-vlan no-aut         h-fail-vl
 << aps dot1x auth-fail-vlan guest-vlan no-auth-fail-vla         n no-guesuth-fail-vlan guest-vlan no-auth-fail-vlan no-guest        
 <<  -vlan
Switch(config)#snmp-server enable traps entity
Switch(config)#snmp-server enable traps power-ethernet group 1
Group 1 is not inline power capable.

Switch(config)#snmp-server enable traps power-ethernet police
Switch(config)#snmp-ser
 << ver enable traps cpu threshold
Switch(config)#snmp-server enable traps rep
Switch(config)#snmp-server enable traps rtr
                                         ^
% Invalid input detected at '^' marker.

Switch(config)#snmp-server enable traps bridge
 <<  newroot topologychange
Switch(config)#snmp-server enable traps stpx inconsistency root-inconsistency$ enable traps stpx inconsistency root-inconsistency          loop-inco
 << aps stpx inconsistency root-inconsistency loop-incon         sistency
Switch(config)#snmp-server enable traps syslog
Switch(config)#snmp-server enable traps vtp
Switch(config)#snmp-server enabl
 << e traps vlancreate
Switch(config)#snmp-server enable traps vlandelete
Switch(config)#snmp-server enable traps flash insertion removal
Switch(config)#snmp-server enable traps port-security
Switch(config)#snmp-server enable traps envmon fan shutdown sup
 << ply temperatur$ enable traps envmon fan shutdown supply temperature          status
Switch(config)#snmp-server enable traps errdisable
Switch(config)#snmp-server enable traps mac-not
 << ification change move threshol$ enable traps mac-notification change move threshold         
Switch(config)#snmp-server enable traps vlan-membership
Switch(config)#snmp-server host 1
 << 30.18.8.12 sysnet 
Switch(config)#line con 0
Switch(config-line)#line vty 0 15
Switch(config-line)# access-class 1 in
Switch(config-line)# password W2w1cD0mIliG!
Switch(config-line)# login local
Switch(config-line)# transport input ssh
Switch(confi
 << g-line)#ntp clock-period 22519226
%NTP: This configuration command is depreceated.
Switch(config)#ntp server 10.92.0.5
Switch(config)#
Switch(config)#end
Switch#
 << 
*Jan  1 18:30:42: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
Switch#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
Expect: matched string 1: (config)#
 >> spanning-tree mode mst

 >> spanning-tree etherchannel guard misconfig

 >> spanning-tree mst configuration

 >>  name msstate

 >>  revision 1

 >>  instance 1 vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 63, 70

 >>  instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 160

 >>  instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 230, 232, 242, 246

 >>  instance 1 vlan 256, 611-612, 654, 741, 996, 999

 >>  instance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037, 2039-2040

 >>  instance 2 vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096, 2104, 2110, 2126

 >>  instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 2189, 2194, 2202

 >>  instance 2 vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 2654, 2999

 >>  instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176, 196

 >>  instance 3 vlan 244, 248, 927

 >>  instance 4 vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072, 2108, 2113, 2128

 >>  instance 4 vlan 2144, 2176, 2196, 2244, 2248, 2927

 >>  instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 228

 >>  instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216, 2228

 >>  instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116, 124

 >>  instance 7 vlan 172, 186, 192, 204-208, 210, 240-241, 251-252, 630, 928

 >>  instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082, 2084

 >>  instance 8 vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208, 2210

 >>  instance 8 vlan 2240-2241, 2251-2252, 2630, 2928

 >>  instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102, 112

 >>  instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 500, 505, 510-511

 >>  instance 9 vlan 522, 551-570, 603, 629, 633, 742, 802, 926, 929

 >>  instance 10 vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 2057, 2062, 2068

 >>  instance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148, 2158

 >>  instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522, 2603, 2629, 2633

 >>  instance 10 vlan 2802, 2926, 2929

 >>  instance 11 vlan 8, 43, 52, 146, 156-157, 180, 200, 218

 >>  instance 12 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180, 2200, 2218

 >> 

 >> end

Expect: searching for 1 strs:  :Configured
 << spanning-tree mode mst
Switch(config)#spanning-tree etherchannel guard misconfig
Switch(config)#spanning-tree mst configuration
Switch(config-mst)# name msstate
Switch(config-mst)# revision 1
Switch(config-mst)# instance 1 vlan 2, 7, 11, 20, 22, 24, 
 << 31, 35, 37, 39-40, $ vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40, 5         0, 60, 63, 11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 
 << 63,          70
Switch(config-mst)# instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 1$ vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 14         0, 152, 1
 << 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 16         0
Switch(config-mst)# instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 23$ vlan 162-1
 << 63, 168, 189, 194, 202, 220, 222, 230         , 232, 24163, 168, 189, 194, 202, 220, 222, 230, 232, 242         , 246
Switch(config-mst)# instance 1 vlan 256, 611-612, 654, 741, 9
 << 96, 999
Switch(config-mst)# instance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031,$ vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031,          2035, 203
 << , 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037         , 2039-2011, 2020, 2022, 2024, 2031, 2035, 2037, 2039-204         0
Switch(config-mst)# instance 2 v
 << lan 2050, 2060, 2063, 2070, 2080, 2086, 2096,$ vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096,          2104, 211, 2060, 2063, 2070,
 <<  2080, 2086, 2096, 2104, 2110         , 2126
Switch(config-mst)# instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, $ vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 2         
 << 189, 2194, 2140, 2152, 2160, 2162-2163, 2168, 2189, 2194,          2202
Switch(config-mst)# instance 2 vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 
 << $ vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 2         654, 2999
Switch(config-mst)# instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128$ vlan 42, 51, 59, 64
 << , 66, 69, 72, 108, 113, 128,          144, 17651, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176,          196
Switch(config-mst)# instance 3 vlan 244, 248, 927
Switch(config-mst)# 
 << instance 4 vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072,$ vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072,          2108, 211, 2051,
 <<  2059, 2064, 2066, 2069, 2072, 2108, 2113         , 2128
Switch(config-mst)# instance 4 vlan 2144, 2176, 2196, 2244, 2248, 2927
Switch(config-mst)# instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 2
 << $ vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 22         8
Switch(config-mst)# instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-$ vlan 2016, 2048, 2058, 2088, 
 << 2121, 2131, 2133-2         134, 2216, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216,          2228
Switch(config-mst)# instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97,
 << $ vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97,          114, 116,3-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116,          1
 << 24
Switch(config-mst)# instance 7 vlan 172, 186, 192, 204-208, 210, 240-241, 251$ vlan 172, 186, 192, 204-208, 210, 240-241, 251-         252, 630,
 << 186, 192, 204-208, 210, 240-241, 251-252, 630,          928
Switch(config-mst)# instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, $ vlan 2009, 2033-2034, 2038, 2054
 << , 2056, 2071, 2         075, 2082, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082,          2084
Switch(config-mst)# instance 8 vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192,
 << $ vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192,          2204-2208, 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208,          221
 << 0
Switch(config-mst)# instance 8 vlan 2240-2241, 2251-2252, 2630, 2928
Switch(config-mst)# instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 9$ vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 
 << 98         -99, 102,12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102,          112
Switch(config-mst)# instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 50
 << $ vlan 130, 132, 147-148, 158, 212, 226, 236, 500         , 505, 51132, 147-148, 158, 212, 226, 236, 500, 505, 510         -511
Switch(config-mst
 << )# instance 9 vlan 522, 551-570, 603, 629, 633, 742, 802, 92$ vlan 522, 551-570, 603, 629, 633, 742, 802, 926         , 929
Switch(config-mst)# instance 10 vlan 2004-2005, 2012, 2018-2019
 << , 2032, 2044, $0 vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 2         057, 20624-2005, 2012, 2018-2019, 2032, 2044, 2057, 2062,  
 <<         2068
Switch(config-mst)# instance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132,$0 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132,          2147-2148
 << 6, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148,          2158
Switch(config-mst)# instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522,$0 vlan 221
 << 2, 2236, 2500, 2505, 2510-2511, 2522,          2603, 2622, 2236, 2500, 2505, 2510-2511, 2522, 2603, 2629         , 2633
Switch(config-mst)# instance 10 vlan 2802, 2926, 2929
Swit
 << ch(config-mst)# instance 11 vlan 8, 43, 52, 146, 156-157, 180, 200, 218
Switch(config-mst)# instance 12 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180,$2 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180
 << ,          2200, 2218, 2043, 2052, 2146, 2156-2157, 2180, 2200, 2218         
Switch(config-mst)#
Switch(config-mst)#end
Switch#
 << 
*Jan  1 18:30:58: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
Switch#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
Expect: matched string 1: (config)#
 >> hostname c29s1.b126.magruderst 

Expect: searching for 2 strs:  :# :>
 << hostname c29s1.b126.magruderst 
c29s1.b126.magruders(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s1.b126.magruderst#
 << 
*Jan  1 18:31:05: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1.b126.magruderst#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1.b126.magruders(config)#
Expect: matched string 1: (config)#
 >> snmp-server contact 6F-1798

Expect: searching for 1 strs:  :#
 << snmp-server contact 6F-1798
c29s1.b126.magruders(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s1.b126.magruderst#
 << 
*Jan  1 18:31:11: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1.b126.magruderst#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1.b126.magruders(config)#
Expect: matched string 1: (config)#
 >> interface vlan 92

Expect: searching for 1 strs:  :(config-if)#
 << interface vlan 92
c29s1.b126.magruders(config-if)#
Expect: matched string 1: (config-if)#
 >> ip address 10.92.2.65 255.255.0.0

 >> ip broadcast-address 10.92.255.255

 >> end

Expect: searching for 1 strs:  :Configured
 << ip address 10.92.2.65 255.255.0.0
c29s1.b126.magruders(config-if)#ip broadcast-address 10.92.255.255
c29s1.b126.magruders(config-if)#end
c29s1.b126.magruderst#
 << 
*Jan  1 18:31:17: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1.b126.magruderst#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1.b126.magruders(config)#
Expect: matched string 1: (config)#
 >> interface Vlan92

Expect: searching for 1 strs:  :(config-if)#
 << interface Vlan92
c29s1.b126.magruders(config-if)#
Expect: matched string 1: (config-if)#
 >> ip default-gateway 10.92.0.1

 >> end

Expect: searching for 1 strs:  :Configured
 << ip default-gateway 10.92.0.1
c29s1.b126.magruders(config)#end
c29s1.b126.magruderst#
 << 
*Jan  1 18:31:23: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1.b126.magruderst#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1.b126.magruders(config)#
Expect: matched string 1: (config)#
 >> ip dhcp snooping

Expect: searching for 1 strs:  :#
 << ip dhcp snooping
c29s1.b126.magruders(config)#
Expect: matched string 1: #
 >> ip dhcp snooping vlan 160

Expect: searching for 1 strs:  :#
 << ip dhcp snooping vlan 160
c29s1.b126.magruders(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s1.b126.magruderst#
*Jan  1 18:31:31: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1.b126.magruderst#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1.b126.magruders(config)#
Expect: matched string 1: (config)#
 >> default interface range gi1/0/1 - 48 

 >> interface range gi1/0/1 - 48 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi1/0/1 - 48 

 << c29s1.b126.magruders(config)#interface range gi1/0/1 - 48 
c29s1.b126.magruders(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport access vlan 160

 >> switchport mode access

 >> spanning-tree portfast

 >> switchport port-security maximum 2

 >> switchport port-security

 >> switchport port-security aging time 15

 >> switchport port-security violation protect

 >> switchport port-security aging type inactivity

 >> power inline never

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport access vlan 160
c29s1.b126.magruders(config-if-range)#switchport mode access
c29s1.b126.magruders(config-if-range)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, conce
 << ntrators, switches, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast will be configured in 48 interfaces due to the range command 
 but will only have effect when the inter
 << faces are in a non-trunking mode.
c29s1.b126.magruders(config-if-range)#switchport port-security maximum 2
c29s1.b126.magruders(config-if-range)#switchport port-security
c29s1.b126.magruders(config-if-range)#switchport port-security aging time 15
c29s
 << 1.b126.magruders(config-if-range)#switchport port-security violation prot$port-security violation prote         ct
c29s1.b126.magruders(config-if-range)#switchport port-security aging type ina
 << $port-security aging type inac         tivity
c29s1.b126.magruders(config-if-range)#power inline never
                                       ^
% Invalid input detected at '^' marker.

c29s1.b126.magruders(config-if-
 << range)#end
c29s1.b126.magruderst#
 << 
*Jan  1 18:31:40: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1.b126.magruderst#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1.b126.magruders(config)#
Expect: matched string 1: (config)#
 >> default interface gi1/0/48 

 >> interface gi1/0/48 

Expect: searching for 1 strs:  :(config-if)#
 << default interface gi1/0/48 
Interface GigabitEthernet1/0/48 set to default configuration
c29s1.b126.magruders(config)#interface gi1/0/48 
c29s1.b126.magruders(config-if)#
Expect: matched string 1: (config-if)#
 >> switchport mode trunk

 >> switchport trunk native vlan 92

 >> ip dhcp snooping trust

 >> no keepalive

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport mode trunk
c29s1.b126.magruders(config-if)#switchport trunk native vlan 92
c29s1.b126.magruders(config-if)#ip dhcp snooping trust
c29s1.b126.magruders(config-if)#no keepalive
c29s1.b126.magruders(config-if)#end
c29s1.b126.magruderst#
 << 
*Jan  1 18:31:47: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1.b126.magruderst#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1.b126.magruders(config)#
Expect: matched string 1: (config)#
 >> default interface range gi1/0/49 - 52 

 >> interface range gi1/0/49 - 52 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi1/0/49 - 52 
c29s1.b126.magruders(config)#interface range gi1/0/49 - 52 
c29s1.b126.magruders(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport mode trunk

 >> switchport trunk native vlan 92

 >> ip dhcp snooping trust

 >> no keepalive

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport mode trunk
c29s1.b126.magruders(config-if-range)#switchport trunk native vlan 92
c29s1.b126.magruders(config-if-range)#ip dhcp snooping trust
c29s1.b126.magruders(config-if-range)#no keepalive
c29s1.b126.magruders(config-if-range)#end
c29s
 << 1.b126.magruderst#
 << 
*Jan  1 18:31:53: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1.b126.magruderst#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1.b126.magruders(config)#
Expect: matched string 1: (config)#
 >> crypto key generate rsa

 >> no

 >> 2048

Expect: searching for 2 strs:  :OK :(config)#
 << crypto key generate rsa
The name for the keys will be: c29s1.b126.magruderst.mgmt.msstate.edu
Choose the size of the key modulus in the range of 360 to 4096 for your
  General Purpose Keys. Choosing a key modulus greater than 512 may take
  a few minu
 << tes.

How many bits in the modulus [512]: no
% A decimal number between 360 and 4096.
How many bits in the modulus [512]: 2048
% Generating 2048 bit RSA keys, keys will be non-exportable...
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...
crypto key generate rsa
The name for the keys will be: c29s1.b126.magruderst.mgmt.msstate.edu
Choose the size of the key modulus in the range of 360 to 4096 for your
  General Purpose Keys. Choosing a key modulus greater than 512 may take
  a few minutes.

How many bits in the modulus [512]: no
% A decimal number between 360 and 4096.
How many bits in the modulus [512]: 2048
% Generating 2048 bit RSA keys, keys will be non-exportable...
...

 >> end

Expect: searching for 1 strs:  :Configured
 << 
 << 
 << 
 << 
[OK] (elapsed time was 15 seconds)

c29s1.b126.magruders(config)#end
c29s1.b126.magruderst#
 << 
*Jan  1 18:32:12: %SSH-5-ENABLED: SSH 1.99 has been enabled
*Jan  1 18:32:12: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> write mem

Expect: searching for 2 strs:  :# :>
 << 
c29s1.b126.magruderst#write mem
Building configuration...

Expect: matched string 1: #
 >> 
Expect: searching for 2 strs:  :# :>
 << [OK]
c29s1.b126.magruderst#
c29s1.b126.magruderst#
c29s1.b126.magruderst#
Expect: matched string 1: #
 >> sh run

Expect: searching for 2 strs:  :# :>
 << sh run
Building configuration...

 << 
Current configuration : 20781 bytes
!
! Last configuration change at 18:32:12 CST Sun Jan 1 2006
!
version 15.0
no service pad
service timestamps debug datetime localtime
service timestamps log datetime localtime
service password-encryption
!

 << hostname c29s1.b126.magruderst
!
boot-start-marker
boot-end-marker
!
enable secret 5 $1$E9oQ$YO.CON6CJ2xgd/0BnEbaY/
enable password 7 053C5418704F6A59142C1B1B2C4D
!
username root privilege 15 secret 5 $1$OF4J$Z7XgaJDr60yGIGgVDcYyP0
no aaa new-mod
 << el
clock timezone CST -6 0
clock summer-time CDT recurring
switch 1 provision ws-c2960s-48ts-l
authentication mac-move permit
!
!
ip dhcp snooping vlan 160
ip dhcp snooping
ip domain-name mgmt.msstate.edu
ip name-server 130.18.80.12
!
!
crypt
 << o pki trustpoint TP-self-signed-2494998912
 enrollment selfsigned
 subject-name cn=IOS-Self-Signed-Certificate-2494998912
 revocation-check none
 rsakeypair TP-self-signed-2494998912
!
!
crypto pki certificate chain TP-self-signed-2494998912
 cert
 << ificate self-signed 01
  	quit
!
spanning-tree mode mst
spanning-tree portfast bpduguard default
spanning-tree extend system-id
!
spanning-tree mst configuration
 name msstate
 revision 1
 instance 1 vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40,
 <<  50, 60, 63, 70
 instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 160
 instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 230, 232, 242, 246
 instance 1 vlan 256, 611-612, 654, 741, 996, 999
 instance 2 vlan 2002, 2007, 2011, 2020
 << , 2022, 2024, 2031, 2035, 2037, 2039-2040
 instance 2 vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096, 2104, 2110, 2126
 instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 2189, 2194, 2202
 instance 2 vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 2
 << 654, 2999
 instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176, 196
 instance 3 vlan 244, 248, 927
 instance 4 vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072, 2108, 2113, 2128
 instance 4 vlan 2144, 2176, 2196, 2244, 2248, 2927
 instan
 << ce 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 228
 instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216, 2228
 instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116, 124
 instance 7 vlan 172, 186, 192, 204-208, 210, 240-
 << 241, 251-252, 630, 928
 instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082, 2084
 instance 8 vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208, 2210
 instance 8 vlan 2240-2241, 2251-2252, 2630, 2928
 instance 9 vlan 4-5, 12, 18
 << -19, 32, 44, 57, 62, 68, 76, 98-99, 102, 112
 instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 500, 505, 510-511
 instance 9 vlan 522, 551-570, 603, 629, 633, 742, 802, 926, 929
 instance 10 vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 2057, 2062
 << , 2068
 instance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148, 2158
 instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522, 2603, 2629, 2633
 instance 10 vlan 2802, 2926, 2929
 instance 11 vlan 8, 43, 52, 146, 156-157, 180, 200, 218

 <<  instance 12 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180, 2200, 2218
!
!
!
!
!
!
errdisable recovery cause udld
errdisable recovery cause bpduguard
errdisable recovery cause security-violation
errdisable recovery cause channel-misconfig (STP)

 << errdisable recovery cause pagp-flap
errdisable recovery cause dtp-flap
errdisable recovery cause link-flap
errdisable recovery cause sfp-config-mismatch
errdisable recovery cause gbic-invalid
errdisable recovery cause psecure-violation
errdisable re
 << covery cause port-mode-failure
errdisable recovery cause dhcp-rate-limit
errdisable recovery cause pppoe-ia-rate-limit
errdisable recovery cause mac-limit
errdisable recovery cause vmps
errdisable recovery cause storm-control
errdisable recovery cau
 << se inline-power
errdisable recovery cause arp-inspection
errdisable recovery cause loopback
errdisable recovery cause small-frame
errdisable recovery cause psp
errdisable recovery interval 1800
!
!
!
!
vlan internal allocation policy ascending

 << !
lldp run
!
! 
!
!
!
!
!
!
!
!
interface FastEthernet0
 no ip address
 shutdown
!
interface GigabitEthernet1/0/1
 switchport access vlan 160
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violati
 << on protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/2
 switchport access vlan 160
 switchport mode access
 switchport 
 << port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/3
 switchp
 << ort access vlan 160
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-
 << tree portfast
!
interface GigabitEthernet1/0/4
 switchport access vlan 160
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security ag
 << ing type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/5
 switchport access vlan 160
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport
 <<  port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/6
 switchport access vlan 160
 switchport mode access
 switchport port-security maximum 2
 << 
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/7
 switchport access vlan 160
 s
 << witchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
inter
 << face GigabitEthernet1/0/8
 switchport access vlan 160
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 s
 << witchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/9
 switchport access vlan 160
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging ti
 << me 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/10
 switchport access vlan 160
 switchport mode access
 switchport port-security maximum 2
 switchport port-sec
 << urity violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/11
 switchport access vlan 160
 switchport mode access
 << 
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1
 << /0/12
 switchport access vlan 160
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-secur
 << ity
 spanning-tree portfast
!
interface GigabitEthernet1/0/13
 switchport access vlan 160
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport 
 << port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/14
 switchport access vlan 160
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation pro
 << tect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/15
 switchport access vlan 160
 switchport mode access
 switchport port-
 << security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/16
 switchport 
 << access vlan 160
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree
 <<  portfast
!
interface GigabitEthernet1/0/17
 switchport access vlan 160
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging
 <<  type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/18
 switchport access vlan 160
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport p
 << ort-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/19
 switchport access vlan 160
 switchport mode access
 switchport port-security maximum 2
 << 
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/20
 switchport access vlan 160
 s
 << witchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
inter
 << face GigabitEthernet1/0/21
 switchport access vlan 160
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 
 << switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/22
 switchport access vlan 160
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging 
 << time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/23
 switchport access vlan 160
 switchport mode access
 switchport port-security maximum 2
 switchport port-s
 << ecurity violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/24
 switchport access vlan 160
 switchport mode acce
 << ss
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEtherne
 << t1/0/25
 switchport access vlan 160
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-sec
 << urity
 spanning-tree portfast
!
interface GigabitEthernet1/0/26
 switchport access vlan 160
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchpor
 << t port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/27
 switchport access vlan 160
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation p
 << rotect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/28
 switchport access vlan 160
 switchport mode access
 switchport por
 << t-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/29
 switchpor
 << t access vlan 160
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tr
 << ee portfast
!
interface GigabitEthernet1/0/30
 switchport access vlan 160
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security agi
 << ng type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/31
 switchport access vlan 160
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport
 <<  port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/32
 switchport access vlan 160
 switchport mode access
 switchport port-security maximum 
 << 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/33
 switchport access vlan 160

 <<  switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
int
 << erface GigabitEthernet1/0/34
 switchport access vlan 160
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 << 
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/35
 switchport access vlan 160
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security agin
 << g time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/36
 switchport access vlan 160
 switchport mode access
 switchport port-security maximum 2
 switchport port
 << -security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/37
 switchport access vlan 160
 switchport mode ac
 << cess
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEther
 << net1/0/38
 switchport access vlan 160
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-s
 << ecurity
 spanning-tree portfast
!
interface GigabitEthernet1/0/39
 switchport access vlan 160
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchp
 << ort port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/40
 switchport access vlan 160
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation
 <<  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/41
 switchport access vlan 160
 switchport mode access
 switchport p
 << ort-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/42
 switchp
 << ort access vlan 160
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-
 << tree portfast
!
interface GigabitEthernet1/0/43
 switchport access vlan 160
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security a
 << ging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/44
 switchport access vlan 160
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchpo
 << rt port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/45
 switchport access vlan 160
 switchport mode access
 switchport port-security maximu
 << m 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/46
 switchport access vlan 160
 << 
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
i
 << nterface GigabitEthernet1/0/47
 switchport access vlan 160
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivit
 << y
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/48
 switchport trunk native vlan 92
 switchport mode trunk
 no keepalive
 ip dhcp snooping trust
!
interface GigabitEthernet1/0/49
 switchport trunk native vlan 
 << 92
 switchport mode trunk
 ip dhcp snooping trust
!
interface GigabitEthernet1/0/50
 switchport trunk native vlan 92
 switchport mode trunk
 ip dhcp snooping trust
!
interface GigabitEthernet1/0/51
 switchport trunk native vlan 92
 switchport m
 << ode trunk
 ip dhcp snooping trust
!
interface GigabitEthernet1/0/52
 switchport trunk native vlan 92
 switchport mode trunk
 ip dhcp snooping trust
!
interface Vlan1
 no ip address
 no ip route-cache
 shutdown
!
interface Vlan92
 ip address 
 << 10.92.2.65 255.255.0.0
 ip broadcast-address 10.92.255.255
!
ip default-gateway 10.92.0.1
no ip http server
no ip http secure-server
!
logging facility local1
logging host 130.18.8.12
access-list 1 permit 10.92.0.0 0.0.255.255
access-list 1 perm
 << it 130.18.8.0 0.0.0.255
access-list 1 permit 10.93.0.0 0.0.255.255
access-list 1 permit 130.18.1.0 0.0.0.255
!
snmp-server community sysnet RO 1
snmp-server community c2-b2=a2 RW 1
snmp-server contact 6F-1798
snmp-server enable traps snmp authentic
 << ation linkdown linkup coldstart warmstart
snmp-server enable traps transceiver all
snmp-server enable traps tty
snmp-server enable traps cluster
snmp-server enable traps config-copy
snmp-server enable traps config
snmp-server enable traps config-cti
 << d
snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-auth-fail-vlan no-guest-vlan
snmp-server enable traps entity
snmp-server enable traps power-ethernet police
snmp-server enable traps cpu threshold
snmp-server enable traps rep
snmp-server
 <<  enable traps bridge newroot topologychange
snmp-server enable traps stpx inconsistency root-inconsistency loop-inconsistency
snmp-server enable traps vtp
snmp-server enable traps vlancreate
snmp-server enable traps vlandelete
snmp-server enable trap
 << s flash insertion removal
snmp-server enable traps port-security
snmp-server enable traps envmon fan shutdown supply temperature status
snmp-server enable traps errdisable
snmp-server enable traps mac-notification change move threshold
snmp-server en
 << able traps vlan-membership
snmp-server host 130.18.8.12 sysnet 
!
!
line con 0
line vty 0 4
 access-class 1 in
 password 7 046C59115E22681E0430091E354A
 login local
 transport input ssh
line vty 5 15
 access-class 1 in
 password 7 046C59115E22
 << 681E0430091E354A
 login local
 transport input ssh
!
ntp server 10.92.0.5
end

c29s1.b126.magruderst#
Expect: matched string 1: #
 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1.b126.magruders(config)#
Expect: matched string 1: (config)#
 >> no service pad

 >> service timestamps debug datetime localtime

 >> service timestamps log datetime localtime

 >> service password-encryption

 >> boot-start-marker

 >> boot-end-marker

 >> enable secret W2w1cD0mIliG!

 >> enable password W2w1cD0mIliG!

 >> username root privilege 15 secret W2w1cD0mIliG!

 >> no aaa new-model

 >> clock timezone CST -6

 >> clock summer-time CDT recurring

 >> authentication mac-move permit

 >> ip domain-name mgmt.msstate.edu

 >> ip name-server 130.18.80.12

 >> vtp domain vtp01.mgmt.msstate.edu

 >> vtp mode client

 >> crypto pki trustpoint TP-self-signed-2494998912

 >>  enrollment selfsigned

 >>  subject-name cn=IOS-Self-Signed-Certificate-2494998912

 >>  revocation-check none

 >>  rsakeypair TP-self-signed-2494998912

 >> crypto pki certificate chain TP-self-signed-2494998912

 >>  certificate self-signed 01 nvram:IOS-Self-Sig#3232.cer

 >> spanning-tree portfast bpduguard default

 >> spanning-tree extend system-id

 >> vlan internal allocation policy ascending

 >> lldp run

 >> errdisable recovery cause all

 >> errdisable recovery interval 1800

 >> interface FastEthernet0

 >>  no ip address

 >>  shutdown

 >> interface Vlan1

 >>  no ip address

 >>  no ip route-cache

 >>  shutdown

 >> interface Vlan92

 >> no ip http server

 >> no ip http secure-server

 >> ip sla enable reaction-alerts

 >> logging facility local1

 >> logging host 130.18.8.12

 >> access-list 1 permit 10.92.0.0 0.0.255.255

 >> access-list 1 permit 130.18.8.0 0.0.0.255

 >> access-list 1 permit 10.93.0.0 0.0.255.255

 >> access-list 1 permit 130.18.1.0 0.0.0.255

 >> snmp-server community sysnet RO 1

 >> snmp-server community c2-b2=a2 RW 1

 >> snmp-server enable traps snmp authentication linkdown linkup coldstart warmstart

 >> snmp-server enable traps transceiver all

 >> snmp-server enable traps tty

 >> snmp-server enable traps cluster

 >> snmp-server enable traps config-copy

 >> snmp-server enable traps config

 >> snmp-server enable traps config-ctid

 >> snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-auth-fail-vlan no-guest-vlan

 >> snmp-server enable traps entity

 >> snmp-server enable traps power-ethernet group 1

 >> snmp-server enable traps power-ethernet police

 >> snmp-server enable traps cpu threshold

 >> snmp-server enable traps rep

 >> snmp-server enable traps rtr

 >> snmp-server enable traps bridge newroot topologychange

 >> snmp-server enable traps stpx inconsistency root-inconsistency loop-inconsistency

 >> snmp-server enable traps syslog

 >> snmp-server enable traps vtp

 >> snmp-server enable traps vlancreate

 >> snmp-server enable traps vlandelete

 >> snmp-server enable traps flash insertion removal

 >> snmp-server enable traps port-security

 >> snmp-server enable traps envmon fan shutdown supply temperature status

 >> snmp-server enable traps errdisable

 >> snmp-server enable traps mac-notification change move threshold

 >> snmp-server enable traps vlan-membership

 >> snmp-server host 130.18.8.12 sysnet 

 >> line con 0

 >> line vty 0 15

 >>  access-class 1 in

 >>  password W2w1cD0mIliG!

 >>  login local

 >>  transport input ssh

 >> ntp clock-period 22519226

 >> ntp server 10.92.0.5

 >> 

 >> end

Expect: searching for 1 strs:  :Configured
 << no service pad
c29s1.b126.magruders(config)#service timestamps debug datetime localtime
c29s1.b126.magruders(config)#service timestamps log datetime localtime
c29s1.b126.magruders(config)#service password-encryption
c29s1.b126.magruders(config)#boot-s
 << tart-marker
c29s1.b126.magruders(config)#boot-end-marker
c29s1.b126.magruders(config)#enable secret W2w1cD0mIliG!
The enable secret you have chosen is the same as your enable password.
This is not recommended.  Re-enter the enable secret.

c29s1.b12
 << 6.magruders(config)#enable password W2w1cD0mIliG!
The enable password you have chosen is the same as your enable secret.
This is not recommended.  Re-enter the enable password.

c29s1.b126.magruders(config)#username root privilege 15 secret W2w1cD0mIl
 << iG!
c29s1.b126.magruders(config)#no aaa new-model
c29s1.b126.magruders(config)#clock timezone CST -6
c29s1.b126.magruders(config)#clock summer-time CDT recurring
c29s1.b126.magruders(config)#authentication mac-move permit
c29s1.b126.magruders(config)
 << #ip domain-name mgmt.msstate.edu
c29s1.b126.magruders(config)#ip name-server 130.18.80.12
c29s1.b126.magruders(config)#vtp domain vtp01.mgmt.msstate.edu
Domain name already set to vtp01.mgmt.msstate.edu.
c29s1.b126.magruders(config)#vtp mode client
D
 << evice mode already VTP Client for VLANS.
c29s1.b126.magruders(config)#crypto pki trustpoint TP-self-signed-2494998912
c29s1.b126.magruders(ca-trustpoint)# enrollment selfsigned
c29s1.b126.magruders(ca-trustpoint)# subject-name cn=IOS-Self-Signed-Certif
 << ic$me cn=IOS-Self-Signed-Certifica         te-249499Self-Signed-Certificate-2494998         912
c29s1.b126.magruders(ca-trustpoint)# revocation-check none
 << 
c29s1.b126.magruders(ca-trustpoint)# rsakeypair TP-self-signed-2494998912
c29s1.b126.magruders(ca-trustpoint)#crypto pki certificate chain TP-self-sign$certificate chain TP-self-signe         d-2494998
 << e chain TP-self-signed-24949989         12
c29s1.b126.magruders(config-cert-chain)# certificate self-signed 01 nvram:IOS$e self-signed 01 nvram:IOS-         Self
 << -Sig#ned 01 nvram:IOS-Self-Sig#3         232.cer
c29s1.b126.magruders(config-cert-chain)#spanning-tree portfast bpduguard defa$ee portfast bpduguard defau         
 << lt
c29s1.b126.magruders(config)#spanning-tree extend system-id
c29s1.b126.magruders(config)#vlan internal allocation policy ascending
c29s1.b126.magruders(config)#lldp run
c29s1.b126.magruders(config)#errdisable recovery cause all
c29s1.b126.magruder
 << s(config)#
*Jan  1 18:35:32: % Multiple self signed certificates in config
    certificate for trust point TP-self-signed-2494998912 ignored
errdisable recovery interval 1800
c29s1.b126.magruders(config)#interface FastEthernet0
c29s1.b126.magruders(c
 << onfig-if)# no ip address
c29s1.b126.magruders(config-if)# shutdown
c29s1.b126.magruders(config-if)#interface Vlan1
c29s1.b126.magruders(config-if)# no ip address
c29s1.b126.magruders(config-if)# no ip route-cache
c29s1.b126.magruders(config-if)# shut
 << down
c29s1.b126.magruders(config-if)#interface Vlan92
c29s1.b126.magruders(config-if)#no ip http server
c29s1.b126.magruders(config)#no ip http secure-server
c29s1.b126.magruders(config)#ip sla enable reaction-alerts
                                 
 <<    ^
% Invalid input detected at '^' marker.

c29s1.b126.magruders(config)#logging facility local1
c29s1.b126.magruders(config)#logging host 130.18.8.12
c29s1.b126.magruders(config)#access-list 1 permit 10.92.0.0 0.0.255.255
c29s1.b126.magruders(con
 << fig)#access-list 1 permit 130.18.8.0 0.0.0.255
c29s1.b126.magruders(config)#access-list 1 permit 10.93.0.0 0.0.255.255
c29s1.b126.magruders(config)#access-list 1 permit 130.18.1.0 0.0.0.255
c29s1.b126.magruders(config)#snmp-server community sysnet RO 1
 << 
c29s1.b126.magruders(config)#snmp-server community c2-b2=a2 RW 1
c29s1.b126.magruders(config)#snmp-server enable traps snmp authentication lin$ enable traps snmp authentication link         down 
 << linkaps snmp authentication linkdown linku         p coldstauthentication linkdown linkup coldstar         t warmsta
 << ion linkdown linkup coldstart warmstar         t
c29s1.b126.magruders(config)#snmp-server enable traps transceiver all
c29s1.b126.magruders(config)#snmp-server enable traps tty
c29s1.b126.magruders(config)#snmp-server enabl
 << e traps cluster
c29s1.b126.magruders(config)#snmp-server enable traps config-copy
c29s1.b126.magruders(config)#snmp-server enable traps config
c29s1.b126.magruders(config)#snmp-server enable traps config-ctid
c29s1.b126.magruders(config)#snmp-server e
 << nable traps dot1x auth-fail-vlan gu$ enable traps dot1x auth-fail-vlan gue         st-vlan naps dot1x auth-fail-vlan guest-vlan no         -au
 << th-faiuth-fail-vlan guest-vlan no-auth-fail         -vlan no-vlan guest-vlan no-auth-fail-vlan no-g         uest-vlan
c29s1.b126.magruders(conf
 << ig)#snmp-server enable traps entity
c29s1.b126.magruders(config)#snmp-server enable traps power-ethernet group 1
Group 1 is not inline power capable.

c29s1.b126.magruders(config)#snmp-server enable traps power-ethernet police
c29s1.b126.magruders(co
 << nfig)#snmp-server enable traps cpu threshold
c29s1.b126.magruders(config)#snmp-server enable traps rep
c29s1.b126.magruders(config)#snmp-server enable traps rtr
                                                       ^
% Invalid input detected at '^' m
 << arker.

c29s1.b126.magruders(config)#snmp-server enable traps bridge newroot topology$ enable traps bridge newroot topologyc         hange
c29s1.b126.magruders(config)#snmp-server enable traps st
 << px inconsistency root$ enable traps stpx inconsistency root-         inconsistaps stpx inconsistency root-inconsiste         ncy loop-
 << nconsistency root-inconsistency loop-i         nconsistecy root-inconsistency loop-inconsisten         cy
c29s1.b126.magruders(config)#snmp-server ena
 << ble traps syslog
c29s1.b126.magruders(config)#snmp-server enable traps vtp
c29s1.b126.magruders(config)#snmp-server enable traps vlancreate
c29s1.b126.magruders(config)#snmp-server enable traps vlandelete
c29s1.b126.magruders(config)#snmp-server enabl
 << e traps flash insertion removal
c29s1.b126.magruders(config)#snmp-server enable traps port-security
c29s1.b126.magruders(config)#snmp-server enable traps envmon fan shutdown sup$ enable traps envmon fan sh
 << utdown supp         ly temperaps envmon fan shutdown supply tempera         ture stat fan shutdown supply temperature statu         s
 << 
c29s1.b126.magruders(config)#snmp-server enable traps errdisable
c29s1.b126.magruders(config)#snmp-server enable traps mac-notification change$ enable traps mac-notification change          move t
 << hreaps mac-notification change move thres         hold
c29s1.b126.magruders(config)#snmp-server enable traps vlan-membership
c29s1.b126.magruders(config)#snmp-server host 130.18.8.12 sysnet 
c29s1
 << .b126.magruders(config)#line con 0
c29s1.b126.magruders(config-line)#line vty 0 15
c29s1.b126.magruders(config-line)# access-class 1 in
c29s1.b126.magruders(config-line)# password W2w1cD0mIliG!
c29s1.b126.magruders(config-line)# login local
c29s1.b12
 << 6.magruders(config-line)# transport input ssh
c29s1.b126.magruders(config-line)#ntp clock-period 22519226
%NTP: This configuration command is depreceated.
c29s1.b126.magruders(config)#ntp server 10.92.0.5
c29s1.b126.magruders(config)#
c29s1.b126.magr
 << uders(config)#end
c29s1.b126.magruderst#
 << 
*Jan  1 18:35:45: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1.b126.magruderst#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1.b126.magruders(config)#
Expect: matched string 1: (config)#
 >> spanning-tree mode mst

 >> spanning-tree etherchannel guard misconfig

 >> spanning-tree mst configuration

 >>  name msstate

 >>  revision 1

 >>  instance 1 vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 63, 70

 >>  instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 160

 >>  instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 230, 232, 242, 246

 >>  instance 1 vlan 256, 611-612, 654, 741, 996, 999

 >>  instance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037, 2039-2040

 >>  instance 2 vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096, 2104, 2110, 2126

 >>  instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 2189, 2194, 2202

 >>  instance 2 vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 2654, 2999

 >>  instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176, 196

 >>  instance 3 vlan 244, 248, 927

 >>  instance 4 vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072, 2108, 2113, 2128

 >>  instance 4 vlan 2144, 2176, 2196, 2244, 2248, 2927

 >>  instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 228

 >>  instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216, 2228

 >>  instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116, 124

 >>  instance 7 vlan 172, 186, 192, 204-208, 210, 240-241, 251-252, 630, 928

 >>  instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082, 2084

 >>  instance 8 vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208, 2210

 >>  instance 8 vlan 2240-2241, 2251-2252, 2630, 2928

 >>  instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102, 112

 >>  instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 500, 505, 510-511

 >>  instance 9 vlan 522, 551-570, 603, 629, 633, 742, 802, 926, 929

 >>  instance 10 vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 2057, 2062, 2068

 >>  instance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148, 2158

 >>  instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522, 2603, 2629, 2633

 >>  instance 10 vlan 2802, 2926, 2929

 >>  instance 11 vlan 8, 43, 52, 146, 156-157, 180, 200, 218

 >>  instance 12 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180, 2200, 2218

 >> 

 >> end

Expect: searching for 1 strs:  :Configured
 << spanning-tree mode mst
c29s1.b126.magruders(config)#spanning-tree etherchannel guard misconfig
c29s1.b126.magruders(config)#spanning-tree mst configuration
c29s1.b126.magruders(config-mst)# name msstate
c29s1.b126.magruders(config-mst)# revision 1
c2
 << 9s1.b126.magruders(config-mst)# instance 1 vlan 2, 7, 11, 20, 22, 24, 31, 3$ vlan 2, 7, 11, 20, 22, 24, 31, 35         , 37, 39-, 11, 20, 22, 24, 31, 35, 37, 3
 << 9-4         0, 50, 6022, 24, 31, 35, 37, 39-40, 50, 60,          63, 70
c29s1.b126.magruders(config-mst)# instance 1 vlan 78, 80, 86, 91, 96, 104, 11
 << $ vlan 78, 80, 86, 91, 96, 104, 110         , 126, 1380, 86, 91, 96, 104, 110, 126, 136         , 140, 15, 96, 104, 110, 126, 136, 140, 152         
 << , 160
c29s1.b126.magruders(config-mst)# instance 1 vlan 162-163, 168, 189, 194, 202$ vlan 162-163, 168, 189, 194, 202,          220, 222163, 168, 189, 1
 << 94, 202, 220, 222,          230, 23289, 194, 202, 220, 222, 230, 232,          242, 246
c29s1.b126.magruders(config-mst)# instance 1 vlan 256, 611-612, 654, 741, 996
 << $ vlan 256, 611-612, 654, 741, 996,          999
c29s1.b126.magruders(config-mst)# instance 2 vlan 2002, 2007, 2011, 2020, 202$ vlan 2002, 2007, 2011, 2020, 2022         , 2024,
 <<  2, 2007, 2011, 2020, 2022, 2024, 20         31, 2035,11, 2020, 2022, 2024, 2031, 2035,          2037, 20320
 << 22, 2024, 2031, 2035, 2037, 2039         -2040
c29s1.b126.magruders(config-mst)# instance 2 vlan 2050, 2060, 2063, 2070, 208$ vlan 2050, 2060, 2063, 2070, 2080         , 2086, 2
 << , 2060, 2063, 2070, 2080, 2086, 20         96, 2104,63, 2070, 2080, 2086, 2096, 2104,          2110, 2122080, 2086, 2096, 2
 << 104, 2110, 2126         
c29s1.b126.magruders(config-mst)# instance 2 vlan 2136, 2140, 2152, 2160, 216$ vlan 2136, 2140, 2152, 2160, 2162         -2163, 21
 << , 2140, 2152, 2160, 2162-2163, 216         8, 2189, 52, 2160, 2162-2163, 2168, 2189, 2         194, 2202
c29s1.b126.magruders(config-mst)# instance 2 vlan 2220, 2222, 2232, 2242, 224
 << $ vlan 2220, 2222, 2232, 2242, 2246         , 2611-26, 2222, 2232, 2242, 2246, 2611-261         2, 2654, 32, 224
 << 2, 2246, 2611-2612, 2654, 2         999
c29s1.b126.magruders(config-mst)# instance 3 vlan 42, 51, 59, 64, 66, 69, 72,$ vlan 42, 51, 59, 64, 66, 69, 72,          108, 113,
 << 51, 59, 64, 66, 69, 72, 108, 113,          128, 144,, 66, 69, 72, 108, 113, 128, 144,          176, 196
c29s1.b126.magruders(config-mst)# instance 3 vlan 244, 248, 927
c29
 << s1.b126.magruders(config-mst)# instance 4 vlan 2042, 2051, 2059, 2064, 206$ vlan 2042, 2051, 2059, 2064, 2066         , 2069, 2, 2051, 2059, 2064, 2066, 2069, 
 << 20         72, 2108,59, 2064, 2066, 2069, 2072, 2108,          2113, 2122066, 2069, 2072, 2108, 2113, 2128         
c29s1.b126.magruders(conf
 << ig-mst)# instance 4 vlan 2144, 2176, 2196, 2244, 224$ vlan 2144, 2176, 2196, 2244, 2248         , 2927
c29s1.b126.magruders(config-mst)# instance 5 vlan 16, 48, 58, 88, 121, 131, 1
 << $ vlan 16, 48, 58, 88, 121, 131, 13         3-134, 2148, 58, 88, 121, 131, 133-134, 216         , 228
c29s1.b126.magruders(config-mst)# instance 6 vlan 2016, 2048, 2058, 
 << 2088, 212$ vlan 2016, 2048, 2058, 2088, 2121         , 2131, 2, 2048, 2058, 2088, 2121, 2131, 21         33-2134, 
 << 58, 2088, 2121, 2131, 2133-2134, 2         216, 2228
c29s1.b126.magruders(config-mst)# instance 7 vlan 9, 33-34, 38, 54, 56, 71, 7$ vlan 9, 33-34, 38, 54, 56, 71, 75         , 82, 84,
 << 3-34, 38, 54, 56, 71, 75, 82, 84,          97, 114, 54, 56, 71, 75, 82, 84, 97, 114, 1         16, 124
c29s1.b126.magruders(config-mst)# instance 7 vlan
 <<  172, 186, 192, 204-208, 210$ vlan 172, 186, 192, 204-208, 210,          240-241,186, 192, 204-208, 210, 240-241,          251-252, 
 << 204-208, 210, 240-241, 251-252, 6         30, 928
c29s1.b126.magruders(config-mst)# instance 8 vlan 2009, 2033-2034, 2038, 2054$ vlan 2009, 2033-2034, 2038, 2054,         
 <<  2056, 20, 2033-2034, 2038, 2054, 2056, 207         1, 2075, 4, 2038, 2054, 2056, 2071, 2075, 2         082, 2084
c29s1.b126.magruders(config-mst)# 
 << instance 8 vlan 2097, 2114, 2116, 2124, 217$ vlan 2097, 2114, 2116, 2124, 2172         , 2186, 2, 2114, 2116, 2124, 2172, 2186, 21         92, 2204-
 << 16, 2124, 2172, 2186, 2192, 2204-2         208, 2210
c29s1.b126.magruders(config-mst)# instance 8 vlan 2240-2241, 2251-2252, 2630,$ vlan 2240-2241, 2251-2252, 2
 << 630,          2928
c29s1.b126.magruders(config-mst)# instance 9 vlan 4-5, 12, 18-19, 32, 44, 57,$ vlan 4-5, 12, 18-19, 32, 44, 57,          62, 68, 71
 << 2, 18-19, 32, 44, 57, 62, 68, 76         , 98-99, , 32, 44, 57, 62, 68, 76, 98-99, 1         02, 112
c29s1.b126.magruders(config-mst)# instance 9 vlan 130, 132, 147-148, 158, 212
 << $ vlan 130, 132, 147-148, 158, 212,          226, 236132, 147-148, 158, 212, 226, 236,          500, 505148, 158, 212, 226,
 <<  236, 500, 505,          510-511
c29s1.b126.magruders(config-mst)# instance 9 vlan 522, 551-570, 603, 629, 633$ vlan 522, 551-570, 603, 629, 633,          742, 802
 << 551-570, 603, 629, 633, 742, 802,          926, 929
c29s1.b126.magruders(config-mst)# instance 10 vlan 2004-2005, 2012, 2018-2019$0 vlan 2004-2005, 2012, 2018-2019,          2032,
 <<  204-2005, 2012, 2018-2019, 2032, 204         4, 2057, 12, 2018-2019, 2032, 2044, 2057, 2         062, 2068
c29s1.b126.magruders(config-mst)# instance
 <<  10 vlan 2076, 2098-2099, 2102, 211$0 vlan 2076, 2098-2099, 2102, 2112         , 2130, 26, 2098-2099, 2102, 2112, 2130, 21         32, 2147-
 << 99, 2102, 2112, 2130, 2132, 2147-2         148, 2158
c29s1.b126.magruders(config-mst)# instance 10 vlan 2212, 2236, 2500, 2505, 25$0 vlan 2212, 2236, 2500, 2505, 251   
 <<       0-2511, 22, 2236, 2500, 2505, 2510-2511, 25         22, 2603,500, 2505, 2510-2511, 2522, 2603,          2629, 263
 <<  2510-2511, 2522, 2603, 2629, 2633         
c29s1.b126.magruders(config-mst)# instance 10 vlan 2802, 2926, 2929
c29s1.b126.magruders(config-mst)# instance 11 vlan 8, 43, 52, 146, 156-157, 1
 << $1 vlan 8, 43, 52, 146, 156-157, 18         0, 200, 243, 52, 146, 156-157, 180, 200, 21         8
c29s1.b126.magruders(config-mst)# instance 12 vlan 2008, 2043, 2052, 2146, 21
 << $2 vlan 2008, 2043, 2052, 2146, 215         6-2157, 28, 2043, 2052, 2146, 2156-2157, 21         80, 2200,052, 2146, 
 << 2156-2157, 2180, 2200,          2218
c29s1.b126.magruders(config-mst)#
c29s1.b126.magruders(config-mst)#end
c29s1.b126.magruderst#
 << 
*Jan  1 18:36:04: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1.b126.magruderst#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1.b126.magruders(config)#
Expect: matched string 1: (config)#
 >> hostname c29s1.b126.magruderst 

Expect: searching for 2 strs:  :# :>
 << hostname c29s1.b126.magruderst 
c29s1.b126.magruders(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s1.b126.magruderst#
 << 
*Jan  1 18:36:10: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1.b126.magruderst#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1.b126.magruders(config)#
Expect: matched string 1: (config)#
 >> snmp-server contact 6F-1798

Expect: searching for 1 strs:  :#
 << snmp-server contact 6F-1798
c29s1.b126.magruders(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s1.b126.magruderst#
 << 
*Jan  1 18:36:16: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1.b126.magruderst#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1.b126.magruders(config)#
Expect: matched string 1: (config)#
 >> interface vlan 92

Expect: searching for 1 strs:  :(config-if)#
 << interface vlan 92
c29s1.b126.magruders(config-if)#
Expect: matched string 1: (config-if)#
 >> ip address 10.92.2.65 255.255.0.0

 >> ip broadcast-address 10.92.255.255

 >> end

Expect: searching for 1 strs:  :Configured
 << ip address 10.92.2.65 255.255.0.0
c29s1.b126.magruders(config-if)#ip broadcast-address 10.92.255.255
c29s1.b126.magruders(config-if)#end
c29s1.b126.magruderst#
 << 
*Jan  1 18:36:22: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1.b126.magruderst#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1.b126.magruders(config)#
Expect: matched string 1: (config)#
 >> interface Vlan92

Expect: searching for 1 strs:  :(config-if)#
 << interface Vlan92
c29s1.b126.magruders(config-if)#
Expect: matched string 1: (config-if)#
 >> ip default-gateway 10.92.0.1

 >> end

Expect: searching for 1 strs:  :Configured
 << ip default-gateway 10.92.0.1
c29s1.b126.magruders(config)#end
c29s1.b126.magruderst#
 << 
*Jan  1 18:36:28: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1.b126.magruderst#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1.b126.magruders(config)#
Expect: matched string 1: (config)#
 >> ip dhcp snooping

Expect: searching for 1 strs:  :#
 << ip dhcp snooping
c29s1.b126.magruders(config)#
Expect: matched string 1: #
 >> ip dhcp snooping vlan 160

Expect: searching for 1 strs:  :#
 << ip dhcp snooping vlan 160
c29s1.b126.magruders(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s1.b126.magruderst#
 << 
*Jan  1 18:36:36: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1.b126.magruderst#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1.b126.magruders(config)#
Expect: matched string 1: (config)#
 >> default interface range gi1/0/1 - 48 

 >> interface range gi1/0/1 - 48 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi1/0/1 - 48 

 << c29s1.b126.magruders(config)#interface range gi1/0/1 - 48 
c29s1.b126.magruders(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport access vlan 160

 >> switchport mode access

 >> spanning-tree portfast

 >> switchport port-security maximum 2

 >> switchport port-security

 >> switchport port-security aging time 15

 >> switchport port-security violation protect

 >> switchport port-security aging type inactivity

 >> power inline never

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport access vlan 160
c29s1.b126.magruders(config-if-range)#switchport mode access
c29s1.b126.magruders(config-if-range)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, conce
 << ntrators, switches, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast will be configured in 48 interfaces due to the range command 
 but will only have effect when the inter
 << faces are in a non-trunking mode.
c29s1.b126.magruders(config-if-range)#switchport port-security maximum 2
c29s1.b126.magruders(config-if-range)#switchport port-security
c29s1.b126.magruders(config-if-range)#switchport port-security aging time 15
c29s
 << 1.b126.magruders(config-if-range)#switchport port-security violation prot$port-security violation prote         ct
c29s1.b126.magruders(config-if-range)#switchport port-security aging type ina
 << $port-security aging type inac         tivity
c29s1.b126.magruders(config-if-range)#power inline never
                                       ^
% Invalid input detected at '^' marker.

c29s1.b126.magruders(config-if-
 << range)#end
c29s1.b126.magruderst#
 << 
*Jan  1 18:36:47: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1.b126.magruderst#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1.b126.magruders(config)#
Expect: matched string 1: (config)#
 >> default interface gi1/0/48 

 >> interface gi1/0/48 

Expect: searching for 1 strs:  :(config-if)#
 << default interface gi1/0/48 
Interface GigabitEthernet1/0/48 set to default configuration
c29s1.b126.magruders(config)#interface gi1/0/48 
c29s1.b126.magruders(config-if)#
Expect: matched string 1: (config-if)#
 >> switchport mode trunk

 >> switchport trunk native vlan 92

 >> ip dhcp snooping trust

 >> no keepalive

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport mode trunk
c29s1.b126.magruders(config-if)#switchport trunk native vlan 92
c29s1.b126.magruders(config-if)#ip dhcp snooping trust
c29s1.b126.magruders(config-if)#no keepalive
c29s1.b126.magruders(config-if)#end
c29s1.b126.magruderst#
 << 
*Jan  1 18:36:53: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1.b126.magruderst#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1.b126.magruders(config)#
Expect: matched string 1: (config)#
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s1.b126.magruderst#
 << 
*Jan  1 18:36:57: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1.b126.magruderst#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1.b126.magruders(config)#
Expect: matched string 1: (config)#
 >> crypto key generate rsa

 >> no

 >> 2048

Expect: searching for 2 strs:  :OK :(config)#
 << crypto key generate rsa
% You already have RSA keys defined named c29s1.b126.magruderst.mgmt.msstate.edu.
% Do you really want to replace them? [yes/no]: no
c29s1.b126.magruders(config)#2048
                             ^
% Invalid input detected at 
Expect: matched string 2: (config)#
 >> end

Expect: searching for 1 strs:  :Configured
 << '^' marker.

c29s1.b126.magruders(config)#end
c29s1.b126.magruderst#
 << 
*Jan  1 18:37:01: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> write mem

Expect: searching for 2 strs:  :# :>
 << 
c29s1.b126.magruderst#write mem
Building configuration...

Expect: matched string 1: #
 >> 
Expect: searching for 2 strs:  :# :>
 << [OK]
c29s1.b126.magruderst#
c29s1.b126.magruderst#
c29s1.b126.magruderst#
Expect: matched string 1: #
 >> sh run

Expect: searching for 2 strs:  :# :>
 << sh run
Building configuration...

 << 
Current configuration : 20781 bytes
!
! Last configuration change at 18:37:01 CST Sun Jan 1 2006
!
version 15.0
no service pad
service timestamps debug datetime localtime
service timestamps log datetime localtime
service password-encryption
!

 << hostname c29s1.b126.magruderst
!
boot-start-marker
boot-end-marker
!
enable secret 5 $1$x8nq$ogweKOyYAW8swu5VViW64.
enable password 7 10795B0E5414365B012D26220369
!
username root privilege 15 secret 5 $1$rMTI$2KFODdFStkeEtQkuLgBN9.
no aaa new-mod
 << el
clock timezone CST -6 0
clock summer-time CDT recurring
switch 1 provision ws-c2960s-48ts-l
authentication mac-move permit
!
!
ip dhcp snooping vlan 160
ip dhcp snooping
ip domain-name mgmt.msstate.edu
ip name-server 130.18.80.12
!
!
crypt
 << o pki trustpoint TP-self-signed-2494998912
 enrollment selfsigned
 subject-name cn=IOS-Self-Signed-Certificate-2494998912
 revocation-check none
 rsakeypair TP-self-signed-2494998912
!
!
crypto pki certificate chain TP-self-signed-2494998912
 cert
 << ificate self-signed 01
  	quit
!
spanning-tree mode mst
spanning-tree portfast bpduguard default
spanning-tree extend system-id
!
spanning-tree mst configuration
 name msstate
 revision 1
 instance 1 vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40,
 <<  50, 60, 63, 70
 instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 160
 instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 230, 232, 242, 246
 instance 1 vlan 256, 611-612, 654, 741, 996, 999
 instance 2 vlan 2002, 2007, 2011, 2020
 << , 2022, 2024, 2031, 2035, 2037, 2039-2040
 instance 2 vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096, 2104, 2110, 2126
 instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 2189, 2194, 2202
 instance 2 vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 2
 << 654, 2999
 instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176, 196
 instance 3 vlan 244, 248, 927
 instance 4 vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072, 2108, 2113, 2128
 instance 4 vlan 2144, 2176, 2196, 2244, 2248, 2927
 instan
 << ce 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 228
 instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216, 2228
 instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116, 124
 instance 7 vlan 172, 186, 192, 204-208, 210, 240-
 << 241, 251-252, 630, 928
 instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082, 2084
 instance 8 vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208, 2210
 instance 8 vlan 2240-2241, 2251-2252, 2630, 2928
 instance 9 vlan 4-5, 12, 18
 << -19, 32, 44, 57, 62, 68, 76, 98-99, 102, 112
 instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 500, 505, 510-511
 instance 9 vlan 522, 551-570, 603, 629, 633, 742, 802, 926, 929
 instance 10 vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 2057, 2062
 << , 2068
 instance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148, 2158
 instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522, 2603, 2629, 2633
 instance 10 vlan 2802, 2926, 2929
 instance 11 vlan 8, 43, 52, 146, 156-157, 180, 200, 218

 <<  instance 12 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180, 2200, 2218
!
!
!
!
!
!
errdisable recovery cause udld
errdisable recovery cause bpduguard
errdisable recovery cause security-violation
errdisable recovery cause channel-misconfig (STP)

 << errdisable recovery cause pagp-flap
errdisable recovery cause dtp-flap
errdisable recovery cause link-flap
errdisable recovery cause sfp-config-mismatch
errdisable recovery cause gbic-invalid
errdisable recovery cause psecure-violation
errdisable re
 << covery cause port-mode-failure
errdisable recovery cause dhcp-rate-limit
errdisable recovery cause pppoe-ia-rate-limit
errdisable recovery cause mac-limit
errdisable recovery cause vmps
errdisable recovery cause storm-control
errdisable recovery cau
 << se inline-power
errdisable recovery cause arp-inspection
errdisable recovery cause loopback
errdisable recovery cause small-frame
errdisable recovery cause psp
errdisable recovery interval 1800
!
!
!
!
vlan internal allocation policy ascending

 << !
lldp run
!
! 
!
!
!
!
!
!
!
!
interface FastEthernet0
 no ip address
 shutdown
!
interface GigabitEthernet1/0/1
 switchport access vlan 160
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violati
 << on protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/2
 switchport access vlan 160
 switchport mode access
 switchport 
 << port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/3
 switchp
 << ort access vlan 160
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-
 << tree portfast
!
interface GigabitEthernet1/0/4
 switchport access vlan 160
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security ag
 << ing type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/5
 switchport access vlan 160
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport
 <<  port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/6
 switchport access vlan 160
 switchport mode access
 switchport port-security maximum 2
 << 
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/7
 switchport access vlan 160
 s
 << witchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
inter
 << face GigabitEthernet1/0/8
 switchport access vlan 160
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 s
 << witchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/9
 switchport access vlan 160
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging ti
 << me 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/10
 switchport access vlan 160
 switchport mode access
 switchport port-security maximum 2
 switchport port-sec
 << urity violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/11
 switchport access vlan 160
 switchport mode access
 << 
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1
 << /0/12
 switchport access vlan 160
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-secur
 << ity
 spanning-tree portfast
!
interface GigabitEthernet1/0/13
 switchport access vlan 160
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport 
 << port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/14
 switchport access vlan 160
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation pro
 << tect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/15
 switchport access vlan 160
 switchport mode access
 switchport port-
 << security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/16
 switchport 
 << access vlan 160
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree
 <<  portfast
!
interface GigabitEthernet1/0/17
 switchport access vlan 160
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging
 <<  type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/18
 switchport access vlan 160
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport p
 << ort-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/19
 switchport access vlan 160
 switchport mode access
 switchport port-security maximum 2
 << 
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/20
 switchport access vlan 160
 s
 << witchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
inter
 << face GigabitEthernet1/0/21
 switchport access vlan 160
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 
 << switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/22
 switchport access vlan 160
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging 
 << time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/23
 switchport access vlan 160
 switchport mode access
 switchport port-security maximum 2
 switchport port-s
 << ecurity violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/24
 switchport access vlan 160
 switchport mode acce
 << ss
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEtherne
 << t1/0/25
 switchport access vlan 160
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-sec
 << urity
 spanning-tree portfast
!
interface GigabitEthernet1/0/26
 switchport access vlan 160
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchpor
 << t port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/27
 switchport access vlan 160
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation p
 << rotect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/28
 switchport access vlan 160
 switchport mode access
 switchport por
 << t-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/29
 switchpor
 << t access vlan 160
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tr
 << ee portfast
!
interface GigabitEthernet1/0/30
 switchport access vlan 160
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security agi
 << ng type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/31
 switchport access vlan 160
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport
 <<  port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/32
 switchport access vlan 160
 switchport mode access
 switchport port-security maximum 
 << 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/33
 switchport access vlan 160

 <<  switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
int
 << erface GigabitEthernet1/0/34
 switchport access vlan 160
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 << 
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/35
 switchport access vlan 160
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security agin
 << g time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/36
 switchport access vlan 160
 switchport mode access
 switchport port-security maximum 2
 switchport port
 << -security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/37
 switchport access vlan 160
 switchport mode ac
 << cess
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEther
 << net1/0/38
 switchport access vlan 160
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-s
 << ecurity
 spanning-tree portfast
!
interface GigabitEthernet1/0/39
 switchport access vlan 160
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchp
 << ort port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/40
 switchport access vlan 160
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation
 <<  protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/41
 switchport access vlan 160
 switchport mode access
 switchport p
 << ort-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/42
 switchp
 << ort access vlan 160
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-
 << tree portfast
!
interface GigabitEthernet1/0/43
 switchport access vlan 160
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security a
 << ging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/44
 switchport access vlan 160
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchpo
 << rt port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/45
 switchport access vlan 160
 switchport mode access
 switchport port-security maximu
 << m 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/46
 switchport access vlan 160
 << 
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast
!
i
 << nterface GigabitEthernet1/0/47
 switchport access vlan 160
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivit
 << y
 switchport port-security
 spanning-tree portfast
!
interface GigabitEthernet1/0/48
 switchport trunk native vlan 92
 switchport mode trunk
 no keepalive
 ip dhcp snooping trust
!
interface GigabitEthernet1/0/49
 switchport trunk native vlan 
 << 92
 switchport mode trunk
 ip dhcp snooping trust
!
interface GigabitEthernet1/0/50
 switchport trunk native vlan 92
 switchport mode trunk
 ip dhcp snooping trust
!
interface GigabitEthernet1/0/51
 switchport trunk native vlan 92
 switchport m
 << ode trunk
 ip dhcp snooping trust
!
interface GigabitEthernet1/0/52
 switchport trunk native vlan 92
 switchport mode trunk
 ip dhcp snooping trust
!
interface Vlan1
 no ip address
 no ip route-cache
 shutdown
!
interface Vlan92
 ip address 
 << 10.92.2.65 255.255.0.0
 ip broadcast-address 10.92.255.255
!
ip default-gateway 10.92.0.1
no ip http server
no ip http secure-server
!
logging facility local1
logging host 130.18.8.12
access-list 1 permit 10.92.0.0 0.0.255.255
access-list 1 perm
 << it 130.18.8.0 0.0.0.255
access-list 1 permit 10.93.0.0 0.0.255.255
access-list 1 permit 130.18.1.0 0.0.0.255
!
snmp-server community sysnet RO 1
snmp-server community c2-b2=a2 RW 1
snmp-server contact 6F-1798
snmp-server enable traps snmp authentic
 << ation linkdown linkup coldstart warmstart
snmp-server enable traps transceiver all
snmp-server enable traps tty
snmp-server enable traps cluster
snmp-server enable traps config-copy
snmp-server enable traps config
snmp-server enable traps config-cti
 << d
snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-auth-fail-vlan no-guest-vlan
snmp-server enable traps entity
snmp-server enable traps power-ethernet police
snmp-server enable traps cpu threshold
snmp-server enable traps rep
snmp-server
 <<  enable traps bridge newroot topologychange
snmp-server enable traps stpx inconsistency root-inconsistency loop-inconsistency
snmp-server enable traps vtp
snmp-server enable traps vlancreate
snmp-server enable traps vlandelete
snmp-server enable trap
 << s flash insertion removal
snmp-server enable traps port-security
snmp-server enable traps envmon fan shutdown supply temperature status
snmp-server enable traps errdisable
snmp-server enable traps mac-notification change move threshold
snmp-server en
 << able traps vlan-membership
snmp-server host 130.18.8.12 sysnet 
!
!
line con 0
line vty 0 4
 access-class 1 in
 password 7 0231564C5A052B71416705102256
 login local
 transport input ssh
line vty 5 15
 access-class 1 in
 password 7 0231564C5A05
 << 2B71416705102256
 login local
 transport input ssh
!
ntp server 10.92.0.5
end

c29s1.b126.magruderst#
Expect: matched string 1: #
 >> show interface status

Expect: searching for 2 strs:  :# :>
 << show interface status

Port      Name               Status       Vlan       Duplex  Speed Type
Gi1/0/1                      notconnect   160          auto   auto 10/100/1000BaseTX
Gi1/0/2                      notconnect   160          auto   auto 10/1
 << 00/1000BaseTX
Gi1/0/3                      notconnect   160          auto   auto 10/100/1000BaseTX
Gi1/0/4                      notconnect   160          auto   auto 10/100/1000BaseTX
Gi1/0/5                      notconnect   160          auto   auto 1
 << 0/100/1000BaseTX
Gi1/0/6                      notconnect   160          auto   auto 10/100/1000BaseTX
Gi1/0/7                      notconnect   160          auto   auto 10/100/1000BaseTX
Gi1/0/8                      notconnect   160          auto   aut
 << o 10/100/1000BaseTX
Gi1/0/9                      notconnect   160          auto   auto 10/100/1000BaseTX
Gi1/0/10                     notconnect   160          auto   auto 10/100/1000BaseTX
Gi1/0/11                     notconnect   160          auto   
 << auto 10/100/1000BaseTX
Gi1/0/12                     notconnect   160          auto   auto 10/100/1000BaseTX
Gi1/0/13                     notconnect   160          auto   auto 10/100/1000BaseTX
Gi1/0/14                     notconnect   160          auto
 <<    auto 10/100/1000BaseTX
Gi1/0/15                     notconnect   160          auto   auto 10/100/1000BaseTX
Gi1/0/16                     notconnect   160          auto   auto 10/100/1000BaseTX
Gi1/0/17                     notconnect   160          a
 << uto   auto 10/100/1000BaseTX
Gi1/0/18                     notconnect   160          auto   auto 10/100/1000BaseTX
Gi1/0/19                     notconnect   160          auto   auto 10/100/1000BaseTX
Gi1/0/20                     notconnect   160        
 <<   auto   auto 10/100/1000BaseTX
Gi1/0/21                     notconnect   160          auto   auto 10/100/1000BaseTX
Gi1/0/22                     notconnect   160          auto   auto 10/100/1000BaseTX
Gi1/0/23                     notconnect   160     
 <<      auto   auto 10/100/1000BaseTX
Gi1/0/24                     notconnect   160          auto   auto 10/100/1000BaseTX
Gi1/0/25                     notconnect   160          auto   auto 10/100/1000BaseTX
Gi1/0/26                     notconnect   160  
 <<         auto   auto 10/100/1000BaseTX
Gi1/0/27                     notconnect   160          auto   auto 10/100/1000BaseTX
Gi1/0/28                     notconnect   160          auto   auto 10/100/1000BaseTX
Gi1/0/29                     notconnect   16
 << 0          auto   auto 10/100/1000BaseTX
Gi1/0/30                     notconnect   160          auto   auto 10/100/1000BaseTX
Gi1/0/31                     notconnect   160          auto   auto 10/100/1000BaseTX
Gi1/0/32                     notconnect  
 <<  160          auto   auto 10/100/1000BaseTX
Gi1/0/33                     notconnect   160          auto   auto 10/100/1000BaseTX
Gi1/0/34                     notconnect   160          auto   auto 10/100/1000BaseTX
Gi1/0/35                     notconnec
 << t   160          auto   auto 10/100/1000BaseTX
Gi1/0/36                     notconnect   160          auto   auto 10/100/1000BaseTX
Gi1/0/37                     notconnect   160          auto   auto 10/100/1000BaseTX
Gi1/0/38                     notcon
 << nect   160          auto   auto 10/100/1000BaseTX
Gi1/0/39                     notconnect   160          auto   auto 10/100/1000BaseTX
Gi1/0/40                     notconnect   160          auto   auto 10/100/1000BaseTX
Gi1/0/41                     not
 << connect   160          auto   auto 10/100/1000BaseTX
Gi1/0/42                     notconnect   160          auto   auto 10/100/1000BaseTX
Gi1/0/43                     notconnect   160          auto   auto 10/100/1000BaseTX
Gi1/0/44                     
 << notconnect   160          auto   auto 10/100/1000BaseTX
Gi1/0/45                     notconnect   160          auto   auto 10/100/1000BaseTX
Gi1/0/46                     notconnect   160          auto   auto 10/100/1000BaseTX
Gi1/0/47                  
 <<    notconnect   160          auto   auto 10/100/1000BaseTX
Gi1/0/48                     notconnect   1            auto   auto 10/100/1000BaseTX
Gi1/0/49                     notconnect   1            auto   auto Not Present
Gi1/0/50                     
 << notconnect   1            auto   auto Not Present
Gi1/0/51                     notconnect   1            auto   auto Not Present
Gi1/0/52                     notconnect   1            auto   auto Not Present
Fa0                          disabled     ro
 << uted       auto   auto 10/100BaseTX
c29s1.b126.magruderst#
Expect: matched string 1: #
