trying to use serial port: /dev/ttyUSB0
 >> 
 >> 

Expect: searching for 4 strs:  :[yes/no] :Press RETURN to get started. :# :Switch>
 << 
test>
test>
test>
test>
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

test>
test>
test>
test>
...

 >> 

Expect: searching for 2 strs:  :# :>
 << 
test>
test>
Expect: matched string 2: >
 >> term len 0

Expect: searching for 2 strs:  :# :>
 << term len 0
test>
Expect: matched string 2: >
 >> show version

Expect: searching for 2 strs:  :# :>
 << show version
Cisco IOS Software, IE4000  Software (IE4000-UNIVERSALK9-M), Version 15.2(4)EA5, RELEASE SOFTWARE (fc1)
Technical Support: http://www.cisco.com/techsupport
Copyright (c) 1986-2016 by Cisco Systems, Inc.
Compiled Tue 20-Dec-16 13:20 by pro
 << d_rel_team

ROM: Bootstrap program is IE4000 boot loader
BOOTLDR: IE4000  Boot Loader (IE4000-HBOOT-M) Version 15.2(2r)EA, RELEASE SOFTWARE (fc1)

test uptime is 7 minutes
System returned to ROM by power-on
System restarted at 20:27:06 CDT Tue Mar 
 << 29 2011
System image file is "sdflash:/ie4000-universalk9-mz.152-4.EA5/ie4000-universalk9-mz.152-4.EA5.bin"
Last reload reason: power-on



This product contains cryptographic features and is subject to United
States and local country laws governin
 << g import, export, transfer and
use. Delivery of Cisco cryptographic products does not imply
third-party authority to import, export, distribute or use encryption.
Importers, exporters, distributors and users are responsible for
compliance with U.S. an
 << d local country laws. By using this product you
agree to comply with applicable laws and regulations. If you are unable
to comply with U.S. and local laws, return this product immediately.

A summary of U.S. laws governing Cisco cryptographic products
 <<  may be found at:
http://www.cisco.com/wwl/export/crypto/tool/stqrg.html

If you require further assistance please contact us by sending email to
export@cisco.com.

License Level: lanbase
License Type: Permanent Right-To-Use
Next reload license Le
 << vel: lanbase

cisco IE-4000-4GS8GP4G-E (APM86XXX) processor (revision N0) with 1048576K bytes of memory.
Processor board ID FDO2208U07D
Last reset from power-on
2 Virtual Ethernet interfaces
16 Gigabit Ethernet interfaces
The password-recovery mech
 << anism is enabled.

512K bytes of flash-simulated non-volatile configuration memory.
Base ethernet MAC Address       : 68:2C:7B:AE:E0:80
Motherboard assembly number     : 73-101573-03
Motherboard serial number       : FDO22062FWC
Model revision numbe
 << r           : N0
Motherboard revision number     : B0
Model number                    : IE-4000-4GS8GP4G-E
System serial number            : FDO2208U07D
Top Assembly Part Number        : 68-6019-01
Top Assembly Revision Number    : E0
Version ID    
 <<                   : V02
Hardware Board Revision Number  : 0x05
Backplane FPGA version          : 0.2F
CIP Serial Number               : 0x49AEE080
SKU Brand Name                  : Cisco


Switch Ports Model                     SW Version          
 <<   SW Image                 
------ ----- -----                     ----------            ----------               
*    1 16    IE-4000-4GS8GP4G-E        15.2(4)EA5            IE4000-UNIVERSALK9-M     


Configuration register is 0xF

test>
Expect: matched string 2: >
 >> enable

Expect: searching for 2 strs:  :Password: :#
 << enable
Password: 
Expect: matched string 1: Password:
 >> W2w1cD0mIliG!

Expect: searching for 1 strs:  :#
 << 
test#
Expect: matched string 1: #
 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
test(config)#
Expect: matched string 1: (config)#
 >> no service pad

 >> service timestamps debug datetime localtime

 >> service timestamps log datetime localtime

 >> service password-encryption

 >> boot-start-marker

 >> boot-end-marker

 >> enable secret W2w1cD0mIliG!

 >> enable password W2w1cD0mIliG!

 >> username root privilege 15 secret W2w1cD0mIliG!

 >> no aaa new-model

 >> clock timezone CST -6 0

 >> clock summer-time CDT recurring

 >> authentication mac-move permit

 >> ip domain-name mgmt.msstate.edu

 >> ip name-server 130.18.80.12

 >> vtp domain vtp01.mgmt.msstate.edu

 >> vtp mode client

 >> crypto pki trustpoint TP-self-signed-2494998912

 >>  enrollment selfsigned

 >>  subject-name cn=IOS-Self-Signed-Certificate-2494998912

 >>  revocation-check none

 >>  rsakeypair TP-self-signed-2494998912

 >> crypto pki certificate chain TP-self-signed-2494998912

 >>  certificate self-signed 01 nvram:IOS-Self-Sig#3232.cer

 >> spanning-tree portfast bpduguard default

 >> spanning-tree extend system-id

 >> vlan internal allocation policy ascending

 >> lldp run

 >> errdisable recovery cause all

 >> errdisable recovery interval 1800

 >> interface FastEthernet0

 >>  no ip address

 >>  shutdown

 >> interface Vlan1

 >>  no ip address

 >>  no ip route-cache

 >>  shutdown

 >> interface Vlan92

 >> no ip http server

 >> no ip http secure-server

 >> logging facility local1

 >> logging host 130.18.8.12

 >> access-list 1 permit 10.92.0.0 0.0.255.255

 >> access-list 1 permit 130.18.8.0 0.0.0.255

 >> access-list 1 permit 10.93.0.0 0.0.255.255

 >> access-list 1 permit 130.18.1.0 0.0.0.255

 >> snmp-server community sysnet RO 1

 >> snmp-server community c2-b2=a2 RW 1

 >> snmp-server enable traps snmp authentication linkdown linkup coldstart warmstart

 >> snmp-server enable traps transceiver all

 >> snmp-server enable traps tty

 >> snmp-server enable traps cluster

 >> snmp-server enable traps config-copy

 >> snmp-server enable traps config

 >> snmp-server enable traps config-ctid

 >> snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-auth-fail-vlan no-guest-vlan

 >> snmp-server enable traps entity

 >> snmp-server enable traps power-ethernet police

 >> snmp-server enable traps cpu threshold

 >> snmp-server enable traps rep

 >> snmp-server enable traps bridge newroot topologychange

 >> snmp-server enable traps stpx inconsistency root-inconsistency loop-inconsistency

 >> snmp-server enable traps syslog

 >> snmp-server enable traps vtp

 >> snmp-server enable traps vlancreate

 >> snmp-server enable traps vlandelete

 >> snmp-server enable traps flash insertion removal

 >> snmp-server enable traps port-security

 >> snmp-server enable traps envmon fan shutdown supply temperature status

 >> snmp-server enable traps errdisable

 >> snmp-server enable traps mac-notification change move threshold

 >> snmp-server enable traps vlan-membership

 >> snmp-server host 130.18.8.12 sysnet 

 >> line con 0

 >> line vty 0 15

 >>  access-class 1 in

 >>  password W2w1cD0mIliG!

 >>  login local

 >>  transport input ssh

 >> ntp server 10.92.0.5

 >> 

 >> end

Expect: searching for 1 strs:  :Configured
 << no service pad
test(config)#service timestamps debug datetime localtime
test(config)#service timestamps log datetime localtime
test(config)#service password-encryption
test(config)#boot-start-marker
test(config)#boot-end-marker
test(config)#enable s
 << ecret W2w1cD0mIliG!
The enable secret you have chosen is the same as your enable password.
This is not recommended.  Re-enter the enable secret.

test(config)#enable password W2w1cD0mIliG!
The enable password you have chosen is the same as your enabl
 << e secret.
This is not recommended.  Re-enter the enable password.

test(config)#username root privilege 15 secret W2w1cD0mIliG!
test(config)#no aaa new-model
test(config)#clock timezone CST -6 0
test(config)#clock summer-time CDT recurring
test(con
 << fig)#authentication mac-move permit
test(config)#ip domain-name mgmt.msstate.edu
test(config)#ip name-server 130.18.80.12
test(config)#vtp domain vtp01.mgmt.msstate.edu
Domain name already set to vtp01.mgmt.msstate.edu.
test(config)#vtp mode client

 << Device mode already VTP Client for VLANS.
test(config)#crypto pki trustpoint TP-self-signed-2494998912
test(ca-trustpoint)# enrollment selfsigned
test(ca-trustpoint)# subject-name cn=IOS-Self-Signed-Certificate-2494998912
test(ca-trustpoint)# revocati
 << on-check none
test(ca-trustpoint)# rsakeypair TP-self-signed-2494998912
test(ca-trustpoint)#crypto pki certificate chain TP-self-signed-2494998912
test(config-cert-chain)# certificate self-signed 01 nvram:IOS-Self-Sig#3232.c
 << $e self-signed 01 nvram:IOS-Self-Sig#3232.ce         r
test(config-cert-chain)#spanning-tree portfast bpduguard default
test(config)#spanning-tree extend system-id
test(config)#vlan internal allocation policy ascending
 << 
test(config)#lldp run
test(config)#errdisable recovery cause all
test(config)#errdisable recovery interval 1800
test(config)#
Mar 29 20:39:22: % Multiple self signed certificates in config
    certificate for trust point TP-self-signed-2494998912 i
 << gnored
interface FastEthernet0
                        ^
% Invalid input detected at '^' marker.

test(config)# no ip address
% Incomplete command.

test(config)# shutdown
% Incomplete command.

test(config)#interface Vlan1
test(config-if)# no
 <<  ip address
test(config-if)# no ip route-cache
test(config-if)# shutdown
test(config-if)#interface Vlan92
test(config-if)#no ip http server
test(config)#no ip http secure-server
test(config)#logging facility local1
test(config)#logging host 130.18.
 << 8.12
test(config)#access-list 1 permit 10.92.0.0 0.0.255.255
test(config)#access-list 1 permit 130.18.8.0 0.0.0.255
test(config)#access-list 1 permit 10.93.0.0 0.0.255.255
test(config)#access-list 1 permit 130.18.1.0 0.0.0.255
test(config)#snmp-serve
 << r community sysnet RO 1
test(config)#snmp-server community c2-b2=a2 RW 1
test(config)#snmp-server enable traps snmp authentication linkdown linkup col$ enable traps snmp authentication link
 << down linkup cold         start waraps snmp authentication linkdown linkup coldstart warm         start
test(config)#snmp-server enable traps transceiver all
test(config)#sn
 << mp-server enable traps tty
test(config)#snmp-server enable traps cluster
test(config)#snmp-server enable traps config-copy
test(config)#snmp-server enable traps config
test(config)#snmp-server enable traps config-ctid
test(config)#snmp-server enable 
 << traps dot1x auth-fail-vlan guest-vlan no-auth$ enable traps dot1x auth-fail-vlan guest-vlan no-auth-         fail-vlana
 << ps dot1x auth-fail-vlan guest-vlan no-auth-fail-vlan          no-guest-uth-fail-vlan guest-vlan no-auth-fail-vlan no-guest-v         lan
snmp-server enable traps dot1x auth-f
 << ail-vlan guest-vlan no-auth-fail-vlan no-gu                         ^est-vlan

% Invalid input detected at '^' marker.

test(config)#snmp-server enable traps entity
test(config)#snmp-server enable traps power-ethernet police
test(config)#snmp-server
 <<  enable traps cpu threshold
test(config)#snmp-server enable traps rep
test(config)#snmp-server enable traps bridge newroot topologychange
test(config)#snmp-server enable traps stpx inconsistency root-inconsistency l
 << $ enable traps stpx inconsistency root-inconsistency lo         op-inconsaps stpx inconsistency root-inconsistency loop-inconsi         stency
tes
 << t(config)#snmp-server enable traps syslog
test(config)#snmp-server enable traps vtp
test(config)#snmp-server enable traps vlancreate
test(config)#snmp-server enable traps vlandelete
test(config)#snmp-server enable traps flash insertion removal
test(c
 << onfig)#snmp-server enable traps port-security
test(config)#snmp-server enable traps envmon fan shutdown supply temperature $ enable traps envmon fan shutdown supply temperature s         
 << tatus
test(config)#snmp-server enable traps errdisable
test(config)#snmp-server enable traps mac-notification change move threshold
test(config)#snmp-server enable traps vlan-membership
test(config)#snmp-server host 130.18.8.12 sysnet 
test(con
 << fig)#line con 0
test(config-line)#line vty 0 15
test(config-line)# access-class 1 in
test(config-line)# password W2w1cD0mIliG!
test(config-line)# login local
test(config-line)# transport input ssh
test(config-line)#ntp server 10.92.0.5
test(config)
 << #
test(config)#end
test#
Mar 29 20:39:35: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
test#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
test(config)#
Expect: matched string 1: (config)#
 >> spanning-tree mode mst

 >> spanning-tree etherchannel guard misconfig

 >> spanning-tree mst configuration

 >>  name msstate

 >>  revision 1

 >>  instance 1 vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 63, 70

 >>  instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 160

 >>  instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 230, 232, 242, 246

 >>  instance 1 vlan 256, 611-612, 654, 741, 996, 999

 >>  instance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037, 2039-2040

 >>  instance 2 vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096, 2104, 2110, 2126

 >>  instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 2189, 2194, 2202

 >>  instance 2 vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 2654, 2999

 >>  instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176, 196

 >>  instance 3 vlan 244, 248, 927

 >>  instance 4 vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072, 2108, 2113, 2128

 >>  instance 4 vlan 2144, 2176, 2196, 2244, 2248, 2927

 >>  instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 228

 >>  instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216, 2228

 >>  instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116, 124

 >>  instance 7 vlan 172, 186, 192, 204-208, 210, 240-241, 251-252, 630, 928

 >>  instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082, 2084

 >>  instance 8 vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208, 2210

 >>  instance 8 vlan 2240-2241, 2251-2252, 2630, 2928

 >>  instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102, 112

 >>  instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 500, 505, 510-511

 >>  instance 9 vlan 522, 551-570, 603, 629, 633, 742, 802, 926, 929

 >>  instance 10 vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 2057, 2062, 2068

 >>  instance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148, 2158

 >>  instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522, 2603, 2629, 2633

 >>  instance 10 vlan 2802, 2926, 2929

 >>  instance 11 vlan 8, 43, 52, 146, 156-157, 180, 200, 218

 >>  instance 12 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180, 2200, 2218

 >> 

 >> end

Expect: searching for 1 strs:  :Configured
 << spanning-tree mode mst
test(config)#spanning-tree etherchannel guard misconfig
test(config)#spanning-tree mst configuration
test(config-mst)# name msstate
test(config-mst)# revision 1
test(config-mst)# instance 1 vlan 2, 7, 11, 20, 22, 24, 31, 35, 37
 << , 39-40, 50$ vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40, 50,          60, 63, , 11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 63
 << , 7         0
test(config-mst)# instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 140$ vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 140,          152, 160
test(config-ms
 << t)# instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 230,$ vlan 162-163, 168, 189, 194, 202, 220, 222, 230,          232, 242,
 << 163, 168, 189, 194, 202, 220, 222, 230, 232, 242,          246
test(config-mst)# instance 1 vlan 256, 611-612, 654, 741, 996, 999
test(config-mst)# instance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031, 2
 << $ vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031, 20         35, 2037,, 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037,          2039-2040
test(config
 << -mst)# instance 2 vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096, 2$ vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096, 21         04, 2110,
 << , 2060, 2063, 2070, 2080, 2086, 2096, 2104, 2110,          2126
test(config-mst)# instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 21$ vlan 2136, 2140, 2152, 2160, 2162-
 << 2163, 2168, 218         9, 2194, , 2140, 2152, 2160, 2162-2163, 2168, 2189, 2194, 2         202
test(config-mst)# instance 2 vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 26
 << $ vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 265         4, 2999
test(config-mst)# instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128, 
 << $ vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128, 1         44, 176, 51, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176, 1         96
test(config-mst)# instance 3 v
 << lan 244, 248, 927
test(config-mst)# instance 4 vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072, 2$ vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072, 21         08, 2113,
 << , 2051, 2059, 2064, 2066, 2069, 2072, 2108, 2113,          2128
test(config-mst)# instance 4 vlan 2144, 2176, 2196, 2244, 2248, 2927
test(config-mst)# instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216,
 <<  228
test(config-mst)# instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-21$ vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-213         4, 2216, 
 << , 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216, 2         228
test(config-mst)# instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97, 1$ vlan 9, 33-34, 38,
 <<  54, 56, 71, 75, 82, 84, 97, 11         4, 116, 13-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116, 12         4
test(config-mst)# instance 7 vlan 172, 186, 192, 204-208, 210, 240-
 << 241, 251-2$ vlan 172, 186, 192, 204-208, 210, 240-241, 251-25         2, 630, 9186, 192, 204-208, 210, 240-241, 251-252, 630, 92
 <<          8
test(config-mst)# instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, 20$ vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, 207         5, 2082, 
 << , 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082, 2         084
test(config-mst)# instance 8 vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192, 2$ vla
 << n 2097, 2114, 2116, 2124, 2172, 2186, 2192, 22         04-2208, , 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208, 2         210
test(config-mst)# instance 8 vlan 2240-2241, 2251-
 << 2252, 2630, 2928
test(config-mst)# instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 98-$ vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 98-9         9, 102, 1
 << 12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102, 11         2
test(config-mst)# instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 500,$ vlan 130, 
 << 132, 147-148, 158, 212, 226, 236, 500,          505, 510-132, 147-148, 158, 212, 226, 236, 500, 505, 510-5         11
test(config-mst)# instance 9 vlan 522, 551-570, 603, 629, 63
 << 3, 742, 802, 926,$ vlan 522, 551-570, 603, 629, 633, 742, 802, 926,          929
test(config-mst)# instance 10 vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 20
 << $0 vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 205         7, 2062, 4-2005, 2012, 2018-2019, 2032, 2044, 2057, 2062, 2         068
test(config-
 << mst)# instance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132, 2$0 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132, 21         47-2148, 
 << 6, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148, 2         158
test(config-mst)# instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522, 2$0 vlan 2212, 2236, 2500, 2505, 2510-2
 << 511, 2522, 26         03, 2629,2, 2236, 2500, 2505, 2510-2511, 2522, 2603, 2629,          2633
test(config-mst)# instance 10 vlan 2802, 2926, 2929
test(config-mst)# instance 11
 <<  vlan 8, 43, 52, 146, 156-157, 180, 200, 218
test(config-mst)# instance 12 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180, 2$2 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180, 22         00,
 <<  2218
test(config-mst)#
test(config-mst)#end
test#
 << 
Mar 29 20:39:50: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
test#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
test(config)#
Expect: matched string 1: (config)#
 >> hostname c4000s1.gate.creelman 

Expect: searching for 2 strs:  :# :>
 << hostname c4000s1.gate.creelman 
c4000s1.gate.creelma(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c4000s1.gate.creelman#
 << 
Mar 29 20:39:55: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c4000s1.gate.creelman#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c4000s1.gate.creelma(config)#
Expect: matched string 1: (config)#
 >> snmp-server contact 6F-2285

Expect: searching for 1 strs:  :#
 << snmp-server contact 6F-2285
c4000s1.gate.creelma(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c4000s1.gate.creelman#
 << 
Mar 29 20:40:01: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c4000s1.gate.creelman#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c4000s1.gate.creelma(config)#
Expect: matched string 1: (config)#
 >> interface vlan 92

Expect: searching for 1 strs:  :(config-if)#
 << interface vlan 92
c4000s1.gate.creelma(config-if)#
Expect: matched string 1: (config-if)#
 >> ip address 10.92.6.26 255.255.0.0

 >> ip broadcast-address 10.92.255.255

 >> end

Expect: searching for 1 strs:  :Configured
 << ip address 10.92.6.26 255.255.0.0
c4000s1.gate.creelma(config-if)#ip broadcast-address 10.92.255.255
c4000s1.gate.creelma(config-if)#end
c4000s1.gate.creelman#
 << 
Mar 29 20:40:08: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c4000s1.gate.creelman#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c4000s1.gate.creelma(config)#
Expect: matched string 1: (config)#
 >> interface Vlan92

Expect: searching for 1 strs:  :(config-if)#
 << interface Vlan92
c4000s1.gate.creelma(config-if)#
Expect: matched string 1: (config-if)#
 >> ip default-gateway 10.92.0.1

 >> end

Expect: searching for 1 strs:  :Configured
 << ip default-gateway 10.92.0.1
c4000s1.gate.creelma(config)#end
c4000s1.gate.creelman#
Mar 29 20:40:14: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c4000s1.gate.creelman#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c4000s1.gate.creelma(config)#
Expect: matched string 1: (config)#
 >> ip dhcp snooping

Expect: searching for 1 strs:  :#
 << ip dhcp snooping
c4000s1.gate.creelma(config)#
Expect: matched string 1: #
 >> ip dhcp snooping vlan 818

Expect: searching for 1 strs:  :#
 << ip dhcp snooping vlan 818
c4000s1.gate.creelma(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c4000s1.gate.creelman#
Mar 29 20:40:21: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c4000s1.gate.creelman#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c4000s1.gate.creelma(config)#
Expect: matched string 1: (config)#
 >> default interface range gi1/1 - 16 

 >> interface range gi1/1 - 16 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi1/1 - 16 
c4000s1.gate.creelma(config)#interface range gi1/1 - 16 
c4000s1.gate.creelma(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport access vlan 818

 >> switchport mode access

 >> spanning-tree portfast

 >> power inline never

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport access vlan 818
c4000s1.gate.creelma(config-if-range)#switchport mode access
c4000s1.gate.creelma(config-if-range)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, conce
 << ntrators, switches, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast will be configured in 16 interfaces due to the range command 
 but will only have effect when the inter
 << faces are in a non-trunking mode.
c4000s1.gate.creelma(config-if-range)#power inline never
                                        ^
% Invalid input detected at '^' marker.

c4000s1.gate.creelma(config-if-range)#end
c4000s1.gate.creelman#
 << 
Mar 29 20:40:28: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c4000s1.gate.creelman#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c4000s1.gate.creelma(config)#
Expect: matched string 1: (config)#
 >> default interface gi1/9 

 >> interface gi1/9 

Expect: searching for 1 strs:  :(config-if)#
 << default interface gi1/9 
Interface GigabitEthernet1/9 set to default configuration
c4000s1.gate.creelma(config)#interface gi1/9 
c4000s1.gate.creelma(config-if)#
Expect: matched string 1: (config-if)#
 >> switchport access vlan 603

 >> switchport mode access

 >> spanning-tree portfast

 >> power inline consumption 15400

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport access vlan 603
c4000s1.gate.creelma(config-if)#switchport mode access
c4000s1.gate.creelma(config-if)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, concentrators, sw
 << itches, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast has been configured on GigabitEthernet1/9 but will only
 have effect when the interface is in a non-trunking mode.
 << 
c4000s1.gate.creelma(config-if)#power inline consumption 15400
%CAUTION: Interface Gi1/9: Misconfiguring the 'power inline
 consumption/allocation' command may cause damage to the switch and void
 your warranty. Take precaution not to oversubscribe th
 << e power supply.
 It is recommended to enable power policing if the switch supports it.
 Refer to documentation.

c4000s1.gate.creelma(config-if)#end
c4000s1.gate.creelman#
 << 
Mar 29 20:40:35: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c4000s1.gate.creelman#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c4000s1.gate.creelma(config)#
Expect: matched string 1: (config)#
 >> default interface range gi1/10 - 16 

 >> interface range gi1/10 - 16 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi1/10 - 16 
c4000s1.gate.creelma(config)#interface range gi1/10 - 16 
c4000s1.gate.creelma(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport access vlan 818

 >> switchport mode access

 >> spanning-tree portfast

 >> power inline consumption 15400

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport access vlan 818
c4000s1.gate.creelma(config-if-range)#switchport mode access
c4000s1.gate.creelma(config-if-range)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, conce
 << ntrators, switches, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast will be configured in 7 interfaces due to the range command 
 but will only have effect when the interf
 << aces are in a non-trunking mode.
c4000s1.gate.creelma(config-if-range)#power inline consumption 15400
%CAUTION: Interface Gi1/10: Misconfiguring the 'power inline
 consumption/allocation' command may cause damage to the switch and void
 your warranty.
 <<  Take precaution not to oversubscribe the power supply.
 It is recommended to enable power policing if the switch supports it.
 Refer to documentation.

%CAUTION: Interface Gi1/11: Misconfiguring the 'power inline
 consumption/allocation' command may
 <<  cause damage to the switch and void
 your warranty. Take precaution not to oversubscribe the power supply.
 It is recommended to enable power policing if the switch supports it.
 Refer to documentation.

%CAUTION: Interface Gi1/12: Misconfiguring th
 << e 'power inline
 consumption/allocation' command may cause damage to the switch and void
 your warranty. Take precaution not to oversubscribe the power supply.
 It is recommended to enable power policing if the switch supports it.
 Refer to documentat
 << ion.

%CAUTION: Interface Gi1/13: Misconfiguring the 'power inline
 consumption/allocation' command may cause damage to the switch and void
 your warranty. Take precaution not to oversubscribe the power supply.
 It is recommended to enable power poli
 << cing if the switch supports it.
 Refer to documentation.

%CAUTION: Interface Gi1/14: Misconfiguring the 'power inline
 consumption/allocation' command may cause damage to the switch and void
 your warranty. Take precaution not to oversubscribe the p
 << ower supply.
 It is recommended to enable power policing if the switch supports it.
 Refer to documentation.

%CAUTION: Interface Gi1/15: Misconfiguring the 'power inline
 consumption/allocation' command may cause damage to the switch and void
 your
 <<  warranty. Take precaution not to oversubscribe the power supply.
 It is recommended to enable power policing if the switch supports it.
 Refer to documentation.

%CAUTION: Interface Gi1/16: Misconfiguring the 'power inline
 consumption/allocation' c
 << ommand may cause damage to the switch and void
 your warranty. Take precaution not to oversubscribe the power supply.
 It is recommended to enable power policing if the switch supports it.
 Refer to documentation.

c4000s1.gate.creelma(config-if-rang
 << e)#end
c4000s1.gate.creelman#
 << 
Mar 29 20:40:44: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c4000s1.gate.creelman#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c4000s1.gate.creelma(config)#
Expect: matched string 1: (config)#
 >> default interface range gi1/1 - 4 

 >> interface range gi1/1 - 4 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi1/1 - 4 
c4000s1.gate.creelma(config)#interface range gi1/1 - 4 
c4000s1.gate.creelma(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport mode trunk

 >> switchport trunk native vlan 92

 >> ip dhcp snooping trust

 >> no keepalive

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport mode trunk
c4000s1.gate.creelma(config-if-range)#switchport trunk native vlan 92
c4000s1.gate.creelma(config-if-range)#ip dhcp snooping trust
c4000s1.gate.creelma(config-if-range)#no keepalive
c4000s1.gate.creelma(config-if-range)#end
c400
 << 0s1.gate.creelman#
 << 
Mar 29 20:40:51: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c4000s1.gate.creelman#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c4000s1.gate.creelma(config)#
Expect: matched string 1: (config)#
 >> crypto key generate rsa

 >> no

 >> 2048

Expect: searching for 2 strs:  :OK :(config)#
 << crypto key generate rsa
% You already have RSA keys defined named c4000s1.gate.creelman.mgmt.msstate.edu.
% Do you really want to replace them? [yes/no]: no
c4000s1.gate.creelma(config)#2048
                             ^
% Invalid input detected at 
Expect: matched string 2: (config)#
 >> end

Expect: searching for 1 strs:  :Configured
 << '^' marker.

c4000s1.gate.creelma(config)#end
c4000s1.gate.creelman#
 << 
Mar 29 20:40:55: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> write mem

Expect: searching for 2 strs:  :# :>
 << 
c4000s1.gate.creelman#write mem
Building configuration...

Expect: matched string 1: #
 >> 
Expect: searching for 2 strs:  :# :>
 << [OK]
c4000s1.gate.creelman#
c4000s1.gate.creelman#
c4000s1.gate.creelman#
Expect: matched string 1: #
 >> sh run

Expect: searching for 2 strs:  :# :>
 << sh run
Building configuration...

Current configuration : 8113 bytes
!
! Last configuration change at 20:40:55 CDT Tue Mar 29 2011
! NVRAM config last updated at 20:40:58 CDT Tue Mar 29 2011
!
version 15.2
no service pad
service timestamps debug
 <<  datetime localtime
service timestamps log datetime localtime
service password-encryption
!
hostname c4000s1.gate.creelman
!
boot-start-marker
boot-end-marker
!
!
enable secret 5 $1$GwhO$RS6hWNyXjmcIfbIyGXfb1/
enable password 7 122E570043082854
 << 270228211474
!
username root privilege 15 secret 5 $1$y3ah$uNC3eaGXQkTv2.P4hVl6S/
no aaa new-model
clock timezone CST -6 0
clock summer-time CDT recurring
system mtu routing 1500
!
!
!
ip dhcp snooping vlan 123,818
ip dhcp snooping
ip domain-n
 << ame mgmt.msstate.edu
ip name-server 130.18.80.12
!
!
!
!
!
ptp mode e2etransparent 
authentication mac-move permit
!
!
crypto pki trustpoint TP-self-signed-2494998912
 enrollment selfsigned
 subject-name cn=IOS-Self-Signed-Certificate-2494998
 << 912
 revocation-check none
 rsakeypair TP-self-signed-2494998912
!
!
crypto pki certificate chain TP-self-signed-2494998912
 certificate self-signed 01
  	quit
!
spanning-tree mode mst
spanning-tree portfast edge bpduguard default
spanning-tree
 <<  extend system-id
!
spanning-tree mst configuration
 name msstate
 revision 1
 instance 1 vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 63, 70
 instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 160
 instance 1 vlan 162-163, 
 << 168, 189, 194, 202, 220, 222, 230, 232, 242, 246
 instance 1 vlan 256, 611-612, 654, 741, 996, 999
 instance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037, 2039-2040
 instance 2 vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096, 2104, 2110, 2
 << 126
 instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 2189, 2194, 2202
 instance 2 vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 2654, 2999
 instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176, 196
 instance 3 vlan 244, 248, 92
 << 7
 instance 4 vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072, 2108, 2113, 2128
 instance 4 vlan 2144, 2176, 2196, 2244, 2248, 2927
 instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 228
 instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-21
 << 34, 2216, 2228
 instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116, 124
 instance 7 vlan 172, 186, 192, 204-208, 210, 240-241, 251-252, 630, 928
 instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082, 2084
 instance 8 vla
 << n 2097, 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208, 2210
 instance 8 vlan 2240-2241, 2251-2252, 2630, 2928
 instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102, 112
 instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 500, 505, 510
 << -511
 instance 9 vlan 522, 551-570, 603, 629, 633, 742, 802, 926, 929
 instance 10 vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 2057, 2062, 2068
 instance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148, 2158
 instance 10 vlan 2212, 2236, 2
 << 500, 2505, 2510-2511, 2522, 2603, 2629, 2633
 instance 10 vlan 2802, 2926, 2929
 instance 11 vlan 8, 43, 52, 146, 156-157, 180, 200, 218
 instance 12 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180, 2200, 2218
!
errdisable recovery cause udld
errdisabl
 << e recovery cause bpduguard
errdisable recovery cause security-violation
errdisable recovery cause channel-misconfig
errdisable recovery cause pagp-flap
errdisable recovery cause link-flap
errdisable recovery cause sfp-config-mismatch
errdisable reco
 << very cause gbic-invalid
errdisable recovery cause psecure-violation
errdisable recovery cause port-mode-failure
errdisable recovery cause dhcp-rate-limit
errdisable recovery cause pppoe-ia-rate-limit
errdisable recovery cause mac-limit
errdisable re
 << covery cause vmps
errdisable recovery cause storm-control
errdisable recovery cause inline-power
errdisable recovery cause arp-inspection
errdisable recovery cause link-monitor-failure
errdisable recovery cause oam-remote-failure
errdisable recovery
 <<  cause loopback
errdisable recovery cause small-frame
errdisable recovery cause psp
errdisable recovery interval 1800
!
alarm profile defaultPort
 alarm not-operating 
 syslog not-operating 
 notifies not-operating 
!
!
!
vlan internal allocat
 << ion policy ascending
!
lldp run
!
!
!
!
!
interface GigabitEthernet1/1
 switchport trunk native vlan 92
 switchport mode trunk
 ip dhcp snooping trust
!
interface GigabitEthernet1/2
 switchport trunk native vlan 92
 switchport mode trunk
 
 << ip dhcp snooping trust
!
interface GigabitEthernet1/3
 switchport trunk native vlan 92
 switchport mode trunk
 ip dhcp snooping trust
!
interface GigabitEthernet1/4
 switchport trunk native vlan 92
 switchport mode trunk
 ip dhcp snooping trust
 << 
!
interface GigabitEthernet1/5
 switchport access vlan 818
 switchport mode access
 spanning-tree portfast edge
!
interface GigabitEthernet1/6
 switchport access vlan 818
 switchport mode access
 spanning-tree portfast edge
!
interface Gigabit
 << Ethernet1/7
 switchport access vlan 818
 switchport mode access
 spanning-tree portfast edge
!
interface GigabitEthernet1/8
 switchport access vlan 818
 switchport mode access
 spanning-tree portfast edge
!
interface GigabitEthernet1/9
 switchp
 << ort access vlan 603
 switchport mode access
 power inline consumption 15400
 spanning-tree portfast edge
!
interface GigabitEthernet1/10
 switchport access vlan 818
 switchport mode access
 power inline consumption 15400
 spanning-tree portfast e
 << dge
!
interface GigabitEthernet1/11
 switchport access vlan 818
 switchport mode access
 power inline consumption 15400
 spanning-tree portfast edge
!
interface GigabitEthernet1/12
 switchport access vlan 818
 switchport mode access
 power inli
 << ne consumption 15400
 spanning-tree portfast edge
!
interface GigabitEthernet1/13
 switchport access vlan 818
 switchport mode access
 power inline consumption 15400
 spanning-tree portfast edge
!
interface GigabitEthernet1/14
 switchport access
 <<  vlan 818
 switchport mode access
 power inline consumption 15400
 spanning-tree portfast edge
!
interface GigabitEthernet1/15
 switchport access vlan 818
 switchport mode access
 power inline consumption 15400
 spanning-tree portfast edge
!
in
 << terface GigabitEthernet1/16
 switchport access vlan 818
 switchport mode access
 power inline consumption 15400
 spanning-tree portfast edge
!
interface Vlan1
 no ip address
 no ip route-cache
 shutdown
!
interface Vlan92
 ip address 10.92.6.2
 << 6 255.255.0.0
 ip broadcast-address 10.92.255.255
!
ip default-gateway 10.92.0.1
ip forward-protocol nd
no ip http server
no ip http secure-server
!
!
!
logging facility local1
logging host 130.18.8.12
access-list 1 permit 10.92.0.0 0.0.255.25
 << 5
access-list 1 permit 130.18.8.0 0.0.0.255
access-list 1 permit 10.93.0.0 0.0.255.255
access-list 1 permit 130.18.1.0 0.0.0.255
!
snmp-server community sysnet RO 1
snmp-server community c2-b2=a2 RW 1
snmp-server contact 6F-2285
snmp-server enable
 <<  traps snmp authentication linkdown linkup coldstart warmstart
snmp-server enable traps transceiver all
snmp-server enable traps tty
snmp-server enable traps cluster
snmp-server enable traps config-copy
snmp-server enable traps config
snmp-server en
 << able traps config-ctid
snmp-server enable traps entity
snmp-server enable traps power-ethernet police
snmp-server enable traps cpu threshold
snmp-server enable traps rep
snmp-server enable traps bridge newroot topologychange
snmp-server enable traps
 <<  stpx inconsistency root-inconsistency loop-inconsistency
snmp-server enable traps syslog
snmp-server enable traps vtp
snmp-server enable traps vlancreate
snmp-server enable traps vlandelete
snmp-server enable traps flash insertion removal
snmp-serv
 << er enable traps port-security
snmp-server enable traps envmon fan shutdown supply temperature status
snmp-server enable traps errdisable
snmp-server enable traps mac-notification change move threshold
snmp-server enable traps vlan-membership
snmp-ser
 << ver host 130.18.8.12 sysnet 
!
!
line con 0
line vty 0 4
 access-class 1 in
 password 7 10795B0E5414365B012D26220369
 login local
 transport input ssh
line vty 5 15
 access-class 1 in
 password 7 10795B0E5414365B012D26220369
 login local
 tra
 << nsport input ssh
!
ntp server 10.92.0.5
!
end

c4000s1.gate.creelman#
Expect: matched string 1: #
 >> show interface status

Expect: searching for 2 strs:  :# :>
 << show interface status

Port      Name               Status       Vlan       Duplex  Speed Type 
Gi1/1                        notconnect   1            auto   auto Not Present
Gi1/2                        notconnect   1            auto   auto Not Prese
 << nt
Gi1/3                        notconnect   1            auto   auto Not Present
Gi1/4                        notconnect   1            auto   auto Not Present
Gi1/5                        notconnect   818          auto   auto Not Present
Gi1/6      
 <<                   notconnect   818          auto   auto Not Present
Gi1/7                        notconnect   818          auto   auto Not Present
Gi1/8                        notconnect   818          auto   auto Not Present
Gi1/9                     
 <<    notconnect   603          auto   auto 10/100/1000BaseTX
Gi1/10                       notconnect   818          auto   auto 10/100/1000BaseTX
Gi1/11                       notconnect   818          auto   auto 10/100/1000BaseTX
Gi1/12                 
 <<       notconnect   818          auto   auto 10/100/1000BaseTX
Gi1/13                       notconnect   818          auto   auto 10/100/1000BaseTX
Gi1/14                       notconnect   818          auto   auto 10/100/1000BaseTX
Gi1/15              
 <<          notconnect   818          auto   auto 10/100/1000BaseTX
Gi1/16                       notconnect   818          auto   auto 10/100/1000BaseTX
c4000s1.gate.creelman#
Expect: matched string 1: #
