trying to use serial port: /dev/ttyUSB0
 >> 
 >> 

Expect: searching for 4 strs:  :[yes/no] :Press RETURN to get started. :# :Switch>
 << 
Switch>
Switch>
Switch>
Switch>
Expect: matched string 4: Switch>
 >> term len 0

Expect: searching for 2 strs:  :# :>
 << term len 0
Switch>
Expect: matched string 2: >
 >> show version

Expect: searching for 2 strs:  :# :>
 << show version
Cisco IOS Software, C2960C Software (C2960c405-UNIVERSALK9-M), Version 15.2(4)E, RELEASE SOFTWARE (fc2)
Technical Support: http://www.cisco.com/techsupport
Copyright (c) 1986-2015 by Cisco Systems, Inc.
Compiled Mon 28-Sep-15 20:57 by pro
 << d_rel_team

ROM: Bootstrap program is C2960C boot loader
BOOTLDR: C2960C Boot Loader (C2960c405-HBOOT-M) Version 12.2(55r)EX9, RELEASE SOFTWARE (fc1)

Switch uptime is 1 minute
System returned to ROM by power-on
System image file is "flash:/c2960c4
 << 05-universalk9-mz.152-4.E.bin"
Last reload reason: Reload command



This product contains cryptographic features and is subject to United
States and local country laws governing import, export, transfer and
use. Delivery of Cisco cryptographic pro
 << ducts does not imply
third-party authority to import, export, distribute or use encryption.
Importers, exporters, distributors and users are responsible for
compliance with U.S. and local country laws. By using this product you
agree to comply with ap
 << plicable laws and regulations. If you are unable
to comply with U.S. and local laws, return this product immediately.

A summary of U.S. laws governing Cisco cryptographic products may be found at:
http://www.cisco.com/wwl/export/crypto/tool/stqrg.htm
 << l

If you require further assistance please contact us by sending email to
export@cisco.com.

License Level: lanbase
License Type: Permanent
Next reload license Level: lanbase

cisco WS-C2960C-8TC-L (PowerPC405) processor (revision F0) with 13107
 << 2K bytes of memory.
Processor board ID FOC1842Y0J7
Last reset from reload command
1 Virtual Ethernet interface
8 FastEthernet interfaces
2 Gigabit Ethernet interfaces
The password-recovery mechanism is enabled.

64K bytes of flash-simulated non-vo
 << latile configuration memory.
Base ethernet MAC Address       : 0C:F5:A4:80:CE:00
Motherboard assembly number     : 73-13530-04
Power supply part number        : 341-0208-02
Motherboard serial number       : FOC184139KU
Power supply serial number     
 <<  : LIT18380EKE
Model revision number           : F0
Motherboard revision number     : A0
Model number                    : WS-C2960C-8TC-L
System serial number            : FOC1842Y0J7
Top Assembly Part Number        : 800-35230-01
Top Assembly Revi
 << sion Number    : L0
Version ID                      : V01
CLEI Code Number                : CMMGB00ARA
Hardware Board Revision Number  : 0x01


Switch Ports Model                     SW Version            SW Image                 
------ ----- ----
 << -                     ----------            ----------               
*    1 10    WS-C2960C-8TC-L           15.2(4)E              C2960c405-UNIVERSALK9-M  


Configuration register is 0xF

Switch>
Expect: matched string 2: >
 >> enable

Expect: searching for 2 strs:  :Password: :#
 << enable
Switch#
Expect: matched string 2: #
 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
Expect: matched string 1: (config)#
 >> no service pad

 >> service timestamps debug datetime localtime

 >> service timestamps log datetime localtime

 >> service password-encryption

 >> boot-start-marker

 >> boot-end-marker

 >> enable secret W2w1cD0mIliG!

 >> enable password W2w1cD0mIliG!

 >> username root privilege 15 secret W2w1cD0mIliG!

 >> no aaa new-model

 >> clock timezone CST -6 0

 >> clock summer-time CDT recurring

 >> authentication mac-move permit

 >> ip domain-name mgmt.msstate.edu

 >> ip name-server 130.18.80.12

 >> vtp domain vtp01.mgmt.msstate.edu

 >> vtp mode client

 >> crypto pki trustpoint TP-self-signed-2494998912

 >>  enrollment selfsigned

 >>  subject-name cn=IOS-Self-Signed-Certificate-2494998912

 >>  revocation-check none

 >>  rsakeypair TP-self-signed-2494998912

 >> crypto pki certificate chain TP-self-signed-2494998912

 >>  certificate self-signed 01 nvram:IOS-Self-Sig#3232.cer

 >> spanning-tree portfast bpduguard default

 >> spanning-tree extend system-id

 >> vlan internal allocation policy ascending

 >> lldp run

 >> errdisable recovery cause all

 >> errdisable recovery interval 1800

 >> interface Vlan1

 >>  no ip address

 >>  no ip route-cache

 >>  shutdown

 >> interface Vlan92

 >> ip http server

 >> ip http secure-server

 >> logging facility local1

 >> logging host 130.18.8.12

 >> access-list 1 permit 10.92.0.0 0.0.255.255

 >> access-list 1 permit 130.18.8.0 0.0.0.255

 >> access-list 1 permit 10.93.0.0 0.0.255.255

 >> access-list 1 permit 130.18.1.0 0.0.0.255

 >> snmp-server community sysnet RO 1

 >> snmp-server community c2-b2=a2 RW 1

 >> snmp-server enable traps snmp authentication linkdown linkup coldstart warmstart

 >> snmp-server enable traps transceiver all

 >> snmp-server enable traps tty

 >> snmp-server enable traps cluster

 >> snmp-server enable traps config-copy

 >> snmp-server enable traps config

 >> snmp-server enable traps config-ctid

 >> snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-auth-fail-vlan no-guest-vlan

 >> snmp-server enable traps entity

 >> snmp-server enable traps power-ethernet police

 >> snmp-server enable traps cpu threshold

 >> snmp-server enable traps rep

 >> snmp-server enable traps bridge newroot topologychange

 >> snmp-server enable traps stpx inconsistency root-inconsistency loop-inconsistency

 >> snmp-server enable traps syslog

 >> snmp-server enable traps vtp

 >> snmp-server enable traps vlancreate

 >> snmp-server enable traps vlandelete

 >> snmp-server enable traps flash insertion removal

 >> snmp-server enable traps port-security

 >> snmp-server enable traps envmon fan shutdown supply temperature status

 >> snmp-server enable traps errdisable

 >> snmp-server enable traps mac-notification change move threshold

 >> snmp-server enable traps vlan-membership

 >> snmp-server host 130.18.8.12 

 >> line con 0

 >> line vty 0 15

 >>  access-class 1 in

 >>  password W2w1cD0mIliG!

 >>  login local

 >>  transport input ssh

 >> ntp server 10.92.0.5

 >> 

 >> end

Expect: searching for 1 strs:  :Configured
 << no service pad
Switch(config)#service timestamps debug datetime localtime
Switch(config)#service timestamps log datetime localtime
Switch(config)#service password-encryption
Switch(config)#boot-start-marker
Switch(config)#boot-end-marker
Switch(conf
 << ig)#enable secret W2w1cD0mIliG!
Switch(config)#enable password W2w1cD0mIliG!
The enable password you have chosen is the same as your enable secret.
This is not recommended.  Re-enter the enable password.

Switch(config)#username root privilege 15 sec
 << ret W2w1cD0mIliG!
Switch(config)#no aaa new-model
Switch(config)#clock timezone CST -6 0
Switch(config)#clock summer-time CDT recurring
Switch(config)#authentication mac-move permit
Switch(config)#ip domain-name mgmt.msstate.edu
Switch(config)#ip na
 << me-server 130.18.80.12
Switch(config)#vtp domain vtp01.mgmt.msstate.edu
Domain name already set to vtp01.mgmt.msstate.edu.
Switch(config)#vtp mode client
Device mode already VTP Client for VLANS.
Switch(config)#crypto pki trustpoint TP-self-signed-24
 << 94998912
Switch(ca-trustpoint)#
*Jan  1 18:03:11: %SYS-6-CLOCKUPDATE: System clock has been updated from 00:03:11 UTC Mon Jan 2 2006 to 18:03:11 CST Sun Jan 1 2006, configured from console by console.
*Jan  1 18:03:11: %SYS-6-CLOCKUPDATE: System clock 
 << has been updated from 18:03:11 CST Sun Jan 1 2006 to 18:03:11 CST Sun Jan 1 2006, configured from console by console. enrollment selfsigned
Switch(ca-trustpoint)# subject-name cn=IOS-Self-Signed-Certificate-2494998912
Switch(ca-trustpoint)# revocation-c
 << heck none
Switch(ca-trustpoint)# rsakeypair TP-self-signed-2494998912
Switch(ca-trustpoint)#crypto pki certificate chain TP-self-signed-2494998912
Switch(config-cert-chain)# certificate self-signed 01 nvram:IOS-Self-Sig#3232
 << $e self-signed 01 nvram:IOS-Self-Sig#3232.         cer
Switch(config-cert-chain)#spanning-tree portfast bpduguard default
Switch(config)#spanning-tree extend system-id
Switch(config)#vlan internal allocation policy ascen
 << ding
Switch(config)#lldp run
Switch(config)#errdisable recovery cause all
Switch(config)#errdisable recovery interval 1800
Switch(config)#interface Vlan1
Switch(config-if)# no ip address
Switch(config-if)# no ip route-cache
Switch(config-if)# shutd
 << own
Switch(config-if)#interface Vlan92
Switch(config-if)#ip http server
Switch(config)#ip http secure-server
Switch(config)#logging facility local1
Switch(config)#logging host 130.18.8.12
Switch(config)#access-list 1 permit 10.92.0.0 0.0.255.255
Sw
 << itch(config)#access-list 1 permit 130.18.8.0 0.0.0.255
Switch(config)#access-list 1 permit 10.93.0.0 0.0.255.255
Switch(config)#access-list 1 permit 130.18.1.0 0.0.0.255
Switch(config)#snmp-server community sysnet RO 1
Switch(config)#snmp-server commu
 << nity c2-b2=a2 RW 1
Switch(config)#snmp-server enable traps snmp authentication linkdown linkup c$ enable traps snmp authentication linkdown linkup co         ldstart w
 << aps snmp authentication linkdown linkup coldstart wa         rmstart
Switch(config)#
*Jan  1 18:03:17: %SYS-6-LOGGINGHOST_STARTSTOP: Logging to host 130.18.8.12 port 0 CLI Request Triggered
*Jan  1 
 << 18:03:17: %SYS-6-LOGGINGHOST_STARTSTOP: Logging to host 130.18.8.12 port 514 started - CLI initiatedsnmp-server enable traps transceiver all
Switch(config)#snmp-server enable traps tty
Switch(config)#snmp-server enable traps cluster
Switch(config)#snmp
 << -server enable traps config-copy
Switch(config)#snmp-server enable traps config
Switch(config)#
*Jan  1 18:03:18: %LINK-5-CHANGED: Interface Vlan1, changed state to administratively downsnmp-server enable traps config-ctid
Switch(config)#snmp-server e
 << nable traps dot1x auth-fail-vlan guest-vlan no-au$ enable traps dot1x auth-fail-vlan guest-vlan no-aut         h-fail-vlaps
 <<  dot1x auth-fail-vlan guest-vlan no-auth-fail-vla         n no-guesuth-fail-vlan guest-vlan no-auth-fail-vlan no-guest         -vlan
snmp-server enable traps dot1x auth-fail-vl
 << an guest-vlan no-auth-fail-vlan no-gu                         ^est-vlan

% Invalid input detected at '^' marker.

Switch(config)#snmp-server enable traps entity
Switch(config)#snmp-server enable traps power-ethernet police
Switch(config)#snmp-server
 <<  enable traps cpu threshold
Switch(config)#snmp-server enable traps rep
Switch(config)#snmp-server enable traps bridge newroot topologychange
Switch(config)#snmp-server enable traps stpx inconsistency root-inconsistency
 << $ enable traps stpx inconsistency root-inconsistency          loop-incoaps stpx inconsistency root-inconsistency loop-incon         sistency
Switc
 << h(config)#snmp-server enable traps syslog
Switch(config)#snmp-server enable traps vtp
Switch(config)#snmp-server enable traps vlancreate
Switch(config)#snmp-server enable traps vlandelete
Switch(config)#snmp-server enable traps flash insertion removal
 << 
Switch(config)#snmp-server enable traps port-security
Switch(config)#snmp-server enable traps envmon fan shutdown supply temperatur$ enable traps envmon fan shutdown supply temperature      
 <<     status
Switch(config)#snmp-server enable traps errdisable
Switch(config)#snmp-server enable traps mac-notification change move threshol$ enable traps mac-notification change move
 <<  threshold         
Switch(config)#snmp-server enable traps vlan-membership
Switch(config)#snmp-server host 130.18.8.12 
% Incomplete command.

Switch(config)#line con 0
Switch(config-line)#line vty 0 15
Switch(config-line)# access-class 1
 <<  in
Switch(config-line)# password W2w1cD0mIliG!
Switch(config-line)# login local
Switch(config-line)# transport input ssh
Switch(config-line)#ntp server 10.92.0.5
Switch(config)#
Switch(config)#end
Switch#
*Jan  1 18:03:25: %SYS-5-CONFIG_I: Config
 << ured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
Switch#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
Expect: matched string 1: (config)#
 >> spanning-tree mode mst

 >> spanning-tree etherchannel guard misconfig

 >> spanning-tree mst configuration

 >>  name msstate

 >>  revision 1

 >>  instance 1 vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 63, 70

 >>  instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 160

 >>  instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 230, 232, 242, 246

 >>  instance 1 vlan 256, 611-612, 654, 741, 996, 999

 >>  instance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037, 2039-2040

 >>  instance 2 vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096, 2104, 2110, 2126

 >>  instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 2189, 2194, 2202

 >>  instance 2 vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 2654, 2999

 >>  instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176, 196

 >>  instance 3 vlan 244, 248, 927

 >>  instance 4 vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072, 2108, 2113, 2128

 >>  instance 4 vlan 2144, 2176, 2196, 2244, 2248, 2927

 >>  instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 228

 >>  instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216, 2228

 >>  instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116, 124

 >>  instance 7 vlan 172, 186, 192, 204-208, 210, 240-241, 251-252, 630, 928

 >>  instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082, 2084

 >>  instance 8 vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208, 2210

 >>  instance 8 vlan 2240-2241, 2251-2252, 2630, 2928

 >>  instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102, 112

 >>  instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 500, 505, 510-511

 >>  instance 9 vlan 522, 551-570, 603, 629, 633, 742, 802, 926, 929

 >>  instance 10 vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 2057, 2062, 2068

 >>  instance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148, 2158

 >>  instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522, 2603, 2629, 2633

 >>  instance 10 vlan 2802, 2926, 2929

 >>  instance 11 vlan 8, 43, 52, 146, 156-157, 180, 200, 218

 >>  instance 12 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180, 2200, 2218

 >> 

 >> end

Expect: searching for 1 strs:  :Configured
 << spanning-tree mode mst
Switch(config)#spanning-tree etherchannel guard misconfig
Switch(config)#spanning-tree mst configuration
Switch(config-mst)# name msstate
Switch(config-mst)# revision 1
Switch(config-mst)# instance 1 vlan 2, 7, 11, 20, 22, 24, 
 << 31, 35, 37, 39-40, $ vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40, 5         0, 60, 63, 11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 
 << 63,          70
Switch(config-mst)# instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 1$ vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 14         0, 152, 1
 << 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 16         0
Switch(config-mst)# instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 23$ vlan 162-1
 << 63, 168, 189, 194, 202, 220, 222, 230         , 232, 24163, 168, 189, 194, 202, 220, 222, 230, 232, 242         , 246
Switch(config-mst)# instance 1 vlan 256, 611-612, 654, 741, 9
 << 96, 999
Switch(config-mst)# instance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031,$ vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031,          2035, 203
 << , 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037         , 2039-2011, 2020, 2022, 2024, 2031, 2035, 2037, 2039-204         0
Switch(config-mst)# instance 2 v
 << lan 2050, 2060, 2063, 2070, 2080, 2086, 2096,$ vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096,          2104, 211, 2060, 2063, 2070,
 <<  2080, 2086, 2096, 2104, 2110         , 2126
Switch(config-mst)# instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, $ vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 2         
 << 189, 2194, 2140, 2152, 2160, 2162-2163, 2168, 2189, 2194,          2202
Switch(config-mst)# instance 2 vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 
 << $ vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 2         654, 2999
Switch(config-mst)# instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128$ vlan 42, 51, 59, 64
 << , 66, 69, 72, 108, 113, 128,          144, 17651, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176,          196
Switch(config-mst)# instance 3 vlan 244, 248, 927
Switch(config-mst)# 
 << instance 4 vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072,$ vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072,          2108, 211, 2051,
 <<  2059, 2064, 2066, 2069, 2072, 2108, 2113         , 2128
Switch(config-mst)# instance 4 vlan 2144, 2176, 2196, 2244, 2248, 2927
Switch(config-mst)# instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 2
 << $ vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 22         8
Switch(config-mst)# instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-$ vlan 2016, 2048, 2058, 2088, 
 << 2121, 2131, 2133-2         134, 2216, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216,          2228
Switch(config-mst)# instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97,
 << $ vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97,          114, 116,3-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116,          1
 << 24
Switch(config-mst)# instance 7 vlan 172, 186, 192, 204-208, 210, 240-241, 251$ vlan 172, 186, 192, 204-208, 210, 240-241, 251-         252, 630,
 << 186, 192, 204-208, 210, 240-241, 251-252, 630,          928
Switch(config-mst)# instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, $ vlan 2009, 2033-2034, 2038, 2054
 << , 2056, 2071, 2         075, 2082, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082,          2084
Switch(config-mst)# instance 8 vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192,
 << $ vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192,          2204-2208, 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208,          221
 << 0
Switch(config-mst)# instance 8 vlan 2240-2241, 2251-2252, 2630, 2928
Switch(config-mst)# instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 9$ vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 
 << 98         -99, 102,12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102,          112
Switch(config-mst)# instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 50
 << $ vlan 130, 132, 147-148, 158, 212, 226, 236, 500         , 505, 51132, 147-148, 158, 212, 226, 236, 500, 505, 510         -511
Switch(config-mst
 << )# instance 9 vlan 522, 551-570, 603, 629, 633, 742, 802, 92$ vlan 522, 551-570, 603, 629, 633, 742, 802, 926         , 929
Switch(config-mst)# instance 10 vlan 2004-2005, 2012, 2018-2019
 << , 2032, 2044, $0 vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 2         057, 20624-2005, 2012, 2018-2019, 2032, 2044, 2057, 2062,  
 <<         2068
Switch(config-mst)# instance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132,$0 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132,          2147-2148
 << 6, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148,          2158
Switch(config-mst)# instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522,$0 vlan 221
 << 2, 2236, 2500, 2505, 2510-2511, 2522,          2603, 2622, 2236, 2500, 2505, 2510-2511, 2522, 2603, 2629         , 2633
Switch(config-mst)# instance 10 vlan 2802, 2926, 2929
Swit
 << ch(config-mst)# instance 11 vlan 8, 43, 52, 146, 156-157, 180, 200, 218
Switch(config-mst)# instance 12 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180,$2 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180
 << ,          2200, 2218, 2043, 2052, 2146, 2156-2157, 2180, 2200, 2218         
Switch(config-mst)#
Switch(config-mst)#end
Switch#
*Jan  1 18:03:41: %SYS-5-CONFIG_I: Configured f
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << rom console by console
Switch#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
Expect: matched string 1: (config)#
 >> hostname c29s1c.r104.butler 

Expect: searching for 2 strs:  :# :>
 << hostname c29s1c.r104.butler 
c29s1c.r104.butler(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s1c.r104.butler#
 << 
*Jan  1 18:03:45: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1c.r104.butler#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1c.r104.butler(config)#
Expect: matched string 1: (config)#
 >> snmp-server contact  

Expect: searching for 1 strs:  :#
 << snmp-server contact  
% Incomplete command.

c29s1c.r104.butler(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s1c.r104.butler#
 << 
*Jan  1 18:03:51: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1c.r104.butler#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1c.r104.butler(config)#
Expect: matched string 1: (config)#
 >> interface vlan 92

Expect: searching for 1 strs:  :(config-if)#
 << interface vlan 92
c29s1c.r104.butler(config-if)#
Expect: matched string 1: (config-if)#
 >> ip address 10.92.6.35 255.255.0.0

 >> ip broadcast-address 10.92.255.255

 >> end

Expect: searching for 1 strs:  :Configured
 << ip address 10.92.6.35 255.255.0.0
c29s1c.r104.butler(config-if)#ip broadcast-address 10.92.255.255
c29s1c.r104.butler(config-if)#end
c29s1c.r104.butler#
 << 
*Jan  1 18:03:58: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1c.r104.butler#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1c.r104.butler(config)#
Expect: matched string 1: (config)#
 >> interface Vlan92

Expect: searching for 1 strs:  :(config-if)#
 << interface Vlan92
c29s1c.r104.butler(config-if)#
Expect: matched string 1: (config-if)#
 >> ip default-gateway 10.92.0.1

 >> end

Expect: searching for 1 strs:  :Configured
 << ip default-gateway 10.92.0.1
c29s1c.r104.butler(config)#end
c29s1c.r104.butler#
*Jan  1 18:04:04: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1c.r104.butler#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1c.r104.butler(config)#
Expect: matched string 1: (config)#
 >> ip dhcp snooping

Expect: searching for 1 strs:  :#
 << ip dhcp snooping
c29s1c.r104.butler(config)#
Expect: matched string 1: #
 >> ip dhcp snooping vlan 208

Expect: searching for 1 strs:  :#
 << ip dhcp snooping vlan 208
c29s1c.r104.butler(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s1c.r104.butler#
*Jan  1 18:04:11: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1c.r104.butler#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1c.r104.butler(config)#
Expect: matched string 1: (config)#
 >> default interface range fa0/1 - 8 

 >> interface range fa0/1 - 8 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range fa0/1 - 8 

 << c29s1c.r104.butler(config)#interface range fa0/1 - 8 
c29s1c.r104.butler(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport access vlan 208

 >> switchport mode access

 >> spanning-tree portfast

 >> switchport port-security maximum 2

 >> switchport port-security

 >> switchport port-security aging time 15

 >> switchport port-security violation protect

 >> switchport port-security aging type inactivity

 >> power inline never

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport access vlan 208
c29s1c.r104.butler(config-if-range)#switchport mode access
c29s1c.r104.butler(config-if-range)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, concentra
 << tors, switches, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast will be configured in 8 interfaces due to the range command 
 but will only have effect when the interfaces
 <<  are in a non-trunking mode.
c29s1c.r104.butler(config-if-range)#switchport port-security maximum 2
c29s1c.r104.butler(config-if-range)#switchport port-security
c29s1c.r104.butler(config-if-range)#switchport port-security aging time 15
c29s1c.r104.but
 << ler(config-if-range)#switchport port-security violation protec$port-security violation protect         
c29s1c.r104.butler(config-if-range)#switchport port-security aging type inact
 << $port-security aging type inacti         vity
c29s1c.r104.butler(config-if-range)#power inline never
                                     ^
% Invalid input detected at '^' marker.

c29s1c.r104.butler(config-if-range)#end
c
 << 29s1c.r104.butler#
 << 
*Jan  1 18:04:20: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1c.r104.butler#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1c.r104.butler(config)#
Expect: matched string 1: (config)#
 >> default interface range fa0/1 - 4 

 >> interface range fa0/1 - 4 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range fa0/1 - 4 
c29s1c.r104.butler(config)#interface range fa0/1 - 4 
c29s1c.r104.butler(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport access vlan 673

 >> switchport mode access

 >> spanning-tree portfast

 >> power inline never

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport access vlan 673
c29s1c.r104.butler(config-if-range)#switchport mode access
c29s1c.r104.butler(config-if-range)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, concentra
 << tors, switches, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast will be configured in 4 interfaces due to the range command 
 but will only have effect when the interfaces
 <<  are in a non-trunking mode.
c29s1c.r104.butler(config-if-range)#power inline never
                                     ^
% Invalid input detected at '^' marker.

c29s1c.r104.butler(config-if-range)#end
c29s1c.r104.butler#
 << 
*Jan  1 18:04:27: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1c.r104.butler#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1c.r104.butler(config)#
Expect: matched string 1: (config)#
 >> default interface fa0/5 

 >> interface fa0/5 

Expect: searching for 1 strs:  :(config-if)#
 << default interface fa0/5 
Interface FastEthernet0/5 set to default configuration
c29s1c.r104.butler(config)#interface fa0/5 
c29s1c.r104.butler(config-if)#
Expect: matched string 1: (config-if)#
 >> switchport access vlan 28

 >> switchport mode access

 >> spanning-tree portfast

 >> power inline never

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport access vlan 28
c29s1c.r104.butler(config-if)#switchport mode access
c29s1c.r104.butler(config-if)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, concentrators, switche
 << s, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast has been configured on FastEthernet0/5 but will only
 have effect when the interface is in a non-trunking mode.
c29s1c.
 << r104.butler(config-if)#power inline never
                               ^
% Invalid input detected at '^' marker.

c29s1c.r104.butler(config-if)#end
c29s1c.r104.butler#
 << 
*Jan  1 18:04:33: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1c.r104.butler#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1c.r104.butler(config)#
Expect: matched string 1: (config)#
 >> default interface fa0/8 

 >> interface fa0/8 

Expect: searching for 1 strs:  :(config-if)#
 << default interface fa0/8 
Interface FastEthernet0/8 set to default configuration
c29s1c.r104.butler(config)#interface fa0/8 
c29s1c.r104.butler(config-if)#
Expect: matched string 1: (config-if)#
 >> switchport access vlan 91

 >> switchport mode access

 >> spanning-tree portfast

 >> power inline never

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport access vlan 91
c29s1c.r104.butler(config-if)#switchport mode access
c29s1c.r104.butler(config-if)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, concentrators, switche
 << s, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast has been configured on FastEthernet0/8 but will only
 have effect when the interface is in a non-trunking mode.
c29s1c.
 << r104.butler(config-if)#power inline never
                               ^
% Invalid input detected at '^' marker.

c29s1c.r104.butler(config-if)#end
c29s1c.r104.butler#
 << 
*Jan  1 18:04:39: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1c.r104.butler#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1c.r104.butler(config)#
Expect: matched string 1: (config)#
 >> default interface range gi0/1 - 2 

 >> interface range gi0/1 - 2 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi0/1 - 2 
c29s1c.r104.butler(config)#interface range gi0/1 - 2 
c29s1c.r104.butler(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport mode trunk

 >> switchport trunk native vlan 92

 >> ip dhcp snooping trust

 >> no keepalive

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport mode trunk
c29s1c.r104.butler(config-if-range)#switchport trunk native vlan 92
c29s1c.r104.butler(config-if-range)#ip dhcp snooping trust
c29s1c.r104.butler(config-if-range)#no keepalive
c29s1c.r104.butler(config-if-range)#end
c29s1c.r104.
 << butler#
 << 
*Jan  1 18:04:45: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1c.r104.butler#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1c.r104.butler(config)#
Expect: matched string 1: (config)#
 >> crypto key generate rsa

 >> no

 >> 2048

Expect: searching for 2 strs:  :OK :(config)#
 << crypto key generate rsa
The name for the keys will be: c29s1c.r104.butler.mgmt.msstate.edu
Choose the size of the key modulus in the range of 360 to 4096 for your
  General Purpose Keys. Choosing a key modulus greater than 512 may take
  a few minutes
 << .

How many bits in the modulus [512]: no
% A decimal number between 360 and 4096.
How many bits in the modulus [512]: 2048
% Generating 2048 bit RSA keys, keys will be non-exportable...
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...
crypto key generate rsa
The name for the keys will be: c29s1c.r104.butler.mgmt.msstate.edu
Choose the size of the key modulus in the range of 360 to 4096 for your
  General Purpose Keys. Choosing a key modulus greater than 512 may take
  a few minutes.

How many bits in the modulus [512]: no
% A decimal number between 360 and 4096.
How many bits in the modulus [512]: 2048
% Generating 2048 bit RSA keys, keys will be non-exportable...
...

 >> end

Expect: searching for 1 strs:  :Configured
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

...

 >> 

 >> write mem

Expect: searching for 2 strs:  :# :>
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

...

 >> 
Expect: searching for 2 strs:  :# :>
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

...

 >> sh run

Expect: searching for 2 strs:  :# :>
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
[OK] (elapsed time was 78 seconds)

c29s1c.r104.butler(config)#end
c29s1c.r104.butler#
c29s1c.r104.butler#write mem
Building configuration...
[OK]
c29s1c.r104.butler#
c29s1c.r104.butler#
c29s1c.r104.butler#sh run
Building configuration...

*
Expect: matched string 1: #
 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << Jan  1 18:06:07: %SSH-5-ENABLED: SSH 1.99 has been enabled
*Jan  1 18:06:08: %SYS-5-CONFIG_I: Configured from console by console
Current configuration : 7209 bytes
!
! Last configuration change at 18:06:08 CST Sun Jan 1 2006
!
version 15.2
no servi
 << ce pad
service timestamps debug datetime localtime
service timestamps log datetime localtime
service password-encryption
!
hostname c29s1c.r104.butler
!
boot-start-marker
boot-end-marker
!
!
enable secret 5 $1$9iSu$rom9qEZMnuLwRnNXa3.5N1
enabl
 << e password 7 097B1C1E48063342062508230C65
!
username root privilege 15 secret 5 $1$gFsP$7T9YCGXu1hNUK1F9Ru9nw.
no aaa new-model
clock timezone CST -6 0
clock summer-time CDT recurring
system mtu routing 1500
!
!
!
ip dhcp snooping vlan 208
ip d
 << hcp snooping
ip domain-name mgmt.msstate.edu
ip name-server 130.18.80.12
!
!
!
!
!
authentication mac-move permit
!
!
crypto pki trustpoint TP-self-signed-2494998912
 enrollment selfsigned
 subject-name cn=IOS-Self-Signed-Certificate-24949989
 << 12
 revocation-check none
 rsakeypair TP-self-signed-2494998912
!
!
crypto pki certificate chain TP-self-signed-2494998912
 certificate self-signed 01
  	quit
!
spanning-tree mode mst
spanning-tree portfast edge bpduguard default
spanning-tree 
 << extend system-id
!
spanning-tree mst configuration
 name msstate
 revision 1
 instance 1 vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 63, 70
 instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 160
 instance 1 vlan 162-163, 1
 << 68, 189, 194, 202, 220, 222, 230, 232, 242, 246
 instance 1 vlan 256, 611-612, 654, 741, 996, 999
 instance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037, 2039-2040
 instance 2 vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096, 2104, 2110, 21
 << 26
 instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 2189, 2194, 2202
 instance 2 vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 2654, 2999
 instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176, 196
 instance 3 vlan 244, 248, 927
 << 
 instance 4 vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072, 2108, 2113, 2128
 instance 4 vlan 2144, 2176, 2196, 2244, 2248, 2927
 instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 228
 instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-213
 << 4, 2216, 2228
 instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116, 124
 instance 7 vlan 172, 186, 192, 204-208, 210, 240-241, 251-252, 630, 928
 instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082, 2084
 instance 8 vlan
 <<  2097, 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208, 2210
 instance 8 vlan 2240-2241, 2251-2252, 2630, 2928
 instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102, 112
 instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 500, 505, 510-
 << 511
 instance 9 vlan 522, 551-570, 603, 629, 633, 742, 802, 926, 929
 instance 10 vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 2057, 2062, 2068
 instance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148, 2158
 instance 10 vlan 2212, 2236, 25
 << 00, 2505, 2510-2511, 2522, 2603, 2629, 2633
 instance 10 vlan 2802, 2926, 2929
 instance 11 vlan 8, 43, 52, 146, 156-157, 180, 200, 218
 instance 12 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180, 2200, 2218
!
errdisable recovery cause udld
errdisable
 <<  recovery cause bpduguard
errdisable recovery cause security-violation
errdisable recovery cause channel-misconfig
errdisable recovery cause pagp-flap
errdisable recovery cause dtp-flap
errdisable recovery cause link-flap
errdisable recovery cause s
 << fp-config-mismatch
errdisable recovery cause gbic-invalid
errdisable recovery cause psecure-violation
errdisable recovery cause port-mode-failure
errdisable recovery cause dhcp-rate-limit
errdisable recovery cause pppoe-ia-rate-limit
errdisable reco
 << very cause mac-limit
errdisable recovery cause vmps
errdisable recovery cause storm-control
errdisable recovery cause inline-power
errdisable recovery cause arp-inspection
errdisable recovery cause loopback
errdisable recovery cause small-frame
err
 << disable recovery cause psp
errdisable recovery interval 1800
!
!
!
!
vlan internal allocation policy ascending
!
lldp run
!
! 
!
!
!
!
!
!
!
!
!
interface FastEthernet0/1
 switchport access vlan 673
 switchport mode access
 spanning
 << -tree portfast edge
!
interface FastEthernet0/2
 switchport access vlan 673
 switchport mode access
 spanning-tree portfast edge
!
interface FastEthernet0/3
 switchport access vlan 673
 switchport mode access
 spanning-tree portfast edge
!
int
 << erface FastEthernet0/4
 switchport access vlan 673
 switchport mode access
 spanning-tree portfast edge
!
interface FastEthernet0/5
 switchport access vlan 28
 switchport mode access
 spanning-tree portfast edge
!
interface FastEthernet0/6
 swi
 << tchport access vlan 208
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spann
 << ing-tree portfast edge
!
interface FastEthernet0/7
 switchport access vlan 208
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-securit
 << y aging type inactivity
 switchport port-security
 spanning-tree portfast edge
!
interface FastEthernet0/8
 switchport access vlan 91
 switchport mode access
 spanning-tree portfast edge
!
interface GigabitEthernet0/1
 switchport trunk native vl
 << an 92
 switchport mode trunk
 ip dhcp snooping trust
!
interface GigabitEthernet0/2
 switchport trunk native vlan 92
 switchport mode trunk
 ip dhcp snooping trust
!
interface Vlan1
 no ip address
 no ip route-cache
 shutdown
!
interface Vla
 << n92
 ip address 10.92.6.35 255.255.0.0
 ip broadcast-address 10.92.255.255
!
ip default-gateway 10.92.0.1
ip http server
ip http secure-server
!
!
logging facility local1
logging host 130.18.8.12
access-list 1 permit 10.92.0.0 0.0.255.255
acce
 << ss-list 1 permit 130.18.8.0 0.0.0.255
access-list 1 permit 10.93.0.0 0.0.255.255
access-list 1 permit 130.18.1.0 0.0.0.255
snmp-server community sysnet RO 1
snmp-server community c2-b2=a2 RW 1
snmp-server enable traps snmp authentication linkdown lin
 << kup coldstart warmstart
snmp-server enable traps transceiver all
snmp-server enable traps tty
snmp-server enable traps cluster
snmp-server enable traps config-copy
snmp-server enable traps config
snmp-server enable traps config-ctid
snmp-server ena
 << ble traps entity
snmp-server enable traps power-ethernet police
snmp-server enable traps cpu threshold
snmp-server enable traps rep
snmp-server enable traps bridge newroot topologychange
snmp-server enable traps stpx inconsistency root-inconsistency 
 << loop-inconsistency
snmp-server enable traps syslog
snmp-server enable traps vtp
snmp-server enable traps vlancreate
snmp-server enable traps vlandelete
snmp-server enable traps flash insertion removal
snmp-server enable traps port-security
snmp-ser
 << ver enable traps envmon fan shutdown supply temperature status
snmp-server enable traps errdisable
snmp-server enable traps mac-notification change move threshold
snmp-server enable traps vlan-membership
!
!
line con 0
line vty 0 4
 access-class 1
 <<  in
 password 7 1525591B55290F74251A392B3446
 login local
 transport input ssh
line vty 5 15
 access-class 1 in
 password 7 1525591B55290F74251A392B3446
 login local
 transport input ssh
!
ntp server 10.92.0.5
end

c29s1c.r104.butler#configur
 << e terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1c.r104.butler(config)#
Expect: matched string 1: (config)#
 >> no service pad

 >> service timestamps debug datetime localtime

 >> service timestamps log datetime localtime

 >> service password-encryption

 >> boot-start-marker

 >> boot-end-marker

 >> enable secret W2w1cD0mIliG!

 >> enable password W2w1cD0mIliG!

 >> username root privilege 15 secret W2w1cD0mIliG!

 >> no aaa new-model

 >> clock timezone CST -6 0

 >> clock summer-time CDT recurring

 >> authentication mac-move permit

 >> ip domain-name mgmt.msstate.edu

 >> ip name-server 130.18.80.12

 >> vtp domain vtp01.mgmt.msstate.edu

 >> vtp mode client

 >> crypto pki trustpoint TP-self-signed-2494998912

 >>  enrollment selfsigned

 >>  subject-name cn=IOS-Self-Signed-Certificate-2494998912

 >>  revocation-check none

 >>  rsakeypair TP-self-signed-2494998912

 >> crypto pki certificate chain TP-self-signed-2494998912

 >>  certificate self-signed 01 nvram:IOS-Self-Sig#3232.cer

 >> spanning-tree portfast bpduguard default

 >> spanning-tree extend system-id

 >> vlan internal allocation policy ascending

 >> lldp run

 >> errdisable recovery cause all

 >> errdisable recovery interval 1800

 >> interface Vlan1

 >>  no ip address

 >>  no ip route-cache

 >>  shutdown

 >> interface Vlan92

 >> ip http server

 >> ip http secure-server

 >> logging facility local1

 >> logging host 130.18.8.12

 >> access-list 1 permit 10.92.0.0 0.0.255.255

 >> access-list 1 permit 130.18.8.0 0.0.0.255

 >> access-list 1 permit 10.93.0.0 0.0.255.255

 >> access-list 1 permit 130.18.1.0 0.0.0.255

 >> snmp-server community sysnet RO 1

 >> snmp-server community c2-b2=a2 RW 1

 >> snmp-server enable traps snmp authentication linkdown linkup coldstart warmstart

 >> snmp-server enable traps transceiver all

 >> snmp-server enable traps tty

 >> snmp-server enable traps cluster

 >> snmp-server enable traps config-copy

 >> snmp-server enable traps config

 >> snmp-server enable traps config-ctid

 >> snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-auth-fail-vlan no-guest-vlan

 >> snmp-server enable traps entity

 >> snmp-server enable traps power-ethernet police

 >> snmp-server enable traps cpu threshold

 >> snmp-server enable traps rep

 >> snmp-server enable traps bridge newroot topologychange

 >> snmp-server enable traps stpx inconsistency root-inconsistency loop-inconsistency

 >> snmp-server enable traps syslog

 >> snmp-server enable traps vtp

 >> snmp-server enable traps vlancreate

 >> snmp-server enable traps vlandelete

 >> snmp-server enable traps flash insertion removal

 >> snmp-server enable traps port-security

 >> snmp-server enable traps envmon fan shutdown supply temperature status

 >> snmp-server enable traps errdisable

 >> snmp-server enable traps mac-notification change move threshold

 >> snmp-server enable traps vlan-membership

 >> snmp-server host 130.18.8.12 

 >> line con 0

 >> line vty 0 15

 >>  access-class 1 in

 >>  password W2w1cD0mIliG!

 >>  login local

 >>  transport input ssh

 >> ntp server 10.92.0.5

 >> 

 >> end

Expect: searching for 1 strs:  :Configured
 << no service pad
c29s1c.r104.butler(config)#service timestamps debug datetime localtime
c29s1c.r104.butler(config)#service timestamps log datetime localtime
c29s1c.r104.butler(config)#service password-encryption
c29s1c.r104.butler(config)#boot-start-mar
 << ker
c29s1c.r104.butler(config)#boot-end-marker
c29s1c.r104.butler(config)#enable secret W2w1cD0mIliG!
The enable secret you have chosen is the same as your enable password.
This is not recommended.  Re-enter the enable secret.

c29s1c.r104.butler(co
 << nfig)#enable password W2w1cD0mIliG!
The enable password you have chosen is the same as your enable secret.
This is not recommended.  Re-enter the enable password.

c29s1c.r104.butler(config)#username root privilege 15 secret W2w1cD0mIliG!
c29s1c.r104
 << .butler(config)#no aaa new-model
c29s1c.r104.butler(config)#clock timezone CST -6 0
c29s1c.r104.butler(config)#clock summer-time CDT recurring
c29s1c.r104.butler(config)#authentication mac-move permit
c29s1c.r104.butler(config)#ip domain-name mgmt.mss
 << tate.edu
c29s1c.r104.butler(config)#ip name-server 130.18.80.12
c29s1c.r104.butler(config)#vtp domain vtp01.mgmt.msstate.edu
Domain name already set to vtp01.mgmt.msstate.edu.
c29s1c.r104.butler(config)#vtp mode client
Device mode already VTP Client 
 << for VLANS.
c29s1c.r104.butler(config)#crypto pki trustpoint TP-self-signed-2494998912
c29s1c.r104.butler(ca-trustpoint)# enrollment selfsigned
c29s1c.r104.butler(ca-trustpoint)# subject-name cn=IOS-Self-Signed-Certificat
 << $me cn=IOS-Self-Signed-Certificate         -24949989Self-Signed-Certificate-249499891         2
c29s1c.r104.butler(ca-trustpoint)# revocation-check none
c29s1c.r104.butler(ca-trustpo
 << int)# rsakeypair TP-self-signed-2494998912
c29s1c.r104.butler(ca-trustpoint)#crypto pki certificate chain TP-self-signed$certificate chain TP-self-signed-         249499891
 << e chain TP-self-signed-2494998912         
c29s1c.r104.butler(config-cert-chain)# certificate self-signed 01 nvram:IOS-S$e self-signed 01 nvram:IOS-Se         lf-Sig#32
 << ned 01 nvram:IOS-Self-Sig#323         2.cer
c29s1c.r104.butler(config-cert-chain)#spanning-tree portfast bpduguard defaul$ee portfast bpduguard default         
c29s1c.r104.bu
 << tler(config)#spanning-tree extend system-id
c29s1c.r104.butler(config)#vlan internal allocation policy ascending
c29s1c.r104.butler(config)#lldp run
c29s1c.r104.butler(config)#errdisable recovery cause all
c29s1c.r104.butler(config)#errdisable recover
 << y interval 1800
c29s1c.r104.butler(config)#interface V
*Jan  1 18:09:02: % Multiple self signed certificates in config
    certificate for trust point TP-self-signed-2494998912 ignored
lan1
c29s1c.r104.butler(config-if)# no ip address
c29s1c.r104.bu
 << tler(config-if)# no ip route-cache
c29s1c.r104.butler(config-if)# shutdown
c29s1c.r104.butler(config-if)#interface Vlan92
c29s1c.r104.butler(config-if)#ip http server
c29s1c.r104.butler(config)#ip http secure-server
c29s1c.r104.butler(config)#logging
 <<  facility local1
c29s1c.r104.butler(config)#logging host 130.18.8.12
c29s1c.r104.butler(config)#access-list 1 permit 10.92.0.0 0.0.255.255
c29s1c.r104.butler(config)#access-list 1 permit 130.18.8.0 0.0.0.255
c29s1c.r104.butler(config)#access-list 1 pe
 << rmit 10.93.0.0 0.0.255.255
c29s1c.r104.butler(config)#access-list 1 permit 130.18.1.0 0.0.0.255
c29s1c.r104.butler(config)#snmp-server community sysnet RO 1
c29s1c.r104.butler(config)#snmp-server community c2-b2=a2 RW 1
c29s1c.r104.butler(config)#snmp
 << -server enable traps snmp authentication linkd$ enable traps snmp authentication linkdo         wn linkupaps snmp authentication linkdown linkup   
 <<        coldstartuthentication linkdown linkup coldstart          warmstart
c29s1c.r104.butler(config)#snmp-server enable traps transceiver all
c29s1c.r104.butler(config)#snmp-server enab
 << le traps tty
c29s1c.r104.butler(config)#snmp-server enable traps cluster
c29s1c.r104.butler(config)#snmp-server enable traps config-copy
c29s1c.r104.butler(config)#snmp-server enable traps config
c29s1c.r104.butler(config)#snmp-server enable traps con
 << fig-ctid
c29s1c.r104.butler(config)#snmp-server enable traps dot1x auth-fail-vlan gues$ enable traps dot1x auth-fail-vlan guest         -vlan no-a
 << ps dot1x auth-fail-vlan guest-vlan no-a         uth-fail-uth-fail-vlan guest-vlan no-auth-fail-v         lan no-guvlan guest-vlan no-auth-fa
 << il-vlan no-gue         st-vlan
snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-auth-fail-vlan no-gu                         ^est-vlan

% Invalid input detected at '^' marker.

c29s1c.r104.butler(config)#snmp-server enable traps e
 << ntity
c29s1c.r104.butler(config)#snmp-server enable traps power-ethernet police
c29s1c.r104.butler(config)#snmp-server enable traps cpu threshold
c29s1c.r104.butler(config)#snmp-server enable traps rep
c29s1c.r104.butler(config)#snmp-server enable tra
 << ps bridge newroot topologych$ enable traps bridge newroot topologycha         nge
c29s1c.r104.butler(config)#snmp-server enable traps stpx inconsistency root-i
 << $ enable traps stpx inconsistency root-in         consistenaps stpx inconsistency root-inconsistenc         y loop-innconsist
 << ency root-inconsistency loop-inc         onsistenccy root-inconsistency loop-inconsistency         
c29s1c.r104.butler(config)#snmp-server enable traps syslog
c29s1c.r104.butler(config)#
 << snmp-server enable traps vtp
c29s1c.r104.butler(config)#snmp-server enable traps vlancreate
c29s1c.r104.butler(config)#snmp-server enable traps vlandelete
c29s1c.r104.butler(config)#snmp-server enable traps flash insertion removal
c29s1c.r104.butler(c
 << onfig)#snmp-server enable traps port-security
c29s1c.r104.butler(config)#snmp-server enable traps envmon fan shutdown suppl$ enable traps envmon fan shutdown supply          temperat
 << aps envmon fan shutdown supply temperatu         re status
c29s1c.r104.butler(config)#snmp-server enable traps errdisable
c29s1c.r104.butler(config)#snmp-server enable traps mac-notification change m
 << $ enable traps mac-notification change mo         ve threshaps mac-notification change move thresho         ld
c29s1c.r104.butler(config)#snmp-ser
 << ver enable traps vlan-membership
c29s1c.r104.butler(config)#snmp-server host 130.18.8.12 
% Incomplete command.

c29s1c.r104.butler(config)#line con 0
c29s1c.r104.butler(config-line)#line vty 0 15
c29s1c.r104.butler(config-line)# access-class 1 in

 << c29s1c.r104.butler(config-line)# password W2w1cD0mIliG!
c29s1c.r104.butler(config-line)# login local
c29s1c.r104.butler(config-line)# transport input ssh
c29s1c.r104.butler(config-line)#ntp server 10.92.0.5
c29s1c.r104.butler(config)#
c29s1c.r104.but
 << ler(config)#end
c29s1c.r104.butler#
 << 
*Jan  1 18:09:13: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1c.r104.butler#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1c.r104.butler(config)#
Expect: matched string 1: (config)#
 >> spanning-tree mode mst

 >> spanning-tree etherchannel guard misconfig

 >> spanning-tree mst configuration

 >>  name msstate

 >>  revision 1

 >>  instance 1 vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 63, 70

 >>  instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 160

 >>  instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 230, 232, 242, 246

 >>  instance 1 vlan 256, 611-612, 654, 741, 996, 999

 >>  instance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037, 2039-2040

 >>  instance 2 vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096, 2104, 2110, 2126

 >>  instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 2189, 2194, 2202

 >>  instance 2 vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 2654, 2999

 >>  instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176, 196

 >>  instance 3 vlan 244, 248, 927

 >>  instance 4 vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072, 2108, 2113, 2128

 >>  instance 4 vlan 2144, 2176, 2196, 2244, 2248, 2927

 >>  instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 228

 >>  instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216, 2228

 >>  instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116, 124

 >>  instance 7 vlan 172, 186, 192, 204-208, 210, 240-241, 251-252, 630, 928

 >>  instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082, 2084

 >>  instance 8 vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208, 2210

 >>  instance 8 vlan 2240-2241, 2251-2252, 2630, 2928

 >>  instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102, 112

 >>  instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 500, 505, 510-511

 >>  instance 9 vlan 522, 551-570, 603, 629, 633, 742, 802, 926, 929

 >>  instance 10 vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 2057, 2062, 2068

 >>  instance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148, 2158

 >>  instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522, 2603, 2629, 2633

 >>  instance 10 vlan 2802, 2926, 2929

 >>  instance 11 vlan 8, 43, 52, 146, 156-157, 180, 200, 218

 >>  instance 12 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180, 2200, 2218

 >> 

 >> end

Expect: searching for 1 strs:  :Configured
 << spanning-tree mode mst
c29s1c.r104.butler(config)#spanning-tree etherchannel guard misconfig
c29s1c.r104.butler(config)#spanning-tree mst configuration
c29s1c.r104.butler(config-mst)# name msstate
c29s1c.r104.butler(config-mst)# revision 1
c29s1c.r10
 << 4.butler(config-mst)# instance 1 vlan 2, 7, 11, 20, 22, 24, 31, 35,$ vlan 2, 7, 11, 20, 22, 24, 31, 35,          37, 39-40, 11, 20, 22, 24, 31, 35, 37, 39-
 << 40,          50, 60, 22, 24, 31, 35, 37, 39-40, 50, 60, 6         3, 70
c29s1c.r104.butler(config-mst)# instance 1 vlan 78, 80, 86, 91, 96, 104, 110,
 << $ vlan 78, 80, 86, 91, 96, 104, 110,          126, 136,80, 86, 91, 96, 104, 110, 126, 136,          140, 152,, 96, 104, 110, 126, 136, 140, 152
 << ,          160
c29s1c.r104.butler(config-mst)# instance 1 vlan 162-163, 168, 189, 194, 202, $ vlan 162-163, 168, 189, 194, 202, 2         20, 222, 
 << 163, 168, 189, 194, 202, 220, 222, 2         30, 232, 89, 194, 202, 220, 222, 230, 232, 2         42, 246
c29s1c.r104.butler(config-mst)# instance 1 vlan 256, 611-612, 654, 741, 996, 
 << $ vlan 256, 611-612, 654, 741, 996, 9         99
c29s1c.r104.butler(config-mst)# instance 2 vlan 2002, 2007, 2011, 2020, 2022,$ vlan 2002, 2007, 2011, 2020, 202
 << 2,          2024, 203, 2007, 2011, 2020, 2022, 2024, 2031         , 2035, 211, 2020, 2022, 2024, 2031, 2035, 20         37, 2039-
 << 2022, 2024, 2031, 2035, 2037, 2039-2         040
c29s1c.r104.butler(config-mst)# instance 2 vlan 2050, 2060, 2063, 2070, 2080,$ vlan 2050, 2060, 2063, 2070, 2080, 
 <<          2086, 209, 2060, 2063, 2070, 2080, 2086, 2096         , 2104, 263, 2070, 2080, 2086, 2096, 2104, 21         10, 2126
c29s1c.r104
 << .butler(config-mst)# instance 2 vlan 2136, 2140, 2152, 2160, 2162-$ vlan 2136, 2140, 2152, 2160, 2162-2         163, 2168, 2140, 2152, 2160, 2162-2163, 216
 << 8,          2189, 2152, 2160, 2162-2163, 2168, 2189, 219         4, 2202
c29s1c.r104.butler(config-mst)# instance 2 vlan 2220, 2222, 2232, 2242, 2246,
 << $ vlan 2220, 2222, 2232, 2242, 2246,          2611-2612, 2222, 2232, 2242, 2246, 2611-2612,          2654, 2932, 2242, 2246, 2611-2612, 2654, 
 << 299         9
c29s1c.r104.butler(config-mst)# instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 1$ vlan 42, 51, 59, 64, 66, 69, 72, 10         8, 113, 1
 << 51, 59, 64, 66, 69, 72, 108, 113, 12         8, 144, 1, 66, 69, 72, 108, 113, 128, 144, 17         6, 196
c29s1c.r104.butler(config-mst)# instance 3 vlan 244, 248, 927
c29s1c.r104.butler(co
 << nfig-mst)# instance 4 vlan 2042, 2051, 2059, 2064, 2066,$ vlan 2042, 2051, 2059, 2064, 2066,          2069, 207, 2051, 2059, 2064, 2066, 2069, 2072        
 <<  , 2108, 259, 2064, 2066, 2069, 2072, 2108, 21         13, 2128
c29s1c.r104.butler(config-mst)# instance 4 vlan 2144, 2176, 2196, 2244, 2248,$ vl
 << an 2144, 2176, 2196, 2244, 2248,          2927
c29s1c.r104.butler(config-mst)# instance 5 vlan 16, 48, 58, 88, 121, 131, 133$ vlan 16, 48, 58, 88, 121, 131, 133-         134, 216,
 << 48, 58, 88, 121, 131, 133-134, 216,          228
c29s1c.r104.butler(config-mst)# instance 6 vlan 2016, 2048, 2058, 2088, 2121,$ vlan 2016, 2048, 2058, 2088, 2121,   
 <<        2131, 213, 2048, 2058, 2088, 2121, 2131, 2133         -2134, 2258, 2088, 2121, 2131, 2133-2134, 221         6, 2228
c29s1c.r104.bu
 << tler(config-mst)# instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75,$ vlan 9, 33-34, 38, 54, 56, 71, 75,          82, 84, 93-34, 38, 54, 56, 71, 75, 82, 84, 97 
 <<         , 114, 1154, 56, 71, 75, 82, 84, 97, 114, 116         , 124
c29s1c.r104.butler(config-mst)# instance 7 vlan 172, 186, 192, 204-208, 210, 
 << $ vlan 172, 186, 192, 204-208, 210, 2         40-241, 2186, 192, 204-208, 210, 240-241, 25         1-252, 63204-208, 210, 240-241, 251-252, 630      
 <<    , 928
c29s1c.r104.butler(config-mst)# instance 8 vlan 2009, 2033-2034, 2038, 2054, $ vlan 2009, 2033-2034, 2038, 2054, 2         056, 2071, 20
 << 33-2034, 2038, 2054, 2056, 2071,          2075, 204, 2038, 2054, 2056, 2071, 2075, 208         2, 2084
c29s1c.r104.butler(config-mst)# instance 8 vlan 2097, 2114, 2116, 2124, 2172,
 << $ vlan 2097, 2114, 2116, 2124, 2172,          2186, 219, 2114, 2116, 2124, 2172, 2186, 2192         , 2204-2216,
 <<  2124, 2172, 2186, 2192, 2204-220         8, 2210
c29s1c.r104.butler(config-mst)# instance 8 vlan 2240-2241, 2251-2252, 2630, 2$ vlan 2240-2241, 2251-2252, 2630, 29         28
c29s1c.r104.b
 << utler(config-mst)# instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 6$ vlan 4-5, 12, 18-19, 32, 44, 57, 62         , 68, 76,12, 18-19, 32, 44, 57, 62, 68, 76,   
 <<        98-99, 10, 32, 44, 57, 62, 68, 76, 98-99, 102         , 112
c29s1c.r104.butler(config-mst)# instance 9 vlan 130, 132, 147-148, 158, 212, $
 <<  vlan 130, 132, 147-148, 158, 212, 2         26, 236, 132, 147-148, 158, 212, 226, 236, 5         00, 505, 148, 158, 212, 226, 236, 500, 505, 5     
 <<     10-511
c29s1c.r104.butler(config-mst)# instance 9 vlan 522, 551-570, 603, 629, 633, $ vlan 522, 551-570, 603, 629, 633, 7         42, 802, 551
 << -570, 603, 629, 633, 742, 802, 9         26, 929
c29s1c.r104.butler(config-mst)# instance 10 vlan 2004-2005, 2012, 2018-2019, $0 vlan 2004-2005, 2012, 2018-2019, 2         032, 2044
 << 4-2005, 2012, 2018-2019, 2032, 2044,          2057, 2012, 2018-2019, 2032, 2044, 2057, 206         2, 2068
c29s1c.r104.butler(config-mst)# instance 10 vlan
 <<  2076, 2098-2099, 2102, 2112,$0 vlan 2076, 2098-2099, 2102, 2112,          2130, 2136, 2098-2099, 2102, 2112, 2130, 2132         , 2147-21
 << 99, 2102, 2112, 2130, 2132, 2147-214         8, 2158
c29s1c.r104.butler(config-mst)# instance 10 vlan 2212, 2236, 2500, 2505, 2510$0 vlan 2212, 2236, 2500, 2505, 
 << 2510-         2511, 2522, 2236, 2500, 2505, 2510-2511, 2522         , 2603, 2500, 2505, 2510-2511, 2522, 2603, 26         29, 2633
c29s1c
 << .r104.butler(config-mst)# instance 10 vlan 2802, 2926, 2929
c29s1c.r104.butler(config-mst)# instance 11 vlan 8, 43, 52, 146, 156-157, 180$1 vlan 8, 43, 52, 146, 156-157, 180,          200, 218
c29s1
 << c.r104.butler(config-mst)# instance 12 vlan 2008, 2043, 2052, 2146, 2156$2 vlan 2008, 2043, 2052, 2146, 2156-         2157, 2188, 2043, 2052, 2146, 2156-21
 << 57, 2180         , 2200, 2052, 2146, 2156-2157, 2180, 2200, 22         18
c29s1c.r104.butler(config-mst)#
c29s1c.r104.butler(config-mst)#end
c29s1c.r104.butler#
 << 
*Jan  1 18:09:31: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1c.r104.butler#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1c.r104.butler(config)#
Expect: matched string 1: (config)#
 >> hostname c29s1c.r104.butler 

Expect: searching for 2 strs:  :# :>
 << hostname c29s1c.r104.butler 
c29s1c.r104.butler(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s1c.r104.butler#
 << 
*Jan  1 18:09:38: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1c.r104.butler#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1c.r104.butler(config)#
Expect: matched string 1: (config)#
 >> snmp-server contact  

Expect: searching for 1 strs:  :#
 << snmp-server contact  
% Incomplete command.

c29s1c.r104.butler(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s1c.r104.butler#
 << 
*Jan  1 18:09:44: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1c.r104.butler#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1c.r104.butler(config)#
Expect: matched string 1: (config)#
 >> interface vlan 92

Expect: searching for 1 strs:  :(config-if)#
 << interface vlan 92
c29s1c.r104.butler(config-if)#
Expect: matched string 1: (config-if)#
 >> ip address 10.92.6.35 255.255.0.0

 >> ip broadcast-address 10.92.255.255

 >> end

Expect: searching for 1 strs:  :Configured
 << ip address 10.92.6.35 255.255.0.0
c29s1c.r104.butler(config-if)#ip broadcast-address 10.92.255.255
c29s1c.r104.butler(config-if)#end
c29s1c.r104.butler#
 << 
*Jan  1 18:09:50: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1c.r104.butler#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1c.r104.butler(config)#
Expect: matched string 1: (config)#
 >> interface Vlan92

Expect: searching for 1 strs:  :(config-if)#
 << interface Vlan92
c29s1c.r104.butler(config-if)#
Expect: matched string 1: (config-if)#
 >> ip default-gateway 10.92.0.1

 >> end

Expect: searching for 1 strs:  :Configured
 << ip default-gateway 10.92.0.1
c29s1c.r104.butler(config)#end
c29s1c.r104.butler#
*Jan  1 18:09:56: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1c.r104.butler#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1c.r104.butler(config)#
Expect: matched string 1: (config)#
 >> ip dhcp snooping

Expect: searching for 1 strs:  :#
 << ip dhcp snooping
c29s1c.r104.butler(config)#
Expect: matched string 1: #
 >> ip dhcp snooping vlan 208

Expect: searching for 1 strs:  :#
 << ip dhcp snooping vlan 208
c29s1c.r104.butler(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s1c.r104.butler#
*Jan  1 18:10:03: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1c.r104.butler#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1c.r104.butler(config)#
Expect: matched string 1: (config)#
 >> default interface range fa0/1 - 8 

 >> interface range fa0/1 - 8 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range fa0/1 - 8 
c29s1c.r104.butler(config)#interface range fa0/1 - 8 
c29s1c.r104.butler(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport access vlan 208

 >> switchport mode access

 >> spanning-tree portfast

 >> switchport port-security maximum 2

 >> switchport port-security

 >> switchport port-security aging time 15

 >> switchport port-security violation protect

 >> switchport port-security aging type inactivity

 >> power inline never

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport access vlan 208
c29s1c.r104.butler(config-if-range)#switchport mode access
c29s1c.r104.butler(config-if-range)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, concentra
 << tors, switches, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast will be configured in 8 interfaces due to the range command 
 but will only have effect when the interfaces
 <<  are in a non-trunking mode.
c29s1c.r104.butler(config-if-range)#switchport port-security maximum 2
c29s1c.r104.butler(config-if-range)#switchport port-security
c29s1c.r104.butler(config-if-range)#switchport port-security aging time 15
c29s1c.r104.but
 << ler(config-if-range)#switchport port-security violation protec$port-security violation protect         
c29s1c.r104.butler(config-if-range)#switchport port-security aging type inact
 << $port-security aging type inacti         vity
c29s1c.r104.butler(config-if-range)#power inline never
                                     ^
% Invalid input detected at '^' marker.

c29s1c.r104.butler(config-if-range)#end
c
 << 29s1c.r104.butler#
 << 
*Jan  1 18:10:12: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1c.r104.butler#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1c.r104.butler(config)#
Expect: matched string 1: (config)#
 >> default interface range fa0/1 - 4 

 >> interface range fa0/1 - 4 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range fa0/1 - 4 
c29s1c.r104.butler(config)#interface range fa0/1 - 4 
c29s1c.r104.butler(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport access vlan 673

 >> switchport mode access

 >> spanning-tree portfast

 >> power inline never

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport access vlan 673
c29s1c.r104.butler(config-if-range)#switchport mode access
c29s1c.r104.butler(config-if-range)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, concentra
 << tors, switches, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast will be configured in 4 interfaces due to the range command 
 but will only have effect when the interfaces
 <<  are in a non-trunking mode.
c29s1c.r104.butler(config-if-range)#power inline never
                                     ^
% Invalid input detected at '^' marker.

c29s1c.r104.butler(config-if-range)#end
c29s1c.r104.butler#
 << 
*Jan  1 18:10:18: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1c.r104.butler#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1c.r104.butler(config)#
Expect: matched string 1: (config)#
 >> default interface fa0/5 

 >> interface fa0/5 

Expect: searching for 1 strs:  :(config-if)#
 << default interface fa0/5 
Interface FastEthernet0/5 set to default configuration
c29s1c.r104.butler(config)#interface fa0/5 
c29s1c.r104.butler(config-if)#
Expect: matched string 1: (config-if)#
 >> switchport access vlan 28

 >> switchport mode access

 >> spanning-tree portfast

 >> power inline never

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport access vlan 28
c29s1c.r104.butler(config-if)#switchport mode access
c29s1c.r104.butler(config-if)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, concentrators, switche
 << s, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast has been configured on FastEthernet0/5 but will only
 have effect when the interface is in a non-trunking mode.
c29s1c.
 << r104.butler(config-if)#power inline never
                               ^
% Invalid input detected at '^' marker.

c29s1c.r104.butler(config-if)#end
c29s1c.r104.butler#
 << 
*Jan  1 18:10:24: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1c.r104.butler#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1c.r104.butler(config)#
Expect: matched string 1: (config)#
 >> default interface fa0/8 

 >> interface fa0/8 

Expect: searching for 1 strs:  :(config-if)#
 << default interface fa0/8 
Interface FastEthernet0/8 set to default configuration
c29s1c.r104.butler(config)#interface fa0/8 
c29s1c.r104.butler(config-if)#
Expect: matched string 1: (config-if)#
 >> switchport access vlan 91

 >> switchport mode access

 >> spanning-tree portfast

 >> power inline never

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport access vlan 91
c29s1c.r104.butler(config-if)#switchport mode access
c29s1c.r104.butler(config-if)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, concentrators, switche
 << s, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast has been configured on FastEthernet0/8 but will only
 have effect when the interface is in a non-trunking mode.
c29s1c.
 << r104.butler(config-if)#power inline never
                               ^
% Invalid input detected at '^' marker.

c29s1c.r104.butler(config-if)#end
c29s1c.r104.butler#
 << 
*Jan  1 18:10:30: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1c.r104.butler#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1c.r104.butler(config)#
Expect: matched string 1: (config)#
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s1c.r104.butler#
 << 
*Jan  1 18:10:34: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1c.r104.butler#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1c.r104.butler(config)#
Expect: matched string 1: (config)#
 >> crypto key generate rsa

 >> no

 >> 2048

Expect: searching for 2 strs:  :OK :(config)#
 << crypto key generate rsa
% You already have RSA keys defined named c29s1c.r104.butler.mgmt.msstate.edu.
% Do you really want to replace them? [yes/no]: no
c29s1c.r104.butler(config)#2048
                           ^
% Invalid input detected at '^' mar
Expect: matched string 2: (config)#
 >> end

Expect: searching for 1 strs:  :Configured
 << ker.

c29s1c.r104.butler(config)#end
c29s1c.r104.butler#
 << 
*Jan  1 18:10:39: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> write mem

Expect: searching for 2 strs:  :# :>
 << 
c29s1c.r104.butler#write mem
Building configuration...
[OK]
c29s1c.r104.butler#
Expect: matched string 1: #
 >> 
Expect: searching for 2 strs:  :# :>
 << 
c29s1c.r104.butler#
c29s1c.r104.butler#
Expect: matched string 1: #
 >> sh run

Expect: searching for 2 strs:  :# :>
 << sh run
Building configuration...

Current configuration : 7209 bytes
!
! Last configuration change at 18:10:39 CST Sun Jan 1 2006
!
version 15.2
no service pad
service timestamps debug datetime localtime
service timestamps log datetime localtime
 << 
service password-encryption
!
hostname c29s1c.r104.butler
!
boot-start-marker
boot-end-marker
!
!
enable secret 5 $1$GOQH$KRu2c8YnoE0ixGJG8252Y/
enable password 7 10795B0E5414365B012D26220369
!
username root privilege 15 secret 5 $1$vJ05$zCC.
 << Gjv7IM9C18bR6Y0lC/
no aaa new-model
clock timezone CST -6 0
clock summer-time CDT recurring
system mtu routing 1500
!
!
!
ip dhcp snooping vlan 208
ip dhcp snooping
ip domain-name mgmt.msstate.edu
ip name-server 130.18.80.12
!
!
!
!
!
aut
 << hentication mac-move permit
!
!
crypto pki trustpoint TP-self-signed-2494998912
 enrollment selfsigned
 subject-name cn=IOS-Self-Signed-Certificate-2494998912
 revocation-check none
 rsakeypair TP-self-signed-2494998912
!
!
crypto pki certificat
 << e chain TP-self-signed-2494998912
 certificate self-signed 01
  	quit
!
spanning-tree mode mst
spanning-tree portfast edge bpduguard default
spanning-tree extend system-id
!
spanning-tree mst configuration
 name msstate
 revision 1
 instance 1 
 << vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 63, 70
 instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 160
 instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 230, 232, 242, 246
 instance 1 vlan 256, 611-612, 654, 741, 996,
 <<  999
 instance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037, 2039-2040
 instance 2 vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096, 2104, 2110, 2126
 instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 2189, 2194, 2202
 instance 2 vl
 << an 2220, 2222, 2232, 2242, 2246, 2611-2612, 2654, 2999
 instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176, 196
 instance 3 vlan 244, 248, 927
 instance 4 vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072, 2108, 2113, 2128
 instance 4 vla
 << n 2144, 2176, 2196, 2244, 2248, 2927
 instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 228
 instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216, 2228
 instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116, 124
 inst
 << ance 7 vlan 172, 186, 192, 204-208, 210, 240-241, 251-252, 630, 928
 instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082, 2084
 instance 8 vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208, 2210
 instance 8 vlan 2240-2241, 2251-2
 << 252, 2630, 2928
 instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102, 112
 instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 500, 505, 510-511
 instance 9 vlan 522, 551-570, 603, 629, 633, 742, 802, 926, 929
 instance 10 vlan 2004-
 << 2005, 2012, 2018-2019, 2032, 2044, 2057, 2062, 2068
 instance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148, 2158
 instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522, 2603, 2629, 2633
 instance 10 vlan 2802, 2926, 2929
 instance 11 
 << vlan 8, 43, 52, 146, 156-157, 180, 200, 218
 instance 12 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180, 2200, 2218
!
errdisable recovery cause udld
errdisable recovery cause bpduguard
errdisable recovery cause security-violation
errdisable recovery c
 << ause channel-misconfig
errdisable recovery cause pagp-flap
errdisable recovery cause dtp-flap
errdisable recovery cause link-flap
errdisable recovery cause sfp-config-mismatch
errdisable recovery cause gbic-invalid
errdisable recovery cause psecure-
 << violation
errdisable recovery cause port-mode-failure
errdisable recovery cause dhcp-rate-limit
errdisable recovery cause pppoe-ia-rate-limit
errdisable recovery cause mac-limit
errdisable recovery cause vmps
errdisable recovery cause storm-control
 << 
errdisable recovery cause inline-power
errdisable recovery cause arp-inspection
errdisable recovery cause loopback
errdisable recovery cause small-frame
errdisable recovery cause psp
errdisable recovery interval 1800
!
!
!
!
vlan internal alloc
 << ation policy ascending
!
lldp run
!
! 
!
!
!
!
!
!
!
!
!
interface FastEthernet0/1
 switchport access vlan 673
 switchport mode access
 spanning-tree portfast edge
!
interface FastEthernet0/2
 switchport access vlan 673
 switchport mo
 << de access
 spanning-tree portfast edge
!
interface FastEthernet0/3
 switchport access vlan 673
 switchport mode access
 spanning-tree portfast edge
!
interface FastEthernet0/4
 switchport access vlan 673
 switchport mode access
 spanning-tree p
 << ortfast edge
!
interface FastEthernet0/5
 switchport access vlan 28
 switchport mode access
 spanning-tree portfast edge
!
interface FastEthernet0/6
 switchport access vlan 208
 switchport mode access
 switchport port-security maximum 2
 switch
 << port port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast edge
!
interface FastEthernet0/7
 switchport access vlan 208
 switchport
 <<  mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 spanning-tree portfast edge
!
interface
 <<  FastEthernet0/8
 switchport access vlan 91
 switchport mode access
 spanning-tree portfast edge
!
interface GigabitEthernet0/1
 switchport trunk native vlan 92
 switchport mode trunk
 ip dhcp snooping trust
!
interface GigabitEthernet0/2
 swit
 << chport trunk native vlan 92
 switchport mode trunk
 ip dhcp snooping trust
!
interface Vlan1
 no ip address
 no ip route-cache
 shutdown
!
interface Vlan92
 ip address 10.92.6.35 255.255.0.0
 ip broadcast-address 10.92.255.255
!
ip default-ga
 << teway 10.92.0.1
ip http server
ip http secure-server
!
!
logging facility local1
logging host 130.18.8.12
access-list 1 permit 10.92.0.0 0.0.255.255
access-list 1 permit 130.18.8.0 0.0.0.255
access-list 1 permit 10.93.0.0 0.0.255.255
access-list
 <<  1 permit 130.18.1.0 0.0.0.255
snmp-server community sysnet RO 1
snmp-server community c2-b2=a2 RW 1
snmp-server enable traps snmp authentication linkdown linkup coldstart warmstart
snmp-server enable traps transceiver all
snmp-server enable traps tt
 << y
snmp-server enable traps cluster
snmp-server enable traps config-copy
snmp-server enable traps config
snmp-server enable traps config-ctid
snmp-server enable traps entity
snmp-server enable traps power-ethernet police
snmp-server enable traps cpu
 <<  threshold
snmp-server enable traps rep
snmp-server enable traps bridge newroot topologychange
snmp-server enable traps stpx inconsistency root-inconsistency loop-inconsistency
snmp-server enable traps syslog
snmp-server enable traps vtp
snmp-server
 <<  enable traps vlancreate
snmp-server enable traps vlandelete
snmp-server enable traps flash insertion removal
snmp-server enable traps port-security
snmp-server enable traps envmon fan shutdown supply temperature status
snmp-server enable traps errdi
 << sable
snmp-server enable traps mac-notification change move threshold
snmp-server enable traps vlan-membership
!
!
line con 0
line vty 0 4
 access-class 1 in
 password 7 0231564C5A052B71416705102256
 login local
 transport input ssh
line vty 5 
 << 15
 access-class 1 in
 password 7 0231564C5A052B71416705102256
 login local
 transport input ssh
!
ntp server 10.92.0.5
end

c29s1c.r104.butler#
Expect: matched string 1: #
