trying to use serial port: /dev/ttyUSB0
 >> 
 >> 

Expect: searching for 4 strs:  :[yes/no] :Press RETURN to get started. :# :Switch>
 << 
Switch>
Switch>
Switch>
Switch>
Expect: matched string 4: Switch>
 >> term len 0

Expect: searching for 2 strs:  :# :>
 << term len 0
Switch>
Expect: matched string 2: >
 >> show version

Expect: searching for 2 strs:  :# :>
 << show version
Cisco IOS Software, C2960S Software (C2960S-UNIVERSALK9-M), Version 15.0(2)SE8, RELEASE SOFTWARE (fc1)
Technical Support: http://www.cisco.com/techsupport
Copyright (c) 1986-2015 by Cisco Systems, Inc.
Compiled Wed 13-May-15 23:10 by prod
 << _rel_team

ROM: Bootstrap program is C2960S board boot loader
BOOTLDR: C2960S Boot Loader (C2960S-HBOOT-M) Version 12.2(55r)SE, RELEASE SOFTWARE (fc1)

Switch uptime is 22 hours, 37 minutes
System returned to ROM by power-on
System image file is "f
 << lash:/c2960s-universalk9-mz.150-2.SE8.bin"


This product contains cryptographic features and is subject to United
States and local country laws governing import, export, transfer and
use. Delivery of Cisco cryptographic products does not imply
thir
 << d-party authority to import, export, distribute or use encryption.
Importers, exporters, distributors and users are responsible for
compliance with U.S. and local country laws. By using this product you
agree to comply with applicable laws and regulati
 << ons. If you are unable
to comply with U.S. and local laws, return this product immediately.

A summary of U.S. laws governing Cisco cryptographic products may be found at:
http://www.cisco.com/wwl/export/crypto/tool/stqrg.html

If you require furthe
 << r assistance please contact us by sending email to
export@cisco.com.

cisco WS-C2960S-48TS-L (PowerPC) processor (revision J0) with 131072K bytes of memory.
Processor board ID FOC1720Z0JP
Last reset from power-on
1 Virtual Ethernet interface
1 Fast
 << Ethernet interface
52 Gigabit Ethernet interfaces
The password-recovery mechanism is enabled.

512K bytes of flash-simulated non-volatile configuration memory.
Base ethernet MAC Address       : D0:C7:89:AF:F7:00
Motherboard assembly number     : 73-
 << 11909-09
Power supply part number        : 341-0327-04
Motherboard serial number       : FOC17196Z8Q
Power supply serial number      : LIT17151Y3X
Model revision number           : J0
Motherboard revision number     : A0
Model number                
 <<     : WS-C2960S-48TS-L
Daughterboard assembly number   : 73-11933-04
Daughterboard serial number     : FOC17194Q3X
System serial number            : FOC1720Z0JP
Top Assembly Part Number        : 800-30950-06
Top Assembly Revision Number    : A0
Vers
 << ion ID                      : V06
CLEI Code Number                : COMGF00ARF
Daughterboard revision number   : A0
Hardware Board Revision Number  : 0x01


Switch Ports Model              SW Version            SW Image                 
------ ----
 << - -----              ----------            ----------               
*    1 52    WS-C2960S-48TS-L   15.0(2)SE8            C2960S-UNIVERSALK9-M     


Configuration register is 0xF

Switch>
Expect: matched string 2: >
 >> enable

Expect: searching for 2 strs:  :Password: :#
 << enable
Switch#
Expect: matched string 2: #
 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
Expect: matched string 1: (config)#
 >> no service pad

 >> service timestamps debug datetime localtime

 >> service timestamps log datetime localtime

 >> service password-encryption

 >> boot-start-marker

 >> boot-end-marker

 >> enable secret W2w1cD0mIliG!

 >> enable password W2w1cD0mIliG!

 >> username root privilege 15 secret W2w1cD0mIliG!

 >> no aaa new-model

 >> clock timezone CST -6

 >> clock summer-time CDT recurring

 >> authentication mac-move permit

 >> ip domain-name mgmt.msstate.edu

 >> ip name-server 130.18.80.12

 >> vtp domain vtp01.mgmt.msstate.edu

 >> vtp mode client

 >> crypto pki trustpoint TP-self-signed-2494998912

 >>  enrollment selfsigned

 >>  subject-name cn=IOS-Self-Signed-Certificate-2494998912

 >>  revocation-check none

 >>  rsakeypair TP-self-signed-2494998912

 >> crypto pki certificate chain TP-self-signed-2494998912

 >>  certificate self-signed 01 nvram:IOS-Self-Sig#3232.cer

 >> spanning-tree portfast bpduguard default

 >> spanning-tree extend system-id

 >> vlan internal allocation policy ascending

 >> lldp run

 >> errdisable recovery cause all

 >> errdisable recovery interval 1800

 >> interface FastEthernet0

 >>  no ip address

 >>  shutdown

 >> interface Vlan1

 >>  no ip address

 >>  no ip route-cache

 >>  shutdown

 >> interface Vlan92

 >> no ip http server

 >> no ip http secure-server

 >> ip sla enable reaction-alerts

 >> logging facility local1

 >> logging host 130.18.8.12

 >> access-list 1 permit 10.92.0.0 0.0.255.255

 >> access-list 1 permit 130.18.8.0 0.0.0.255

 >> access-list 1 permit 10.93.0.0 0.0.255.255

 >> access-list 1 permit 130.18.1.0 0.0.0.255

 >> snmp-server community sysnet RO 1

 >> snmp-server community c2-b2=a2 RW 1

 >> snmp-server enable traps snmp authentication linkdown linkup coldstart warmstart

 >> snmp-server enable traps transceiver all

 >> snmp-server enable traps tty

 >> snmp-server enable traps cluster

 >> snmp-server enable traps config-copy

 >> snmp-server enable traps config

 >> snmp-server enable traps config-ctid

 >> snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-auth-fail-vlan no-guest-vlan

 >> snmp-server enable traps entity

 >> snmp-server enable traps power-ethernet group 1

 >> snmp-server enable traps power-ethernet police

 >> snmp-server enable traps cpu threshold

 >> snmp-server enable traps rep

 >> snmp-server enable traps rtr

 >> snmp-server enable traps bridge newroot topologychange

 >> snmp-server enable traps stpx inconsistency root-inconsistency loop-inconsistency

 >> snmp-server enable traps syslog

 >> snmp-server enable traps vtp

 >> snmp-server enable traps vlancreate

 >> snmp-server enable traps vlandelete

 >> snmp-server enable traps flash insertion removal

 >> snmp-server enable traps port-security

 >> snmp-server enable traps envmon fan shutdown supply temperature status

 >> snmp-server enable traps errdisable

 >> snmp-server enable traps mac-notification change move threshold

 >> snmp-server enable traps vlan-membership

 >> snmp-server host 130.18.8.12 sysnet 

 >> line con 0

 >> line vty 0 15

 >>  access-class 1 in

 >>  password W2w1cD0mIliG!

 >>  login local

 >>  transport input ssh

 >> ntp clock-period 22519226

 >> ntp server 10.92.0.5

 >> 

 >> end

Expect: searching for 1 strs:  :Configured
 << no service pad
Switch(config)#service timestamps debug datetime localtime
Switch(config)#service timestamps log datetime localtime
Switch(config)#service password-encryption
Switch(config)#boot-start-marker
Switch(config)#boot-end-marker
Switch(conf
 << ig)#enable secret W2w1cD0mIliG!
Switch(config)#enable password W2w1cD0mIliG!
The enable password you have chosen is the same as your enable secret.
This is not recommended.  Re-enter the enable password.

Switch(config)#username root privilege 15 sec
 << ret W2w1cD0mIliG!
Switch(config)#no aaa new-model
Switch(config)#clock timezone CST -6
Switch(config)#clock summer-time CDT recurring
Switch(config)#authentication mac-move permit
Switch(config)#ip domain-name mgmt.msstate.edu
Switch(config)#ip name
 << -server 130.18.80.12
Switch(config)#vtp domain vtp01.mgmt.msstate.edu
Domain name already set to vtp01.mgmt.msstate.edu.
Switch(config)#vtp mode client
Device mode already VTP Client for VLANS.
Switch(config)#crypto pki trustpoint TP-self-signed-2494
 << 998912
Switch(ca-trustpoint)# enrollment selfsigned
Switch(ca-trustpoint)# subject-name cn=IOS-Self-Signed-Certificate-2494998912
Switch(ca-trustpoint)#
*Jan  2 16:39:56: %SYS-6-CLOCKUPDATE: System clock has been updated from 22:39:56 UTC Mon Jan 2 20
 << 06 to 16:39:56 CST Mon Jan 2 2006, configured from console by console.
*Jan  2 16:39:57: %SYS-6-CLOCKUPDATE: System clock has been updated from 16:39:57 CST Mon Jan 2 2006 to 16:39:57 CST Mon Jan 2 2006, configured from console by console. revocation-che
 << ck none
Switch(ca-trustpoint)# rsakeypair TP-self-signed-2494998912
Switch(ca-trustpoint)#crypto pki certificate chain TP-self-signed-2494998912
Switch(config-cert-chain)# certificate self-signed 01 nvram:IOS-Self-Sig#3232
 << $e self-signed 01 nvram:IOS-Self-Sig#3232.         cer
Switch(config-cert-chain)#spanning-tree portfast bpduguard default
Switch(config)#spanning-tree extend system-id
Switch(config)#vlan internal allocation policy ascendi
 << ng
Switch(config)#lldp run
Switch(config)#errdisable recovery cause all
Switch(config)#errdisable recovery interval 1800
Switch(config)#interface FastEthernet0
Switch(config-if)# no ip address
Switch(config-if)# shutdown
Switch(config-if)#interface
 <<  Vlan1
Switch(config-if)# no ip address
Switch(config-if)# no ip route-cache
Switch(config-if)# shutdown
Switch(config-if)#interface Vlan92
Switch(config-if)#no ip http server
Switch(config)#no ip http secure-server
Switch(config)#ip sla enable rea
 << ction-alerts
                      ^
% Invalid input detected at '^' marker.

Switch(config)#logging facility local1
Switch(config)#logging host 130.18.8.12
Switch(config)#
*Jan  2 16:40:02: %LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan92, c
 << hanged state to down
*Jan  2 16:40:03: %LINK-5-CHANGED: Interface FastEthernet0, changed state to administratively downaccess-list 1 permit 10.92.0.0 0.0.255.255
Switch(config)#access-list 1 permit 130.18.8.0 0.0.0.255
Switch(config)#access-list 1 perm
 << it 10.93.0.0 0.0.255.255
Switch(config)#access-list 1 permit 130.18.1.0 0.0.0.255
Switch(config)#snmp-server community sysnet RO 1

*Jan  2 16:40:04: %LINK-5-CHANGED: Interface Vlan1, changed state to administratively down
Switch(config)#snmp-server c
 << ommunity c2-b2=a2 RW 1
Switch(config)#snmp-server enable traps snmp authentication linkdown linkup c$ enable traps snmp authentication linkdown linkup co         ldstart w
 << aps snmp authentication linkdown linkup coldstart wa         rmstart
Switch(config)#snmp-server enable traps transceiver all
Switch(config)#snmp-server enable traps tty
Switch(config)#snmp-serve
 << r enab
*Jan  2 16:40:04: %SYS-6-LOGGINGHOST_STARTSTOP: Logging to host 130.18.8.12 port 514 started - CLI initiatedle traps cluster
Switch(config)#snmp-server enable traps config-copy
Switch(config)#snmp-server enable traps config
Switch(config)#snmp-
 << server enable traps config-ctid
Switch(config)#snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-au$ enable traps dot1x auth-fail-vlan guest-vlan no-aut         h-fail-vl
 << aps dot1x auth-fail-vlan guest-vlan no-auth-fail-vla         n no-guesuth-fail-vlan guest-vlan no-auth-fail-vlan no-guest       
 <<   -vlan
Switch(config)#snmp-server enable traps entity
Switch(config)#snmp-server enable traps power-ethernet group 1
Group 1 is not inline power capable.

Switch(config)#snmp-server enable traps power-ethernet police
Switch(config)#snmp-se
 << rver enable traps cpu threshold
Switch(config)#snmp-server enable traps rep
Switch(config)#snmp-server enable traps rtr
                                         ^
% Invalid input detected at '^' marker.

Switch(config)#snmp-server enable traps bridg
 << e newroot topologychange
Switch(config)#snmp-server enable traps stpx inconsistency root-inconsistency$ enable traps stpx inconsistency root-inconsistency          loop-inco
 << aps stpx inconsistency root-inconsistency loop-incon         sistency
Switch(config)#snmp-server enable traps syslog
Switch(config)#snmp-server enable traps vtp
Switch(config)#snmp-server enab
 << le traps vlancreate
Switch(config)#snmp-server enable traps vlandelete
Switch(config)#snmp-server enable traps flash insertion removal
Switch(config)#snmp-server enable traps port-security
Switch(config)#snmp-server enable traps envmon fan shutdown su
 << pply temperatur$ enable traps envmon fan shutdown supply temperature          status
Switch(config)#snmp-server enable traps errdisable
Switch(config)#snmp-server enable traps mac-no
 << tification change move threshol$ enable traps mac-notification change move threshold         
Switch(config)#snmp-server enable traps vlan-membership
Switch(config)#snmp-server host 
 << 130.18.8.12 sysnet 
Switch(config)#line con 0
Switch(config-line)#line vty 0 15
Switch(config-line)# access-class 1 in
Switch(config-line)# password W2w1cD0mIliG!
Switch(config-line)# login local
Switch(config-line)# transport input ssh
Switch(conf
 << ig-line)#ntp clock-period 22519226
%NTP: This configuration command is depreceated.
Switch(config)#ntp server 10.92.0.5
Switch(config)#
Switch(config)#end
Switch#
 << 
*Jan  2 16:40:13: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
Switch#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
Expect: matched string 1: (config)#
 >> spanning-tree mode mst

 >> spanning-tree etherchannel guard misconfig

 >> spanning-tree mst configuration

 >>  name msstate

 >>  revision 1

 >>  instance 1 vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 63, 70

 >>  instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 160

 >>  instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 230, 232, 242, 246

 >>  instance 1 vlan 256, 611-612, 654, 741, 996, 999

 >>  instance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037, 2039-2040

 >>  instance 2 vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096, 2104, 2110, 2126

 >>  instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 2189, 2194, 2202

 >>  instance 2 vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 2654, 2999

 >>  instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176, 196

 >>  instance 3 vlan 244, 248, 927

 >>  instance 4 vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072, 2108, 2113, 2128

 >>  instance 4 vlan 2144, 2176, 2196, 2244, 2248, 2927

 >>  instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 228

 >>  instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216, 2228

 >>  instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116, 124

 >>  instance 7 vlan 172, 186, 192, 204-208, 210, 240-241, 251-252, 630, 928

 >>  instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082, 2084

 >>  instance 8 vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208, 2210

 >>  instance 8 vlan 2240-2241, 2251-2252, 2630, 2928

 >>  instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102, 112

 >>  instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 500, 505, 510-511

 >>  instance 9 vlan 522, 551-570, 603, 629, 633, 742, 802, 926, 929

 >>  instance 10 vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 2057, 2062, 2068

 >>  instance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148, 2158

 >>  instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522, 2603, 2629, 2633

 >>  instance 10 vlan 2802, 2926, 2929

 >>  instance 11 vlan 8, 43, 52, 146, 156-157, 180, 200, 218

 >>  instance 12 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180, 2200, 2218

 >> 

 >> end

Expect: searching for 1 strs:  :Configured
 << spanning-tree mode mst
Switch(config)#spanning-tree etherchannel guard misconfig
Switch(config)#spanning-tree mst configuration
Switch(config-mst)# name msstate
Switch(config-mst)# revision 1
Switch(config-mst)# instance 1 vlan 2, 7, 11, 20, 22, 24, 
 << 31, 35, 37, 39-40, $ vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40, 5         0, 60, 63, 11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 
 << 63,          70
Switch(config-mst)# instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 1$ vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 14         0, 152, 1
 << 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 16         0
Switch(config-mst)# instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 23$ vlan 162-1
 << 63, 168, 189, 194, 202, 220, 222, 230         , 232, 24163, 168, 189, 194, 202, 220, 222, 230, 232, 242         , 246
Switch(config-mst)# instance 1 vlan 256, 611-612, 654, 741, 9
 << 96, 999
Switch(config-mst)# instance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031,$ vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031,          2035, 203
 << , 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037         , 2039-2011, 2020, 2022, 2024, 2031, 2035, 2037, 2039-204         0
Switch(config-mst)# instance 2 v
 << lan 2050, 2060, 2063, 2070, 2080, 2086, 2096,$ vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096,          2104, 211, 2060, 2063, 2070,
 <<  2080, 2086, 2096, 2104, 2110         , 2126
Switch(config-mst)# instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, $ vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 2         
 << 189, 2194, 2140, 2152, 2160, 2162-2163, 2168, 2189, 2194,          2202
Switch(config-mst)# instance 2 vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 
 << $ vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 2         654, 2999
Switch(config-mst)# instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128$ vlan 42, 51, 59, 64
 << , 66, 69, 72, 108, 113, 128,          144, 17651, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176,          196
Switch(config-mst)# instance 3 vlan 244, 248, 927
Switch(config-mst)# 
 << instance 4 vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072,$ vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072,          2108, 211, 2051,
 <<  2059, 2064, 2066, 2069, 2072, 2108, 2113         , 2128
Switch(config-mst)# instance 4 vlan 2144, 2176, 2196, 2244, 2248, 2927
Switch(config-mst)# instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 2
 << $ vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 22         8
Switch(config-mst)# instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-$ vlan 2016, 2048, 2058, 2088, 
 << 2121, 2131, 2133-2         134, 2216, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216,          2228
Switch(config-mst)# instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97,
 << $ vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97,          114, 116,3-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116,          1
 << 24
Switch(config-mst)# instance 7 vlan 172, 186, 192, 204-208, 210, 240-241, 251$ vlan 172, 186, 192, 204-208, 210, 240-241, 251-         252, 630,
 << 186, 192, 204-208, 210, 240-241, 251-252, 630,          928
Switch(config-mst)# instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, $ vlan 2009, 2033-2034, 2038, 2054
 << , 2056, 2071, 2         075, 2082, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082,          2084
Switch(config-mst)# instance 8 vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192,
 << $ vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192,          2204-2208, 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208,          221
 << 0
Switch(config-mst)# instance 8 vlan 2240-2241, 2251-2252, 2630, 2928
Switch(config-mst)# instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 9$ vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 
 << 98         -99, 102,12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102,          112
Switch(config-mst)# instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 50
 << $ vlan 130, 132, 147-148, 158, 212, 226, 236, 500         , 505, 51132, 147-148, 158, 212, 226, 236, 500, 505, 510         -511
Switch(config-mst
 << )# instance 9 vlan 522, 551-570, 603, 629, 633, 742, 802, 92$ vlan 522, 551-570, 603, 629, 633, 742, 802, 926         , 929
Switch(config-mst)# instance 10 vlan 2004-2005, 2012, 2018-2019
 << , 2032, 2044, $0 vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 2         057, 20624-2005, 2012, 2018-2019, 2032, 2044, 2057, 2062,  
 <<         2068
Switch(config-mst)# instance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132,$0 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132,          2147-2148
 << 6, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148,          2158
Switch(config-mst)# instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522,$0 vlan 221
 << 2, 2236, 2500, 2505, 2510-2511, 2522,          2603, 2622, 2236, 2500, 2505, 2510-2511, 2522, 2603, 2629         , 2633
Switch(config-mst)# instance 10 vlan 2802, 2926, 2929
Swit
 << ch(config-mst)# instance 11 vlan 8, 43, 52, 146, 156-157, 180, 200, 218
Switch(config-mst)# instance 12 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180,$2 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180
 << ,          2200, 2218, 2043, 2052, 2146, 2156-2157, 2180, 2200, 2218         
Switch(config-mst)#
Switch(config-mst)#end
Switch#
 << 
*Jan  2 16:40:29: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
Switch#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
Expect: matched string 1: (config)#
 >> hostname c29s3.r007n.scott 

Expect: searching for 2 strs:  :# :>
 << hostname c29s3.r007n.scott 
c29s3.r007n.scott(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s3.r007n.scott#
 << 
*Jan  2 16:40:35: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s3.r007n.scott#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s3.r007n.scott(config)#
Expect: matched string 1: (config)#
 >> snmp-server contact 6F-1720

Expect: searching for 1 strs:  :#
 << snmp-server contact 6F-1720
c29s3.r007n.scott(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s3.r007n.scott#
 << 
*Jan  2 16:40:41: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s3.r007n.scott#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s3.r007n.scott(config)#
Expect: matched string 1: (config)#
 >> interface vlan 92

Expect: searching for 1 strs:  :(config-if)#
 << interface vlan 92
c29s3.r007n.scott(config-if)#
Expect: matched string 1: (config-if)#
 >> ip address 10.92.6.36 255.255.0.0

 >> ip broadcast-address 10.92.255.255

 >> end

Expect: searching for 1 strs:  :Configured
 << ip address 10.92.6.36 255.255.0.0
c29s3.r007n.scott(config-if)#ip broadcast-address 10.92.255.255
c29s3.r007n.scott(config-if)#end
c29s3.r007n.scott#
 << 
*Jan  2 16:40:48: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s3.r007n.scott#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s3.r007n.scott(config)#
Expect: matched string 1: (config)#
 >> interface Vlan92

Expect: searching for 1 strs:  :(config-if)#
 << interface Vlan92
c29s3.r007n.scott(config-if)#
Expect: matched string 1: (config-if)#
 >> ip default-gateway 10.92.0.1

 >> end

Expect: searching for 1 strs:  :Configured
 << ip default-gateway 10.92.0.1
c29s3.r007n.scott(config)#end
c29s3.r007n.scott#
*Jan  2 16:40:54: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s3.r007n.scott#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s3.r007n.scott(config)#
Expect: matched string 1: (config)#
 >> ip dhcp snooping

Expect: searching for 1 strs:  :#
 << ip dhcp snooping
c29s3.r007n.scott(config)#
Expect: matched string 1: #
 >> ip dhcp snooping vlan 236

Expect: searching for 1 strs:  :#
 << ip dhcp snooping vlan 236
c29s3.r007n.scott(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s3.r007n.scott#
 << 
 << 
*Jan  2 16:41:01: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s3.r007n.scott#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s3.r007n.scott(config)#
Expect: matched string 1: (config)#
 >> default interface range gi1/0/1 - 48 

 >> interface range gi1/0/1 - 48 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi1/0/1 - 48 

 << c29s3.r007n.scott(config)#interface range gi1/0/1 - 48 
c29s3.r007n.scott(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport access vlan 236

 >> switchport mode access

 >> spanning-tree portfast

 >> switchport port-security maximum 2

 >> switchport port-security

 >> switchport port-security aging time 15

 >> switchport port-security violation protect

 >> switchport port-security aging type inactivity

 >> power inline never

 >> shutdown

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport access vlan 236
c29s3.r007n.scott(config-if-range)#switchport mode access
c29s3.r007n.scott(config-if-range)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, concentrato
 << rs, switches, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast will be configured in 48 interfaces due to the range command 
 but will only have effect when the interfaces 
 << are in a non-trunking mode.
c29s3.r007n.scott(config-if-range)#switchport port-security maximum 2
c29s3.r007n.scott(config-if-range)#switchport port-security
c29s3.r007n.scott(config-if-range)#switchport port-security aging time 15
c29s3.r007n.scott(c
 << onfig-if-range)#switchport port-security violation protect
c29s3.r007n.scott(config-if-range)#switchport port-security aging type inacti$port-security aging type inactiv         ity
c29s3.r007n.scott(co
 << nfig-if-range)#power inline never
                                    ^
% Invalid input detected at '^' marker.

c29s3.r007n.scott(config-if-range)#shutdown
c29s3.r007n.scott(config-if-range)#end
c29s3.r007n.scott#
 << 
*Jan  2 16:41:11: %SYS-5-CONFIG_I: Configured from console by console
*Jan  2 16:41:13: %LINK-5-CHANGED: Interface GigabitEthernet1/0/1, changed state to administratively down
*Jan  2 16:41:13: %LINK-5-CHANGED: Interface GigabitEthernet1/0/2, changed 
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << state to administratively down
*Jan  2 16:41:13: %LINK-5-CHANGED: Interface GigabitEthernet1/0/3, changed state to administratively down
*Jan  2 16:41:13: %LINK-5-CHANGED: Interface GigabitEthernet1/0/4, changed state to administratively down
*Jan  2 1
 << 6:41:13: %LINK-5-CHANGED: Interface GigabitEthernet1/0/5, changed state 
c29s3.r007n.scott#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s3.r007n.scott(config)#to administratively down
*Jan  2 16:41:13: %LINK-5-CH
Expect: matched string 1: (config)#
 >> default interface gi1/0/48 

 >> interface gi1/0/48 

Expect: searching for 1 strs:  :(config-if)#
 << ANGED: Interface GigabitEthernet1/0/6, changed state to administratively down
*Jan  2 16:41:13: %LINK-5-CHANGED: Interface GigabitEthernet1/0/7, changed state to administratively down
*Jan  2 16:41:13: %LINK-5-CHANGED: Interface GigabitEthernet1/0/8, ch
 << anged state to administratively down
*Jan  2 16:41:13: %LINK-5-CHANGED: Interface GigabitEthernet1/0/9, changed state to administratively down
*Jan  2 16:41:13: %LINK-5-CHANGED: Interface GigabitEtherdefault interface gi1/0/48 
Interface GigabitEtherne
 << t1/0/48 set to default configuration
c29s3.r007n.scott(config)#interface gi1/0/48 
c29s3.r007n.scott(config-if)#net1/0/10, changed state to administratively down
*Jan  2 16:41:13: %LINK-5-CHANGED: Interface GigabitEthernet1/0/11, changed state to admin
Expect: matched string 1: (config-if)#
 >> switchport mode trunk

 >> switchport trunk native vlan 92

 >> ip dhcp snooping trust

 >> no keepalive

 >> shutdown

 >> end

Expect: searching for 1 strs:  :Configured
 << istratively down
*Jan  2 16:41:13: %LINK-5-CHANGED: Interface GigabitEthernet1/0/12, changed state to administratively down
*Jan  2 16:41:13: %LINK-5-CHANGED: Interface GigabitEthernet1/0/13, changed state to administratively down
*Jan  2 16:41:13: %LI
 << NK-5-CHANGED: Interface GigabitEthernet1/0/14, changed state to administratively down
*Jan  2 16:41:13: %LINK-5-CHswitchport mode trunk
c29s3.r007n.scott(config-if)#switchport trunk native vlan 92
c29s3.r007n.scott(config-if)#ip dhcp snooping trust
c2
 << 9s3.r007n.scott(config-if)#no keepalive
c29s3.r007n.scott(config-if)#shutdown
c29s3.r007n.scott(config-if)#ANGED: Interface GigabitEthernet1/0/15, changed state to administratively down
*Jan  2 16:41:13: %LINK-5-CHANGED: Interface GigabitEthernet1/0/16
 << , changed state to administratively down
*Jan  2 16:41:13: %LINK-5-CHANGED: Interface GigabitEthernet1/0/17, changed state to administratively down
*Jan  2 16:41:13: %LINK-5-CHANGED: Interface GigabitEthernet1/0/18, changed state to administratively dow
 << n
*Jan  2 16:41:13: %LINK-5-CHANGED: Interface GigabitEthernet1/0/19, changed state to administratively downend
c29s3.r007n.scott#
*Jan  2 16:41:13: %LINK-5-CHANGED: Interface GigabitEthernet1/0/20, changed state to administratively down
*Jan  2 16:4
 << 1:13: %LINK-5-CHANGED: Interface GigabitEthernet1/0/21, changed state to administratively down
*Jan  2 16:41:13: %LINK-5-CHANGED: Interface GigabitEthernet1/0/22, changed state to administratively down
*Jan  2 16:41:13: %LINK-5-CHANGED: Interface Gigabi
 << tEthernet1/0/23, changed state to administratively down
*Jan  2 16:41:13: %LINK-5-CHANGED: Interface GigabitEthernet1/0/24, changed state to administratively down
*Jan  2 16:41:13: %LINK-5-CHANGED: Interface GigabitEthernet1/0/25, changed state to admin
 << istratively down
*Jan  2 16:41:13: %LINK-5-CHANGED: Interface GigabitEthernet1/0/26, changed state to administratively down
*Jan  2 16:41:13: %LINK-5-CHANGED: Interface GigabitEthernet1/0/27, changed state to administratively down
*Jan  2 16:41:13: %LI
 << NK-5-CHANGED: Interface GigabitEthernet1/0/28, changed state to administratively down
*Jan  2 16:41:13: %LINK-5-CHANGED: Interface GigabitEthernet1/0/29, changed state to administratively down
*Jan  2 16:41:13: %LINK-5-CHANGED: Interface GigabitEthernet
 << 1/0/30, changed state to administratively down
*Jan  2 16:41:13: %LINK-5-CHANGED: Interface GigabitEthernet1/0/31, changed state to administratively down
*Jan  2 16:41:13: %LINK-5-CHANGED: Interface GigabitEthernet1/0/32, changed state to administrative
 << ly down
*Jan  2 16:41:13: %LINK-5-CHANGED: Interface GigabitEthernet1/0/33, changed state to administratively down
*Jan  2 16:41:13: %LINK-5-CHANGED: Interface GigabitEthernet1/0/34, changed state to administratively down
*Jan  2 16:41:13: %LINK-5-CHAN
 << GED: Interface GigabitEthernet1/0/35, changed state to administratively down
*Jan  2 16:41:13: %LINK-5-CHANGED: Interface GigabitEthernet1/0/36, changed state to administratively down
*Jan  2 16:41:13: %LINK-5-CHANGED: Interface GigabitEthernet1/0/37, c
 << hanged state to administratively down
*Jan  2 16:41:13: %LINK-5-CHANGED: Interface GigabitEthernet1/0/38, changed state to administratively down
*Jan  2 16:41:13: %LINK-5-CHANGED: Interface GigabitEthernet1/0/39, changed state to administratively down

 << *Jan  2 16:41:13: %LINK-5-CHANGED: Interface GigabitEthernet1/0/40, changed state to administratively down
*Jan  2 16:41:13: %LINK-5-CHANGED: Interface GigabitEthernet1/0/41, changed state to administratively down
*Jan  2 16:41:13: %LINK-5-CHANGED: Inte
 << rface GigabitEthernet1/0/42, changed state to administratively down
*Jan  2 16:41:13: %LINK-5-CHANGED: Interface GigabitEthernet1/0/43, changed state to administratively down
*Jan  2 16:41:13: %LINK-5-CHANGED: Interface GigabitEthernet1/0/44, changed st
 << ate to administratively down
*Jan  2 16:41:13: %LINK-5-CHANGED: Interface GigabitEthernet1/0/45, changed state to administratively down
*Jan  2 16:41:13: %LINK-5-CHANGED: Interface GigabitEthernet1/0/46, changed state to administratively down
*Jan  2 1
 << 6:41:13: %LINK-5-CHANGED: Interface GigabitEthernet1/0/47, changed state to administratively down
*Jan  2 16:41:13: %LINK-5-CHANGED: Interface GigabitEthernet1/0/48, changed state to administratively down
*Jan  2 16:41:17: %SYS-5-CONFIG_I: Configured fr
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << om console by console
c29s3.r007n.scott#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s3.r007n.scott(config)#
Expect: matched string 1: (config)#
 >> default interface range gi1/0/49 - 52 

 >> interface range gi1/0/49 - 52 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi1/0/49 - 52 
c29s3.r007n.scott(config)#interface range gi1/0/49 - 52 
c29s3.r007n.scott(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport mode trunk

 >> switchport trunk native vlan 92

 >> ip dhcp snooping trust

 >> no keepalive

 >> shutdown

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport mode trunk
c29s3.r007n.scott(config-if-range)#switchport trunk native vlan 92
c29s3.r007n.scott(config-if-range)#ip dhcp snooping trust
c29s3.r007n.scott(config-if-range)#no keepalive
c29s3.r007n.scott(config-if-range)#shutdown
c29s3.r007n
 << .scott(config-if-range)#end
c29s3.r007n.scott#
 << 
*Jan  2 16:41:28: %SYS-5-CONFIG_I: Configured from console by console
*Jan  2 16:41:30: %LINK-5-CHANGED: Interface GigabitEthernet1/0/49, changed state to administratively down
*Jan  2 16:41:30: %LINK-5-CHANGED: Interface GigabitEthernet1/0/50, change
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << d state to administratively down
*Jan  2 16:41:30: %LINK-5-CHANGED: Interface GigabitEthernet1/0/51, changed state to administratively down
*Jan  2 16:41:30: %LINK-5-CHANGED: Interface GigabitEthernet1/0/52, changed state to administratively down
c29s3
 << .r007n.scott#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s3.r007n.scott(config)#
Expect: matched string 1: (config)#
 >> crypto key generate rsa

 >> no

 >> 2048

Expect: searching for 2 strs:  :OK :(config)#
 << crypto key generate rsa
The name for the keys will be: c29s3.r007n.scott.mgmt.msstate.edu
Choose the size of the key modulus in the range of 360 to 4096 for your
  General Purpose Keys. Choosing a key modulus greater than 512 may take
  a few minutes.
 << 

How many bits in the modulus [512]: no
% A decimal number between 360 and 4096.
How many bits in the modulus [512]: 2048
% Generating 2048 bit RSA keys, keys will be non-exportable...
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...
crypto key generate rsa
The name for the keys will be: c29s3.r007n.scott.mgmt.msstate.edu
Choose the size of the key modulus in the range of 360 to 4096 for your
  General Purpose Keys. Choosing a key modulus greater than 512 may take
  a few minutes.

How many bits in the modulus [512]: no
% A decimal number between 360 and 4096.
How many bits in the modulus [512]: 2048
% Generating 2048 bit RSA keys, keys will be non-exportable...
...

 >> end

Expect: searching for 1 strs:  :Configured
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...

...

 >> 

 >> write mem

Expect: searching for 2 strs:  :# :>
 << 
 << 
 << 
 << 
[OK] (elapsed time was 26 seconds)

c29s3.r007n.scott(config)#end
c29s3.r007n.scott#
c29s3.r007n.scott#write mem

Expect: matched string 1: #
 >> 
Expect: searching for 2 strs:  :# :>
 << Building configuration...

*Jan  2 16:41:59: %SSH-5-ENABLED: SSH 1.99 has been enabled
*Jan  2 16:41:59: %SYS-5-CONFIG_I: Configured from console by console[OK]
c29s3.r007n.scott#
c29s3.r007n.scott#
c29s3.r007n.scott#
Expect: matched string 1: #
 >> sh run

Expect: searching for 2 strs:  :# :>
 << sh run
Building configuration...

Current configuration : 21297 bytes
!
! Last configuration change at 16:41:59 CST Mon Jan 2 2006
!
version 15.0
no service pad
service timestamps debug datetime localtime
service timestamps log datetime localtim
 << e
service password-encryption
!
hostname c29s3.r007n.scott
!
boot-start-marker
boot-end-marker
!
enable secret 5 $1$j3No$7SjbOUymA2Zk53haUrVPS0
enable password 7 046C59115E22681E0430091E354A
!
username root privilege 15 secret 5 $1$bOkO$PWuqoJU
 << l21PJodL1xM8bx0
no aaa new-model
clock timezone CST -6 0
clock summer-time CDT recurring
switch 1 provision ws-c2960s-48ts-l
authentication mac-move permit
!
!
ip dhcp snooping vlan 236
ip dhcp snooping
ip domain-name mgmt.msstate.edu
ip name-s
 << erver 130.18.80.12
!
!
crypto pki trustpoint TP-self-signed-2494998912
 enrollment selfsigned
 subject-name cn=IOS-Self-Signed-Certificate-2494998912
 revocation-check none
 rsakeypair TP-self-signed-2494998912
!
!
crypto pki certificate chain T
 << P-self-signed-2494998912
 certificate self-signed 01
  	quit
!
spanning-tree mode mst
spanning-tree portfast bpduguard default
spanning-tree extend system-id
!
spanning-tree mst configuration
 name msstate
 revision 1
 instance 1 vlan 2, 7, 11,
 <<  20, 22, 24, 31, 35, 37, 39-40, 50, 60, 63, 70
 instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 160
 instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 230, 232, 242, 246
 instance 1 vlan 256, 611-612, 654, 741, 996, 999
 instanc
 << e 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037, 2039-2040
 instance 2 vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096, 2104, 2110, 2126
 instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 2189, 2194, 2202
 instance 2 vlan 2220, 2222,
 <<  2232, 2242, 2246, 2611-2612, 2654, 2999
 instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176, 196
 instance 3 vlan 244, 248, 927
 instance 4 vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072, 2108, 2113, 2128
 instance 4 vlan 2144, 2176, 
 << 2196, 2244, 2248, 2927
 instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 228
 instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216, 2228
 instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116, 124
 instance 7 vlan 17
 << 2, 186, 192, 204-208, 210, 240-241, 251-252, 630, 928
 instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082, 2084
 instance 8 vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208, 2210
 instance 8 vlan 2240-2241, 2251-2252, 2630, 292
 << 8
 instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102, 112
 instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 500, 505, 510-511
 instance 9 vlan 522, 551-570, 603, 629, 633, 742, 802, 926, 929
 instance 10 vlan 2004-2005, 2012, 20
 << 18-2019, 2032, 2044, 2057, 2062, 2068
 instance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148, 2158
 instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522, 2603, 2629, 2633
 instance 10 vlan 2802, 2926, 2929
 instance 11 vlan 8, 43, 52
 << , 146, 156-157, 180, 200, 218
 instance 12 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180, 2200, 2218
!
!
!
!
!
!
errdisable recovery cause udld
errdisable recovery cause bpduguard
errdisable recovery cause security-violation
errdisable recovery 
 << cause channel-misconfig (STP)
errdisable recovery cause pagp-flap
errdisable recovery cause dtp-flap
errdisable recovery cause link-flap
errdisable recovery cause sfp-config-mismatch
errdisable recovery cause gbic-invalid
errdisable recovery cause p
 << secure-violation
errdisable recovery cause port-mode-failure
errdisable recovery cause dhcp-rate-limit
errdisable recovery cause pppoe-ia-rate-limit
errdisable recovery cause mac-limit
errdisable recovery cause vmps
errdisable recovery cause storm-c
 << ontrol
errdisable recovery cause inline-power
errdisable recovery cause arp-inspection
errdisable recovery cause loopback
errdisable recovery cause small-frame
errdisable recovery cause psp
errdisable recovery interval 1800
!
!
!
!
vlan interna
 << l allocation policy ascending
!
lldp run
!
! 
!
!
!
!
!
!
!
!
interface FastEthernet0
 no ip address
 shutdown
!
interface GigabitEthernet1/0/1
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 s
 << witchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 shutdown
 spanning-tree portfast
!
interface GigabitEthernet1/0/2
 switchport access vlan 
 << 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 shutdown
 spanning-tree 
 << portfast
!
interface GigabitEthernet1/0/3
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging t
 << ype inactivity
 switchport port-security
 shutdown
 spanning-tree portfast
!
interface GigabitEthernet1/0/4
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 swit
 << chport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 shutdown
 spanning-tree portfast
!
interface GigabitEthernet1/0/5
 switchport access vlan 236
 switchport mode access
 switchport port-s
 << ecurity maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 shutdown
 spanning-tree portfast
!
interface GigabitEthernet1/0/6
 sw
 << itchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 shut
 << down
 spanning-tree portfast
!
interface GigabitEthernet1/0/7
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport 
 << port-security aging type inactivity
 switchport port-security
 shutdown
 spanning-tree portfast
!
interface GigabitEthernet1/0/8
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-security vio
 << lation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 shutdown
 spanning-tree portfast
!
interface GigabitEthernet1/0/9
 switchport access vlan 236
 switchport mode acces
 << s
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 shutdown
 spanning-tree portfast
!
interface Giga
 << bitEthernet1/0/10
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchpor
 << t port-security
 shutdown
 spanning-tree portfast
!
interface GigabitEthernet1/0/11
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security agin
 << g time 15
 switchport port-security aging type inactivity
 switchport port-security
 shutdown
 spanning-tree portfast
!
interface GigabitEthernet1/0/12
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 swit
 << chport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 shutdown
 spanning-tree portfast
!
interface GigabitEthernet1/0/13
 switchport access vlan 23
 << 6
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 shutdown
 spanning-tree po
 << rtfast
!
interface GigabitEthernet1/0/14
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging ty
 << pe inactivity
 switchport port-security
 shutdown
 spanning-tree portfast
!
interface GigabitEthernet1/0/15
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 swit
 << chport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 shutdown
 spanning-tree portfast
!
interface GigabitEthernet1/0/16
 switchport access vlan 236
 switchport mode access
 switchport port-
 << security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 shutdown
 spanning-tree portfast
!
interface GigabitEthernet1/0/17
 
 << switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 sh
 << utdown
 spanning-tree portfast
!
interface GigabitEthernet1/0/18
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchpo
 << rt port-security aging type inactivity
 switchport port-security
 shutdown
 spanning-tree portfast
!
interface GigabitEthernet1/0/19
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 <<  violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 shutdown
 spanning-tree portfast
!
interface GigabitEthernet1/0/20
 switchport access vlan 236
 switchport mode 
 << access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 shutdown
 spanning-tree portfast
!
interface
 <<  GigabitEthernet1/0/21
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 swit
 << chport port-security
 shutdown
 spanning-tree portfast
!
interface GigabitEthernet1/0/22
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security
 <<  aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 shutdown
 spanning-tree portfast
!
interface GigabitEthernet1/0/23
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2

 <<  switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 shutdown
 spanning-tree portfast
!
interface GigabitEthernet1/0/24
 switchport access vl
 << an 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 shutdown
 spanning-tr
 << ee portfast
!
interface GigabitEthernet1/0/25
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security agi
 << ng type inactivity
 switchport port-security
 shutdown
 spanning-tree portfast
!
interface GigabitEthernet1/0/26
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect

 <<  switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 shutdown
 spanning-tree portfast
!
interface GigabitEthernet1/0/27
 switchport access vlan 236
 switchport mode access
 switchport 
 << port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 shutdown
 spanning-tree portfast
!
interface GigabitEthernet1/0/
 << 28
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 << 
 shutdown
 spanning-tree portfast
!
interface GigabitEthernet1/0/29
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 swi
 << tchport port-security aging type inactivity
 switchport port-security
 shutdown
 spanning-tree portfast
!
interface GigabitEthernet1/0/30
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-sec
 << urity violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 shutdown
 spanning-tree portfast
!
interface GigabitEthernet1/0/31
 switchport access vlan 236
 switchport 
 << mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 shutdown
 spanning-tree portfast
!
inte
 << rface GigabitEthernet1/0/32
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity

 <<  switchport port-security
 shutdown
 spanning-tree portfast
!
interface GigabitEthernet1/0/33
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-sec
 << urity aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 shutdown
 spanning-tree portfast
!
interface GigabitEthernet1/0/34
 switchport access vlan 236
 switchport mode access
 switchport port-security maximu
 << m 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 shutdown
 spanning-tree portfast
!
interface GigabitEthernet1/0/35
 switchport acce
 << ss vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 shutdown
 spanni
 << ng-tree portfast
!
interface GigabitEthernet1/0/36
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-securit
 << y aging type inactivity
 switchport port-security
 shutdown
 spanning-tree portfast
!
interface GigabitEthernet1/0/37
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation prot
 << ect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 shutdown
 spanning-tree portfast
!
interface GigabitEthernet1/0/38
 switchport access vlan 236
 switchport mode access
 switch
 << port port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 shutdown
 spanning-tree portfast
!
interface GigabitEtherne
 << t1/0/39
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-sec
 << urity
 shutdown
 spanning-tree portfast
!
interface GigabitEthernet1/0/40
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 << 
 switchport port-security aging type inactivity
 switchport port-security
 shutdown
 spanning-tree portfast
!
interface GigabitEthernet1/0/41
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport por
 << t-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 shutdown
 spanning-tree portfast
!
interface GigabitEthernet1/0/42
 switchport access vlan 236
 switch
 << port mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 shutdown
 spanning-tree portfast
!
 << 
interface GigabitEthernet1/0/43
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactiv
 << ity
 switchport port-security
 shutdown
 spanning-tree portfast
!
interface GigabitEthernet1/0/44
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport por
 << t-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 shutdown
 spanning-tree portfast
!
interface GigabitEthernet1/0/45
 switchport access vlan 236
 switchport mode access
 switchport port-security m
 << aximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 shutdown
 spanning-tree portfast
!
interface GigabitEthernet1/0/46
 switchport
 <<  access vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 shutdown
 s
 << panning-tree portfast
!
interface GigabitEthernet1/0/47
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-se
 << curity aging type inactivity
 switchport port-security
 shutdown
 spanning-tree portfast
!
interface GigabitEthernet1/0/48
 switchport trunk native vlan 92
 switchport mode trunk
 shutdown
 no keepalive
 ip dhcp snooping trust
!
interface Giga
 << bitEthernet1/0/49
 switchport trunk native vlan 92
 switchport mode trunk
 shutdown
 ip dhcp snooping trust
!
interface GigabitEthernet1/0/50
 switchport trunk native vlan 92
 switchport mode trunk
 shutdown
 ip dhcp snooping trust
!
interface
 <<  GigabitEthernet1/0/51
 switchport trunk native vlan 92
 switchport mode trunk
 shutdown
 ip dhcp snooping trust
!
interface GigabitEthernet1/0/52
 switchport trunk native vlan 92
 switchport mode trunk
 shutdown
 ip dhcp snooping trust
!
inte
 << rface Vlan1
 no ip address
 no ip route-cache
 shutdown
!
interface Vlan92
 ip address 10.92.6.36 255.255.0.0
 ip broadcast-address 10.92.255.255
!
ip default-gateway 10.92.0.1
no ip http server
no ip http secure-server
!
logging facility loc
 << al1
logging host 130.18.8.12
access-list 1 permit 10.92.0.0 0.0.255.255
access-list 1 permit 130.18.8.0 0.0.0.255
access-list 1 permit 10.93.0.0 0.0.255.255
access-list 1 permit 130.18.1.0 0.0.0.255
!
snmp-server community sysnet RO 1
snmp-server 
 << community c2-b2=a2 RW 1
snmp-server contact 6F-1720
snmp-server enable traps snmp authentication linkdown linkup coldstart warmstart
snmp-server enable traps transceiver all
snmp-server enable traps tty
snmp-server enable traps cluster
snmp-server e
 << nable traps config-copy
snmp-server enable traps config
snmp-server enable traps config-ctid
snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-auth-fail-vlan no-guest-vlan
snmp-server enable traps entity
snmp-server enable traps power-ether
 << net police
snmp-server enable traps cpu threshold
snmp-server enable traps rep
snmp-server enable traps bridge newroot topologychange
snmp-server enable traps stpx inconsistency root-inconsistency loop-inconsistency
snmp-server enable traps vtp
snmp
 << -server enable traps vlancreate
snmp-server enable traps vlandelete
snmp-server enable traps flash insertion removal
snmp-server enable traps port-security
snmp-server enable traps envmon fan shutdown supply temperature status
snmp-server enable trap
 << s errdisable
snmp-server enable traps mac-notification change move threshold
snmp-server enable traps vlan-membership
snmp-server host 130.18.8.12 sysnet 
!
!
line con 0
line vty 0 4
 access-class 1 in
 password 7 0738735B1F0A3D551A3B0705236B
 l
 << ogin local
 transport input ssh
line vty 5 15
 access-class 1 in
 password 7 0738735B1F0A3D551A3B0705236B
 login local
 transport input ssh
!
ntp server 10.92.0.5
end

c29s3.r007n.scott#
Expect: matched string 1: #
 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s3.r007n.scott(config)#
Expect: matched string 1: (config)#
 >> no service pad

 >> service timestamps debug datetime localtime

 >> service timestamps log datetime localtime

 >> service password-encryption

 >> boot-start-marker

 >> boot-end-marker

 >> enable secret W2w1cD0mIliG!

 >> enable password W2w1cD0mIliG!

 >> username root privilege 15 secret W2w1cD0mIliG!

 >> no aaa new-model

 >> clock timezone CST -6

 >> clock summer-time CDT recurring

 >> authentication mac-move permit

 >> ip domain-name mgmt.msstate.edu

 >> ip name-server 130.18.80.12

 >> vtp domain vtp01.mgmt.msstate.edu

 >> vtp mode client

 >> crypto pki trustpoint TP-self-signed-2494998912

 >>  enrollment selfsigned

 >>  subject-name cn=IOS-Self-Signed-Certificate-2494998912

 >>  revocation-check none

 >>  rsakeypair TP-self-signed-2494998912

 >> crypto pki certificate chain TP-self-signed-2494998912

 >>  certificate self-signed 01 nvram:IOS-Self-Sig#3232.cer

 >> spanning-tree portfast bpduguard default

 >> spanning-tree extend system-id

 >> vlan internal allocation policy ascending

 >> lldp run

 >> errdisable recovery cause all

 >> errdisable recovery interval 1800

 >> interface FastEthernet0

 >>  no ip address

 >>  shutdown

 >> interface Vlan1

 >>  no ip address

 >>  no ip route-cache

 >>  shutdown

 >> interface Vlan92

 >> no ip http server

 >> no ip http secure-server

 >> ip sla enable reaction-alerts

 >> logging facility local1

 >> logging host 130.18.8.12

 >> access-list 1 permit 10.92.0.0 0.0.255.255

 >> access-list 1 permit 130.18.8.0 0.0.0.255

 >> access-list 1 permit 10.93.0.0 0.0.255.255

 >> access-list 1 permit 130.18.1.0 0.0.0.255

 >> snmp-server community sysnet RO 1

 >> snmp-server community c2-b2=a2 RW 1

 >> snmp-server enable traps snmp authentication linkdown linkup coldstart warmstart

 >> snmp-server enable traps transceiver all

 >> snmp-server enable traps tty

 >> snmp-server enable traps cluster

 >> snmp-server enable traps config-copy

 >> snmp-server enable traps config

 >> snmp-server enable traps config-ctid

 >> snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-auth-fail-vlan no-guest-vlan

 >> snmp-server enable traps entity

 >> snmp-server enable traps power-ethernet group 1

 >> snmp-server enable traps power-ethernet police

 >> snmp-server enable traps cpu threshold

 >> snmp-server enable traps rep

 >> snmp-server enable traps rtr

 >> snmp-server enable traps bridge newroot topologychange

 >> snmp-server enable traps stpx inconsistency root-inconsistency loop-inconsistency

 >> snmp-server enable traps syslog

 >> snmp-server enable traps vtp

 >> snmp-server enable traps vlancreate

 >> snmp-server enable traps vlandelete

 >> snmp-server enable traps flash insertion removal

 >> snmp-server enable traps port-security

 >> snmp-server enable traps envmon fan shutdown supply temperature status

 >> snmp-server enable traps errdisable

 >> snmp-server enable traps mac-notification change move threshold

 >> snmp-server enable traps vlan-membership

 >> snmp-server host 130.18.8.12 sysnet 

 >> line con 0

 >> line vty 0 15

 >>  access-class 1 in

 >>  password W2w1cD0mIliG!

 >>  login local

 >>  transport input ssh

 >> ntp clock-period 22519226

 >> ntp server 10.92.0.5

 >> 

 >> end

Expect: searching for 1 strs:  :Configured
 << no service pad
c29s3.r007n.scott(config)#service timestamps debug datetime localtime
c29s3.r007n.scott(config)#service timestamps log datetime localtime
c29s3.r007n.scott(config)#service password-encryption
c29s3.r007n.scott(config)#boot-start-marker
 << 
c29s3.r007n.scott(config)#boot-end-marker
c29s3.r007n.scott(config)#enable secret W2w1cD0mIliG!
The enable secret you have chosen is the same as your enable password.
This is not recommended.  Re-enter the enable secret.

c29s3.r007n.scott(config)#e
 << nable password W2w1cD0mIliG!
The enable password you have chosen is the same as your enable secret.
This is not recommended.  Re-enter the enable password.

c29s3.r007n.scott(config)#username root privilege 15 secret W2w1cD0mIliG!
c29s3.r007n.scott(c
 << onfig)#no aaa new-model
c29s3.r007n.scott(config)#clock timezone CST -6
c29s3.r007n.scott(config)#clock summer-time CDT recurring
c29s3.r007n.scott(config)#authentication mac-move permit
c29s3.r007n.scott(config)#ip domain-name mgmt.msstate.edu
c29s3
 << .r007n.scott(config)#ip name-server 130.18.80.12
c29s3.r007n.scott(config)#vtp domain vtp01.mgmt.msstate.edu
Domain name already set to vtp01.mgmt.msstate.edu.
c29s3.r007n.scott(config)#vtp mode client
Device mode already VTP Client for VLANS.
c29s3.
 << r007n.scott(config)#crypto pki trustpoint TP-self-signed-2494998912
c29s3.r007n.scott(ca-trustpoint)# enrollment selfsigned
c29s3.r007n.scott(ca-trustpoint)# subject-name cn=IOS-Self-Signed-Certificate$me cn=I
 << OS-Self-Signed-Certificate-         249499891Self-Signed-Certificate-2494998912         
c29s3.r007n.scott(ca-trustpoint)# revocation-check none
c29s3.r007n.scott(ca-trustpoint)# rsakeypair TP
 << -self-signed-2494998912
c29s3.r007n.scott(ca-trustpoint)#crypto pki certificate chain TP-self-signed-$certificate chain TP-self-signed-2         494998912
c29s3.r007n.scott(config-cert-chain)# certifi
 << cate self-signed 01 nvram:IOS-Se$e self-signed 01 nvram:IOS-Sel         f-Sig#323ned 01 nvram:IOS-Self-Sig#3232         .cer
c29s3.r007n.scott(config-cert-ch
 << ain)#spanning-tree portfast bpduguard default
c29s3.r007n.scott(config)#spanning-tree extend system-id
c29s3.r007n.scott(config)#vlan internal allocation policy ascending
c29s3.r007n.scott(config)#lldp run
c29s3.r007n.scott(config)#errdisable recovery
 <<  cause all
c29s3.r007n.scott(config)#errdisable recovery interval 1800
c29s3.r007n.scott(config)#interface FastEthernet0
c29s3.r007n.scott(config-if)# no ip address
c29s3.r007n.scott(config-if)# s
*Jan  2 16:46:20: % Multiple self signed certificates
 <<  in config
    certificate for trust point TP-self-signed-2494998912 ignored
hutdown
c29s3.r007n.scott(config-if)#interface Vlan1
c29s3.r007n.scott(config-if)# no ip address
c29s3.r007n.scott(config-if)# no ip route-cache
c29s3.r007n.scott(config-if
 << )# shutdown
c29s3.r007n.scott(config-if)#interface Vlan92
c29s3.r007n.scott(config-if)#no ip http server
c29s3.r007n.scott(config)#no ip http secure-server
c29s3.r007n.scott(config)#ip sla enable reaction-alerts
                                 ^
% 
 << Invalid input detected at '^' marker.

c29s3.r007n.scott(config)#logging facility local1
c29s3.r007n.scott(config)#logging host 130.18.8.12
c29s3.r007n.scott(config)#access-list 1 permit 10.92.0.0 0.0.255.255
c29s3.r007n.scott(config)#access-list 1 p
 << ermit 130.18.8.0 0.0.0.255
c29s3.r007n.scott(config)#access-list 1 permit 10.93.0.0 0.0.255.255
c29s3.r007n.scott(config)#access-list 1 permit 130.18.1.0 0.0.0.255
c29s3.r007n.scott(config)#snmp-server community sysnet RO 1
c29s3.r007n.scott(config)#s
 << nmp-server community c2-b2=a2 RW 1
c29s3.r007n.scott(config)#snmp-server enable traps snmp authentication linkdo$ enable traps snmp authentication linkdow         n linkup 
 << aps snmp authentication linkdown linkup c         oldstart uthentication linkdown linkup coldstart w         armstart
c29s3.r007n.scott(config)#snmp-server en
 << able traps transceiver all
c29s3.r007n.scott(config)#snmp-server enable traps tty
c29s3.r007n.scott(config)#snmp-server enable traps cluster
c29s3.r007n.scott(config)#snmp-server enable traps config-copy
c29s3.r007n.scott(config)#snmp-server enable tr
 << aps config
c29s3.r007n.scott(config)#snmp-server enable traps config-ctid
c29s3.r007n.scott(config)#snmp-server enable traps dot1x auth-fail-vlan guest$ enable traps dot1x auth-fail-vlan guest-         
 << vlan no-aaps dot1x auth-fail-vlan guest-vlan no-au         th-fail-vuth-fail-vlan guest-vlan no-auth-fail-vl         an no-gue
 << vlan guest-vlan no-auth-fail-vlan no-gues         t-vlan
c29s3.r007n.scott(config)#snmp-server enable traps entity
c29s3.r007n.scott(config)#snmp-server enable traps power-ethernet group 1
Group 1
 <<  is not inline power capable.

c29s3.r007n.scott(config)#snmp-server enable traps power-ethernet police
c29s3.r007n.scott(config)#snmp-server enable traps cpu threshold
c29s3.r007n.scott(config)#snmp-server enable traps rep
c29s3.r007n.scott(config)#
 << snmp-server enable traps rtr
                                                    ^
% Invalid input detected at '^' marker.

c29s3.r007n.scott(config)#snmp-server enable traps bridge newroot topologycha
 << $ enable traps bridge newroot topologychan         ge
c29s3.r007n.scott(config)#snmp-server enable traps stpx inconsistency root-in$ enable traps stpx inconsistency root-inc         on
 << sistencaps stpx inconsistency root-inconsistency          loop-incnconsistency root-inconsistency loop-inco         nsistency
c29s3.r007
 << n.scott(config)#snmp-server enable traps syslog
c29s3.r007n.scott(config)#snmp-server enable traps vtp
c29s3.r007n.scott(config)#snmp-server enable traps vlancreate
c29s3.r007n.scott(config)#snmp-server enable traps vlandelete
c29s3.r007n.scott(config
 << )#snmp-server enable traps flash insertion removal
c29s3.r007n.scott(config)#snmp-server enable traps port-security
c29s3.r007n.scott(config)#snmp-server enable traps envmon fan shutdown supply$ enable 
 << traps envmon fan shutdown supply          temperatuaps envmon fan shutdown supply temperatur         e status
c29s3.r007n.scott(config)#snmp-server enable traps errdisable
c29s3.r007n.s
 << cott(config)#snmp-server enable traps mac-notification change mo$ enable traps mac-notification change mov         e threshoaps mac-notification 
 << change move threshol         d
c29s3.r007n.scott(config)#snmp-server enable traps vlan-membership
c29s3.r007n.scott(config)#snmp-server host 130.18.8.12 sysnet 
c29s3.r007n.scott(config)#line con 0
c29s3.r007n.scott(config-line)#line vty 0 15
 << 
c29s3.r007n.scott(config-line)# access-class 1 in
c29s3.r007n.scott(config-line)# password W2w1cD0mIliG!
c29s3.r007n.scott(config-line)# login local
c29s3.r007n.scott(config-line)# transport input ssh
c29s3.r007n.scott(config-line)#ntp clock-period 
 << 22519226
%NTP: This configuration command is depreceated.
c29s3.r007n.scott(config)#ntp server 10.92.0.5
c29s3.r007n.scott(config)#
c29s3.r007n.scott(config)#end
c29s3.r007n.scott#
 << 
*Jan  2 16:46:33: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s3.r007n.scott#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s3.r007n.scott(config)#
Expect: matched string 1: (config)#
 >> spanning-tree mode mst

 >> spanning-tree etherchannel guard misconfig

 >> spanning-tree mst configuration

 >>  name msstate

 >>  revision 1

 >>  instance 1 vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 63, 70

 >>  instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 160

 >>  instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 230, 232, 242, 246

 >>  instance 1 vlan 256, 611-612, 654, 741, 996, 999

 >>  instance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037, 2039-2040

 >>  instance 2 vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096, 2104, 2110, 2126

 >>  instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 2189, 2194, 2202

 >>  instance 2 vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 2654, 2999

 >>  instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176, 196

 >>  instance 3 vlan 244, 248, 927

 >>  instance 4 vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072, 2108, 2113, 2128

 >>  instance 4 vlan 2144, 2176, 2196, 2244, 2248, 2927

 >>  instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 228

 >>  instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216, 2228

 >>  instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116, 124

 >>  instance 7 vlan 172, 186, 192, 204-208, 210, 240-241, 251-252, 630, 928

 >>  instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082, 2084

 >>  instance 8 vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208, 2210

 >>  instance 8 vlan 2240-2241, 2251-2252, 2630, 2928

 >>  instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102, 112

 >>  instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 500, 505, 510-511

 >>  instance 9 vlan 522, 551-570, 603, 629, 633, 742, 802, 926, 929

 >>  instance 10 vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 2057, 2062, 2068

 >>  instance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148, 2158

 >>  instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522, 2603, 2629, 2633

 >>  instance 10 vlan 2802, 2926, 2929

 >>  instance 11 vlan 8, 43, 52, 146, 156-157, 180, 200, 218

 >>  instance 12 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180, 2200, 2218

 >> 

 >> end

Expect: searching for 1 strs:  :Configured
 << spanning-tree mode mst
c29s3.r007n.scott(config)#spanning-tree etherchannel guard misconfig
c29s3.r007n.scott(config)#spanning-tree mst configuration
c29s3.r007n.scott(config-mst)# name msstate
c29s3.r007n.scott(config-mst)# revision 1
c29s3.r007n.sc
 << ott(config-mst)# instance 1 vlan 2, 7, 11, 20, 22, 24, 31, 35, $ vlan 2, 7, 11, 20, 22, 24, 31, 35, 3         7, 39-40,, 11, 20, 22, 24, 31, 35, 37, 39-4
 << 0,          50, 60, 622, 24, 31, 35, 37, 39-40, 50, 60, 63         , 70
c29s3.r007n.scott(config-mst)# instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 
 << $ vlan 78, 80, 86, 91, 96, 104, 110, 1         26, 136, 80, 86, 91, 96, 104, 110, 126, 136, 1         40, 152, , 96, 104, 110, 126, 136, 14
 << 0, 152, 1         60
c29s3.r007n.scott(config-mst)# instance 1 vlan 162-163, 168, 189, 194, 202, 2$ vlan 162-163, 168, 189, 194, 202, 22         0, 222, 2
 << 163, 168, 189, 194, 202, 220, 222, 23         0, 232, 289, 194, 202, 220, 222, 230, 232, 24         2, 246
c29s3.r007n.scott(config-mst)# instance 1 vlan 256, 611-612, 654, 741, 99
 << 6, 9$ vlan 256, 611-612, 654, 741, 996, 99         9
c29s3.r007n.scott(config-mst)# instance 2 vlan 2002, 2007, 2011, 2020, 2022, $ vlan 2002, 2007, 20
 << 11, 2020, 2022, 2         024, 2031, 2007, 2011, 2020, 2022, 2024, 2031,          2035, 2011, 2020, 2022, 2024, 2031, 2035, 203         
 << 7, 2039-22022, 2024, 2031, 2035, 2037, 2039-20         40
c29s3.r007n.scott(config-mst)# instance 2 vlan 2050, 2060, 2063, 2070, 2080, $ vlan 2050, 2060
 << , 2063, 2070, 2080, 2         086, 2096, 2060, 2063, 2070, 2080, 2086, 2096,          2104, 2163, 2070, 2080, 2086, 2096, 2104, 211         
 << 0, 2126
c29s3.r007n.scott(config-mst)# instance 2 vlan 2136, 2140, 2152, 2160, 2162-2$ vlan 2136, 2140, 2152, 2160, 2162-21         63, 2168,, 2140,
 <<  2152, 2160, 2162-2163, 2168,          2189, 21952, 2160, 2162-2163, 2168, 2189, 2194         , 2202
c29s3.r007n.scott(config-mst)# instance 2 vlan 2220, 2222, 2232, 2242, 2246, 
 << $ vlan 2220, 2222, 2232, 2242, 2246, 2         611-2612,, 2222, 2232, 2242, 2246, 2611-2612,          2654, 299
 << 32, 2242, 2246, 2611-2612, 2654, 2999         
c29s3.r007n.scott(config-mst)# instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 10$ vlan 42, 51, 59, 64, 66, 69, 72, 108         , 113, 12
 << 51, 59, 64, 66, 69, 72, 108, 113, 128         , 144, 17, 66, 69, 72, 108, 113, 128, 144, 176         , 196
c29s3.r007n.scott(config-mst)# instance 3 vla
 << n 244, 248, 927
c29s3.r007n.scott(config-mst)# instance 4 vlan 2042, 2051, 2059, 2064, 2066, $ vlan 2042, 2051, 2059, 2064, 2066, 2         069, 2072, 2
 << 051, 2059, 2064, 2066, 2069, 2072,          2108, 2159, 2064, 2066, 2069, 2072, 2108, 211         3, 2128
c29s3.r007n.scott(config-mst)# instance 4 vlan 2144, 2176, 2196, 2244, 2248, 
 << $ vlan 2144, 2176, 2196, 2244, 2248, 2         927
c29s3.r007n.scott(config-mst)# instance 5 vlan 16, 48, 58, 88, 121, 131, 133-$ vlan 16, 48, 58, 88, 121, 13
 << 1, 133-1         34, 216, 48, 58, 88, 121, 131, 133-134, 216, 2         28
c29s3.r007n.scott(config-mst)# instance 6 vlan 2016, 2048, 2058, 2088, 2121, 
 << $ vlan 2016, 2048, 2058, 2088, 2121, 2         131, 2133, 2048, 2058, 2088, 2121, 2131, 2133-         2134, 22158, 2088, 2121, 2131, 213
 << 3-2134, 2216         , 2228
c29s3.r007n.scott(config-mst)# instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, $ vlan 9, 33-34, 38, 54, 56, 71, 75, 8         2, 84, 97
 << 3-34, 38, 54, 56, 71, 75, 82, 84, 97,          114, 11654, 56, 71, 75, 82, 84, 97, 114, 116,          124
c29s3.r007n.scott(config-mst)# instance 7 vlan 172, 186, 192, 204-
 << 208, 210, 2$ vlan 172, 186, 192, 204-208, 210, 24         0-241, 25186, 192, 204-208, 210, 240-241, 251         -252, 630
 << 204-208, 210, 240-241, 251-252, 630,          928
c29s3.r007n.scott(config-mst)# instance 8 vlan 2009, 2033-2034, 2038, 2054, 2$ vlan 2009, 2033-2034, 2038, 2054, 20         
 << 56, 2071,, 2033-2034, 2038, 2054, 2056, 2071,          2075, 2084, 2038, 2054, 2056, 2071, 2075, 2082         , 2084
c29s3.r007n.scott(con
 << fig-mst)# instance 8 vlan 2097, 2114, 2116, 2124, 2172, $ vlan 2097, 2114, 2116, 2124, 2172, 2         186, 2192, 2114, 2116, 2124, 2172, 2186, 2192,    
 <<       2204-22016, 2124, 2172, 2186, 2192, 2204-2208         , 2210
c29s3.r007n.scott(config-mst)# instance 8 vlan 2240-2241, 2251-2252, 2630, 29
 << $ vlan 2240-2241, 2251-2252, 2630, 292         8
c29s3.r007n.scott(config-mst)# instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62$ vlan 4-5, 12, 18-19, 32, 44, 57, 62,          68, 76, 
 << 12, 18-19, 32, 44, 57, 62, 68, 76, 9         8-99, 102, 32, 44, 57, 62, 68, 76, 98-99, 102,          112
c29s3.r007n.scott(config-mst)# instance 9 vlan
 <<  130, 132, 147-148, 158, 212, 2$ vlan 130, 132, 147-148, 158, 212, 22         6, 236, 5132, 147-148, 158, 212, 226, 236, 50         0, 505, 5
 << 148, 158, 212, 226, 236, 500, 505, 51         0-511
c29s3.r007n.scott(config-mst)# instance 9 vlan 522, 551-570, 603, 629, 633, 7$ vlan 522, 551-570, 603, 6
 << 29, 633, 74         2, 802, 9551-570, 603, 629, 633, 742, 802, 92         6, 929
c29s3.r007n.scott(config-mst)# instance 10 vlan 2004-2005, 2012, 2018-2019, 2
 << $0 vlan 2004-2005, 2012, 2018-2019, 20         32, 2044,4-2005, 2012, 2018-2019, 2032, 2044,          2057, 20612, 2018-2019, 2032,
 <<  2044, 2057, 2062         , 2068
c29s3.r007n.scott(config-mst)# instance 10 vlan 2076, 2098-2099, 2102, 2112, $0 vlan 2076, 2098-2099, 2102, 2112, 2         130, 2132
 << 6, 2098-2099, 2102, 2112, 2130, 2132,          2147-21499, 2102, 2112, 2130, 2132, 2147-2148         , 2158
c29s3.r007n.scott(config-mst)# instance 10 vlan 2212, 2236,
 <<  2500, 2505, 2510-$0 vlan 2212, 2236, 2500, 2505, 2510-2         511, 25222, 2236, 2500, 2505, 2510-2511, 2522,          2603, 26
 << 500, 2505, 2510-2511, 2522, 2603, 262         9, 2633
c29s3.r007n.scott(config-mst)# instance 10 vlan 2802, 2926, 2929
c29s3.r007n.scott(config-mst)# instance 11 vlan 8, 43, 52, 146, 156-157, 180,
 << $1 vlan 8, 43, 52, 146, 156-157, 180,          200, 218
c29s3.r007n.scott(config-mst)# instance 12 vlan 2008, 2043, 2052, 2146, 2156-$2 vlan 2008, 2043, 2052, 2146, 215
 << 6-2         157, 21808, 2043, 2052, 2146, 2156-2157, 2180,          2200, 22052, 2146, 2156-2157, 2180, 2200, 221         8
c29s3.r007n
 << .scott(config-mst)#
c29s3.r007n.scott(config-mst)#end
c29s3.r007n.scott#
 << 
*Jan  2 16:46:51: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s3.r007n.scott#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s3.r007n.scott(config)#
Expect: matched string 1: (config)#
 >> hostname c29s3.r007n.scott 

Expect: searching for 2 strs:  :# :>
 << hostname c29s3.r007n.scott 
c29s3.r007n.scott(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s3.r007n.scott#
 << 
*Jan  2 16:46:57: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s3.r007n.scott#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s3.r007n.scott(config)#
Expect: matched string 1: (config)#
 >> snmp-server contact 6F-1720

Expect: searching for 1 strs:  :#
 << snmp-server contact 6F-1720
c29s3.r007n.scott(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s3.r007n.scott#
 << 
*Jan  2 16:47:03: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s3.r007n.scott#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s3.r007n.scott(config)#
Expect: matched string 1: (config)#
 >> interface vlan 92

Expect: searching for 1 strs:  :(config-if)#
 << interface vlan 92
c29s3.r007n.scott(config-if)#
Expect: matched string 1: (config-if)#
 >> ip address 10.92.6.36 255.255.0.0

 >> ip broadcast-address 10.92.255.255

 >> end

Expect: searching for 1 strs:  :Configured
 << ip address 10.92.6.36 255.255.0.0
c29s3.r007n.scott(config-if)#ip broadcast-address 10.92.255.255
c29s3.r007n.scott(config-if)#end
c29s3.r007n.scott#
 << 
*Jan  2 16:47:10: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s3.r007n.scott#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s3.r007n.scott(config)#
Expect: matched string 1: (config)#
 >> interface Vlan92

Expect: searching for 1 strs:  :(config-if)#
 << interface Vlan92
c29s3.r007n.scott(config-if)#
Expect: matched string 1: (config-if)#
 >> ip default-gateway 10.92.0.1

 >> end

Expect: searching for 1 strs:  :Configured
 << ip default-gateway 10.92.0.1
c29s3.r007n.scott(config)#end
c29s3.r007n.scott#
*Jan  2 16:47:16: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s3.r007n.scott#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s3.r007n.scott(config)#
Expect: matched string 1: (config)#
 >> ip dhcp snooping

Expect: searching for 1 strs:  :#
 << ip dhcp snooping
c29s3.r007n.scott(config)#
Expect: matched string 1: #
 >> ip dhcp snooping vlan 236

Expect: searching for 1 strs:  :#
 << ip dhcp snooping vlan 236
c29s3.r007n.scott(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s3.r007n.scott#
*Jan  2 16:47:23: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s3.r007n.scott#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s3.r007n.scott(config)#
Expect: matched string 1: (config)#
 >> default interface range gi1/0/1 - 48 

 >> interface range gi1/0/1 - 48 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi1/0/1 - 48 

 << c29s3.r007n.scott(config)#interface range gi1/0/1 - 48 
c29s3.r007n.scott(config-if-range)#
*Jan  2 16:47:29: %LINK-3-UPDOWN: Interface GigabitEthernet1/0/1, changed state to down
*Jan  2 16:47:29: %LINK-3-UPDOWN: Interface GigabitEthernet1/0/2, change
Expect: matched string 1: (config-if-range)#
 >> switchport access vlan 236

 >> switchport mode access

 >> spanning-tree portfast

 >> switchport port-security maximum 2

 >> switchport port-security

 >> switchport port-security aging time 15

 >> switchport port-security violation protect

 >> switchport port-security aging type inactivity

 >> power inline never

 >> shutdown

 >> end

Expect: searching for 1 strs:  :Configured
 << d state to down
*Jan  2 16:47:29: %LINK-3-UPDOWN: Interface GigabitEthernet1/0/3, changed state to down
*Jan  2 16:47:30: %LINK-3-UPDOWN: Interface GigabitEthernet1/0/4, changed state to down
*Jan  2 16:47:30: %LINK-3-UPDOWN: Interface GigabitEthernet1
 << /0/5, changed state to down
*Jan  2 16:47:30: %LINK-3-UPDOWN: Interface GigabitEthernet1/0/6switchport access vlan 236
c29s3.r007n.scott(config-if-range)#switchport mode access
c29s3.r007n.scott(config-if-range)#spanning-tree portfast
%Warning: portfa
 << st should only be enabled on ports connected to a single
 host. Connecting hubs, concentrators, switches, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast will be configure
 << d in 48 interfaces due to the range command 
 but will only have effect when the interfaces are in a non-trunking mode.
c29s3.r007n.scott(config-if-range)#switchport port-security maximum 2
c29s3.r007n.scott(config-if-range)#, changed state to down
*J
 << an  2 16:47:30: %LINK-3-UPDOWN: Interface GigabitEthernet1/0/7, changed state to down
*Jan  2 16:47:30: %LINK-3-UPDOWN: Interface GigabitEthernet1/0/8, changed state to down
*Jan  2 16:47:30: %LINK-3-UPDOWN: Inswitchport port-security
c29s3.r007n.scott
 << (config-if-range)#switchport port-security aging time 15
c29s3.r007n.scott(config-if-range)#switchport port-security violation protect
terface GigabitEthernet1/0/9, changed state to down
*Jan  2 16:47:30: %LINK-3-UPDOWN: Interface GigabitEthernet1/0/10,
 <<  changed state to down
*Jan  2 16:47:30: %LINK-3-UPDOWN: Interface GigabitEthernet1/0/11, changed state to down
*Jan  2 16:47:30: %LINK-3-UPDOWN: Interface GigabitEthernet1/0/12, changed state to down
*Jan  2 16:47:30: %LINK-3-UPDOWN: Interface Gigabit
 << Ethernet1/0/13, changed state to down
*Jan  2 16:47:30: %LINK-3-UPDOWN: Interface GigabitEthernet1/0/14, changed state to down
c29s3.r007n.scott(config-if-range)#switchport port-security aging type inacti$port-s
 << ecurity aging type inactiv         ity
c29s3.r007n.scott(config-if-range)#power inline never
                                    ^
% Invalid input detected at '^' marker.

c29s3.r007n.scott(config-if-range)#shutdown

*Jan  2 16:47:30: %LINK
 << -3-UPDOWN: Interface GigabitEthernet1/0/15, changed state to down
*Jan  2 16:47:30: %LINK-3-UPDOWN: Interface GigabitEthernet1/0/16, changed state to down
*Jan  2 16:47:30: %LINK-3-UPDOWN: Interface GigabitEthernet1/0/17, changed state to down
*Jan  2 
 << 16:47:30: %LINK-3-UPDOWN: Interface GigabitEthernet1/0/18, changed state to down
*Jan  2 16:47:30: %LINK-3-UPDOWN: Interface GigabitEthernet1/0/19, changed state to down
*Jan  2 16:47:
c29s3.r007n.scott(config-if-range)#end
c29s3.r007n.scott#30: %LINK
 << -3-UPDOWN: Interface GigabitEthernet1/0/20, changed state to down
*Jan  2 16:47:30: %LINK-3-UPDOWN: Interface GigabitEthernet1/0/21, changed state to down
*Jan  2 16:47:30: %LINK-3-UPDOWN: Interface GigabitEthernet1/0/22, changed state to down
*Jan  2 
 << 16:47:30: %LINK-3-UPDOWN: Interface GigabitEthernet1/0/23, changed state to down
*Jan  2 16:47:30: %LINK-3-UPDOWN: Interface GigabitEthernet1/0/24, changed state to down
*Jan  2 16:47:31: %LINK-3-UPDOWN: Interface GigabitEthernet1/0/25, changed state to
 <<  down
*Jan  2 16:47:31: %LINK-3-UPDOWN: Interface GigabitEthernet1/0/26, changed state to down
*Jan  2 16:47:31: %LINK-3-UPDOWN: Interface GigabitEthernet1/0/27, changed state to down
*Jan  2 16:47:31: %LINK-3-UPDOWN: Interface GigabitEthernet1/0/28, c
 << hanged state to down
*Jan  2 16:47:31: %LINK-3-UPDOWN: Interface GigabitEthernet1/0/29, changed state to down
*Jan  2 16:47:31: %LINK-3-UPDOWN: Interface GigabitEthernet1/0/30, changed state to down
*Jan  2 16:47:31: %LINK-3-UPDOWN: Interface GigabitEt
 << hernet1/0/31, changed state to down
*Jan  2 16:47:31: %LINK-3-UPDOWN: Interface GigabitEthernet1/0/32, changed state to down
*Jan  2 16:47:31: %LINK-3-UPDOWN: Interface GigabitEthernet1/0/33, changed state to down
*Jan  2 16:47:31: %LINK-3-UPDOWN: Inte
 << rface GigabitEthernet1/0/34, changed state to down
*Jan  2 16:47:31: %LINK-3-UPDOWN: Interface GigabitEthernet1/0/35, changed state to down
*Jan  2 16:47:31: %LINK-3-UPDOWN: Interface GigabitEthernet1/0/36, changed state to down
*Jan  2 16:47:31: %LINK
 << -3-UPDOWN: Interface GigabitEthernet1/0/37, changed state to down
*Jan  2 16:47:31: %LINK-3-UPDOWN: Interface GigabitEthernet1/0/38, changed state to down
*Jan  2 16:47:31: %LINK-3-UPDOWN: Interface GigabitEthernet1/0/39, changed state to down
*Jan  2 
 << 16:47:31: %LINK-3-UPDOWN: Interface GigabitEthernet1/0/40, changed state to down
*Jan  2 16:47:31: %LINK-3-UPDOWN: Interface GigabitEthernet1/0/41, changed state to down
*Jan  2 16:47:31: %LINK-3-UPDOWN: Interface GigabitEthernet1/0/42, changed state to
 <<  down
*Jan  2 16:47:31: %LINK-3-UPDOWN: Interface GigabitEthernet1/0/43, changed state to down
*Jan  2 16:47:31: %LINK-3-UPDOWN: Interface GigabitEthernet1/0/44, changed state to down
*Jan  2 16:47:31: %LINK-3-UPDOWN: Interface GigabitEthernet1/0/45, c
 << hanged state to down
*Jan  2 16:47:32: %LINK-3-UPDOWN: Interface GigabitEthernet1/0/46, changed state to down
*Jan  2 16:47:32: %LINK-3-UPDOWN: Interface GigabitEthernet1/0/47, changed state to down
*Jan  2 16:47:32: %LINK-3-UPDOWN: Interface GigabitEt
 << hernet1/0/48, changed state to down
*Jan  2 16:47:33: %SYS-5-CONFIG_I: Configured from console by console
*Jan  2 16:47:35: %LINK-5-CHANGED: Interface GigabitEthernet1/0/1, changed state to administratively down
*Jan  2 16:47:35: %LINK-5-CHANGED: Inter
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << face GigabitEthernet1/0/2, changed state to administratively down
*Jan  2 16:47:35: %LINK-5-CHANGED: Interface GigabitEthernet1/0/3, changed state to administratively down
*Jan  2 16:47:35: %LINK-5-CHANGED: Interface GigabitEthernet1/0/4, changed sta
c
 << 29s3.r007n.scott#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s3.r007n.scott(config)#te to administratively down
*Jan  2 16:47:35: %LINK-5-CHANGED: Interface GigabitEthernet1/0/5, changed state to administratively
Expect: matched string 1: (config)#
 >> default interface gi1/0/48 

 >> interface gi1/0/48 

Expect: searching for 1 strs:  :(config-if)#
 <<  down
*Jan  2 16:47:35: %LINK-5-CHANGED: Interface GigabitEthernet1/0/6, changed state to administratively down
*Jan  2 16:47:35: %LINK-5-CHANGED: Interface GigabitEthernet1/0/7, changed state to administratively down
*Jan  2 16:47:35: %LINK-5-CHANGED:
 <<  Interface GigabitEthernet1/0/8, changed state to administratively down
*Jan  2 16:47:35: %LINK-5-CHANGED: Interface GigabitEtdefault interface gi1/0/48 
Interface GigabitEthernet1/0/48 set to default configuration
c29s3.r007n.scott(config)#interface g
 << i1/0/48 
c29s3.r007n.scott(config-if)#hernet1/0/9, changed state to administratively down
*Jan  2 16:47:35: %LINK-5-CHANGED: Interface GigabitEthernet1/0/10, changed state to administratively down
*Jan  2 16:47:35: %LINK-5-CHANGED: Interface GigabitEth
Expect: matched string 1: (config-if)#
 >> switchport mode trunk

 >> switchport trunk native vlan 92

 >> ip dhcp snooping trust

 >> no keepalive

 >> shutdown

 >> end

Expect: searching for 1 strs:  :Configured
 << ernet1/0/11, changed state to administratively down
*Jan  2 16:47:35: %LINK-5-CHANGED: Interface GigabitEthernet1/0/12, changed state to administratively down
*Jan  2 16:47:35: %LINK-5-CHANGED: Interface GigabitEthernet1/0/13, changed state to administr
 << atively down
*Jan  2 16:47:35: %LINK-5-switchport mode trunk
c29s3.r007n.scott(config-if)#switchport trunk native vlan 92
c29s3.r007n.scott(config-if)#ip dhcp snooping trust
c29s3.r007n.scott(config-if)#no keepalive
c29s3.r007n.scott(config-if)#CHANG
 << ED: Interface GigabitEthernet1/0/14, changed state to administratively down
*Jan  2 16:47:35: %LINK-5-CHANGED: Interface GigabitEthernet1/0/15, changed state to administratively down
*Jan  2 16:47:35: %LINK-5-CHANGED: Interface GigabitEthernet1/0/16, ch
 << anged state to administratively down
*Jan  2 16:47:35: %LINK-5-CHANGED: Interface GigabitEthernet1/0/17, changed state to administratively down
*Jan  2 16:47:35: %LINK-5-CHANGED: Interface GigabitEthernet1/0/18, changed state to administratively dowshut
 << down
c29s3.r007n.scott(config-if)#end
c29s3.r007n.scott#n
*Jan  2 16:47:35: %LINK-5-CHANGED: Interface GigabitEthernet1/0/19, changed state to administratively down
*Jan  2 16:47:35: %LINK-5-CHANGED: Interface GigabitEthernet1/0/20, changed state to a
 << dministratively down
*Jan  2 16:47:35: %LINK-5-CHANGED: Interface GigabitEthernet1/0/21, changed state to administratively down
*Jan  2 16:47:35: %LINK-5-CHANGED: Interface GigabitEthernet1/0/22, changed state to administratively down
*Jan  2 16:47:35:
 <<  %LINK-5-CHANGED: Interface GigabitEthernet1/0/23, changed state to administratively down
*Jan  2 16:47:35: %LINK-5-CHANGED: Interface GigabitEthernet1/0/24, changed state to administratively down
*Jan  2 16:47:35: %LINK-5-CHANGED: Interface GigabitEthe
 << rnet1/0/25, changed state to administratively down
*Jan  2 16:47:35: %LINK-5-CHANGED: Interface GigabitEthernet1/0/26, changed state to administratively down
*Jan  2 16:47:35: %LINK-5-CHANGED: Interface GigabitEthernet1/0/27, changed state to administra
 << tively down
*Jan  2 16:47:35: %LINK-5-CHANGED: Interface GigabitEthernet1/0/28, changed state to administratively down
*Jan  2 16:47:35: %LINK-5-CHANGED: Interface GigabitEthernet1/0/29, changed state to administratively down
*Jan  2 16:47:35: %LINK-5-
 << CHANGED: Interface GigabitEthernet1/0/30, changed state to administratively down
*Jan  2 16:47:35: %LINK-5-CHANGED: Interface GigabitEthernet1/0/31, changed state to administratively down
*Jan  2 16:47:35: %LINK-5-CHANGED: Interface GigabitEthernet1/0/3
 << 2, changed state to administratively down
*Jan  2 16:47:35: %LINK-5-CHANGED: Interface GigabitEthernet1/0/33, changed state to administratively down
*Jan  2 16:47:35: %LINK-5-CHANGED: Interface GigabitEthernet1/0/34, changed state to administratively do
 << wn
*Jan  2 16:47:35: %LINK-5-CHANGED: Interface GigabitEthernet1/0/35, changed state to administratively down
*Jan  2 16:47:35: %LINK-5-CHANGED: Interface GigabitEthernet1/0/36, changed state to administratively down
*Jan  2 16:47:35: %LINK-5-CHANGED: 
 << Interface GigabitEthernet1/0/37, changed state to administratively down
*Jan  2 16:47:35: %LINK-5-CHANGED: Interface GigabitEthernet1/0/38, changed state to administratively down
*Jan  2 16:47:35: %LINK-5-CHANGED: Interface GigabitEthernet1/0/39, change
 << d state to administratively down
*Jan  2 16:47:35: %LINK-5-CHANGED: Interface GigabitEthernet1/0/40, changed state to administratively down
*Jan  2 16:47:35: %LINK-5-CHANGED: Interface GigabitEthernet1/0/41, changed state to administratively down
*Jan 
 <<  2 16:47:35: %LINK-5-CHANGED: Interface GigabitEthernet1/0/42, changed state to administratively down
*Jan  2 16:47:35: %LINK-5-CHANGED: Interface GigabitEthernet1/0/43, changed state to administratively down
*Jan  2 16:47:35: %LINK-5-CHANGED: Interface
 <<  GigabitEthernet1/0/44, changed state to administratively down
*Jan  2 16:47:35: %LINK-5-CHANGED: Interface GigabitEthernet1/0/45, changed state to administratively down
*Jan  2 16:47:35: %LINK-5-CHANGED: Interface GigabitEthernet1/0/46, changed state t
 << o administratively down
*Jan  2 16:47:35: %LINK-5-CHANGED: Interface GigabitEthernet1/0/47, changed state to administratively down
*Jan  2 16:47:35: %LINK-5-CHANGED: Interface GigabitEthernet1/0/48, changed state to administratively down
*Jan  2 16:47:
 << 42: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s3.r007n.scott#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s3.r007n.scott(config)#
Expect: matched string 1: (config)#
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s3.r007n.scott#
 << 
*Jan  2 16:47:52: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s3.r007n.scott#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s3.r007n.scott(config)#
Expect: matched string 1: (config)#
 >> crypto key generate rsa

 >> no

 >> 2048

Expect: searching for 2 strs:  :OK :(config)#
 << crypto key generate rsa
% You already have RSA keys defined named c29s3.r007n.scott.mgmt.msstate.edu.
% Do you really want to replace them? [yes/no]: no
c29s3.r007n.scott(config)#2048
                          ^
% Invalid input detected at '^' marker
Expect: matched string 2: (config)#
 >> end

Expect: searching for 1 strs:  :Configured
 << .

c29s3.r007n.scott(config)#end
c29s3.r007n.scott#
 << 
*Jan  2 16:47:56: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> write mem

Expect: searching for 2 strs:  :# :>
 << 
c29s3.r007n.scott#write mem
Building configuration...

Expect: matched string 1: #
 >> 
Expect: searching for 2 strs:  :# :>
 << [OK]
c29s3.r007n.scott#
c29s3.r007n.scott#
c29s3.r007n.scott#
Expect: matched string 1: #
 >> sh run

Expect: searching for 2 strs:  :# :>
 << sh run
Building configuration...

Current configuration : 21297 bytes
!
! Last configuration change at 16:47:56 CST Mon Jan 2 2006
!
version 15.0
no service pad
service timestamps debug datetime localtime
service timestamps log datetime localtim
 << e
service password-encryption
!
hostname c29s3.r007n.scott
!
boot-start-marker
boot-end-marker
!
enable secret 5 $1$tIFj$w934Ted78pa8ESOd47Omt1
enable password 7 1420401C5D070E7B29013F3C0552
!
username root privilege 15 secret 5 $1$vnHX$g8Omms8
 << cdI2TM3rgSCa.I1
no aaa new-model
clock timezone CST -6 0
clock summer-time CDT recurring
switch 1 provision ws-c2960s-48ts-l
authentication mac-move permit
!
!
ip dhcp snooping vlan 236
ip dhcp snooping
ip domain-name mgmt.msstate.edu
ip name-s
 << erver 130.18.80.12
!
!
crypto pki trustpoint TP-self-signed-2494998912
 enrollment selfsigned
 subject-name cn=IOS-Self-Signed-Certificate-2494998912
 revocation-check none
 rsakeypair TP-self-signed-2494998912
!
!
crypto pki certificate chain T
 << P-self-signed-2494998912
 certificate self-signed 01
  	quit
!
spanning-tree mode mst
spanning-tree portfast bpduguard default
spanning-tree extend system-id
!
spanning-tree mst configuration
 name msstate
 revision 1
 instance 1 vlan 2, 7, 11,
 <<  20, 22, 24, 31, 35, 37, 39-40, 50, 60, 63, 70
 instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 160
 instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 230, 232, 242, 246
 instance 1 vlan 256, 611-612, 654, 741, 996, 999
 instanc
 << e 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037, 2039-2040
 instance 2 vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096, 2104, 2110, 2126
 instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 2189, 2194, 2202
 instance 2 vlan 2220, 2222,
 <<  2232, 2242, 2246, 2611-2612, 2654, 2999
 instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176, 196
 instance 3 vlan 244, 248, 927
 instance 4 vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072, 2108, 2113, 2128
 instance 4 vlan 2144, 2176, 
 << 2196, 2244, 2248, 2927
 instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 228
 instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216, 2228
 instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116, 124
 instance 7 vlan 17
 << 2, 186, 192, 204-208, 210, 240-241, 251-252, 630, 928
 instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082, 2084
 instance 8 vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208, 2210
 instance 8 vlan 2240-2241, 2251-2252, 2630, 292
 << 8
 instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102, 112
 instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 500, 505, 510-511
 instance 9 vlan 522, 551-570, 603, 629, 633, 742, 802, 926, 929
 instance 10 vlan 2004-2005, 2012, 20
 << 18-2019, 2032, 2044, 2057, 2062, 2068
 instance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148, 2158
 instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522, 2603, 2629, 2633
 instance 10 vlan 2802, 2926, 2929
 instance 11 vlan 8, 43, 52
 << , 146, 156-157, 180, 200, 218
 instance 12 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180, 2200, 2218
!
!
!
!
!
!
errdisable recovery cause udld
errdisable recovery cause bpduguard
errdisable recovery cause security-violation
errdisable recovery 
 << cause channel-misconfig (STP)
errdisable recovery cause pagp-flap
errdisable recovery cause dtp-flap
errdisable recovery cause link-flap
errdisable recovery cause sfp-config-mismatch
errdisable recovery cause gbic-invalid
errdisable recovery cause p
 << secure-violation
errdisable recovery cause port-mode-failure
errdisable recovery cause dhcp-rate-limit
errdisable recovery cause pppoe-ia-rate-limit
errdisable recovery cause mac-limit
errdisable recovery cause vmps
errdisable recovery cause storm-c
 << ontrol
errdisable recovery cause inline-power
errdisable recovery cause arp-inspection
errdisable recovery cause loopback
errdisable recovery cause small-frame
errdisable recovery cause psp
errdisable recovery interval 1800
!
!
!
!
vlan interna
 << l allocation policy ascending
!
lldp run
!
! 
!
!
!
!
!
!
!
!
interface FastEthernet0
 no ip address
 shutdown
!
interface GigabitEthernet1/0/1
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 s
 << witchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 shutdown
 spanning-tree portfast
!
interface GigabitEthernet1/0/2
 switchport access vlan 
 << 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 shutdown
 spanning-tree 
 << portfast
!
interface GigabitEthernet1/0/3
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging t
 << ype inactivity
 switchport port-security
 shutdown
 spanning-tree portfast
!
interface GigabitEthernet1/0/4
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 swit
 << chport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 shutdown
 spanning-tree portfast
!
interface GigabitEthernet1/0/5
 switchport access vlan 236
 switchport mode access
 switchport port-s
 << ecurity maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 shutdown
 spanning-tree portfast
!
interface GigabitEthernet1/0/6
 sw
 << itchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 shut
 << down
 spanning-tree portfast
!
interface GigabitEthernet1/0/7
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport 
 << port-security aging type inactivity
 switchport port-security
 shutdown
 spanning-tree portfast
!
interface GigabitEthernet1/0/8
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-security vio
 << lation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 shutdown
 spanning-tree portfast
!
interface GigabitEthernet1/0/9
 switchport access vlan 236
 switchport mode acces
 << s
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 shutdown
 spanning-tree portfast
!
interface Giga
 << bitEthernet1/0/10
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchpor
 << t port-security
 shutdown
 spanning-tree portfast
!
interface GigabitEthernet1/0/11
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security agin
 << g time 15
 switchport port-security aging type inactivity
 switchport port-security
 shutdown
 spanning-tree portfast
!
interface GigabitEthernet1/0/12
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 swit
 << chport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 shutdown
 spanning-tree portfast
!
interface GigabitEthernet1/0/13
 switchport access vlan 23
 << 6
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 shutdown
 spanning-tree po
 << rtfast
!
interface GigabitEthernet1/0/14
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging ty
 << pe inactivity
 switchport port-security
 shutdown
 spanning-tree portfast
!
interface GigabitEthernet1/0/15
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 swit
 << chport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 shutdown
 spanning-tree portfast
!
interface GigabitEthernet1/0/16
 switchport access vlan 236
 switchport mode access
 switchport port-
 << security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 shutdown
 spanning-tree portfast
!
interface GigabitEthernet1/0/17
 
 << switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 sh
 << utdown
 spanning-tree portfast
!
interface GigabitEthernet1/0/18
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchpo
 << rt port-security aging type inactivity
 switchport port-security
 shutdown
 spanning-tree portfast
!
interface GigabitEthernet1/0/19
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 <<  violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 shutdown
 spanning-tree portfast
!
interface GigabitEthernet1/0/20
 switchport access vlan 236
 switchport mode 
 << access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 shutdown
 spanning-tree portfast
!
interface
 <<  GigabitEthernet1/0/21
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 swit
 << chport port-security
 shutdown
 spanning-tree portfast
!
interface GigabitEthernet1/0/22
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security
 <<  aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 shutdown
 spanning-tree portfast
!
interface GigabitEthernet1/0/23
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2

 <<  switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 shutdown
 spanning-tree portfast
!
interface GigabitEthernet1/0/24
 switchport access vl
 << an 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 shutdown
 spanning-tr
 << ee portfast
!
interface GigabitEthernet1/0/25
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security agi
 << ng type inactivity
 switchport port-security
 shutdown
 spanning-tree portfast
!
interface GigabitEthernet1/0/26
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect

 <<  switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 shutdown
 spanning-tree portfast
!
interface GigabitEthernet1/0/27
 switchport access vlan 236
 switchport mode access
 switchport 
 << port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 shutdown
 spanning-tree portfast
!
interface GigabitEthernet1/0/
 << 28
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 << 
 shutdown
 spanning-tree portfast
!
interface GigabitEthernet1/0/29
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 swi
 << tchport port-security aging type inactivity
 switchport port-security
 shutdown
 spanning-tree portfast
!
interface GigabitEthernet1/0/30
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-sec
 << urity violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 shutdown
 spanning-tree portfast
!
interface GigabitEthernet1/0/31
 switchport access vlan 236
 switchport 
 << mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 shutdown
 spanning-tree portfast
!
inte
 << rface GigabitEthernet1/0/32
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity

 <<  switchport port-security
 shutdown
 spanning-tree portfast
!
interface GigabitEthernet1/0/33
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-sec
 << urity aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 shutdown
 spanning-tree portfast
!
interface GigabitEthernet1/0/34
 switchport access vlan 236
 switchport mode access
 switchport port-security maximu
 << m 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 shutdown
 spanning-tree portfast
!
interface GigabitEthernet1/0/35
 switchport acce
 << ss vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 shutdown
 spanni
 << ng-tree portfast
!
interface GigabitEthernet1/0/36
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-securit
 << y aging type inactivity
 switchport port-security
 shutdown
 spanning-tree portfast
!
interface GigabitEthernet1/0/37
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation prot
 << ect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 shutdown
 spanning-tree portfast
!
interface GigabitEthernet1/0/38
 switchport access vlan 236
 switchport mode access
 switch
 << port port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 shutdown
 spanning-tree portfast
!
interface GigabitEtherne
 << t1/0/39
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-sec
 << urity
 shutdown
 spanning-tree portfast
!
interface GigabitEthernet1/0/40
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 << 
 switchport port-security aging type inactivity
 switchport port-security
 shutdown
 spanning-tree portfast
!
interface GigabitEthernet1/0/41
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport por
 << t-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 shutdown
 spanning-tree portfast
!
interface GigabitEthernet1/0/42
 switchport access vlan 236
 switch
 << port mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 shutdown
 spanning-tree portfast
!
 << 
interface GigabitEthernet1/0/43
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactiv
 << ity
 switchport port-security
 shutdown
 spanning-tree portfast
!
interface GigabitEthernet1/0/44
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport por
 << t-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 shutdown
 spanning-tree portfast
!
interface GigabitEthernet1/0/45
 switchport access vlan 236
 switchport mode access
 switchport port-security m
 << aximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 shutdown
 spanning-tree portfast
!
interface GigabitEthernet1/0/46
 switchport
 <<  access vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 shutdown
 s
 << panning-tree portfast
!
interface GigabitEthernet1/0/47
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-se
 << curity aging type inactivity
 switchport port-security
 shutdown
 spanning-tree portfast
!
interface GigabitEthernet1/0/48
 switchport trunk native vlan 92
 switchport mode trunk
 shutdown
 no keepalive
 ip dhcp snooping trust
!
interface Giga
 << bitEthernet1/0/49
 switchport trunk native vlan 92
 switchport mode trunk
 shutdown
 ip dhcp snooping trust
!
interface GigabitEthernet1/0/50
 switchport trunk native vlan 92
 switchport mode trunk
 shutdown
 ip dhcp snooping trust
!
interface
 <<  GigabitEthernet1/0/51
 switchport trunk native vlan 92
 switchport mode trunk
 shutdown
 ip dhcp snooping trust
!
interface GigabitEthernet1/0/52
 switchport trunk native vlan 92
 switchport mode trunk
 shutdown
 ip dhcp snooping trust
!
inte
 << rface Vlan1
 no ip address
 no ip route-cache
 shutdown
!
interface Vlan92
 ip address 10.92.6.36 255.255.0.0
 ip broadcast-address 10.92.255.255
!
ip default-gateway 10.92.0.1
no ip http server
no ip http secure-server
!
logging facility loc
 << al1
logging host 130.18.8.12
access-list 1 permit 10.92.0.0 0.0.255.255
access-list 1 permit 130.18.8.0 0.0.0.255
access-list 1 permit 10.93.0.0 0.0.255.255
access-list 1 permit 130.18.1.0 0.0.0.255
!
snmp-server community sysnet RO 1
snmp-server 
 << community c2-b2=a2 RW 1
snmp-server contact 6F-1720
snmp-server enable traps snmp authentication linkdown linkup coldstart warmstart
snmp-server enable traps transceiver all
snmp-server enable traps tty
snmp-server enable traps cluster
snmp-server e
 << nable traps config-copy
snmp-server enable traps config
snmp-server enable traps config-ctid
snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-auth-fail-vlan no-guest-vlan
snmp-server enable traps entity
snmp-server enable traps power-ether
 << net police
snmp-server enable traps cpu threshold
snmp-server enable traps rep
snmp-server enable traps bridge newroot topologychange
snmp-server enable traps stpx inconsistency root-inconsistency loop-inconsistency
snmp-server enable traps vtp
snmp
 << -server enable traps vlancreate
snmp-server enable traps vlandelete
snmp-server enable traps flash insertion removal
snmp-server enable traps port-security
snmp-server enable traps envmon fan shutdown supply temperature status
snmp-server enable trap
 << s errdisable
snmp-server enable traps mac-notification change move threshold
snmp-server enable traps vlan-membership
snmp-server host 130.18.8.12 sysnet 
!
!
line con 0
line vty 0 4
 access-class 1 in
 password 7 0738735B1F0A3D551A3B0705236B
 l
 << ogin local
 transport input ssh
line vty 5 15
 access-class 1 in
 password 7 0738735B1F0A3D551A3B0705236B
 login local
 transport input ssh
!
ntp server 10.92.0.5
end

c29s3.r007n.scott#
Expect: matched string 1: #
 >> show interface status

Expect: searching for 2 strs:  :# :>
 << show interface status

Port      Name               Status       Vlan       Duplex  Speed Type
Gi1/0/1                      disabled     236          auto   auto 10/100/1000BaseTX
Gi1/0/2                      disabled     236          auto   auto 10/1
 << 00/1000BaseTX
Gi1/0/3                      disabled     236          auto   auto 10/100/1000BaseTX
Gi1/0/4                      disabled     236          auto   auto 10/100/1000BaseTX
Gi1/0/5                      disabled     236          auto   auto 1
 << 0/100/1000BaseTX
Gi1/0/6                      disabled     236          auto   auto 10/100/1000BaseTX
Gi1/0/7                      disabled     236          auto   auto 10/100/1000BaseTX
Gi1/0/8                      disabled     236          auto   aut
 << o 10/100/1000BaseTX
Gi1/0/9                      disabled     236          auto   auto 10/100/1000BaseTX
Gi1/0/10                     disabled     236          auto   auto 10/100/1000BaseTX
Gi1/0/11                     disabled     236          auto   
 << auto 10/100/1000BaseTX
Gi1/0/12                     disabled     236          auto   auto 10/100/1000BaseTX
Gi1/0/13                     disabled     236          auto   auto 10/100/1000BaseTX
Gi1/0/14                     disabled     236          auto
 <<    auto 10/100/1000BaseTX
Gi1/0/15                     disabled     236          auto   auto 10/100/1000BaseTX
Gi1/0/16                     disabled     236          auto   auto 10/100/1000BaseTX
Gi1/0/17                     disabled     236          a
 << uto   auto 10/100/1000BaseTX
Gi1/0/18                     disabled     236          auto   auto 10/100/1000BaseTX
Gi1/0/19                     disabled     236          auto   auto 10/100/1000BaseTX
Gi1/0/20                     disabled     236        
 <<   auto   auto 10/100/1000BaseTX
Gi1/0/21                     disabled     236          auto   auto 10/100/1000BaseTX
Gi1/0/22                     disabled     236          auto   auto 10/100/1000BaseTX
Gi1/0/23                     disabled     236     
 <<      auto   auto 10/100/1000BaseTX
Gi1/0/24                     disabled     236          auto   auto 10/100/1000BaseTX
Gi1/0/25                     disabled     236          auto   auto 10/100/1000BaseTX
Gi1/0/26                     disabled     236  
 <<         auto   auto 10/100/1000BaseTX
Gi1/0/27                     disabled     236          auto   auto 10/100/1000BaseTX
Gi1/0/28                     disabled     236          auto   auto 10/100/1000BaseTX
Gi1/0/29                     disabled     23
 << 6          auto   auto 10/100/1000BaseTX
Gi1/0/30                     disabled     236          auto   auto 10/100/1000BaseTX
Gi1/0/31                     disabled     236          auto   auto 10/100/1000BaseTX
Gi1/0/32                     disabled    
 <<  236          auto   auto 10/100/1000BaseTX
Gi1/0/33                     disabled     236          auto   auto 10/100/1000BaseTX
Gi1/0/34                     disabled     236          auto   auto 10/100/1000BaseTX
Gi1/0/35                     disabled 
 <<     236          auto   auto 10/100/1000BaseTX
Gi1/0/36                     disabled     236          auto   auto 10/100/1000BaseTX
Gi1/0/37                     disabled     236          auto   auto 10/100/1000BaseTX
Gi1/0/38                     disabl
 << ed     236          auto   auto 10/100/1000BaseTX
Gi1/0/39                     disabled     236          auto   auto 10/100/1000BaseTX
Gi1/0/40                     disabled     236          auto   auto 10/100/1000BaseTX
Gi1/0/41                     dis
 << abled     236          auto   auto 10/100/1000BaseTX
Gi1/0/42                     disabled     236          auto   auto 10/100/1000BaseTX
Gi1/0/43                     disabled     236          auto   auto 10/100/1000BaseTX
Gi1/0/44                     
 << disabled     236          auto   auto 10/100/1000BaseTX
Gi1/0/45                     disabled     236          auto   auto 10/100/1000BaseTX
Gi1/0/46                     disabled     236          auto   auto 10/100/1000BaseTX
Gi1/0/47                  
 <<    disabled     236          auto   auto 10/100/1000BaseTX
Gi1/0/48                     disabled     1            auto   auto 10/100/1000BaseTX
Gi1/0/49                     disabled     1            auto   auto Not Present
Gi1/0/50                     
 << disabled     1            auto   auto Not Present
Gi1/0/51                     disabled     1            auto   auto Not Present
Gi1/0/52                     disabled     1            auto   auto Not Present
Fa0                          disabled     ro
 << uted       auto   auto 10/100BaseTX
c29s3.r007n.scott#
Expect: matched string 1: #
