trying to use serial port: /dev/ttyUSB0
 >> 
 >> 

Expect: searching for 4 strs:  :[yes/no] :Press RETURN to get started. :# :Switch>
 << 
% Please answer 'yes' or 'no'.
Would you like to enter the initial configuration dialog? [yes/no]: 
% Please answer 'yes' or 'no'.
Would you like to enter the initial configuration dialog? [yes/no]: 
% Please answer 'yes' or 'no'.
Would you like to
Expect: matched string 1: [yes/no]
 >> 

 >> no

 >> term len 0

Expect: searching for 2 strs:  :# :>
 <<  enter the initial configuration dialog? [yes/no]: 
% Please answer 'yes' or 'no'.
Would you like to enter the initial configuration dialog? [yes/no]: 
% Please answer 'yes' or 'no'.
Would you like to enter the initial configuration dialog? [yes/no]: 
 << 
% Please answer 'yes' or 'no'.
Would you like to enter the initial configuration dialog? [yes/no]: no
Switch>term len 0
Switch>
Expect: matched string 2: >
 >> show version

Expect: searching for 2 strs:  :# :>
 << show version
Cisco IOS Software, C3560CX Software (C3560CX-UNIVERSALK9-M), Version 15.2(4)E6, RELEASE SOFTWARE (fc4)
Technical Support: http://www.cisco.com/techsupport
Copyright (c) 1986-2018 by Cisco Systems, Inc.
Compiled Thu 05-Apr-18 03:17 by pro
 << d_rel_team

ROM: Bootstrap program is C3560CX boot loader
BOOTLDR: C3560CX Boot Loader (C3560CX-HBOOT-M) Version 15.2(4r)E5, RELEASE SOFTWARE (fc4)

Switch uptime is 4 minutes
System returned to ROM by power-on
System restarted at 19:52:30 UTC Fri 
 << Aug 24 2018
System image file is "flash:/c3560cx-universalk9-mz.152-4.E6/c3560cx-universalk9-mz.152-4.E6.bin"
Last reload reason: Unknown reason



This product contains cryptographic features and is subject to United
States and local country laws 
 << governing import, export, transfer and
use. Delivery of Cisco cryptographic products does not imply
third-party authority to import, export, distribute or use encryption.
Importers, exporters, distributors and users are responsible for
compliance with
 <<  U.S. and local country laws. By using this product you
agree to comply with applicable laws and regulations. If you are unable
to comply with U.S. and local laws, return this product immediately.

A summary of U.S. laws governing Cisco cryptographic 
 << products may be found at:
http://www.cisco.com/wwl/export/crypto/tool/stqrg.html

If you require further assistance please contact us by sending email to
export@cisco.com.

License Level: ipbase
License Type: Default. No valid license found.
Next 
 << reload license Level: ipbase

cisco WS-C3560CX-8PC-S (APM86XXX) processor (revision L0) with 524288K bytes of memory.
Processor board ID FOC2227T0Q7
Last reset from power-on
1 Virtual Ethernet interface
12 Gigabit Ethernet interfaces
The password-r
 << ecovery mechanism is enabled.

512K bytes of flash-simulated non-volatile configuration memory.
Base ethernet MAC Address       : 00:A5:BF:8D:0D:80
Motherboard assembly number     : 73-100859-04
Power supply part number        : 341-0675-02
Motherbo
 << ard serial number       : FOC22245ATK
Power supply serial number      : LIT22222T33
Model revision number           : L0
Motherboard revision number     : B0
Model number                    : WS-C3560CX-8PC-S
System serial number            : FOC2227
 << T0Q7
Top Assembly Part Number        : 68-100567-01
Top Assembly Revision Number    : C0
Version ID                      : V03
CLEI Code Number                : CMM1S10DRB
Hardware Board Revision Number  : 0x09


Switch Ports Model                
 <<      SW Version            SW Image                 
------ ----- -----                     ----------            ----------               
*    1 12    WS-C3560CX-8PC-S          15.2(4)E6             C3560CX-UNIVERSALK9-M    


Configuration registe
 << r is 0xF

Switch>
Expect: matched string 2: >
 >> enable

Expect: searching for 2 strs:  :Password: :#
 << 
Aug 24 19:57:01.441: SMI Director is not configured, disabling SMI
Aug 24 19:57:01.441: disable_smartinstall_operation:Disabling SMIenable
Switch#
Expect: matched string 2: #
 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
Expect: matched string 1: (config)#
 >> no service pad

 >> service timestamps debug datetime localtime

 >> service timestamps log datetime localtime

 >> service password-encryption

 >> logging buffered informational

 >> enable secret W2w1cD0mIliG!

 >> enable password W2w1cD0mIliG!

 >> username root privilege 15 secret W2w1cD0mIliG!

 >> no aaa new-model

 >> clock timezone CST -6

 >> clock summer-time CDT recurring

 >> system mtu routing 1500

 >> ip subnet-zero

 >> ip domain-name mgmt.msstate.edu

 >> ip name-server 130.18.80.13

 >> ip name-server 130.18.80.12

 >> vtp domain vtp01.mgmt.msstate.edu

 >> vtp mode client

 >> crypto pki trustpoint TP-self-signed-2494998912

 >>  enrollment selfsigned

 >>  subject-name cn=IOS-Self-Signed-Certificate-2494998912

 >>  revocation-check none

 >>  rsakeypair TP-self-signed-2494998912

 >> crypto pki certificate chain TP-self-signed-2494998912

 >>  certificate self-signed 01 nvram:IOS-Self-Sig#3232.cer

 >> spanning-tree portfast bpduguard default

 >> spanning-tree extend system-id

 >> vlan internal allocation policy ascending

 >> lldp run

 >> errdisable recovery cause all

 >> errdisable recovery interval 1800

 >> interface Vlan1

 >>  no ip address

 >>  no ip route-cache

 >> interface Vlan92

 >> no ip http server

 >> no ip http secure-server

 >> logging facility local1

 >> logging 130.18.8.12

 >> access-list 1 permit 10.92.0.0 0.0.255.255

 >> access-list 1 permit 130.18.8.0 0.0.0.255

 >> access-list 1 permit 10.93.0.0 0.0.255.255

 >> access-list 1 permit 130.18.1.0 0.0.0.255

 >> snmp-server community sysnet RO 1

 >> snmp-server community c2-b2=a2 RW 1

 >> snmp-server enable traps snmp authentication linkdown linkup coldstart warmstart

 >> snmp-server enable traps transceiver all

 >> snmp-server enable traps tty

 >> snmp-server enable traps cluster

 >> snmp-server enable traps config-copy

 >> snmp-server enable traps config

 >> snmp-server enable traps config-ctid

 >> snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-auth-fail-vlan no-guest-vlan

 >> snmp-server enable traps entity

 >> snmp-server enable traps power-ethernet police

 >> snmp-server enable traps cpu threshold

 >> snmp-server enable traps rep

 >> snmp-server enable traps bridge newroot topologychange

 >> snmp-server enable traps stpx inconsistency root-inconsistency loop-inconsistency

 >> snmp-server enable traps syslog

 >> snmp-server enable traps vtp

 >> snmp-server enable traps vlancreate

 >> snmp-server enable traps vlandelete

 >> snmp-server enable traps flash insertion removal

 >> snmp-server enable traps port-security

 >> snmp-server enable traps envmon fan shutdown supply temperature status

 >> snmp-server enable traps errdisable

 >> snmp-server enable traps mac-notification change move threshold

 >> snmp-server enable traps vlan-membership

 >> snmp-server host 130.18.8.12 sysnet

 >> line con 0

 >> line vty 0 15

 >>  access-class 1 in

 >>  password W2w1cD0mIliG!

 >>  login local

 >>  transport input ssh

 >> ntp server 10.92.0.5

 >> 

 >> end

Expect: searching for 1 strs:  :Configured
 << no service pad
Switch(config)#service timestamps debug datetime localtime
Switch(config)#service timestamps log datetime localtime
Switch(config)#service password-encryption
Switch(config)#logging buffered informational
Switch(config)#enable secret W
 << 2w1cD0mIliG!
Switch(config)#enable password W2w1cD0mIliG!
The enable password you have chosen is the same as your enable secret.
This is not recommended.  Re-enter the enable password.

Switch(config)#username root privilege 15 secret W2w1cD0mIliG!

 << Switch(config)#no aaa new-model
Switch(config)#clock timezone CST -6
Switch(config)#clock summer-time CDT recurring
Switch(config)#system mtu routing 1500
Switch(config)#ip sub
Aug 24 19:57:57: %SYS-5-LOG_CONFIG_CHANGE: Buffer logging: level informat
 << ional, xml disabled, filtering disabled, size (4096)net-zero
Switch(config)#ip domain-name mgmt.msstate.edu
Switch(config)#ip name-server 130.18.80.13
Switch(config)#ip name-server 130.18.80.12
Switch(config)#vtp domain vtp01.mgmt.msstate.edu
Changin
 << g VTP domain name from NULL to vtp01.mgmt.msstate.edu
Switch(config)#
Aug 24 13:57:58: %SYS-6-CLOCKUPDATE: System clock has been updated from 19:57:58 UTC Fri Aug 24 2018 to 13:57:58 CST Fri Aug 24 2018, configured from console by console.
Aug 24 14:57
 << :59: %SYS-6-CLOCKUPDATE: System clock has been updated from 13:57:59 CST Fri Aug 24 2018 to 14:57:59 CDT Fri Aug 24 2018, configured from console by console.vtp mode client
Setting device to VTP Client mode for VLANS.
Switch(config)#crypto pki trustpoin
 << t TP-self-signed-2494998912
Switch(ca-trustpoint)# enrollment selfsigned
Switch(ca-trustpoint)# subject-name cn=IOS-Self-Signed-Certificate-2494998912
Switch(ca-trustpoint)# revocation-check none
Switch(ca-trustpoint)#
Aug 24 14:58:00: %SW_VLAN-6-VTP
 << _DOMAIN_NAME_CHG: VTP domain name changed to vtp01.mgmt.msstate.edu. rsakeypair TP-self-signed-2494998912
Switch(ca-trustpoint)#crypto pki certificate chain TP-self-signed-2494998912
Switch(config-cert-chain)# certificate self-signed 01 nvram:IOS-Self-S
 << ig#3232$e self-signed 01 nvram:IOS-Self-Sig#3232.         cer
Switch(config-cert-chain)#spanning-tree portfast bpduguard default
Switch(config)#spanning-tree extend system-id
Switch(config)#vl
 << an internal allocation policy ascending
Switch(config)#lldp run
Switch(config)#errdisable recovery cause all
Switch(config)#errdisable recovery interval 1800
Switch(config)#interface Vlan1
Switch(config-if)# no ip address
Switch(config-if)# no ip ro
 << ute-cache
Switch(config-if)#interface Vlan92
Switch(config-if)#no ip http server
Switch(config)#no ip http secure-server
Switch(config)#logging facility local1
Switch(config)#logging 130.18.8.12
Switch(config)#access-list 1 permit 10.92.0.0 0.0.255.
 << 255
Switch(config)#access-list 1 permit 130.18.8.0 0.0.0.255
Switch(config)#access-list 1 permit 10.93.0.0 0.0.255.255
Switch(config)#access-list 1 permit 130.18.1.0 0.0.0.255
Switch(config)#snmp-server community sysnet RO 1
Switch(config)#snmp-serve
 << r community c2-b2=a2 RW 1
Switch(config)#
Aug 24 14:58:05: %SYS-6-LOGGINGHOST_STARTSTOP: Logging to host 130.18.8.12 port 0 CLI Request Triggered
Aug 24 14:58:05: %SYS-6-LOGGINGHOST_STARTSTOP: Logging to host 130.18.8.12 port 514 started - CLI initiate
 << dsnmp-server enable traps snmp authentication linkdown linkup c$ enable traps snmp authentication linkdown linkup co         ldstart w
 << aps snmp authentication linkdown linkup coldstart wa         rmstart
Switch(config)#snmp-server enable traps transceiver all
Switch(config)#snmp-server enable traps tty
Switch(config)#snmp-server enable traps cluster
Switch(config)
 << #snmp-server enable traps config-copy
Switch(config)#snmp-server enable traps config
Switch(config)#snmp-server enable traps config-ctid
Switch(config)#snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-au
 << $ enable traps dot1x auth-fail-vlan guest-vlan no-aut         h-fail-vlaps dot1x auth-fail-vlan guest-vlan no-auth-fail-vla         n no-gues
 << uth-fail-vlan guest-vlan no-auth-fail-vlan no-guest         -vlan
snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-auth-fail-vlan no-gu                         ^est-vlan

% Invalid in
 << put detected at '^' marker.

Switch(config)#snmp-server enable traps entity
Switch(config)#snmp-server enable traps power-ethernet police
Switch(config)#snmp-server enable traps cpu threshold
Switch(config)#snmp-server enable traps rep
Switch(config
 << )#snmp-server enable traps bridge newroot topologychange
Switch(config)#snmp-server enable traps stpx inconsistency root-inconsistency$ enable traps stpx inconsistency root-inconsistency      
 <<     loop-incoaps stpx inconsistency root-inconsistency loop-incon         sistency
Switch(config)#snmp-server enable traps syslog
Switch(config)#snmp-server enable traps vtp
 << 
Switch(config)#snmp-server enable traps vlancreate
Switch(config)#snmp-server enable traps vlandelete
Switch(config)#snmp-server enable traps flash insertion removal
Switch(config)#snmp-server enable traps port-security
Switch(config)#snmp-server ena
 << ble traps envmon fan shutdown supply temperatur$ enable traps envmon fan shutdown supply temperature          status
Switch(config)#snmp-server enable traps errdisable
Switch(config)
 << #snmp-server enable traps mac-notification change move threshol$ enable traps mac-notification change move threshold         
Switch(config)#snmp-server enable traps vlan-membership

 << Switch(config)#snmp-server host 130.18.8.12 sysnet
Switch(config)#line con 0
Switch(config-line)#line vty 0 15
Switch(config-line)# access-class 1 in
Switch(config-line)# password W2w1cD0mIliG!
Switch(config-line)# login local
Switch(config-line)# t
 << ransport input ssh
Switch(config-line)#ntp server 10.92.0.5
Switch(config)#
Switch(config)#end
Switch#
 << 
Aug 24 14:58:13: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
Switch#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
Expect: matched string 1: (config)#
 >> spanning-tree mode mst

 >> spanning-tree etherchannel guard misconfig

 >> spanning-tree mst configuration

 >>  name msstate

 >>  revision 1

 >>  instance 1 vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 63, 70

 >>  instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 160

 >>  instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 230, 232, 242, 246

 >>  instance 1 vlan 256, 611-612, 654, 741, 996, 999

 >>  instance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037, 2039-2040

 >>  instance 2 vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096, 2104, 2110, 2126

 >>  instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 2189, 2194, 2202

 >>  instance 2 vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 2654, 2999

 >>  instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176, 196

 >>  instance 3 vlan 244, 248, 927

 >>  instance 4 vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072, 2108, 2113, 2128

 >>  instance 4 vlan 2144, 2176, 2196, 2244, 2248, 2927

 >>  instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 228

 >>  instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216, 2228

 >>  instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116, 124

 >>  instance 7 vlan 172, 186, 192, 204-208, 210, 240-241, 251-252, 630, 928

 >>  instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082, 2084

 >>  instance 8 vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208, 2210

 >>  instance 8 vlan 2240-2241, 2251-2252, 2630, 2928

 >>  instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102, 112

 >>  instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 500, 505, 510-511

 >>  instance 9 vlan 522, 551-570, 603, 629, 633, 742, 802, 926, 929

 >>  instance 10 vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 2057, 2062, 2068

 >>  instance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148, 2158

 >>  instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522, 2603, 2629, 2633

 >>  instance 10 vlan 2802, 2926, 2929

 >>  instance 11 vlan 8, 43, 52, 146, 156-157, 180, 200, 218

 >>  instance 12 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180, 2200, 2218

 >> 

 >> end

Expect: searching for 1 strs:  :Configured
 << spanning-tree mode mst
Switch(config)#spanning-tree etherchannel guard misconfig
Switch(config)#spanning-tree mst configuration
Switch(config-mst)# name msstate
Switch(config-mst)# revision 1
Switch(config-mst)# instance 1 vlan 2, 7, 11, 20, 22, 24, 
 << 31, 35, 37, 39-40, $ vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40, 5         0, 60, 63, 11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 
 << 63,          70
Switch(config-mst)# instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 1$ vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 14         0, 152, 1
 << 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 16         0
Switch(config-mst)# instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 23$ vlan 162-1
 << 63, 168, 189, 194, 202, 220, 222, 230         , 232, 24163, 168, 189, 194, 202, 220, 222, 230, 232, 242         , 246
Switch(config-mst)# instance 1 vlan 256, 611-612, 654, 741, 9
 << 96, 999
Switch(config-mst)# instance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031,$ vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031,          2035, 203
 << , 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037         , 2039-2011, 2020, 2022, 2024, 2031, 2035, 2037, 2039-204         0
Switch(config-mst)# instance 2 v
 << lan 2050, 2060, 2063, 2070, 2080, 2086, 2096,$ vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096,          2104, 211, 2060, 2063, 2070,
 <<  2080, 2086, 2096, 2104, 2110         , 2126
Switch(config-mst)# instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, $ vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 2         
 << 189, 2194, 2140, 2152, 2160, 2162-2163, 2168, 2189, 2194,          2202
Switch(config-mst)# instance 2 vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 
 << $ vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 2         654, 2999
Switch(config-mst)# instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128$ vlan 42, 51, 59, 64
 << , 66, 69, 72, 108, 113, 128,          144, 17651, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176,          196
Switch(config-mst)# instance 3 vlan 244, 248, 927
Switch(config-mst)# 
 << instance 4 vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072,$ vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072,          2108, 211, 2051,
 <<  2059, 2064, 2066, 2069, 2072, 2108, 2113         , 2128
Switch(config-mst)# instance 4 vlan 2144, 2176, 2196, 2244, 2248, 2927
Switch(config-mst)# instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 2
 << $ vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 22         8
Switch(config-mst)# instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-$ vlan 2016, 2048, 2058, 2088, 
 << 2121, 2131, 2133-2         134, 2216, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216,          2228
Switch(config-mst)# instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97,
 << $ vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97,          114, 116,3-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116,          1
 << 24
Switch(config-mst)# instance 7 vlan 172, 186, 192, 204-208, 210, 240-241, 251$ vlan 172, 186, 192, 204-208, 210, 240-241, 251-         252, 630,
 << 186, 192, 204-208, 210, 240-241, 251-252, 630,          928
Switch(config-mst)# instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, $ vlan 2009, 2033-2034, 2038, 2054
 << , 2056, 2071, 2         075, 2082, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082,          2084
Switch(config-mst)# instance 8 vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192,
 << $ vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192,          2204-2208, 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208,          221
 << 0
Switch(config-mst)# instance 8 vlan 2240-2241, 2251-2252, 2630, 2928
Switch(config-mst)# instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 9$ vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 
 << 98         -99, 102,12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102,          112
Switch(config-mst)# instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 50
 << $ vlan 130, 132, 147-148, 158, 212, 226, 236, 500         , 505, 51132, 147-148, 158, 212, 226, 236, 500, 505, 510         -511
Switch(config-mst
 << )# instance 9 vlan 522, 551-570, 603, 629, 633, 742, 802, 92$ vlan 522, 551-570, 603, 629, 633, 742, 802, 926         , 929
Switch(config-mst)# instance 10 vlan 2004-2005, 2012, 2018-2019
 << , 2032, 2044, $0 vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 2         057, 20624-2005, 2012, 2018-2019, 2032, 2044, 2057, 2062,  
 <<         2068
Switch(config-mst)# instance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132,$0 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132,          2147-2148
 << 6, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148,          2158
Switch(config-mst)# instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522,$0 vlan 221
 << 2, 2236, 2500, 2505, 2510-2511, 2522,          2603, 2622, 2236, 2500, 2505, 2510-2511, 2522, 2603, 2629         , 2633
Switch(config-mst)# instance 10 vlan 2802, 2926, 2929
Swit
 << ch(config-mst)# instance 11 vlan 8, 43, 52, 146, 156-157, 180, 200, 218
Switch(config-mst)# instance 12 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180,$2 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180
 << ,          2200, 2218, 2043, 2052, 2146, 2156-2157, 2180, 2200, 2218         
Switch(config-mst)#
Switch(config-mst)#end
Switch#
Aug 24 14:58:29: %SYS-5-CONFIG_I: Configured fr
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << om console by console
Switch#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
Expect: matched string 1: (config)#
 >> hostname c29s1c.concessions.3ne.scott 

Expect: searching for 2 strs:  :# :>
 << hostname c29s1c.concessions.3ne.scott 
c29s1c.concessions.3(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s1c.concessions.3ne.scott#
 << 
Aug 24 14:58:34: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1c.concessions.3ne.scott#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1c.concessions.3(config)#
Expect: matched string 1: (config)#
 >> snmp-server contact  

Expect: searching for 1 strs:  :#
 << snmp-server contact  
% Incomplete command.

c29s1c.concessions.3(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s1c.concessions.3ne.scott#
 << 
Aug 24 14:58:40: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1c.concessions.3ne.scott#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1c.concessions.3(config)#
Expect: matched string 1: (config)#
 >> interface vlan 92

Expect: searching for 1 strs:  :(config-if)#
 << interface vlan 92
c29s1c.concessions.3(config-if)#
Expect: matched string 1: (config-if)#
 >> ip address 10.92.6.39 255.255.0.0

 >> ip broadcast-address 10.92.255.255

 >> end

Expect: searching for 1 strs:  :Configured
 << ip address 10.92.6.39 255.255.0.0
c29s1c.concessions.3(config-if)#ip broadcast-address 10.92.255.255
c29s1c.concessions.3(config-if)#end
c29s1c.concessions.3ne.scott#
 << 
Aug 24 14:58:46: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1c.concessions.3ne.scott#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1c.concessions.3(config)#
Expect: matched string 1: (config)#
 >> interface Vlan92

Expect: searching for 1 strs:  :(config-if)#
 << interface Vlan92
c29s1c.concessions.3(config-if)#
Expect: matched string 1: (config-if)#
 >> ip default-gateway 10.92.0.1

 >> end

Expect: searching for 1 strs:  :Configured
 << ip default-gateway 10.92.0.1
c29s1c.concessions.3(config)#end
c29s1c.concessions.3ne.scott#
Aug 24 14:58:52: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1c.concessions.3ne.scott#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1c.concessions.3(config)#
Expect: matched string 1: (config)#
 >> ip dhcp snooping

Expect: searching for 1 strs:  :#
 << ip dhcp snooping
c29s1c.concessions.3(config)#
Expect: matched string 1: #
 >> ip dhcp snooping vlan 633

Expect: searching for 1 strs:  :#
 << ip dhcp snooping vlan 633
c29s1c.concessions.3(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s1c.concessions.3ne.scott#
Aug 24 14:58:59: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1c.concessions.3ne.scott#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1c.concessions.3(config)#
Expect: matched string 1: (config)#
 >> default interface range gi0/1 - 8 

 >> interface range gi0/1 - 8 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi0/1 - 8 
c29s1c.concessions.3(config)#interface range gi0/1 - 8 
c29s1c.concessions.3(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport access vlan 633

 >> switchport mode access

 >> spanning-tree portfast

 >> switchport port-security maximum 2

 >> switchport port-security

 >> switchport port-security aging time 15

 >> switchport port-security violation protect

 >> switchport port-security aging type inactivity

 >> power inline never

 >> shutdown

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport access vlan 633
c29s1c.concessions.3(config-if-range)#switchport mode access
c29s1c.concessions.3(config-if-range)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, conce
 << ntrators, switches, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast will be configured in 8 interfaces due to the range command 
 but will only have effect when the interf
 << aces are in a non-trunking mode.
c29s1c.concessions.3(config-if-range)#switchport port-security maximum 2
c29s1c.concessions.3(config-if-range)#switchport port-security
c29s1c.concessions.3(config-if-range)#switchport port-security aging time 15
c29s1
 << c.concessions.3(config-if-range)#switchport port-security violation prot$port-security violation prote         ct
c29s1c.concessions.3(config-if-range)#switchport port-security aging type ina
 << $port-security aging type inac         tivity
c29s1c.concessions.3(config-if-range)#power inline never
c29s1c.concessions.3(config-if-range)#shutdown
c29s1c.concessions.3(config-if-range)#end
c29s1c.concessions.3ne.sco
 << tt#
Aug 24 14:59:07: %SYS-5-CONFIG_I: Configured from console by console
Aug 24 14:59:09: %LINK-5-CHANGED: Interface GigabitEthernet0/1, changed state to administratively down
Aug 24 14:59:09: %LINK-5-CHANGED: Interface GigabitEthernet0/2, changed stat
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << e to administratively down
Aug 24 14:59:09: %LINK-5-CHANGED: Interface GigabitEthernet0/3, changed state to administratively down
Aug 24 14:59:09: %LINK-5-CHANGED: Interface GigabitEthernet0/4, changed state to administratively down
Aug 24 14:59:09: %L
 << INK-5-CHANGED: Interface GigabitEthernet0/5, changed state to administrati
c29s1c.concessions.3ne.scott#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1c.concessions.3(config)#vely down
Aug 24 14:59:09: %LINK-5-CH
Expect: matched string 1: (config)#
 >> default interface range gi0/1 - 8 

 >> interface range gi0/1 - 8 

Expect: searching for 1 strs:  :(config-if-range)#
 << ANGED: Interface GigabitEthernet0/6, changed state to administratively down
Aug 24 14:59:09: %LINK-5-CHANGED: Interface GigabitEthernet0/7, changed state to administratively down
Aug 24 14:59:09: %LINK-5-CHANGED: Interface GigabitEthernet0/8, changed st
 << ate to administratively downdefault interface range gi0/1 - 8 
c29s1c.concessions.3(config)#interface range gi0/1 - 8 
c29s1c.concessions.3(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport access vlan 633

 >> switchport mode access

 >> spanning-tree portfast

 >> switchport port-security maximum 2

 >> switchport port-security

 >> switchport port-security aging time 15

 >> switchport port-security violation protect

 >> switchport port-security aging type inactivity

 >> no power inline consumption

 >> shutdown

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport access vlan 633
c29s1c.concessions.3(config-if-range)#switchport mode access
c29s1c.concessions.3(config-if-range)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, conce
 << ntrators, switches, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast will be configured in 8 interfaces due to the range command 
 but will only have effect when the interf
 << aces are in a non-trunking mode.
c29s1c.concessions.3(config-if-range)#switchport port-security maximum 2
c29s1c.concessions.3(config-if-range)#switchport port-security
c29s1c.concessions.3(config-if-range)#switchport port-security aging time 15
c29s1
 << c.concessions.3(config-if-range)#switchport port-security violation prot$port-security violation prote         ct
c29s1c.concessions.3(config-if-range)#switchport port-security aging type ina
 << $port-security aging type inac         tivity
c29s1c.concessions.3(config-if-range)#no power inline consumption
c29s1c.concessions.3(config-if-range)#shutdown
c29s1c.concessions.3(config-if-range)#end
c29s1c.concession
 << s.3ne.scott#
Aug 24 14:59:12: %LINK-3-UPDOWN: Interface GigabitEthernet0/1, changed state to down
Aug 24 14:59:12: %LINK-3-UPDOWN: Interface GigabitEthernet0/2, changed state to down
Aug 24 14:59:12: %LINK-3-UPDOWN: Interface GigabitEthernet0/3, change
 << d state to down
Aug 24 14:59:13: %LINK-3-UPDOWN: Interface GigabitEthernet0/4, changed state to down
Aug 24 14:59:13: %LINK-3-UPDOWN: Interface GigabitEthernet0/5, changed state to down
Aug 24 14:59:13: %LINK-3-UPDOWN: Interface GigabitEthernet0/6, cha
 << nged state to down
Aug 24 14:59:13: %LINK-3-UPDOWN: Interface GigabitEthernet0/7, changed state to down
Aug 24 14:59:13: %LINK-3-UPDOWN: Interface GigabitEthernet0/8, changed state to down
Aug 24 14:59:14: %SYS-5-CONFIG_I: Configured from console by co
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << nsole
c29s1c.concessions.3ne.scott#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1c.concessions.3(config)#
Aug 24 14:59:16: %LINK-5-CHANGED: Interface GigabitEthernet0/1, changed state to administratively down
A
Expect: matched string 1: (config)#
 >> default interface range gi0/9 - 12 

 >> interface range gi0/9 - 12 

Expect: searching for 1 strs:  :(config-if-range)#
 << ug 24 14:59:16: %LINK-5-CHANGED: Interface GigabitEthernet0/2, changed state to administratively down
Aug 24 14:59:16: %LINK-5-CHANGED: Interface GigabitEthernet0/3, changed state to administratively down
Aug 24 14:59:16: %LINK-5-CHANGED: Interface Giga
 << bitEthernet0/4, changed state to administratively down
Aug 24 14:59:16: %LINK-5-CHANGED: Interface GigabitEthernet0/5, changed state to administratidefault interface range gi0/9 - 12 
c29s1c.concessions.3(config)#interface range gi0/9 - 12 
c29s1c.conc
 << essions.3(config-if-range)#vely down
Aug 24 14:59:16: %LINK-5-CHANGED: Interface GigabitEthernet0/6, changed state to administratively down
Aug 24 14:59:16: %LINK-5-CHANGED: Interface GigabitEthernet0/7, changed state to administratively down
Aug 24 14
Expect: matched string 1: (config-if-range)#
 >> switchport mode trunk

 >> switchport trunk native vlan 92

 >> ip dhcp snooping trust

 >> no keepalive

 >> shutdown

 >> end

Expect: searching for 1 strs:  :Configured
 << :59:16: %LINK-5-CHANGED: Interface GigabitEthernet0/8, changed state to administratively downswitchport mode trunk
c29s1c.concessions.3(config-if-range)#switchport trunk native vlan 92
c29s1c.concessions.3(config-if-range)#ip dhcp snooping trust
c29s1c
 << .concessions.3(config-if-range)#no keepalive
c29s1c.concessions.3(config-if-range)#shutdown
c29s1c.concessions.3(config-if-range)#end
c29s1c.concessions.3ne.scott#
 << 
Aug 24 14:59:19: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s1c.concessions.3ne.scott#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s1c.concessions.3(config)#
Aug 24 14:59:20: %LINK-5-CHANGED: Interface GigabitEthernet0/9, changed state to administratively down
Aug 24
Expect: matched string 1: (config)#
 >> crypto key generate rsa

 >> no

 >> 2048

Expect: searching for 2 strs:  :OK :(config)#
 <<  14:59:20: %LINK-5-CHANGED: Interface GigabitEthernet0/10, changed state to administratively down
Aug 24 14:59:20: %LINK-5-CHANGED: Interface GigabitEthernet0/11, changed state to administratively down
Aug 24 14:59:20: %LINK-5-CHANGED: Interface Gigabit
 << Ethernet0/12, changed state to administratively downcrypto key generate rsa
The name for the keys will be: c29s1c.concessions.3ne.scott.mgmt.msstate.edu
Choose the size of the key modulus in the range of 360 to 4096 for your
  General Purpose Keys. Cho
 << osing a key modulus greater than 512 may take
  a few minutes.

How many bits in the modulus [512]: no
% A decimal number between 360 and 4096.
How many bits in the modulus [512]: 2048
% Generating 2048 bit RSA keys, keys will be non-exportable...
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...
 14:59:20: %LINK-5-CHANGED: Interface GigabitEthernet0/10, changed state to administratively down
Aug 24 14:59:20: %LINK-5-CHANGED: Interface GigabitEthernet0/11, changed state to administratively down
Aug 24 14:59:20: %LINK-5-CHANGED: Interface GigabitEthernet0/12, changed state to administratively downcrypto key generate rsa
The name for the keys will be: c29s1c.concessions.3ne.scott.mgmt.msstate.edu
Choose the size of the key modulus in the range of 360 to 4096 for your
  General Purpose Keys. Choosing a key modulus greater than 512 may take
  a few minutes.

How many bits in the modulus [512]: no
% A decimal number between 360 and 4096.
How many bits in the modulus [512]: 2048
% Generating 2048 bit RSA keys, keys will be non-exportable...
...

 >> end

Expect: searching for 1 strs:  :Configured
 << 
 << 
 << 
 << 
 << 
 << 
[OK] (elapsed time was 15 seconds)

c29s1c.concessions.3(config)#end
c29s1c.concessions.3ne.scott#
Aug 24 14:59:38: %SSH-5-ENABLED: SSH 1.99 has been enabled
Aug 24 14:59:39: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> write mem

Expect: searching for 2 strs:  :# :>
 << 
c29s1c.concessions.3ne.scott#write mem
Building configuration...

Expect: matched string 1: #
 >> 
Expect: searching for 2 strs:  :# :>
 << [OK]
c29s1c.concessions.3ne.scott#
c29s1c.concessions.3ne.scott#
c29s1c.concessions.3ne.scott#
Expect: matched string 1: #
 >> sh run

Expect: searching for 2 strs:  :# :>
 << sh run
Building configuration...

Current configuration : 8953 bytes
!
! Last configuration change at 14:59:39 CDT Fri Aug 24 2018
! NVRAM config last updated at 14:59:41 CDT Fri Aug 24 2018
!
version 15.2
no service pad
service timestamps debug
 <<  datetime localtime
service timestamps log datetime localtime
service password-encryption
!
hostname c29s1c.concessions.3ne.scott
!
boot-start-marker
boot-end-marker
!
logging buffered informational
enable secret 5 $1$SYm9$IIB.vHszoEIWIswDBhHCO/
 << 
enable password 7 012454130A08225F2C6542003E44
!
username root privilege 15 secret 5 $1$GsCN$BT8AVxgEzr5jZNdRD1iEm.
no aaa new-model
clock timezone CST -6 0
clock summer-time CDT recurring
system mtu routing 1500
!
!
!
!
!
!
ip dhcp snoopin
 << g vlan 633
ip dhcp snooping
ip domain-name mgmt.msstate.edu
ip name-server 130.18.80.13
ip name-server 130.18.80.12
!
!
!
!
!
!
!
crypto pki trustpoint TP-self-signed-2494998912
 enrollment selfsigned
 subject-name cn=IOS-Self-Signed-Certifi
 << cate-2494998912
 revocation-check none
 rsakeypair TP-self-signed-2494998912
!
!
crypto pki certificate chain TP-self-signed-2494998912
 certificate self-signed 01
  	quit
!
spanning-tree mode mst
spanning-tree portfast edge bpduguard default
s
 << panning-tree extend system-id
!
spanning-tree mst configuration
 name msstate
 revision 1
 instance 1 vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 63, 70
 instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 160
 instance 1 vl
 << an 162-163, 168, 189, 194, 202, 220, 222, 230, 232, 242, 246
 instance 1 vlan 256, 611-612, 654, 741, 996, 999
 instance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037, 2039-2040
 instance 2 vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096, 2
 << 104, 2110, 2126
 instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 2189, 2194, 2202
 instance 2 vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 2654, 2999
 instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176, 196
 instance 3 vlan 
 << 244, 248, 927
 instance 4 vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072, 2108, 2113, 2128
 instance 4 vlan 2144, 2176, 2196, 2244, 2248, 2927
 instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 228
 instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2
 << 131, 2133-2134, 2216, 2228
 instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116, 124
 instance 7 vlan 172, 186, 192, 204-208, 210, 240-241, 251-252, 630, 928
 instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082, 2084
 in
 << stance 8 vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208, 2210
 instance 8 vlan 2240-2241, 2251-2252, 2630, 2928
 instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102, 112
 instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 5
 << 00, 505, 510-511
 instance 9 vlan 522, 551-570, 603, 629, 633, 742, 802, 926, 929
 instance 10 vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 2057, 2062, 2068
 instance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148, 2158
 instance 10 vlan 2
 << 212, 2236, 2500, 2505, 2510-2511, 2522, 2603, 2629, 2633
 instance 10 vlan 2802, 2926, 2929
 instance 11 vlan 8, 43, 52, 146, 156-157, 180, 200, 218
 instance 12 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180, 2200, 2218
!
errdisable recovery cause udl
 << d
errdisable recovery cause bpduguard
errdisable recovery cause security-violation
errdisable recovery cause channel-misconfig
errdisable recovery cause pagp-flap
errdisable recovery cause dtp-flap
errdisable recovery cause link-flap
errdisable rec
 << overy cause sfp-config-mismatch
errdisable recovery cause gbic-invalid
errdisable recovery cause l2ptguard
errdisable recovery cause psecure-violation
errdisable recovery cause port-mode-failure
errdisable recovery cause dhcp-rate-limit
errdisable r
 << ecovery cause pppoe-ia-rate-limit
errdisable recovery cause mac-limit
errdisable recovery cause vmps
errdisable recovery cause storm-control
errdisable recovery cause inline-power
errdisable recovery cause arp-inspection
errdisable recovery cause lo
 << opback
errdisable recovery cause small-frame
errdisable recovery cause psp
errdisable recovery interval 1800
!
!
!
!
vlan internal allocation policy ascending
!
lldp run
!
! 
!
!
!
!
!
!
!
!
!
interface GigabitEthernet0/1
 switchpor
 << t access vlan 633
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 shutdown
 
 << spanning-tree portfast edge
!
interface GigabitEthernet0/2
 switchport access vlan 633
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port
 << -security aging type inactivity
 switchport port-security
 shutdown
 spanning-tree portfast edge
!
interface GigabitEthernet0/3
 switchport access vlan 633
 switchport mode access
 switchport port-security maximum 2
 switchport port-security viol
 << ation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 shutdown
 spanning-tree portfast edge
!
interface GigabitEthernet0/4
 switchport access vlan 633
 switchport mode acc
 << ess
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 shutdown
 spanning-tree portfast edge
!
interfa
 << ce GigabitEthernet0/5
 switchport access vlan 633
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switc
 << hport port-security
 shutdown
 spanning-tree portfast edge
!
interface GigabitEthernet0/6
 switchport access vlan 633
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-securit
 << y aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 shutdown
 spanning-tree portfast edge
!
interface GigabitEthernet0/7
 switchport access vlan 633
 switchport mode access
 switchport port-security maximum 
 << 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 shutdown
 spanning-tree portfast edge
!
interface GigabitEthernet0/8
 switchport acce
 << ss vlan 633
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 shutdown
 spanni
 << ng-tree portfast edge
!
interface GigabitEthernet0/9
 switchport trunk native vlan 92
 switchport mode trunk
 shutdown
 ip dhcp snooping trust
!
interface GigabitEthernet0/10
 switchport trunk native vlan 92
 switchport mode trunk
 shutdown
 i
 << p dhcp snooping trust
!
interface GigabitEthernet0/11
 switchport trunk native vlan 92
 switchport mode trunk
 shutdown
 ip dhcp snooping trust
!
interface GigabitEthernet0/12
 switchport trunk native vlan 92
 switchport mode trunk
 shutdown
 
 << ip dhcp snooping trust
!
interface Vlan1
 no ip address
 no ip route-cache
!
interface Vlan92
 ip address 10.92.6.39 255.255.0.0
 ip broadcast-address 10.92.255.255
!
ip default-gateway 10.92.0.1
ip forward-protocol nd
no ip http server
no ip
 <<  http secure-server
!
!
!
logging facility local1
logging host 130.18.8.12
access-list 1 permit 10.92.0.0 0.0.255.255
access-list 1 permit 130.18.8.0 0.0.0.255
access-list 1 permit 10.93.0.0 0.0.255.255
access-list 1 permit 130.18.1.0 0.0.0.255

 << !
snmp-server community sysnet RO 1
snmp-server community c2-b2=a2 RW 1
snmp-server enable traps snmp authentication linkdown linkup coldstart warmstart
snmp-server enable traps transceiver all
snmp-server enable traps tty
snmp-server enable traps c
 << luster
snmp-server enable traps config-copy
snmp-server enable traps config
snmp-server enable traps config-ctid
snmp-server enable traps entity
snmp-server enable traps power-ethernet police
snmp-server enable traps cpu threshold
snmp-server enabl
 << e traps rep
snmp-server enable traps bridge newroot topologychange
snmp-server enable traps stpx inconsistency root-inconsistency loop-inconsistency
snmp-server enable traps syslog
snmp-server enable traps vtp
snmp-server enable traps vlancreate
snm
 << p-server enable traps vlandelete
snmp-server enable traps flash insertion removal
snmp-server enable traps port-security
snmp-server enable traps envmon fan shutdown supply temperature status
snmp-server enable traps errdisable
snmp-server enable tra
 << ps mac-notification change move threshold
snmp-server enable traps vlan-membership
snmp-server host 130.18.8.12 sysnet 
no vstack
!
line con 0
line vty 0 4
 access-class 1 in
 password 7 08161E59581A21471F22000D0D6A
 login local
 transport input
 <<  ssh
line vty 5 15
 access-class 1 in
 password 7 08161E59581A21471F22000D0D6A
 login local
 transport input ssh
!
ntp server 10.92.0.5
!
end

c29s1c.concessions.3ne.scott#
Expect: matched string 1: #
 >> show interface status

Expect: searching for 2 strs:  :# :>
 << show interface status

Port      Name               Status       Vlan       Duplex  Speed Type 
Gi0/1                        disabled     633          auto   auto 10/100/1000BaseTX
Gi0/2                        disabled     633          auto   auto 10/
 << 100/1000BaseTX
Gi0/3                        disabled     633          auto   auto 10/100/1000BaseTX
Gi0/4                        disabled     633          auto   auto 10/100/1000BaseTX
Gi0/5                        disabled     633          auto   auto 
 << 10/100/1000BaseTX
Gi0/6                        disabled     633          auto   auto 10/100/1000BaseTX
Gi0/7                        disabled     633          auto   auto 10/100/1000BaseTX
Gi0/8                        disabled     633          auto   au
 << to 10/100/1000BaseTX
Gi0/9                        disabled     1            auto   auto 10/100/1000BaseTX
Gi0/10                       disabled     1            auto   auto 10/100/1000BaseTX
Gi0/11                       disabled     1            auto  
 <<  auto Not Present
Gi0/12                       disabled     1            auto   auto Not Present
c29s1c.concessions.3ne.scott#
Expect: matched string 1: #
