trying to use serial port: /dev/ttyUSB0
 >> 
 >> 

Expect: searching for 4 strs:  :[yes/no] :Press RETURN to get started. :# :Switch>
 << 


         --- System Configuration Dialog ---

Enable secret warning
----------------------------------
In order to access the device manager, an enable secret is required
If you enter the initial configuration dialog, you will be prompted for t
 << he enable secret
If you choose not to enter the intial configuration dialog, or if you exit setup without setting the enable secret,
please set an enable secret using the following CLI in configuration mode-
enable secret 0 <cleartext password>
------
 << ----------------------------
Would you like to enter the initial configuration dialog? [yes/no]: 
% Please answer 'yes' or 'no'.
Would you like to enter the initial configuration dialog? [yes/no]: 
% Please answer 'yes' or 'no'.
Would you like to ent
Expect: matched string 1: [yes/no]
 >> 

 >> no

 >> term len 0

Expect: searching for 2 strs:  :# :>
 << er the initial configuration dialog? [yes/no]: 
% Please answer 'yes' or 'no'.
Would you like to enter the initial configuration dialog? [yes/no]: 
% Please answer 'yes' or 'no'.
Would you like to enter the initial configuration dialog? [yes/no]: 
% 
 << Please answer 'yes' or 'no'.
Would you like to enter the initial configuration dialog? [yes/no]: no
Switch>term len 0
Switch>
Expect: matched string 2: >
 >> show version

Expect: searching for 2 strs:  :# :>
 << show version
Cisco IOS Software, C2960S Software (C2960S-UNIVERSALK9-M), Version 15.0(2)SE8, RELEASE SOFTWARE (fc1)
Technical Support: http://www.cisco.com/techsupport
Copyright (c) 1986-2015 by Cisco Systems, Inc.
Compiled Wed 13-May-15 23:10 by prod
 << _rel_team

ROM: Bootstrap program is C2960S board boot loader
BOOTLDR: C2960S Boot Loader (C2960S-HBOOT-M) Version 12.2(55r)SE, RELEASE SOFTWARE (fc1)

Switch uptime is 3 minutes
System returned to ROM by power-on
System image file is "flash:/c2960
 << s-universalk9-mz.150-2.SE8.bin"


This product contains cryptographic features and is subject to United
States and local country laws governing import, export, transfer and
use. Delivery of Cisco cryptographic products does not imply
third-party aut
 << hority to import, export, distribute or use encryption.
Importers, exporters, distributors and users are responsible for
compliance with U.S. and local country laws. By using this product you
agree to comply with applicable laws and regulations. If you
 <<  are unable
to comply with U.S. and local laws, return this product immediately.

A summary of U.S. laws governing Cisco cryptographic products may be found at:
http://www.cisco.com/wwl/export/crypto/tool/stqrg.html

If you require further assistanc
 << e please contact us by sending email to
export@cisco.com.

cisco WS-C2960S-24TS-L (PowerPC) processor (revision E0) with 131072K bytes of memory.
Processor board ID FOC1614Z1RS
Last reset from power-on
1 Virtual Ethernet interface
1 FastEthernet in
 << terface
28 Gigabit Ethernet interfaces
The password-recovery mechanism is enabled.

512K bytes of flash-simulated non-volatile configuration memory.
Base ethernet MAC Address       : F4:EA:67:A0:64:00
Motherboard assembly number     : 73-11910-08
P
 << ower supply part number        : 341-0328-02
Motherboard serial number       : FOC16131NJJ
Power supply serial number      : LIT16060S3V
Model revision number           : E0
Motherboard revision number     : A0
Model number                    : WS-C2
 << 960S-24TS-L
Daughterboard assembly number   : 73-11933-04
Daughterboard serial number     : FOC16133W3E
System serial number            : FOC1614Z1RS
Top Assembly Part Number        : 800-30954-03
Top Assembly Revision Number    : A0
Version ID     
 <<                  : V03
CLEI Code Number                : COMGG00ARC
Daughterboard revision number   : A0
Hardware Board Revision Number  : 0x01


Switch Ports Model              SW Version            SW Image                 
------ ----- -----    
 <<           ----------            ----------               
*    1 28    WS-C2960S-24TS-L   15.0(2)SE8            C2960S-UNIVERSALK9-M     


Configuration register is 0xF

Switch>
Expect: matched string 2: >
 >> enable

Expect: searching for 2 strs:  :Password: :#
 << enable
Switch#
Expect: matched string 2: #
 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
Expect: matched string 1: (config)#
 >> no service pad

 >> service timestamps debug datetime localtime

 >> service timestamps log datetime localtime

 >> service password-encryption

 >> boot-start-marker

 >> boot-end-marker

 >> enable secret W2w1cD0mIliG!

 >> enable password W2w1cD0mIliG!

 >> username root privilege 15 secret W2w1cD0mIliG!

 >> no aaa new-model

 >> clock timezone CST -6

 >> clock summer-time CDT recurring

 >> authentication mac-move permit

 >> ip domain-name mgmt.msstate.edu

 >> ip name-server 130.18.80.12

 >> vtp domain vtp01.mgmt.msstate.edu

 >> vtp mode client

 >> crypto pki trustpoint TP-self-signed-2494998912

 >>  enrollment selfsigned

 >>  subject-name cn=IOS-Self-Signed-Certificate-2494998912

 >>  revocation-check none

 >>  rsakeypair TP-self-signed-2494998912

 >> crypto pki certificate chain TP-self-signed-2494998912

 >>  certificate self-signed 01 nvram:IOS-Self-Sig#3232.cer

 >> spanning-tree portfast bpduguard default

 >> spanning-tree extend system-id

 >> vlan internal allocation policy ascending

 >> lldp run

 >> errdisable recovery cause all

 >> errdisable recovery interval 1800

 >> interface FastEthernet0

 >>  no ip address

 >>  shutdown

 >> interface Vlan1

 >>  no ip address

 >>  no ip route-cache

 >>  shutdown

 >> interface Vlan92

 >> no ip http server

 >> no ip http secure-server

 >> ip sla enable reaction-alerts

 >> logging facility local1

 >> logging host 130.18.8.12

 >> access-list 1 permit 10.92.0.0 0.0.255.255

 >> access-list 1 permit 130.18.8.0 0.0.0.255

 >> access-list 1 permit 10.93.0.0 0.0.255.255

 >> access-list 1 permit 130.18.1.0 0.0.0.255

 >> snmp-server community sysnet RO 1

 >> snmp-server community c2-b2=a2 RW 1

 >> snmp-server enable traps snmp authentication linkdown linkup coldstart warmstart

 >> snmp-server enable traps transceiver all

 >> snmp-server enable traps tty

 >> snmp-server enable traps cluster

 >> snmp-server enable traps config-copy

 >> snmp-server enable traps config

 >> snmp-server enable traps config-ctid

 >> snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-auth-fail-vlan no-guest-vlan

 >> snmp-server enable traps entity

 >> snmp-server enable traps power-ethernet group 1

 >> snmp-server enable traps power-ethernet police

 >> snmp-server enable traps cpu threshold

 >> snmp-server enable traps rep

 >> snmp-server enable traps rtr

 >> snmp-server enable traps bridge newroot topologychange

 >> snmp-server enable traps stpx inconsistency root-inconsistency loop-inconsistency

 >> snmp-server enable traps syslog

 >> snmp-server enable traps vtp

 >> snmp-server enable traps vlancreate

 >> snmp-server enable traps vlandelete

 >> snmp-server enable traps flash insertion removal

 >> snmp-server enable traps port-security

 >> snmp-server enable traps envmon fan shutdown supply temperature status

 >> snmp-server enable traps errdisable

 >> snmp-server enable traps mac-notification change move threshold

 >> snmp-server enable traps vlan-membership

 >> snmp-server host 130.18.8.12 sysnet 

 >> line con 0

 >> line vty 0 15

 >>  access-class 1 in

 >>  password W2w1cD0mIliG!

 >>  login local

 >>  transport input ssh

 >> ntp clock-period 22519226

 >> ntp server 10.92.0.5

 >> 

 >> end

Expect: searching for 1 strs:  :Configured
 << no service pad
Switch(config)#service timestamps debug datetime localtime
Switch(config)#service timestamps log datetime localtime
Switch(config)#service password-encryption
Switch(config)#boot-start-marker
Switch(config)#boot-end-marker
Switch(conf
 << ig)#enable secret W2w1cD0mIliG!
Switch(config)#enable password W2w1cD0mIliG!
The enable password you have chosen is the same as your enable secret.
This is not recommended.  Re-enter the enable password.

Switch(config)#username root privilege 15 sec
 << ret W2w1cD0mIliG!
Switch(config)#no aaa new-model
Switch(config)#clock timezone CST -6
Switch(config)#clock summer-time CDT recurring
Switch(config)#authentication mac-move permit
Switch(config)#ip domain-name mgmt.msstate.edu
Switch(config)#ip name
 << -server 130.18.80.12
Switch(config)#vtp domain vtp01.mgmt.msstate.edu
Domain name already set to vtp01.mgmt.msstate.edu.
Switch(config)#vtp mode client
Device mode already VTP Client for VLANS.
Switch(config)#
*Jan  1 18:04:21: %SYS-6-CLOCKUPDATE: S
 << ystem clock has been updated from 00:04:21 UTC Mon Jan 2 2006 to 18:04:21 CST Sun Jan 1 2006, configured from console by console.
*Jan  1 18:04:21: %SYS-6-CLOCKUPDATE: System clock has been updated from 18:04:21 CST Sun Jan 1 2006 to 18:04:21 CST Sun Jan
 <<  1 2006, configured from console by console.crypto pki trustpoint TP-self-signed-2494998912
Switch(ca-trustpoint)# enrollment selfsigned
Switch(ca-trustpoint)# subject-name cn=IOS-Self-Signed-Certificate-2494998912
Switch(ca-trustpoint)# revocation-che
 << ck none
Switch(ca-trustpoint)# rsakeypair TP-self-signed-2494998912
Switch(ca-trustpoint)#crypto pki certificate chain TP-self-signed-2494998912
Switch(config-cert-chain)# certificate self-signed 01 nvram:IOS-Self-Sig#3232
 << $e self-signed 01 nvram:IOS-Self-Sig#3232.         cer
Switch(config-cert-chain)#spanning-tree portfast bpduguard default
Switch(config)#spanning-tree extend system-id
Switch(config)#vlan internal allocation policy ascendi
 << ng
Switch(config)#lldp run
Switch(config)#errdisable recovery cause all
Switch(config)#errdisable recovery interval 1800
Switch(config)#interface FastEthernet0
Switch(config-if)# no ip address
Switch(config-if)# shutdown
Switch(config-if)#interface
 <<  Vlan1
Switch(config-if)# no ip address
Switch(config-if)# no ip route-cache
Switch(config-if)# shutdown
Switch(config-if)#interface Vlan92
Switch(config-if)#no ip http server
Switch(config)#no ip http secure-server
Switch(config)#ip sla enable rea
 << ction-alerts
                      ^
% Invalid input detected at '^' marker.

Switch(config)#logging facility local1
Switch(config)#logging host 130.18.8.12
Switch(config)#access-list 1 permit 10.92.0.0 0.0.255.255
Switch(config)#access-list 1 perm
 << it 130.18.8.0 0.0.0.255
Switch(config)#
*Jan  1 18:04:26: %LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan92, changed state to down
*Jan  1 18:04:27: %LINK-5-CHANGED: Interface FastEthernet0, changed state to administratively downaccess-list 1 perm
 << it 10.93.0.0 0.0.255.255
Switch(config)#access-list 1 permit 130.18.1.0 0.0.0.255
Switch(config)#snmp-server community sysnet RO 1
Switch(config)#snmp-server community c2-b2=a2 RW 1
Switch(config)#snmp-server enable traps snmp a
*Jan  1 18:04:28: %LI
 << NK-5-CHANGED: Interface Vlan1, changed state to administratively downuthentication linkdown linkup c$ enable traps snmp authentication linkdown linkup co         ldstart w
 << aps snmp authentication linkdown linkup coldstart wa         rmstart
Switch(config)#snmp-server enable traps transceiver all
Switch(config)#snmp-server enable traps tty
Switch(config)#snmp-server
 <<  enable traps cluster
Switch(config)#snmp-server enable traps config-copy
Switch(config)#
*Jan  1 18:04:28: %SYS-6-LOGGINGHOST_STARTSTOP: Logging to host 130.18.8.12 port 514 started - CLI initiatedsnmp-server enable traps config
Switch(config)#snmp-s
 << erver enable traps config-ctid
Switch(config)#snmp-server enable traps dot1x auth-fail-vlan guest-vlan no-au$ enable traps dot1x auth-fail-vlan guest-vlan no-aut         h-fail-vl
 << aps dot1x auth-fail-vlan guest-vlan no-auth-fail-vla         n no-guesuth-fail-vlan guest-vlan no-auth-fail-vlan no-guest        
 <<  -vlan
Switch(config)#snmp-server enable traps entity
Switch(config)#snmp-server enable traps power-ethernet group 1
Group 1 is not inline power capable.

Switch(config)#snmp-server enable traps power-ethernet police
Switch(config)#snmp-ser
 << ver enable traps cpu threshold
Switch(config)#snmp-server enable traps rep
Switch(config)#snmp-server enable traps rtr
                                         ^
% Invalid input detected at '^' marker.

Switch(config)#snmp-server enable traps bridge
 <<  newroot topologychange
Switch(config)#snmp-server enable traps stpx inconsistency root-inconsistency$ enable traps stpx inconsistency root-inconsistency          loop-inco
 << aps stpx inconsistency root-inconsistency loop-incon         sistency
Switch(config)#snmp-server enable traps syslog
Switch(config)#snmp-server enable traps vtp
Switch(config)#snmp-server enabl
 << e traps vlancreate
Switch(config)#snmp-server enable traps vlandelete
Switch(config)#snmp-server enable traps flash insertion removal
Switch(config)#snmp-server enable traps port-security
Switch(config)#snmp-server enable traps envmon fan shutdown sup
 << ply temperatur$ enable traps envmon fan shutdown supply temperature          status
Switch(config)#snmp-server enable traps errdisable
Switch(config)#snmp-server enable traps mac-not
 << ification change move threshol$ enable traps mac-notification change move threshold         
Switch(config)#snmp-server enable traps vlan-membership
Switch(config)#snmp-server host 1
 << 30.18.8.12 sysnet 
Switch(config)#line con 0
Switch(config-line)#line vty 0 15
Switch(config-line)# access-class 1 in
Switch(config-line)# password W2w1cD0mIliG!
Switch(config-line)# login local
Switch(config-line)# transport input ssh
Switch(confi
 << g-line)#ntp clock-period 22519226
%NTP: This configuration command is depreceated.
Switch(config)#ntp server 10.92.0.5
Switch(config)#
Switch(config)#end
Switch#
 << 
*Jan  1 18:04:37: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
Switch#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
Expect: matched string 1: (config)#
 >> spanning-tree mode mst

 >> spanning-tree etherchannel guard misconfig

 >> spanning-tree mst configuration

 >>  name msstate

 >>  revision 1

 >>  instance 1 vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 63, 70

 >>  instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 160

 >>  instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 230, 232, 242, 246

 >>  instance 1 vlan 256, 611-612, 654, 741, 996, 999

 >>  instance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037, 2039-2040

 >>  instance 2 vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096, 2104, 2110, 2126

 >>  instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 2189, 2194, 2202

 >>  instance 2 vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 2654, 2999

 >>  instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176, 196

 >>  instance 3 vlan 244, 248, 927

 >>  instance 4 vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072, 2108, 2113, 2128

 >>  instance 4 vlan 2144, 2176, 2196, 2244, 2248, 2927

 >>  instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 228

 >>  instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216, 2228

 >>  instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116, 124

 >>  instance 7 vlan 172, 186, 192, 204-208, 210, 240-241, 251-252, 630, 928

 >>  instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082, 2084

 >>  instance 8 vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208, 2210

 >>  instance 8 vlan 2240-2241, 2251-2252, 2630, 2928

 >>  instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102, 112

 >>  instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 500, 505, 510-511

 >>  instance 9 vlan 522, 551-570, 603, 629, 633, 742, 802, 926, 929

 >>  instance 10 vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 2057, 2062, 2068

 >>  instance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148, 2158

 >>  instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522, 2603, 2629, 2633

 >>  instance 10 vlan 2802, 2926, 2929

 >>  instance 11 vlan 8, 43, 52, 146, 156-157, 180, 200, 218

 >>  instance 12 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180, 2200, 2218

 >> 

 >> end

Expect: searching for 1 strs:  :Configured
 << spanning-tree mode mst
Switch(config)#spanning-tree etherchannel guard misconfig
Switch(config)#spanning-tree mst configuration
Switch(config-mst)# name msstate
Switch(config-mst)# revision 1
Switch(config-mst)# instance 1 vlan 2, 7, 11, 20, 22, 24, 
 << 31, 35, 37, 39-40, $ vlan 2, 7, 11, 20, 22, 24, 31, 35, 37, 39-40, 5         0, 60, 63, 11, 20, 22, 24, 31, 35, 37, 39-40, 50, 60, 
 << 63,          70
Switch(config-mst)# instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 1$ vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 14         0, 152, 1
 << 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 16         0
Switch(config-mst)# instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 23$ vlan 162-1
 << 63, 168, 189, 194, 202, 220, 222, 230         , 232, 24163, 168, 189, 194, 202, 220, 222, 230, 232, 242         , 246
Switch(config-mst)# instance 1 vlan 256, 611-612, 654, 741, 9
 << 96, 999
Switch(config-mst)# instance 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031,$ vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031,          2035, 203
 << , 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037         , 2039-2011, 2020, 2022, 2024, 2031, 2035, 2037, 2039-204         0
Switch(config-mst)# instance 2 v
 << lan 2050, 2060, 2063, 2070, 2080, 2086, 2096,$ vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096,          2104, 211, 2060, 2063, 2070,
 <<  2080, 2086, 2096, 2104, 2110         , 2126
Switch(config-mst)# instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, $ vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 2         
 << 189, 2194, 2140, 2152, 2160, 2162-2163, 2168, 2189, 2194,          2202
Switch(config-mst)# instance 2 vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 
 << $ vlan 2220, 2222, 2232, 2242, 2246, 2611-2612, 2         654, 2999
Switch(config-mst)# instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128$ vlan 42, 51, 59, 64
 << , 66, 69, 72, 108, 113, 128,          144, 17651, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176,          196
Switch(config-mst)# instance 3 vlan 244, 248, 927
Switch(config-mst)# 
 << instance 4 vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072,$ vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072,          2108, 211, 2051,
 <<  2059, 2064, 2066, 2069, 2072, 2108, 2113         , 2128
Switch(config-mst)# instance 4 vlan 2144, 2176, 2196, 2244, 2248, 2927
Switch(config-mst)# instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 2
 << $ vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 22         8
Switch(config-mst)# instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-$ vlan 2016, 2048, 2058, 2088, 
 << 2121, 2131, 2133-2         134, 2216, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216,          2228
Switch(config-mst)# instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97,
 << $ vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97,          114, 116,3-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116,          1
 << 24
Switch(config-mst)# instance 7 vlan 172, 186, 192, 204-208, 210, 240-241, 251$ vlan 172, 186, 192, 204-208, 210, 240-241, 251-         252, 630,
 << 186, 192, 204-208, 210, 240-241, 251-252, 630,          928
Switch(config-mst)# instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, $ vlan 2009, 2033-2034, 2038, 2054
 << , 2056, 2071, 2         075, 2082, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082,          2084
Switch(config-mst)# instance 8 vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192,
 << $ vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192,          2204-2208, 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208,          221
 << 0
Switch(config-mst)# instance 8 vlan 2240-2241, 2251-2252, 2630, 2928
Switch(config-mst)# instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 9$ vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 
 << 98         -99, 102,12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102,          112
Switch(config-mst)# instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 50
 << $ vlan 130, 132, 147-148, 158, 212, 226, 236, 500         , 505, 51132, 147-148, 158, 212, 226, 236, 500, 505, 510         -511
Switch(config-mst
 << )# instance 9 vlan 522, 551-570, 603, 629, 633, 742, 802, 92$ vlan 522, 551-570, 603, 629, 633, 742, 802, 926         , 929
Switch(config-mst)# instance 10 vlan 2004-2005, 2012, 2018-2019
 << , 2032, 2044, $0 vlan 2004-2005, 2012, 2018-2019, 2032, 2044, 2         057, 20624-2005, 2012, 2018-2019, 2032, 2044, 2057, 2062,  
 <<         2068
Switch(config-mst)# instance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132,$0 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132,          2147-2148
 << 6, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148,          2158
Switch(config-mst)# instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522,$0 vlan 221
 << 2, 2236, 2500, 2505, 2510-2511, 2522,          2603, 2622, 2236, 2500, 2505, 2510-2511, 2522, 2603, 2629         , 2633
Switch(config-mst)# instance 10 vlan 2802, 2926, 2929
Swit
 << ch(config-mst)# instance 11 vlan 8, 43, 52, 146, 156-157, 180, 200, 218
Switch(config-mst)# instance 12 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180,$2 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180
 << ,          2200, 2218, 2043, 2052, 2146, 2156-2157, 2180, 2200, 2218         
Switch(config-mst)#
Switch(config-mst)#end
Switch#
 << 
*Jan  1 18:04:52: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
Switch#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#
Expect: matched string 1: (config)#
 >> hostname c29s4.r1127.bryan 

Expect: searching for 2 strs:  :# :>
 << hostname c29s4.r1127.bryan 
c29s4.r1127.bryan(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s4.r1127.bryan#
 << 
*Jan  1 18:04:59: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s4.r1127.bryan#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s4.r1127.bryan(config)#
Expect: matched string 1: (config)#
 >> snmp-server contact 6F-1617

Expect: searching for 1 strs:  :#
 << snmp-server contact 6F-1617
c29s4.r1127.bryan(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s4.r1127.bryan#
 << 
*Jan  1 18:05:05: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s4.r1127.bryan#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s4.r1127.bryan(config)#
Expect: matched string 1: (config)#
 >> interface vlan 92

Expect: searching for 1 strs:  :(config-if)#
 << interface vlan 92
c29s4.r1127.bryan(config-if)#
Expect: matched string 1: (config-if)#
 >> ip address 10.92.6.50 255.255.0.0

 >> ip broadcast-address 10.92.255.255

 >> end

Expect: searching for 1 strs:  :Configured
 << ip address 10.92.6.50 255.255.0.0
c29s4.r1127.bryan(config-if)#ip broadcast-address 10.92.255.255
c29s4.r1127.bryan(config-if)#end
c29s4.r1127.bryan#
 << 
*Jan  1 18:05:11: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s4.r1127.bryan#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s4.r1127.bryan(config)#
Expect: matched string 1: (config)#
 >> interface Vlan92

Expect: searching for 1 strs:  :(config-if)#
 << interface Vlan92
c29s4.r1127.bryan(config-if)#
Expect: matched string 1: (config-if)#
 >> ip default-gateway 10.92.0.1

 >> end

Expect: searching for 1 strs:  :Configured
 << ip default-gateway 10.92.0.1
c29s4.r1127.bryan(config)#end
c29s4.r1127.bryan#
*Jan  1 18:05:17: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s4.r1127.bryan#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s4.r1127.bryan(config)#
Expect: matched string 1: (config)#
 >> ip dhcp snooping

Expect: searching for 1 strs:  :#
 << ip dhcp snooping
c29s4.r1127.bryan(config)#
Expect: matched string 1: #
 >> ip dhcp snooping vlan 236

Expect: searching for 1 strs:  :#
 << ip dhcp snooping vlan 236
c29s4.r1127.bryan(config)#
Expect: matched string 1: #
 >> end

Expect: searching for 1 strs:  :Configured
 << end
c29s4.r1127.bryan#
*Jan  1 18:05:24: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s4.r1127.bryan#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s4.r1127.bryan(config)#
Expect: matched string 1: (config)#
 >> default interface range gi1/0/1 - 24 

 >> interface range gi1/0/1 - 24 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi1/0/1 - 24 
c29s4.r1127.bryan(config)#interface range gi1/0/1 - 24 
c29s4.r1127.bryan(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport access vlan 236

 >> switchport mode access

 >> spanning-tree portfast

 >> switchport port-security maximum 2

 >> switchport port-security

 >> switchport port-security aging time 15

 >> switchport port-security violation protect

 >> switchport port-security aging type inactivity

 >> power inline never

 >> shutdown

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport access vlan 236
c29s4.r1127.bryan(config-if-range)#switchport mode access
c29s4.r1127.bryan(config-if-range)#spanning-tree portfast
%Warning: portfast should only be enabled on ports connected to a single
 host. Connecting hubs, concentrato
 << rs, switches, bridges, etc... to this
 interface  when portfast is enabled, can cause temporary bridging loops.
 Use with CAUTION

%Portfast will be configured in 24 interfaces due to the range command 
 but will only have effect when the interfaces 
 << are in a non-trunking mode.
c29s4.r1127.bryan(config-if-range)#switchport port-security maximum 2
c29s4.r1127.bryan(config-if-range)#switchport port-security
c29s4.r1127.bryan(config-if-range)#switchport port-security aging time 15
c29s4.r1127.bryan(c
 << onfig-if-range)#switchport port-security violation protect
c29s4.r1127.bryan(config-if-range)#switchport port-security aging type inacti$port-security aging type inactiv         ity
c29s4.r1127.bryan(co
 << nfig-if-range)#power inline never
                                    ^
% Invalid input detected at '^' marker.

c29s4.r1127.bryan(config-if-range)#shutdown
c29s4.r1127.bryan(config-if-range)#end
c29s4.r1127.bryan#
 << 
*Jan  1 18:05:33: %SYS-5-CONFIG_I: Configured from console by console
*Jan  1 18:05:34: %LINK-5-CHANGED: Interface GigabitEthernet1/0/1, changed state to administratively down
*Jan  1 18:05:34: %LINK-5-CHANGED: Interface GigabitEthernet1/0/2, changed 
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << state to administratively down
*Jan  1 18:05:34: %LINK-5-CHANGED: Interface GigabitEthernet1/0/3, changed state to administratively down
*Jan  1 18:05:34: %LINK-5-CHANGED: Interface GigabitEthernet1/0/4, changed state to administratively down
*Jan  1 1
 << 8:05:34: %LINK-5-CHANGED: Interface GigabitEthernet1/0/5, changed state 
c29s4.r1127.bryan#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s4.r1127.bryan(config)#to administratively down
*Jan  1 18:05:34: %LINK-5-CH
Expect: matched string 1: (config)#
 >> default interface gi1/0/24 

 >> interface gi1/0/24 

Expect: searching for 1 strs:  :(config-if)#
 << ANGED: Interface GigabitEthernet1/0/6, changed state to administratively down
*Jan  1 18:05:34: %LINK-5-CHANGED: Interface GigabitEthernet1/0/7, changed state to administratively down
*Jan  1 18:05:34: %LINK-5-CHANGED: Interface GigabitEthernet1/0/8, ch
 << anged state to administratively down
*Jan  1 18:05:34: %LINK-5-CHANGED: Interface GigabitEthernet1/0/9, changed state to administratively down
*Jan  1 18:05:34: %LINK-5-CHANGED: Interface GigabitEtherdefault interface gi1/0/24 
Interface GigabitEtherne
 << t1/0/24 set to default configuration
c29s4.r1127.bryan(config)#interface gi1/0/24 
c29s4.r1127.bryan(config-if)#net1/0/10, changed state to administratively down
*Jan  1 18:05:34: %LINK-5-CHANGED: Interface GigabitEthernet1/0/11, changed state to admin
Expect: matched string 1: (config-if)#
 >> switchport mode trunk

 >> switchport trunk native vlan 92

 >> ip dhcp snooping trust

 >> no keepalive

 >> shutdown

 >> end

Expect: searching for 1 strs:  :Configured
 << istratively down
*Jan  1 18:05:34: %LINK-5-CHANGED: Interface GigabitEthernet1/0/12, changed state to administratively down
*Jan  1 18:05:34: %LINK-5-CHANGED: Interface GigabitEthernet1/0/13, changed state to administratively down
*Jan  1 18:05:34: %LI
 << NK-5-CHANGED: Interface GigabitEthernet1/0/14, changed state to administratively down
*Jan  1 18:05:34: %LINK-5-CHswitchport mode trunk
c29s4.r1127.bryan(config-if)#switchport trunk native vlan 92
c29s4.r1127.bryan(config-if)#ip dhcp snooping trust
c2
 << 9s4.r1127.bryan(config-if)#no keepalive
c29s4.r1127.bryan(config-if)#shutdown
c29s4.r1127.bryan(config-if)#ANGED: Interface GigabitEthernet1/0/15, changed state to administratively down
*Jan  1 18:05:34: %LINK-5-CHANGED: Interface GigabitEthernet1/0/16
 << , changed state to administratively down
*Jan  1 18:05:34: %LINK-5-CHANGED: Interface GigabitEthernet1/0/17, changed state to administratively down
*Jan  1 18:05:34: %LINK-5-CHANGED: Interface GigabitEthernet1/0/18, changed state to administratively dow
 << n
*Jan  1 18:05:34: %LINK-5-CHANGED: Interface GigabitEthernet1/0/19, changed state to administratively downend
c29s4.r1127.bryan#
*Jan  1 18:05:34: %LINK-5-CHANGED: Interface GigabitEthernet1/0/20, changed state to administratively down
*Jan  1 18:0
 << 5:34: %LINK-5-CHANGED: Interface GigabitEthernet1/0/21, changed state to administratively down
*Jan  1 18:05:34: %LINK-5-CHANGED: Interface GigabitEthernet1/0/22, changed state to administratively down
*Jan  1 18:05:34: %LINK-5-CHANGED: Interface Gigabi
 << tEthernet1/0/23, changed state to administratively down
*Jan  1 18:05:34: %LINK-5-CHANGED: Interface GigabitEthernet1/0/24, changed state to administratively down
*Jan  1 18:05:38: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s4.r1127.bryan#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s4.r1127.bryan(config)#
Expect: matched string 1: (config)#
 >> default interface range gi1/0/25 - 28 

 >> interface range gi1/0/25 - 28 

Expect: searching for 1 strs:  :(config-if-range)#
 << default interface range gi1/0/25 - 28 
c29s4.r1127.bryan(config)#interface range gi1/0/25 - 28 
c29s4.r1127.bryan(config-if-range)#
Expect: matched string 1: (config-if-range)#
 >> switchport mode trunk

 >> switchport trunk native vlan 92

 >> ip dhcp snooping trust

 >> no keepalive

 >> shutdown

 >> end

Expect: searching for 1 strs:  :Configured
 << switchport mode trunk
c29s4.r1127.bryan(config-if-range)#switchport trunk native vlan 92
c29s4.r1127.bryan(config-if-range)#ip dhcp snooping trust
c29s4.r1127.bryan(config-if-range)#no keepalive
c29s4.r1127.bryan(config-if-range)#shutdown
c29s4.r1127
 << .bryan(config-if-range)#end
c29s4.r1127.bryan#
*Jan  1 18:05:45: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> configure terminal

Expect: searching for 1 strs:  :(config)#
 << 
c29s4.r1127.bryan#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
c29s4.r1127.bryan(config)#
*Jan  1 18:05:47: %LINK-5-CHANGED: Interface GigabitEthernet1/0/25, changed state to administratively down
*Jan  1 18:05:47
Expect: matched string 1: (config)#
 >> crypto key generate rsa

 >> no

 >> 2048

Expect: searching for 2 strs:  :OK :(config)#
 << : %LINK-5-CHANGED: Interface GigabitEthernet1/0/26, changed state to administratively down
*Jan  1 18:05:47: %LINK-5-CHANGED: Interface GigabitEthernet1/0/27, changed state to administratively down
*Jan  1 18:05:47: %LINK-5-CHANGED: Interface GigabitEth
 << ernet1/0/28, changed state to administratively downcrypto key generate rsa
The name for the keys will be: c29s4.r1127.bryan.mgmt.msstate.edu
Choose the size of the key modulus in the range of 360 to 4096 for your
  General Purpose Keys. Choosing a key 
 << modulus greater than 512 may take
  a few minutes.

How many bits in the modulus [512]: no
% A decimal number between 360 and 4096.
How many bits in the modulus [512]: 2048
% Generating 2048 bit RSA keys, keys will be non-exportable...
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
Expect: did not match any strings!
...
: %LINK-5-CHANGED: Interface GigabitEthernet1/0/26, changed state to administratively down
*Jan  1 18:05:47: %LINK-5-CHANGED: Interface GigabitEthernet1/0/27, changed state to administratively down
*Jan  1 18:05:47: %LINK-5-CHANGED: Interface GigabitEthernet1/0/28, changed state to administratively downcrypto key generate rsa
The name for the keys will be: c29s4.r1127.bryan.mgmt.msstate.edu
Choose the size of the key modulus in the range of 360 to 4096 for your
  General Purpose Keys. Choosing a key modulus greater than 512 may take
  a few minutes.

How many bits in the modulus [512]: no
% A decimal number between 360 and 4096.
How many bits in the modulus [512]: 2048
% Generating 2048 bit RSA keys, keys will be non-exportable...
...

 >> end

Expect: searching for 1 strs:  :Configured
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
 << 
[OK] (elapsed time was 21 seconds)

c29s4.r1127.bryan(config)#end
c29s4.r1127.bryan#
*Jan  1 18:06:10: %SSH-5-ENABLED: SSH 1.99 has been enabled
*Jan  1 18:06:11: %SYS-5-CONFIG_I: Configured from console by console
Expect: matched string 1: Configured
 >> 

 >> write mem

Expect: searching for 2 strs:  :# :>
 << 
c29s4.r1127.bryan#write mem
Building configuration...

Expect: matched string 1: #
 >> 
Expect: searching for 2 strs:  :# :>
 << [OK]
c29s4.r1127.bryan#
c29s4.r1127.bryan#
c29s4.r1127.bryan#
Expect: matched string 1: #
 >> sh run

Expect: searching for 2 strs:  :# :>
 << sh run
Building configuration...

Current configuration : 13761 bytes
!
! Last configuration change at 18:06:11 CST Sun Jan 1 2006
!
version 15.0
no service pad
service timestamps debug datetime localtime
service timestamps log datetime localtim
 << e
service password-encryption
!
hostname c29s4.r1127.bryan
!
boot-start-marker
boot-end-marker
!
enable secret 5 $1$zH3E$vxBdvYEKedhB3wfmdle9R0
enable password 7 122E570043082854270228211474
!
username root privilege 15 secret 5 $1$EKjD$aF0Hi2x
 << NGQPIsH4HvJz4R.
no aaa new-model
clock timezone CST -6 0
clock summer-time CDT recurring
switch 1 provision ws-c2960s-24ts-l
authentication mac-move permit
!
!
ip dhcp snooping vlan 236
ip dhcp snooping
ip domain-name mgmt.msstate.edu
ip name-s
 << erver 130.18.80.12
!
!
crypto pki trustpoint TP-self-signed-2494998912
 enrollment selfsigned
 subject-name cn=IOS-Self-Signed-Certificate-2494998912
 revocation-check none
 rsakeypair TP-self-signed-2494998912
!
!
crypto pki certificate chain T
 << P-self-signed-2494998912
 certificate self-signed 01
  	quit
!
spanning-tree mode mst
spanning-tree portfast bpduguard default
spanning-tree extend system-id
!
spanning-tree mst configuration
 name msstate
 revision 1
 instance 1 vlan 2, 7, 11,
 <<  20, 22, 24, 31, 35, 37, 39-40, 50, 60, 63, 70
 instance 1 vlan 78, 80, 86, 91, 96, 104, 110, 126, 136, 140, 152, 160
 instance 1 vlan 162-163, 168, 189, 194, 202, 220, 222, 230, 232, 242, 246
 instance 1 vlan 256, 611-612, 654, 741, 996, 999
 instanc
 << e 2 vlan 2002, 2007, 2011, 2020, 2022, 2024, 2031, 2035, 2037, 2039-2040
 instance 2 vlan 2050, 2060, 2063, 2070, 2080, 2086, 2096, 2104, 2110, 2126
 instance 2 vlan 2136, 2140, 2152, 2160, 2162-2163, 2168, 2189, 2194, 2202
 instance 2 vlan 2220, 2222,
 <<  2232, 2242, 2246, 2611-2612, 2654, 2999
 instance 3 vlan 42, 51, 59, 64, 66, 69, 72, 108, 113, 128, 144, 176, 196
 instance 3 vlan 244, 248, 927
 instance 4 vlan 2042, 2051, 2059, 2064, 2066, 2069, 2072, 2108, 2113, 2128
 instance 4 vlan 2144, 2176, 
 << 2196, 2244, 2248, 2927
 instance 5 vlan 16, 48, 58, 88, 121, 131, 133-134, 216, 228
 instance 6 vlan 2016, 2048, 2058, 2088, 2121, 2131, 2133-2134, 2216, 2228
 instance 7 vlan 9, 33-34, 38, 54, 56, 71, 75, 82, 84, 97, 114, 116, 124
 instance 7 vlan 17
 << 2, 186, 192, 204-208, 210, 240-241, 251-252, 630, 928
 instance 8 vlan 2009, 2033-2034, 2038, 2054, 2056, 2071, 2075, 2082, 2084
 instance 8 vlan 2097, 2114, 2116, 2124, 2172, 2186, 2192, 2204-2208, 2210
 instance 8 vlan 2240-2241, 2251-2252, 2630, 292
 << 8
 instance 9 vlan 4-5, 12, 18-19, 32, 44, 57, 62, 68, 76, 98-99, 102, 112
 instance 9 vlan 130, 132, 147-148, 158, 212, 226, 236, 500, 505, 510-511
 instance 9 vlan 522, 551-570, 603, 629, 633, 742, 802, 926, 929
 instance 10 vlan 2004-2005, 2012, 20
 << 18-2019, 2032, 2044, 2057, 2062, 2068
 instance 10 vlan 2076, 2098-2099, 2102, 2112, 2130, 2132, 2147-2148, 2158
 instance 10 vlan 2212, 2236, 2500, 2505, 2510-2511, 2522, 2603, 2629, 2633
 instance 10 vlan 2802, 2926, 2929
 instance 11 vlan 8, 43, 52
 << , 146, 156-157, 180, 200, 218
 instance 12 vlan 2008, 2043, 2052, 2146, 2156-2157, 2180, 2200, 2218
!
!
!
!
!
!
errdisable recovery cause udld
errdisable recovery cause bpduguard
errdisable recovery cause security-violation
errdisable recovery 
 << cause channel-misconfig (STP)
errdisable recovery cause pagp-flap
errdisable recovery cause dtp-flap
errdisable recovery cause link-flap
errdisable recovery cause sfp-config-mismatch
errdisable recovery cause gbic-invalid
errdisable recovery cause p
 << secure-violation
errdisable recovery cause port-mode-failure
errdisable recovery cause dhcp-rate-limit
errdisable recovery cause pppoe-ia-rate-limit
errdisable recovery cause mac-limit
errdisable recovery cause vmps
errdisable recovery cause storm-c
 << ontrol
errdisable recovery cause inline-power
errdisable recovery cause arp-inspection
errdisable recovery cause loopback
errdisable recovery cause small-frame
errdisable recovery cause psp
errdisable recovery interval 1800
!
!
!
!
vlan interna
 << l allocation policy ascending
!
lldp run
!
! 
!
!
!
!
!
!
!
!
interface FastEthernet0
 no ip address
 shutdown
!
interface GigabitEthernet1/0/1
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 s
 << witchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 shutdown
 spanning-tree portfast
!
interface GigabitEthernet1/0/2
 switchport access vlan 
 << 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 shutdown
 spanning-tree 
 << portfast
!
interface GigabitEthernet1/0/3
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging t
 << ype inactivity
 switchport port-security
 shutdown
 spanning-tree portfast
!
interface GigabitEthernet1/0/4
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 swit
 << chport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 shutdown
 spanning-tree portfast
!
interface GigabitEthernet1/0/5
 switchport access vlan 236
 switchport mode access
 switchport port-s
 << ecurity maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 shutdown
 spanning-tree portfast
!
interface GigabitEthernet1/0/6
 sw
 << itchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 shut
 << down
 spanning-tree portfast
!
interface GigabitEthernet1/0/7
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport 
 << port-security aging type inactivity
 switchport port-security
 shutdown
 spanning-tree portfast
!
interface GigabitEthernet1/0/8
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-security vio
 << lation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 shutdown
 spanning-tree portfast
!
interface GigabitEthernet1/0/9
 switchport access vlan 236
 switchport mode acces
 << s
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 shutdown
 spanning-tree portfast
!
interface Giga
 << bitEthernet1/0/10
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchpor
 << t port-security
 shutdown
 spanning-tree portfast
!
interface GigabitEthernet1/0/11
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security agin
 << g time 15
 switchport port-security aging type inactivity
 switchport port-security
 shutdown
 spanning-tree portfast
!
interface GigabitEthernet1/0/12
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 swit
 << chport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 shutdown
 spanning-tree portfast
!
interface GigabitEthernet1/0/13
 switchport access vlan 23
 << 6
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 shutdown
 spanning-tree po
 << rtfast
!
interface GigabitEthernet1/0/14
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging ty
 << pe inactivity
 switchport port-security
 shutdown
 spanning-tree portfast
!
interface GigabitEthernet1/0/15
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 swit
 << chport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 shutdown
 spanning-tree portfast
!
interface GigabitEthernet1/0/16
 switchport access vlan 236
 switchport mode access
 switchport port-
 << security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 shutdown
 spanning-tree portfast
!
interface GigabitEthernet1/0/17
 
 << switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 sh
 << utdown
 spanning-tree portfast
!
interface GigabitEthernet1/0/18
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchpo
 << rt port-security aging type inactivity
 switchport port-security
 shutdown
 spanning-tree portfast
!
interface GigabitEthernet1/0/19
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-security
 <<  violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 shutdown
 spanning-tree portfast
!
interface GigabitEthernet1/0/20
 switchport access vlan 236
 switchport mode 
 << access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 shutdown
 spanning-tree portfast
!
interface
 <<  GigabitEthernet1/0/21
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 swit
 << chport port-security
 shutdown
 spanning-tree portfast
!
interface GigabitEthernet1/0/22
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2
 switchport port-security violation protect
 switchport port-security
 <<  aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 shutdown
 spanning-tree portfast
!
interface GigabitEthernet1/0/23
 switchport access vlan 236
 switchport mode access
 switchport port-security maximum 2

 <<  switchport port-security violation protect
 switchport port-security aging time 15
 switchport port-security aging type inactivity
 switchport port-security
 shutdown
 spanning-tree portfast
!
interface GigabitEthernet1/0/24
 switchport trunk nat
 << ive vlan 92
 switchport mode trunk
 shutdown
 no keepalive
 ip dhcp snooping trust
!
interface GigabitEthernet1/0/25
 switchport trunk native vlan 92
 switchport mode trunk
 shutdown
 ip dhcp snooping trust
!
interface GigabitEthernet1/0/26
 
 << switchport trunk native vlan 92
 switchport mode trunk
 shutdown
 ip dhcp snooping trust
!
interface GigabitEthernet1/0/27
 switchport trunk native vlan 92
 switchport mode trunk
 shutdown
 ip dhcp snooping trust
!
interface GigabitEthernet1/0/
 << 28
 switchport trunk native vlan 92
 switchport mode trunk
 shutdown
 ip dhcp snooping trust
!
interface Vlan1
 no ip address
 no ip route-cache
 shutdown
!
interface Vlan92
 ip address 10.92.6.50 255.255.0.0
 ip broadcast-address 10.92.255.2
 << 55
!
ip default-gateway 10.92.0.1
no ip http server
no ip http secure-server
!
logging facility local1
logging host 130.18.8.12
access-list 1 permit 10.92.0.0 0.0.255.255
access-list 1 permit 130.18.8.0 0.0.0.255
access-list 1 permit 10.93.0.0 0
 << .0.255.255
access-list 1 permit 130.18.1.0 0.0.0.255
!
snmp-server community sysnet RO 1
snmp-server community c2-b2=a2 RW 1
snmp-server contact 6F-1617
snmp-server enable traps snmp authentication linkdown linkup coldstart warmstart
snmp-server en
 << able traps transceiver all
snmp-server enable traps tty
snmp-server enable traps cluster
snmp-server enable traps config-copy
snmp-server enable traps config
snmp-server enable traps config-ctid
snmp-server enable traps dot1x auth-fail-vlan guest-vl
 << an no-auth-fail-vlan no-guest-vlan
snmp-server enable traps entity
snmp-server enable traps power-ethernet police
snmp-server enable traps cpu threshold
snmp-server enable traps rep
snmp-server enable traps bridge newroot topologychange
snmp-server 
 << enable traps stpx inconsistency root-inconsistency loop-inconsistency
snmp-server enable traps vtp
snmp-server enable traps vlancreate
snmp-server enable traps vlandelete
snmp-server enable traps flash insertion removal
snmp-server enable traps port-
 << security
snmp-server enable traps envmon fan shutdown supply temperature status
snmp-server enable traps errdisable
snmp-server enable traps mac-notification change move threshold
snmp-server enable traps vlan-membership
snmp-server host 130.18.8.12 
 << sysnet 
!
!
line con 0
line vty 0 4
 access-class 1 in
 password 7 1420401C5D070E7B29013F3C0552
 login local
 transport input ssh
line vty 5 15
 access-class 1 in
 password 7 1420401C5D070E7B29013F3C0552
 login local
 transport input ssh
!

 << ntp server 10.92.0.5
end

c29s4.r1127.bryan#
Expect: matched string 1: #
 >> show interface status

Expect: searching for 2 strs:  :# :>
 << show interface status

Port      Name               Status       Vlan       Duplex  Speed Type
Gi1/0/1                      disabled     236          auto   auto 10/100/1000BaseTX
Gi1/0/2                      disabled     236          auto   auto 10/1
 << 00/1000BaseTX
Gi1/0/3                      disabled     236          auto   auto 10/100/1000BaseTX
Gi1/0/4                      disabled     236          auto   auto 10/100/1000BaseTX
Gi1/0/5                      disabled     236          auto   auto 1
 << 0/100/1000BaseTX
Gi1/0/6                      disabled     236          auto   auto 10/100/1000BaseTX
Gi1/0/7                      disabled     236          auto   auto 10/100/1000BaseTX
Gi1/0/8                      disabled     236          auto   aut
 << o 10/100/1000BaseTX
Gi1/0/9                      disabled     236          auto   auto 10/100/1000BaseTX
Gi1/0/10                     disabled     236          auto   auto 10/100/1000BaseTX
Gi1/0/11                     disabled     236          auto   
 << auto 10/100/1000BaseTX
Gi1/0/12                     disabled     236          auto   auto 10/100/1000BaseTX
Gi1/0/13                     disabled     236          auto   auto 10/100/1000BaseTX
Gi1/0/14                     disabled     236          auto
 <<    auto 10/100/1000BaseTX
Gi1/0/15                     disabled     236          auto   auto 10/100/1000BaseTX
Gi1/0/16                     disabled     236          auto   auto 10/100/1000BaseTX
Gi1/0/17                     disabled     236          a
 << uto   auto 10/100/1000BaseTX
Gi1/0/18                     disabled     236          auto   auto 10/100/1000BaseTX
Gi1/0/19                     disabled     236          auto   auto 10/100/1000BaseTX
Gi1/0/20                     disabled     236        
 <<   auto   auto 10/100/1000BaseTX
Gi1/0/21                     disabled     236          auto   auto 10/100/1000BaseTX
Gi1/0/22                     disabled     236          auto   auto 10/100/1000BaseTX
Gi1/0/23                     disabled     236     
 <<      auto   auto 10/100/1000BaseTX
Gi1/0/24                     disabled     1            auto   auto 10/100/1000BaseTX
Gi1/0/25                     disabled     1            auto   auto Not Present
Gi1/0/26                     disabled     1          
 <<   auto   auto Not Present
Gi1/0/27                     disabled     1            auto   auto Not Present
Gi1/0/28                     disabled     1            auto   auto Not Present
Fa0                          disabled     routed       auto   auto 1
 << 0/100BaseTX
c29s4.r1127.bryan#
Expect: matched string 1: #
